<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8" />
<title>DSM Mobile</title>
<link href="../help.css" rel="stylesheet" type="text/css" />
<link href="help.css" rel="stylesheet" type="text/css" />
<script src="../jslib/jquery.min.js"></script> <script src="../jslib/mobile.js"></script>
</head>
<body>

<br>
<p>DSM mobile ger DSM <strong>admin</strong> (eller en anv&auml;ndare som h&ouml;r till gruppen <strong>administrators</strong>) m&ouml;jlighet att hantera DSM-inst&auml;llningar och kontrollera DSM-informationen med en iOS<sup>&reg;</sup> (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup>, eller iPod touch<sup>&reg;</sup>) eller Android<sup>&reg;</sup>-enhet. Detta hj&auml;lpavsnitt om DSM mobile inneh&aring;ller f&ouml;ljande &auml;mnen och resurser f&ouml;r att hj&auml;lpa dig att komma ig&aring;ng.</p>
<h2><a name="login" href="#">Logga in och Logga ut</a></h2>

<div name="contents" id="login" class="x-hidden-display">
<p>Efter att du anslutit till DSM med webbl&auml;saren p&aring; din iOS- eller Android-enhet kommer du att se inloggningsf&ouml;nstret f&ouml;r inmatning av dina DSM-kontouppgifter.</p>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att logga in p&aring; DSM mobile:</h4>
<p>Skriv in dina DSM-anv&auml;ndaruppgifter och tryck p&aring; <b>Logga in</b>. Om du vill spara din inloggningsinformation och logga in automatiskt n&auml;sta g&aring;ng, s&auml;tt p&aring; <b>Kom ih&aring;g mig</b> innan du loggar in.</p>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att logga ut fr&aring;n DSM mobile:</h4>
<ol>
	<li>Tryck p&aring; alternativknappen h&ouml;gst upp till h&ouml;ger p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-tablet).</li>
	<li>Tryck p&aring; <b>Inst&auml;llningar</b> och tryck p&aring; <b>Logga ut</b>.</li>
</ol>
</div>

<h2><a name="user" href="#" >Hantera DSM-anv&auml;ndare</a></h2>

<div name="contents" id="user" class="x-hidden-display">
<p>Tryck p&aring; <b>Anv&auml;ndare &amp; grupper</b> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-tablet) f&ouml;r att se listan &ouml;ver anv&auml;ndare.</p>

<h4>Skapa en anv&auml;ndare:</h4>
<ol>
	<li>Tryck p&aring; <b>+</b> och skriv sedan in anv&auml;ndarnamnet och l&ouml;senordet och e-postadressen f&ouml;r den nya anv&auml;ndaren.</li>
	<li>Aktivera <b>Skicka meddelande</b> f&ouml;r att skicka ett meddelande till anv&auml;ndarens e-postadress n&auml;r hans eller hennes DSM-anv&auml;ndarkonton har skapats.<br><span class="note_head">Obs: </span>Innan meddelandet skickas, se till att meddelandeinst&auml;llningarna har slutf&ouml;rts p&aring; din Synology NAS. Logga in p&aring; skrivbordsversionen av DSM med din dators webbl&auml;sare och g&aring; till <b>Huvudmeny</b> &gt; <b>Kontrollpanel</b> &gt; <b>Meddelande</b> &gt; <b>E-post</b> f&ouml;r att &auml;ndra inst&auml;llningarna.</li>
	<li>Tryck p&aring; <b>Slutf&ouml;r</b> f&ouml;r att bekr&auml;fta eller tryck den v&auml;nstra pilen f&ouml;r att avbryta.</li>
</ol>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att snabbt hitta en anv&auml;ndare:</h4>
<p>Skriv in anv&auml;ndarens namn i s&ouml;kf&auml;ltet.</p>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att &auml;ndra en anv&auml;ndares uppgifter:</h4>
<ol>
	<li>Tryck p&aring; anv&auml;ndarens namn och g&ouml;r n&aring;got av f&ouml;ljande:
		<ul>
			<li>&Auml;ndra anv&auml;ndarens namn eller l&ouml;senord i f&auml;ltet <b>Namn</b> eller <b>L&ouml;senord</b>.</li>
		<li>V&auml;lj <b>Avaktivera</b> f&ouml;r att avaktivera anv&auml;ndaren. Du kan v&auml;lja att aktivera anv&auml;ndaren vid ett senare tillf&auml;lle utan att f&ouml;rlora hans eller hennes inst&auml;llningar.</li>
		<li>Aktivera <b>Administrator</b> f&ouml;r att l&auml;gga till anv&auml;ndaren till gruppen <b>admin</b>. Anv&auml;ndare som tillh&ouml;r gruppen <b>admin</b> tilldelas administrativa privilegier f&ouml;r att &auml;ndra DSM-inst&auml;llningarna med DSM mobile eller datorns webbl&auml;sare.</li>
		</ul>
	</li>
	<li>G&ouml;r n&aring;got av f&ouml;ljande under <b>Privilegier</b> och tryck sedan p&aring; <b>Bak&aring;t</b>:
		<ul>
			<li>Tryck p&aring; <b>Delad mapp</b> och tryck p&aring; den delade mappens namn f&ouml;r att &auml;ndra anv&auml;ndarens &aring;tkomstprivilegier: <b>L&auml;sa/skriva</b>: Anv&auml;ndaren kan g&ouml;ra &auml;ndringar i filerna och undermapparna i den delade mappen; <b>Endast l&auml;sbar</b>: Anv&auml;ndaren kan komma &aring;t filerna och undermapparna i den delade mappen, men kan inte g&ouml;ra &auml;ndringar i dem; <b>Ingen &aring;tkomst</b>: Anv&auml;ndaren kan inte komma &aring;t filerna och undermapparna i de delade mapparna.<br><span class="note_head">Obs: </span>Om det uppst&aring;r en konflikt mellan privilegier kommer prioriteten att vara som f&ouml;ljande: <span class="note_content">Ingen &aring;tkomst &gt; L&auml;sa/skriva &gt; Endast l&auml;sbar</span>.</li>
			<li>Tryck p&aring; <b>Applikation</b> f&ouml;r att &auml;ndra anv&auml;ndarens &aring;tkomstprivilegier till DSM-applikationer.</li>
		</ul>
	</li>
	<li>Tryck p&aring; <b>Slutf&ouml;r</b> f&ouml;r att bekr&auml;fta eller tryck den v&auml;nstra pilen f&ouml;r att avbryta.</li>
</ol>
</div>

<h2><a name="shared" href="#" >Hantera delade mappar</a></h2>

<div name="contents" id="shared" class="x-hidden-display">
<p>Tryck p&aring; <b>Delad mapp</b> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-tablet) f&ouml;r att se listan &ouml;ver delade mappar p&aring; din Synology NAS.</p>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att skapa en delad mapp:</h4>
<ol>
	<li>Tryck p&aring; <b>+</b> och skriv sedan in namnet f&ouml;r den nya mappen.</li>
	<li>Tryck p&aring; <b>Slutf&ouml;r</b> f&ouml;r att bekr&auml;fta eller tryck den v&auml;nstra pilen f&ouml;r att avbryta.</li>
</ol>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att &auml;ndra en delad mapp:</h4>
<p>Tryck p&aring; den delade mappens namn och g&ouml;r n&aring;got av f&ouml;ljande:</p>
<ul>
	<li>&Auml;ndra den delade mappens namn i f&auml;ltet <b>Namn</b>.</li>
	<li>Tryck p&aring; <b>Anv&auml;ndarbeh&ouml;righeter</b> och tryck p&aring; en anv&auml;ndare f&ouml;r att &auml;ndra hans eller hennes &aring;tkomstprivilegier till den delade mappen: <b>L&auml;sa/skriva</b>: Anv&auml;ndaren kan g&ouml;ra &auml;ndringar i filerna och undermapparna i den delade mappen; <b>Endast l&auml;sbar</b>: Anv&auml;ndaren kan komma &aring;t filerna och undermapparna i den delade mappen, men kan inte g&ouml;ra &auml;ndringar i dem; <b>Ingen &aring;tkomst</b>: Anv&auml;ndaren kan inte komma &aring;t filerna och undermapparna i de delade mapparna.<br><span class="note_head">Obs: </span>Om det uppst&aring;r en konflikt mellan privilegier kommer prioriteten att vara som f&ouml;ljande: <span class="note_content">Ingen &aring;tkomst &gt; L&auml;sa/skriva &gt; Endast l&auml;sbar</span>.</li>
	<li>Du kan &auml;ven trycka p&aring; <b>Gruppbeh&ouml;righeter</b> f&ouml;r att konfigurera privilegier f&ouml;r grupper.<br><span class="note_head">Obs: </span>Gruppbeh&ouml;righeter har h&ouml;gre prioritet &auml;n anv&auml;ndarbeh&ouml;righeter.</li>
</ul>
</div>

<h2><a name="services" href="#" >Aktivera tj&auml;nster</a></h2>

<div name="contents" id="services" class="x-hidden-display">
<p>Tryck p&aring; <b>Tj&auml;nst</b> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-datorplatta) f&ouml;r att aktivera eller avaktivera Synology NAS-tj&auml;nster.</p>

<h4>Att hantera LAN-tj&auml;nster i Synology NAS:</h4>
<ul>
	<li>Aktivera eller avaktivera n&aring;got av f&ouml;ljande alternativ:
		<ul>
			<li><b>Windows-filservice</b> l&aring;ter din Synology NAS bli en Windows-filserver (CIFS) inom LAN.</li>
			<li><b>MAC-filservice</b> l&aring;ter din Synology NAS bli en Mac-filserver (AFP) inom LAN.</li>
			<li><b>NFS-tj&auml;nst</b> l&aring;ter Linux-klienter inom LAN komma &aring;t Synology NAS-data.</li>
			<li><b>Bonjour-skrivare</b> l&aring;ter Mac-klienter skriva ut p&aring; USB-skrivare som anslutna till din Synology NAS.</li>
			<li><b>Media Server</b> l&aring;ter DLNA/UPnP-hemmaenheter inom LAN att bl&auml;ddra bland och spela upp multimediainneh&aring;ll p&aring; din Synology NAS.</li>
			<li><b>iTunes</b> l&aring;ter iTunes-klienter inom LAN bl&auml;ddra bland och spela upp musik eller videor p&aring; din Synology NAS.</li>
		</ul>
	</li>
</ul>

<h4>Att hantera Internettj&auml;nster i Synology NAS:</h4>
<ul>
	<li>Aktivera eller avaktivera n&aring;got av f&ouml;ljande alternativ:
		<ul>
			<li><b>FTP</b> aktiverar din Synology NAS s&aring; att den blir en FTP-server.</li>
			<li><b>Webbtj&auml;nster</b> l&aring;ter dig vara v&auml;rd f&ouml;r webbsidor (med PHP+MySQL-st&ouml;d) p&aring; din Synology NAS.</li>
			<li><b>WebDAV</b> l&aring;ter klientprogram hantera och redigera filer p&aring; Synology NAS via HTTP-protokollet.</li>
			<li><b>WebDAV (HTTPS)</b> l&aring;ter klientprogram hantera och redigera filer p&aring; Synology NAS via HTTPS-protokollet.</li>
			<li><b><a name="filestationservice"></a>File Station</b> &auml;r en webbaserad applikation som g&ouml;r att du kan hantera filer p&aring; Synology NAS genom en anpassad port utan att beh&ouml;va logga in p&aring; DSM.</li>
			<li><b>File Station (HTTPS)</b> g&ouml;r att du kan ansluta till File Station via HTTPS-protokollet.</li>
			<li><b>Surveillance Station</b> &auml;r en webbaserad applikation som kan hantera IP-kameror f&ouml;r att skydda din hem- eller kontorsmilj&ouml;.</li>
			<li><b>Audio Station</b> &auml;r en webbaserad applikation som ger dig &aring;tkomst till musikbiblioteket p&aring; din Synology NAS.</li>
			<li><b>Photo&nbsp;Station</b> &auml;r ett fotoalbum online som &auml;r integrerad med en blogg som sparas p&aring; din Synology NAS.</li>
			<li><b><a name="downloadsationservice"></a>Download Station</b> (BT/HTTP/FTP/NZB/RSS) &auml;r en webbaserad applikation som hj&auml;lper dig att ladda ner filer fr&aring;n Internet till din Synology NAS.</li>
			<li><b>eMule</b> aktiverar eMule-st&ouml;det f&ouml;r Download Station.</li>
		</ul>
	</li>
</ul>

<div class="section">
<h4>Obs:</h4>
<p>F&ouml;r mer information om de ovann&auml;mnda tj&auml;nsterna h&auml;nvisas du till f&ouml;ljande:</p>
	<ul>
		<li><b>DSM hj&auml;lp</b> (tillg&auml;nglig n&auml;r du loggar in p&aring; skrivbordsutg&aring;van av DSM med din dators webbl&auml;sare och g&aring;r till <b>Huvudmeny</b> &gt; <b>DSM hj&auml;lp</b>)</li>
		<li><b>Bruksanvisning f&ouml;r Synology DSM</b> (finns p&aring; Synology:s <a href="http://www.synology.com/support/download.php" target="_blank">Nerladdningscenter</a>)</li>
	</ul>
</div>

</div>

<h2><a name="resourcemonitor" href="#" >&Ouml;vervaka systemresurser</a></h2>

<div name="contents" id="resourcemonitor" class="x-hidden-display">
<p>Tryck p&aring; <b>Resurssk&auml;rm</b> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-tablet) f&ouml;r att &ouml;vervaka processor- och minnesanv&auml;ndning p&aring; Synology NAS.</p>
</div>

<h2><a name="sysinfo" href="#" >Visa systeminformation</a></h2>

<div name="contents" id="sysinfo" class="x-hidden-display">
<p>Tryck p&aring; <b>Systeminfo</b> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-tablet) f&ouml;r att se en status&ouml;versikt f&ouml;r din Synology NAS.</p>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att se systeminfo f&ouml;r din Synology NAS:</h4>
<ol>
	<li>G&ouml;r n&aring;got av f&ouml;ljande:
		<ul>
			<li>Tryck p&aring; <b>Allm&auml;nt</b> f&ouml;r att se den grundl&auml;ggande informationen om din Synology NAS, inklusive serienummer, modellnamn, m&auml;ngden fysiskt minne, DSM-versionen, samt tidinformation och temperaturstatus.</li>
			<li>Tryck p&aring; <b>N&auml;tverk</b> f&ouml;r att n&auml;tverkskonfigurationen f&ouml;r din Synology NAS samt statusen f&ouml;r varje n&auml;tverksgr&auml;nssnitt.</li>
			<li>Tryck p&aring; <b>Lagring</b> f&ouml;r att se volymanv&auml;ndning f&ouml;r Synology NAS.</li>
		</ul>
	</li>
	<li>Tryck p&aring; knappen <b>Uppdatera</b> h&ouml;gst upp till h&ouml;ger f&ouml;r att h&aring;lla systeminformation uppdaterad.</li>
</ol>
</div>

<h2><a name="firmware" href="#" >Fast programvara</a></h2>

<div name="contents" id="firmware" class="x-hidden-display">
<p>Tryck p&aring; <b>Fast programvara</b> f&ouml;r att visa och uppdatera din DSM-version.</p>

<h4>Att konfigurera inst&auml;llningar f&ouml;r uppgradering av DSM:</h4>
<ol>
	<li>Tryck p&aring; <strong>DSM-uppgradering</strong>.</li>
	<li>V&auml;lj valfritt av f&ouml;ljande alternativ:
		<ul>
			<li>Endast viktiga uppdateringar</li>
			<li>Nyaste DSM och alla uppdateringar</li>
		</ul>
	</li>
	<li>Tryck p&aring; <strong>Klart</strong>.</li>
</ol>

<h4>Att ladda ner tillg&auml;ngliga uppdateringar:</h4>
<ol>
	<li>Kontrollera din DSM-version i <strong>Status</strong>.</li>
	<li>Om din DSM-version inte &auml;r uppdaterad, tryck p&aring; knappen <strong>Ladda ner</strong> som finns under avsnittet <strong>Status</strong> f&ouml;r att uppgradera din DSM.</li>
</ol>
</div>

<h2><a name="block" href="#" >Hantera IP-blockering</a></h2>

<div name="contents" id="block" class="x-hidden-display">
<p>Tryck p&aring; <b>IP-blockering</b> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-datorplatta) f&ouml;r att f&ouml;rhindra oauktoriserad inloggning.</p>

<h4>Att hantera IP-blockering:</h4>
<ol>
	<li>Tryck p&aring; knappen f&ouml;r konfiguration i det &ouml;vre h&ouml;gra h&ouml;rnet.</li>
	<li>S&auml;tt p&aring; <b>Aktivera auto block</b> f&ouml;r att aktivera IP-blockering.</li>
	<li>Ange en siffra f&ouml;r <b>Inloggningsf&ouml;rs&ouml;k</b> och <b>Inom (minuter)</b> f&ouml;r att blockera en IP-adress efter det specificerade antalet inloggningsf&ouml;rs&ouml;k inom angivet antal minuter.</li>
	<li>Du kan s&auml;tta p&aring; <b>Aktivera f&ouml;rfallotid f&ouml;r blockering</b> och specificera <b>Ta bort blockering efter (dagar)</b> f&ouml;r att ta bort blockeringen av en IP-adress efter det specificerade antalet dagar. Om du anger &rdquo;0&rdquo; h&auml;r kommer IP-adressen att blockeras p&aring; obest&auml;mt tid till dess att du tar bort den fr&aring;n blocklistan.</li>
	<li>Tryck p&aring; <b>Slutf&ouml;r</b>.</li>
</ol>

<h4>Att l&auml;gga till IP-adresser till till&aring;ten lista/blockeringslista:</h4>
<ol>
	<li>Om du vill l&auml;gga till den till&aring;tna/blockerade IP-adressen till listan, tryck p&aring; knappen f&ouml;r att l&auml;gga till i det &ouml;vre h&ouml;gra h&ouml;rnet och tryck p&aring; <b>Till&aring;ten lista</b> eller <b>Blockeringslista</b>.</li>
	<li>Efter att IP-adressen angivits, tryck p&aring; <b>Slutf&ouml;r</b>.</li>
</ol>
</div>


<h2><a name="package" href="#" >Hantera Paketcenter</a></h2>

<div name="contents" id="package" class="x-hidden-display">

<p>Synology har integrerat applikationer utvecklade av tredje part eller Synology till paket som kan installeras och aktiveras enkelt p&aring; Synology NAS.</p>


<h4>Att hantera Paketcenter:</h4>
<p>Tryck p&aring; <strong>Paketcenter</strong> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-datorplatta) f&ouml;r att visa information om filpaketet, k&ouml;ra eller stoppa filpaket eller uppdatera till de senaste versionerna.</p>


<h4>Att k&ouml;ra eller stoppa installerade paket:</h4>
<p>Tryck p&aring; v&auml;ljaren bredvid ett filpaket f&ouml;r att k&ouml;ra eller stoppa det.</p>

<h4>Att visa filpaket: </h4>
<p>Tryck p&aring; ett filpaket f&ouml;r att se dess information.</p>
     
<h4>Att uppdatera filpaket:</h4>
<ol>
	<li>Tryck p&aring; fliken <strong>Uppdatera</strong> f&ouml;r att visa vilka versioner som f&ouml;r n&auml;rvarande &auml;r tillg&auml;ngliga f&ouml;r uppdatering.</li>
    <li>Tryck p&aring; knappen p&aring; den h&ouml;gra sidan av ett filpaket f&ouml;r att uppdatera till den senaste versionen.</li>   
</ol>
</div>


<h2><a name="log" href="#">Visa loggfiler eller aktuella anslutningar</a></h2>

<div name="contents" id="log" class="x-hidden-display">
<p>Tryck p&aring; <b>Loggfil</b> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-datorplatta) f&ouml;r att &ouml;vervaka aktuella anslutningar eller visa loggfilerna f&ouml;r tj&auml;nsterna i Synology NAS.</p>

<h4>&Ouml;vervakning av aktuella anslutningar:</h4>
<ul>
	<li>Tryck p&aring; <b>Senaste [number] loggfiler</b> i avsnittet <b>&Ouml;versikt</b> f&ouml;r att visa listan med anv&auml;ndare som nyligen haft &aring;tkomst till Synology NAS.</li>
</ul>

<h4>Se loggfilerna f&ouml;r en specifik tj&auml;nst:</h4>
<ul>
	<li>Tryck p&aring; n&aring;got av objekten i <b>H&auml;ndelseloggar</b> eller <b>Fil&ouml;verf&ouml;ringsloggar</b> f&ouml;r att se en lista &ouml;ver relevanta loggar.</li>
</ul>

</div>
<h2><a name="launch" href="#">K&ouml;r mobilapplikationer</a></h2>
<div name="contents" id="launch" class="x-hidden-display">

<p>DSM mobile ger dig ett praktiskt utrymme f&ouml;r att k&ouml;ra Synology-mobilapplikationer som finns installerade p&aring; din iOS- eller Android-enhet.</p>

<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att k&ouml;ra Synology-mobilapplikationer med DSM mobile:</h4>
<p>Tryck p&aring; en av f&ouml;ljande applikationer i den nedre delen av startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-surfplatta):</p>
<ul>
	<li><b>DS photo</b> (tillg&auml;nglig n&auml;r tj&auml;nsten <b>Photo Station</b> &auml;r aktiverad)</li>
	<li><b>DS audio</b> (tillg&auml;nglig n&auml;r tj&auml;nsten <b>Audio Station</b> &auml;r aktiverad)</li>
	<li><b>DS cam</b> (tillg&auml;nglig n&auml;r tj&auml;nsten <b>Surveillance Station</b> &auml;r aktiverad)</li>
	<li><b>DS file</b> (tillg&auml;nglig n&auml;r tj&auml;nsten <b>WebDAV</b> &auml;r aktiverad)</li>
</ul>

<div class="section">
<h4>Obs:</h4>
	<ul>
		<li>Mer information om dessa applikationer finns i applikationernas hj&auml;lpfiler.</li>
     </ul> 
</div>
</div>

<h2><a name="restart" href="#">V&auml;lj en &aring;tg&auml;rd f&ouml;r Synology NAS<br><span style="font-size:80%;">(starta om, st&auml;ng av, eller pip)</span></a></h2>

<div name="contents" id="restart" class="x-hidden-display">
<p>Med DSM mobile kan du starta om eller st&auml;nga av din Synology NAS med din iOS- eller Android-enhet. Om det finns flera Synology NAS i n&auml;rheten kan du dessutom snabbt identifiera din Synology NAS genom att be den spela upp pipljud.</p>

<h4>Att v&auml;lja en &aring;tg&auml;rd f&ouml;r Synology NAS:</h4>
<ol>
	<li>Tryck p&aring; alternativknappen h&ouml;gst upp till h&ouml;ger p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-tablet).</li>
	<li>G&ouml;r n&aring;got av f&ouml;ljande:
		<ul>
			<li>Tryck p&aring; <b>Starta om</b> och tryck sedan p&aring; <b>Ja</b> f&ouml;r att starta om din Synology NAS.</li>
			<li>Tryck p&aring; <b>St&auml;ng av</b> och tryck sedan p&aring; <b>Ja</b> f&ouml;r att st&auml;nga av din Synology NAS.</li>
			<li>Tryck p&aring; <b>Hitta mig</b> f&ouml;r att be Synology NAS avge ett pipljud. Tryck p&aring; <b>OK</b> f&ouml;r att stoppa pip-ljudet.</li>
		</ul>
	</li>
</ol>
</div>


<h2><a name="desktopedition" href="#">Byta till skrivbordsl&auml;ge i DSM</a></h2>

<div name="contents" id="desktopedition" class="x-hidden-display">
<p>Klicka p&aring; ikonen f&ouml;r inst&auml;llningar och v&auml;lj <b>Skrivbordsl&auml;ge</b> f&ouml;r att byta till skrivbordsl&auml;ge i DSM.</p>

</div>




<h2><a name="contents12" href="#">Anv&auml;nda Lagringshanterare</a></h2>
<div name="contents" id="contents12" class="x-hidden-display">
<p><strong>Lagringshanterare</strong> l&aring;ter dig snabbt se anv&auml;ndningen och h&auml;lsan f&ouml;r systemets volymer och diskar.</p>

<h4>Att visa volyminformation:</h4>
	<ol>
		<li>Tryck p&aring; <strong>Lagringshanterare</strong> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-datorplatta).</li>
		<li>Tryck p&aring; fliken <strong>Volym</strong>.</li> 
		<li>Tryck p&aring; en volym i listan f&ouml;r att visa dess detaljerade information.</li>
	</ol>

<h4>Att visa diskinformation:</h4>
	<ol>
		<li>Tryck p&aring; <strong>Lagringshanterare</strong> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-datorplatta).</li>
		<li>Tryck p&aring; fliken <strong>HDD/SSD</strong>.</li>
		<li>Tryck p&aring; en disk i listan f&ouml;r att visa dess information om h&auml;lsa och S.M.A.R.T.-information.</li>
	</ol>

<h4>Att starta eller stoppa ett S.M.A.R.T.-test:</h4>
	<ol>
		<li>Tryck p&aring; <strong>Lagringshanterare</strong> p&aring; startsidan (iPhone/iPod touch eller Android-telefon) eller den v&auml;nstra panelen (iPad eller Android-datorplatta).</li>
		<li>Tryck p&aring; fliken <strong>HDD/SSD</strong>.</li>
		<li>Tryck p&aring; en disk i listan f&ouml;r att visa dess sida med information.</li>
		<li>Tryck p&aring; <strong>S.M.A.R.T. Tryck p&aring; </strong> f&ouml;r att starta ett S.M.A.R.T.-test eller <strong>Stoppa</strong> f&ouml;r att stoppa det.</li>
     </ol>
     
</div>


<h2><a name="contents11" href="#">Mer information</a></h2>

<div name="contents" id="contents11" class="x-hidden-display">
<p>Om du beh&ouml;ver information om fels&ouml;kning eller om du vill l&auml;ra dig mer om Synology, klicka p&aring; f&ouml;ljande l&auml;nkar f&ouml;r att f&aring; tillg&aring;ng till Synology:s online-resurser:</p>
<ul>
	<li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">Fr&aring;gor och svar</a>
</li>
	<li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
	<li><a href="http://forum.synology.com" target="_blank">Forum</a></li>
	<li><a href="http://www.synology.com/support/download.php" target="_blank">Nerladdningscenter</a></li>
	<li><a href="https://myds.synology.com/support/support_form.php" target="_blank">Teknisk support</a></li>
</ul>
</div>


</body>
</html>