<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>S&auml;kerhetskopiering &amp; Replikering</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>LUN-s&auml;kerhetskopiering</h2>
<p>Under fliken <b>S&auml;kerhetskopiering</b> i <b>S&auml;kerhetskopiera &amp; Replikering</b> kan du anv&auml;nda <b>Lokal LUN-s&auml;kerhetskopiering</b> f&ouml;r att s&auml;kerhetskopiera iSCSI LUNs p&aring; din DiskStation till lokala delade mappar. Du kan &auml;ven anv&auml;nda <b>N&auml;tverks-LUN-s&auml;kerhetskopiering</b> f&ouml;r att s&auml;kerhetskopiera ytterligare en DiskStation.</p>

<h4>S&auml;kerhetskopiera en iSCSI LUN:</h4>
<ol>
<li>
V&auml;lj <b>Skapa</b> &gt; <b>LUN-s&auml;kerhetskopieringsuppgift</b> f&ouml;r att &ouml;ppna <b>Guiden LUN s&auml;kerhetskopiering</b> och klicka p&aring; <b>N&auml;sta</b>.
</li>
<li>
N&auml;r du uppmanas att v&auml;lja destinationstyp v&auml;ljer du n&aring;gon av f&ouml;ljande:
</li>
<ul>
<li>
<b>Lokal LUN-s&auml;kerhetskopiering</b>: V&auml;lj detta alternativ f&ouml;r att s&auml;kerhetskopiera LUN fr&aring;n din DiskStation till en lokal delad mapp eller en extern lagring som &auml;r ansluten till USB eller eSATA-porten p&aring; din DiskStation.
</li>
<li><b>N&auml;tverks-LUN-s&auml;kerhetskopiering</b>: V&auml;lj detta alternativ f&ouml;r att s&auml;kerhetskopiera LUN fr&aring;n din DiskStation till en annan DiskStation.
</li>
</ul>
<li>
N&auml;r du uppmanas till det specificerar du s&auml;kerhetskopieringsdestinationen och k&auml;ll-LUN och st&auml;ller in s&auml;kerhetskopieringsschemat.
</li>
<li>
F&ouml;lj guiden f&ouml;r att slutf&ouml;ra installationen.
</li>
</ol>
<p>Efter att s&auml;kerhetskopieringsuppgiften har skapats kommer DiskStation att utf&ouml;ra s&auml;kerhetskopieringsuppgiften enligt schema och lagra den s&auml;kerhetskopierade LUN p&aring; destinationen. S&auml;kerhetskopierad LUN anv&auml;nds endast f&ouml;r syftet s&auml;kerhetskopiering. F&ouml;r &aring;tkomst till s&auml;kerhetskopierad LUN, se <a href="restore.html">&Aring;terst&auml;lla s&auml;kerhetskopierad LUN</a> f&ouml;r mer information.</p>

<div class="section">
<h4>Obs!</h4>
<ul>
<li>Både vanliga fil- och blocknivå-LUN kommer att säkerhetskopieras som filavbilder på målet. Om återställda, kommer alla blocknivå-LUN att återställas till fil-LUN.</li>
<li>Varje s&auml;kerhetskopieringsuppgift kan endast inkludera en LUN som s&auml;kerhetskopieringsk&auml;llan.</li>
<li>LUNS kan inte s&auml;kerhetskopieras till en extern disk med formatet FAT, FAT32, HFS, HFS Plus eller NTFS.</li>
<li>Innan N&auml;tverks-LUN-s&auml;kerhetskopiering utf&ouml;rs, v&auml;nligen logga in p&aring; m&aring;let DiskStation f&ouml;r att s&auml;kerst&auml;lla att tj&auml;nsten n&auml;tverkss&auml;kerhetskopiering &auml;r aktiverad i <b>S&auml;kerhetskopiering &amp; Replikering</b> &gt; <b>S&auml;kerhetskopieringstj&auml;nster</b>.</li>
<li>Om din DiskStation ansluts till n&auml;tverket via en router m&aring;ste du se till att du har specificerat en regel f&ouml;r vidarebefordring av portar f&ouml;r iSCSI-tj&auml;nsten (TCP-port 3260) p&aring; routern, innan du utf&ouml;r N&auml;tverks-LUN-s&auml;kerhetskopiering.</li>
</ul>
</div>


<div class="section">
<h4>Om Fullst&auml;ndig s&auml;kerhetskopiering och inkrementell s&auml;kerhetskopiering:</h4>
<p>
DiskStation kommer att utf&ouml;ra en fullst&auml;ndig s&auml;kerhetskopiering f&ouml;r vald LUN f&ouml;rsta g&aring;ngen och d&auml;refter inkrementell s&auml;kerhetskopiering. Men om namnet p&aring; den delade mappen eller s&auml;kerhetskopieringsdestinationen &auml;ndras kommer DiskStation att utf&ouml;ra en fullst&auml;ndig s&auml;kerhetskopiering f&ouml;r uppgiften igen.
</p>
</div>
</body></html>
