
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Optionen der File Station verwalten - Synology DSM Hilfe</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Learn how to customize File Station settings related to file management, shared links, and security.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Versenden von Dateien als E-Mail-Anlage</h2>

<p>Sie k&ouml;nnen Dateien als E-Mail-Anlage direkt in der <strong>File Station</strong> versenden, indem Sie auf die ausgew&auml;hlten Dateien rechtsklicken und die Option <strong>als E-Mail-Anlage versenden</strong> ausw&auml;hlen. Ein E-Mail-Fenster mit einigen n&uuml;tzlichen Eigenschaften wird ge&ouml;ffnet:</p>
<ul>
<li>An: Falls Sie irgendwelche Kontakte f&uuml;r Ihr E-Mail-Konto synchronisiert haben, erscheint eine Kontaktliste, in der die mit Ihrem E-Mail-Konto verkn&uuml;pften, synchronisierten Kontakte angezeigt werden.</li>
<li>Von: Sie k&ouml;nnen das Standard-E-Mail-Konto ausw&auml;hlen oder ein anderes E-Mail-Konto hinzuf&uuml;gen. Die Kontaktliste wird automatisch zum ausgew&auml;hlten E-Mail-Konto wechseln.</li>
<li>Anlagen: Die ausgew&auml;hlten Anlagen werden am unteren Rand der E-Mail angezeigt. Sie k&ouml;nnen mehrere Anlagen mit Hilfe der Anlagen-Taste hinzuf&uuml;gen.</li>
</ul>

<div class="section">
  <h4>Hinweis:</h4>
  <ul>
    <li>Nur Dateien k&ouml;nnen als Anlage hinzugef&uuml;gt werden.</li>
    <li>Sie k&ouml;nnen bis zu 10 Dateien an eine einzige E-Mail anh&auml;ngen.</li>
    <li>Die maximal zul&auml;ssige Gesamtgr&ouml;&szlig;e aller Anh&auml;nge einer E-Mail ist von Ihrem E-Mail-Dienst abh&auml;ngig. Wenn Sie nicht sicher sind, empfehlen wir die Gesamtdateigr&ouml;&szlig;e aller Anh&auml;nge auf 25 MB zu beschr&auml;nken. </li>
  </ul>
</div>
</body>
</html>
