<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Dateien/Ordnerberechtigungen anzeigen oder &auml;ndern</h2>
<p>Mit der File Station k&ouml;nnen Sie die Zugriffsberechtigungen f&uuml;r Dateien und Unterordner einstellen. Diese Funktion ist besonders dann hilfreich, wenn Sie verschiedenen Benutzergruppen den Zugriff auf verschiedene Unterordner in den gemeinsamen Ordnern erlauben m&ouml;chten.</p>

<h4>Benutzern und Gruppen den Zugriff auf Dateien und Unterordner erlauben:</h4>
<ol>
<li>W&auml;hlen Sie die Dateien und Ordner, f&uuml;r die Sie Zugangsberechtigungen festlegen m&ouml;chten.</li>
<li>Klicken Sie mit der rechten Maustaste auf eine(n) der Dateien oder Ordner oder w&auml;hlen Sie das Men&uuml; <b>Aktion</b> und w&auml;hlen Sie anschlie&szlig;end <b>Eigenschaften</b>.</li>

<img src="about:blank" class="help_image"/>

<li>Im Abschnitt <b>Besitzer</b>, w&auml;hlen Sie den Besitzer der ausgew&auml;hlten Dateien und Ordner im Drop-down-Men&uuml; <b>Besitzer</b>.</li>

<img src="about:blank" class="help_image"/>

<li class="disable-eds14">Klicken Sie auf die Registerkarte <b>Benutzerrechte</b> und w&auml;hlen Sie dann einen Benutzer oder eine Gruppe. Klicken Sie auf <strong>Bearbeiten</strong>, um die <strong>Genehmigungspr&uuml;fung zu &ouml;ffnen<strong>.</strong></strong><br>

<li class="disable-eds14">Verwenden Sie eine der folgenden Methoden im Fenster <b>Berechtigungs-Editor</b>, um ACL-Berechtigungen f&uuml;r die Datei oder den Ordner zu verwalten:

<ol class="disable-eds14">
        <li><b>Benutzer oder Gruppe:</b> Geben Sie den Benutzer oder die Gruppe an, deren Berechtigungen angepasst werden sollen.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>&Uuml;bernehmen von:</b> Nur zur Ansicht. Hier finden Sie Informationen, ob eine Berechtigung (von einem &uuml;bergeordneten Ordner) &uuml;bernommen oder ausdr&uuml;cklich (als <b>Keine</b> angezeigt) ist. </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Typ:</b> W&auml;hlen Sie <b>Zulassen</b> oder <b>Verweigern</b>, um dem Benutzer oder der Gruppe die Genehmigung zu gew&auml;hren oder zu verwehren.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Anwenden auf:</b> Wenn Sie einen Genehmigungseintrag f&uuml;r einen Ordner erstellen, markieren Sie die Kontrollk&auml;stchen, um den Eintrag f&uuml;r diesen Ordner, die Ordner (oder <b>Untergeordnete Ordner</b>) oder Dateien (oder <b>Untergeordnete Dateien</b>) in diesem Ordner oder alle Dateien und Ordner in diesem Ordner (oder <b>Alle Ableitungen</b>) zu &uuml;bernehmen. </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Administration:</b> Markieren Sie <b>Berechtigungen lesen</b>, <b>Berechtigungen &auml;ndern</b> oder <b>Eigent&uuml;merschaft &uuml;bernehmen</b>, um die Berechtigungen des Benutzers oder der Gruppe f&uuml;r den Eintrag festzulegen. </li>
        <li><b>Lesen</b> oder <b>Schreiben</b>: Markieren Sie die Kontrollk&auml;stchen in diesen Bereichen, um die Berechtigungseinstellungen des Benutzers oder der Gruppe f&uuml;r die Datei oder den Ordner zu &auml;ndern. </li>
      </ol>    
  <li> Klicken Sie auf <b>OK</b>.</li>
</ol>

<p><span class="note_head">Hinweis: </span>Sie d&uuml;rfen die Zugriffsberechtigungen auf Dateien und Unterordner im gemeinsamen Ordner <b>photo</b> hier nicht bearbeiten.</p>
</body>
</html>
