<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Dateien oder Ordner hochladen</h2>
<p>Verwenden Sie eine der folgenden Methoden, um Dateien oder Ordner von Ihrem Computer auf DiskStation hochzuladen.</p>
<p>Um vollen Zugriff auf die unten stehenden Upload-Funktionen zu haben, installieren Sie zuerst Java Runtime Environment (JRE) und Flash Player. </p>


<h4>Methode 1:</h4>
<ol>
<li>
W&auml;hlen Sie im oberen Teil des linken Feldes einen Zielordner auf DiskStation. 
</li>
<li>
Klicken Sie auf <b>Hochladen</b>, w&auml;hlen Sie <strong>Hochladen - &Uuml;berspringen</strong> oder <strong>Hochladen - &Uuml;berschreiben</strong> und w&auml;hlen Sie Dateien oder Ordner von Ihrem lokalen Computer. </li>
</ol>
<h4>Methode 2:</h4>
<ol>
	<li>Gehen Sie zu <strong>Einstellungen</strong>, markieren Sie <strong>Mit der File Station Dateien des lokalen Computers durchsuchen</strong> und aktualisieren Sie die Webseite, um Ordner Ihres lokalen Computers im unteren Bereich des linken Feldes anzuzeigen.</li>
<div class="section">
<h4>Hinweis:</h4>
<p>Die Option <strong>Mit der File Station Dateien des lokalen Computers durchsuchen</strong> wird nur &uuml;bernommen, wenn Sie JRE auf Ihrem Computer installiert und aktiviert haben.</p>
</div>
	<li>W&auml;hlen Sie im unteren Teil des linken Feldes einen Ordner von Ihrem lokalen Computer. Der Hauptbereich zeigt nun die Inhalte des ausgew&auml;hlten Ordners an.
	</li>
	<li>W&auml;hlen Sie die gew&uuml;nschten Dateien oder Ordner im Hauptbereich und klicken Sie auf <b>Hochladen</b>. 
</li>
	<li>W&auml;hlen Sie im Fenster, das dann erscheint, einen Zielordner auf DiskStation aus.
	</li>
	<li>W&auml;hlen Sie oben in der rechten Ecke des Fensters <b>&Uuml;berschreiben</b>, wenn Sie die Dateien oder Ordner mit demselben Namen am Zielordner &uuml;berschreiben m&ouml;chten. Klicken Sie andernfalls auf <b>&Uuml;berspringen</b>.
</li>
	<li>Klicken Sie auf <b>OK</b>, um den Upload zu starten.
</li>
</ol>
<h4>Methode 3:</h4>
<ol>
<li>Gehen Sie zu <strong>Einstellungen</strong>, markieren Sie <strong>Mit der File Station Dateien des lokalen Computers durchsuchen</strong> und aktualisieren Sie die Webseite, um Ordner Ihres lokalen Computers im unteren Bereich des linken Feldes anzuzeigen.</li>
<li>
Ziehen Sie im linken Feld einen Ordner von Ihrem Computer (der untere Teil) in einen beliebigen Ordner auf DiskStation (oberer Teil).
</li>
<li>
W&auml;hlen Sie im angezeigten Pop-Up Men&uuml;, ob Sie Dateien/Ordner mit identischem Namen im Zielordner &uuml;berschreiben oder &uuml;berspringen m&ouml;chten.
</li>
</ol>
<h4>Methode 4:</h4>
<ol>
<li>
W&auml;hlen Sie im oberen Teil des linken Feldes einen Zielordner auf DiskStation.
</li>

<li>
W&auml;hlen Sie Dateien auf dem Desktop oder im Datei-Explorer Ihres Computers (z.&nbsp;B. Windows Explorer oder Mac Finder) und ziehen Sie diese in die File Station im Webbrowser.
</li>

<li>
W&auml;hlen Sie im angezeigten Dialog, ob Sie Dateien mit identischem Namen im Zielordner &uuml;berschreiben oder &uuml;berspringen m&ouml;chten.</li>
<div class="section">
<h4>Hinweis:</h4>
<ul>
<li><b>Methode 4</b> wird nur von bestimmten Browsern unterst&uuml;tzt: Chrome, Firefox, Safari 5.1 und neuere Versionen. Wenn allerdings <strong>Mit der File Station Dateien des lokalen Computers durchsuchen</strong> markiert ist, wird Mac nicht unterst&uuml;tzt.</li>
<li>
Sie k&ouml;nnen auch Ordner ziehen und ablegen, um Dateien zu leeren, aber nur wenn <strong>Mit der File Station Dateien des lokalen Computers durchsuchen</strong> f&uuml;r die oben stehenden Browser markiert ist. Anderenfalls k&ouml;nnen Sie mit <strong>Methode 4</strong> keine Ordner hochladen und Dateien leeren.</li>
	<li>
Wenn Sie Chrome f&uuml;r Linux verwenden und &uuml;ber das HTTPS-Protokoll bei DSM angemeldet sind, m&uuml;ssen Sie ein vertrauensw&uuml;rdiges Zertifikat importieren (unter <b>Systemsteuerung</b> &gt; <b>Sicherheit</b> &gt; <strong>Zertifikat</strong>), um mit <b>Methode 4</b> Inhalte hochladen zu k&ouml;nnen.
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ol>
<li>
Sie k&ouml;nnen bis zu 1000 Dateien zu Ihrer Upload-Warteschlange hinzuf&uuml;gen.
</li>
	<li>
	Sie k&ouml;nnen Dateien mit einer Gr&ouml;&szlig;e &uuml;ber 4GB hochladen, wenn Sie Google Chrome, Firefox, Safari 5.1 oder sp&auml;ter verwenden oder wenn <strong>Mit der File Station Dateien des lokalen Computers durchsuchen</strong> markiert ist. Ansonsten k&ouml;nnen Sie nur bis zu 2 GB Dateien gleichzeitig hochladen.</li>
	<li>
Bei gemeinsamen, nicht verschl&uuml;sselten Ordnern sollte der Datei-/Ordnername maximal 255 Zeichen lang sein (max. ca. 80 Zeichen bei nicht-lateinischen Sprachen); bei gemeinsamen, verschl&uuml;sselten Ordnern sollte der Datei-/Ordnername maximal 143 Zeichen lang sein (max. ca. 47 Zeichen bei nicht-lateinischen Sprachen).
</li>
<li>
Datei-/Ordnernamen d&uuml;rfen die folgenden Zeichen nicht enthalten: \ / : * ? &quot; &gt; |.
</li>
<li>
Datei-/Ordnername darf nicht mit &quot;._&quot; beginnen.
</li>
<li>Sie Dateien 0 KB Dateien nur dann hochladen, wenn Sie JRE installiert haben.</li>
</ol>
</div>


<div class="section">
<h4>Fehlerbehebung</h4>
<p>Wenn Sie lokal auf Ihrem Mac gespeicherte Inhalte mit Safari nicht ordnungsgem&auml;&szlig; durchsuchen k&ouml;nnen, gehen Sie folgenderma&szlig;en vor:</p>
<ol>
<li>&Ouml;ffnen Sie auf Ihrem Mac Safari und w&auml;hlen Sie <strong>Einstellungen</strong> im Men&uuml;.</li>
<li>Klicken Sie in der Registerkarte <strong>Sicherheit</strong> auf <strong>Website-Einstellungen verwalten</strong>.</li>
<li>W&auml;hlen Sie unter <strong>Java</strong> Ihre DSM-&quot;Website&quot;.</li>
<li>W&auml;hlen Sie <strong>Im unsicheren Modus ausf&uuml;hren</strong>.</li>
</ol>
</div>



</body>
</html>
