<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
	<h2>&Uuml;berblick</h2>
	<p>Der &Uuml;berblick zeigt den Gesamtstatus der Speicherbereiche an, einschlie&szlig;lich des Gesamtzustands aller Bereiche, die Festplattenbelegung, Top Volume-Nutzung und iSCSI LUN Nutzung.</p>

		<h4>Speicherzustand</h4>
        <p>Es gibt drei Statusarten:</p>
	  	<ul>
				<li><b>In Ordnung</b>: Alle Speicherbereiche sind normal.</li>
				<li><B>Achtung</B>: Ein Speicherbereich (Volume oder iSCSI LUN) ist fehlerhaft, SSD Cache ist abgest&uuml;rzt oder eine Systempartition ist ausgefallen.</li>
				<li><b>Gefahr</b>: Ein Speicherbereich (Volume oder iSCSI LUN) ist abgest&uuml;rzt.</li>
			</ul>
			<p>Wenn mehrere Unregelm&auml;&szlig;igkeiten gleichzeitig auftreten, wird der Zustand in der folgenden Reihenfolge angezeigt: 1) Speicherbereiche (Volume oder iSCSI LUN); 2) SSD Cache und 3) Systempartition. Wenn ein Problem auftritt, folgen Sie bitte den unter dem Status vorgeschlagenen Anweisungen.</p>
		
		<h4>Disk-Informationen</h4>
        <p>Diese Abschnitt zeigt Festplatten- und Hardware-Informationen an. Sie k&ouml;nnen &uuml;berpr&uuml;fen, wie viele Festplatten von welchen Speicherbereichen verwendet werden, die Anzahl der Ersatzfestplatten, sowie die Anzahl der verf&uuml;gbaren Festplattensch&auml;chte.</p>
        
		<h4>Top Volume-Auslastung</h4>
        <p>Dieser Abschnitt zeigt die genutzte Kapazit&auml;t eines Volumes. Wenn die Gesamtnutzung 90% erreicht, wird das Tortendiagramm rot; &uuml;ber 80% gelb; und unter 79% blau.</p>
        
		<h4>iSCSI LUN Nutzung</h4>
        <p>Dieser Abschnitt zeigt die folgenden Informationen an:</p>
        <ul>
         		<li><b>Berichtet</b>:  Die insgesamt zugewiesene Kapazit&auml;t aller iSCSI LUN (Block-Ebene) und iSCSI LUN (regul&auml;re Datei) in der RAID Gruppe zusammengerechnet.</li>
                <li><b>Benutzt</b>: Insgesamt zugewiesene Kapazit&auml;t im iSCSI LUN (regul&auml;re Dateien) und die Gesamtkapazit&auml;t des iSCSI LUN (Block-Ebene) zusammengerechnet.</li>
                <li><b>Gespeichert</b>:  Die insgesamt <b>Berichtet</b> Gr&ouml;&szlig;e minus der insgesamt <b>Benutzt</b> Gr&ouml;&szlig;e mit Anzeige der gesparten Kosten f&uuml;r Speicherbereich und Verwaltung.</li>
</ul>
        </li>
</body>
</html>
