<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Medya İndeksleme Hizmeti</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>D&ouml;n&uuml;şt&uuml;rme Ayarları</h2>
<p>Medya Sunucusu veya Photo Station ile kullanmak &uuml;zere fotoğraf veya video y&uuml;klediğinizde, daha iyi g&ouml;z atma deneyimi amacıyla k&uuml;&ccedil;&uuml;k resimler oluşturulacaktır. Burada k&uuml;&ccedil;&uuml;k resim kalitesini ayarlayabilir ve d&ouml;n&uuml;şt&uuml;rme ilerlemesini izleyebilirsiniz.</p>
<p>Aynı zamanda, mobil cihazlarınız &uuml;zerindeki Photo Station'ın <strong>photo</strong> paylaşımlı klas&ouml;r&uuml;ndeki videoları izlemek isterseniz, video d&ouml;n&uuml;şt&uuml;rmeyi etkinleştirebilir ve d&ouml;n&uuml;şt&uuml;rme ilerlemesini de izleyebilirsiniz.</p>
<h4>K&uuml;&ccedil;&uuml;k resim kalitesini ayarlamak i&ccedil;in:</h4>
<ol>
<li>
A&ccedil;ılan men&uuml;den bir kalite se&ccedil;in.
</li>
<li>
<b>Uygula</b>'ya tıklayın.
</li>
</ol>
<div class="section">
<span class="note_head">Not: </span>
<ul>
<li>Y&uuml;ksek kalitede k&uuml;&ccedil;&uuml;k resimler oluşturulması daha fazla zaman alacaktır.</li>
</ul>
</div>
<h4>Mobil cihazlarda video d&ouml;n&uuml;şt&uuml;rmeyi etkinleştirmek i&ccedil;in:</h4>
<ol>
<li><strong>Mobil cihazlar i&ccedil;in video d&ouml;n&uuml;şt&uuml;rmeyi etkinleştir</strong>'i işaretleyin.</li>
<li><strong>Uygula</strong>'ya tıkladığınızda hareket halindeyken mobil cihazlarınız &uuml;zerinde videoları g&ouml;rebileceksiniz.
</li>
</ol>

<div class="section">
<span class="note_head">Not: </span>
<ul>
<li>Sadece Photo Station'ın <strong>photo</strong> paylaşımlı klas&ouml;r&uuml;ne y&uuml;klenen videolar mobil cihazlar tarafından desteklenen bi&ccedil;ime d&ouml;n&uuml;şt&uuml;r&uuml;lebilir.</li>
<li>MP4 dosyalar d&ouml;n&uuml;şt&uuml;r&uuml;lmeyecektir.</li>
</ul>
</div>
<h4>Fotoğraf/video d&ouml;n&uuml;şt&uuml;rme ilerlemesini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in:</h4>
<ol>
<li>Fotoğraflar veya videolar DiskStation'e y&uuml;klenirken g&ouml;rev &ccedil;ubuğunun sağ &uuml;st k&ouml;şesinde g&ouml;r&uuml;nen <strong>D&ouml;n&uuml;şt&uuml;rme İlerlemesi</strong> simgesine tıklayın. </li>
<li>
Beliren pencerede aşağıdakilerden birini yapın:
</li>
<ul>
<li>
<b>D&ouml;n&uuml;şt&uuml;rme İlerlemesi</b> b&ouml;l&uuml;m&uuml;nde, arkaplanda ger&ccedil;ekleştirilen k&uuml;&ccedil;&uuml;k resim oluşturma işleminin ilerlemesini ve durumunu izleyin.
</li>
<li>
D&ouml;n&uuml;şt&uuml;rme ilerlemesini duraklatmak i&ccedil;in aşağıdakini yapın:
</li>
<ol>
<li>
İlerlemeyi duraklatmak i&ccedil;in a&ccedil;ılan men&uuml;den <b>[Sayı] saat geciktir</b> se&ccedil;imini yapın ve <b>Duraklat</b>'a tıklayın. (Varsayılan olarak, <b>1 saat geciktir</b> se&ccedil;ilir.)
</li>
<li>Belirlenen gecikme s&uuml;resinden sonra d&ouml;n&uuml;şt&uuml;rme ilerlemesi devam edecektir ya da işlemi hemen s&uuml;rd&uuml;rmek i&ccedil;in <b>Devam</b> &uuml;zerine tıklayın.
</li>
</ol>
<div class="section">
<span class="note_head">Not: </span>
<ul>
<li>D&ouml;n&uuml;şt&uuml;rme ilerlemesi daha y&uuml;ksek CPU kaynakları gerektirdiğinden, duraklatma sayesinde sistem kaynakları devam eden diğer g&ouml;revler i&ccedil;in korunabilir.</li>
</ul>
</div>
</ul>
<li>
D&ouml;n&uuml;şt&uuml;rme işlemi tamamlandığında g&ouml;rev &ccedil;ubuğundaki simge kaybolacaktır.
</li>
</ol>

<div class="section">
<span class="note_head">Not: </span>
<ul>
<li>Photo Station Uploader k&uuml;&ccedil;&uuml;k resim oluşturma i&ccedil;in daha iyi performans sunduğundan, Photo Station kitaplığınıza fazla sayıda fotoğraf/video y&uuml;klemek istediğinizde Photo Station Uploader kullanmanızı &ouml;neririz.</li>
</ul>
</div>

</body>
</html>