<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Multimedya Veritabanı</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Sistem Veritabanı</h1>
<p> DiskStation, <b>usbshare1</b> gibi harici depolama aygıtlarınızda oluşturulan paylaşımlı klas&ouml;rlerde depolanan paket verilerini ve sistem g&uuml;nl&uuml;k girişlerini takip etmek i&ccedil;in bir sistem veritabanı kullanır.</p>
<p> <span class="note_head">&Ouml;nemli: </span>DiskStation sunucunuza bağlanan harici depolama aygıtları &uuml;zerinde saklanan paket verilerine erişmek isterseniz ya da <b>Ana Men&uuml;</b> &gt; <strong>Günlük Merkezi</strong> &ouml;ğesinde DSM'nin g&uuml;nl&uuml;k kayıtlarını g&ouml;rmek isterseniz, sistem veritabanının &ouml;ncelikle etkinleştirilmesi gerekir. Aksi halde ilgili t&uuml;m hizmetler erişilemez hale gelecektir. </p>
<h4>Sistem veritabanını etkinleştirmek i&ccedil;in:</h4>
<ol>
  <li> <b>Sistem veritabanını etkinleştir</b>'i işaretleyin. </li>
  <li> Aşağıdakilerden birini yapın:
    <ul>
      <li> Sistem veritabanını depolamak i&ccedil;in DSM'nin otomatik olarak bir paylaşımlı klas&ouml;r se&ccedil;mesini istiyorsanız <b>Otomatik yapılandırma</b> se&ccedil;imini yapın. Paylaşımlı klas&ouml;r&uuml; i&ccedil;eren harici depolama aygıtı &ccedil;ıkarılırsa, DSM veritabanını kaydetmek i&ccedil;in otomatik olarak başka bir paylaşımlı klas&ouml;r se&ccedil;ecektir. </li>
      <li> <b>Mevcut veritabanını seçilen paylaşımlı klasöre taşıyın</b> &ouml;ğesini se&ccedil;in ve ardından mevcut veritabanını harici aygıtınızda oluşturulan başka bir paylaşımlı klas&ouml;re taşımak i&ccedil;in a&ccedil;ılır men&uuml;den se&ccedil;im yapın. </li>
      <li><strong>Mevcut veritabanlarından birini se&ccedil;</strong> &ouml;ğesini se&ccedil;in ve ardından DiskStation sunucunuza bağlı olan birden fazla harici aygıt varsa mevcut bir veritabanını se&ccedil;mek i&ccedil;in a&ccedil;ılır men&uuml;den se&ccedil;im yapın.</li>
    </ul>
  </li>
  <li> <b>Uygula</b>'ya tıklayın. </li>
</ol>
<p> <span class="note_head">Uyarı: </span>Veritabanının bozulmasını &ouml;nlemek i&ccedil;in depolama aygıtını <b>Ana Men&uuml;</b> &gt; <b>Denetim Masası</b> &gt; <strong>Harici Aygıtlar</strong> &gt; <strong>Harici Aygıtlar</strong> &ouml;ğesinde &ccedil;ıkarttığınızdan veya DiskStation sunucunuzdan &ccedil;ıkartmadan &ouml;nce sağ &uuml;st k&ouml;şedeki harici aygıtlar simgesine tıklayarak &ccedil;ıkarttığınızdan emin olun. </p>
</body>
</html>
