<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Bu sayfa, Bluetooth adapt&ouml;rlerini y&ouml;netmek ve DiskStation &uuml;r&uuml;n&uuml;n&uuml;ze Bluetooth aygıtları bağlamak i&ccedil;in se&ccedil;enekler sağlar. Bir kez bağlandığında, hoparl&ouml;r ya da kulaklık gibi bazı Bluetooth aygıtlar, DiskStation &uuml;r&uuml;n&uuml;n&uuml;zde depolanan m&uuml;zikleri kolayca dinlemenizi sağlayacak şekilde Audio Station i&ccedil;in ses &ccedil;ıkışı olarak se&ccedil;ilebilir.</p>
<h2>Başlarken</h2>
<p>Bir USB Bluetooth adapt&ouml;r&uuml;n&uuml; DiskStation &uuml;r&uuml;n&uuml;n&uuml;zdeki bir USB bağlantı noktasına takın. Bluetooth ana sayfasının sol tarafında Bluetooth adapt&ouml;rlerinin bir listesi g&ouml;r&uuml;nt&uuml;lenir. Bluetooth aygıtlarıyla ilgili bilgiler ve se&ccedil;enekler sağda g&ouml;r&uuml;nt&uuml;lenir.</p>
<h4>Bluetooth adapt&ouml;rlerini etkinleştirmek ya da devre dışı bırakmak i&ccedil;in:</h4>
<ol>
<li>Bir Bluetooth adapt&ouml;r&uuml; se&ccedil;in</li>
<li><strong>Gelişmiş Ayarlar</strong>'a tıklayın.</li>
<li><strong>Bluetooth Etkinleştir</strong> kutusunu işaretleyin.</li>
<li><strong>OK</strong> &uuml;zerine tıklayarak ayarları kaydedin.</li>
</ol>
<h2>Bluetooth Aygıtlarını Y&ouml;netme</h2>
<p>Yeni bir Bluetooth aygıtına bağlanırken, algılanabilir olduğundan, DiskStation &uuml;r&uuml;n&uuml;ne 10 metre uzaklık i&ccedil;inde bulunduğundan ve A2DP (Advanced Audio Distribution Profile) kullandığından emin olun. Kurulumla ilgili daha fazla ayrıntı i&ccedil;in Bluetooth aygıtının kullanım kılavuzuna başvurun.</p>
<h4>Bir Bluetooth aygıtına bağlanmak i&ccedil;in:</h4>
<ol>
<li><strong>Bluetooth</strong> ana sayfasında, DiskStation &uuml;r&uuml;n&uuml;ne bağlamak istediğiniz Bluetooth aygıtını se&ccedil;in. Aygıt g&ouml;r&uuml;nmezse, yakındaki aygıtları aramak i&ccedil;in <strong>Yenile</strong>'ye tıklamayı deneyin.</li>
<li>G&ouml;r&uuml;nd&uuml;ğ&uuml;nde aygıtı se&ccedil;in.</li>
<li><strong>Bağlan</strong>'a tıklayın.</li>
<li>Gerekirse, aygıtınız i&ccedil;in PIN'i girin.</li>
</ol>
<h4>Bluetooth aygıtı bilgilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in:</h4>
<ol>
<li>Bağlı bir Bluetooth aygıtını se&ccedil;in.</li>
<li><strong>Bilgi</strong>'ye tıklayın.</li>
<li>Bluetooth adresi, adı, t&uuml;r&uuml; ve durumu gibi bilgileri g&ouml;r&uuml;nt&uuml;leyen bir pencere a&ccedil;ılır.</li>
</ol>
<h4>Bir Bluetooth aygıtını kaldırmak i&ccedil;in:</h4>
<ol>
<li>DiskStation &uuml;r&uuml;n&uuml;n&uuml;zle daha fazla kullanmak istemediğiniz bir Bluetooth aygıtını se&ccedil;in.</li>
<li><strong>Kaldır</strong>'a tıklayın.</li>
</ol>
<div class="section">
<h4>Not:</h4>
<ul>
<li>Bluetooth hoparl&ouml;rler veya kulaklıklar yoluyla m&uuml;zik dinlerken, Bluetooth adapt&ouml;r&uuml;n&uuml;z&uuml;n ayarları değiştirilirse veya aynı anda &ccedil;ok fazla sayıda Bluetooth aygıtıyla bağlanırsanız y&uuml;r&uuml;tme sorunlarıyla karşılaşabilirsiniz.</li>
<li>Aygıta bağlı olarak, DiskStation sunucunuza bağlanmış olan bir &ccedil;ift Bluetooth hoparl&ouml;r daha sonra başka bir DiskStation sunucusuna (veya Bluetooth m&uuml;zik &ccedil;alara) bağlanırsa, hoparl&ouml;rler DiskStation sunucunuzu unutabilir. Bu durumda, hoparl&ouml;rlerle m&uuml;zik dinleme sırasında bir hata meydana gelebilir. Bu sorunu &ccedil;&ouml;zmek i&ccedil;in, l&uuml;tfen hoparl&ouml;rleri kaldırın ve tekrar bağlamayı deneyin.</li>
</ul>

</div>
</body>
</html>
