<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Otomatik Engelleme</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Otomatik Engelleme</h2>

<p>Otomatik engelleme yetkisiz oturum a&ccedil;mayı &ouml;nlemenize olanak sağlar. Hizmet etkinleştirildikten sonra, &ccedil;ok sayıda başarısız oturum a&ccedil;ma girişiminde bulunan bir IP adresi engellenir. SSH, Telnet, rsync, Network Backup, Shared Folder Sync, FTP, WebDAV, Synology mobile apps, File Station veya DSM aracılığıyla yapılan başarısız oturum a&ccedil;ma girişimlerinin t&uuml;m&uuml; eklenecektir. Hi&ccedil;bir zaman engellenmeyecek IP adreslerini i&ccedil;eren bir İzin Listesine de sahip olabilirsiniz.</p>

<h4>Otomatik engellemeyi kurmak i&ccedil;in:</h4>
<ol>
<li><strong>Genel</strong> sekmesine gidip <b>Otomatik engellemeyi etkinleştir</b>'i işaretleyin.</li>
<li>Belirlenen dakika sayısı i&ccedil;inde yapılan bir dizi başarısız oturum a&ccedil;ma girişimlerinden sonra IP adresini engellemek i&ccedil;in <b>Oturum a&ccedil;ma girişimleri</b> sayısı ile <b>S&uuml;re i&ccedil;inde (dakika)</b> girişlerini yapın.</li>
<li><b>Engelleme s&uuml;re dolumunu etkinleştir</b>'i işaretleyin ve belirlenen g&uuml;n sayısı sonunda engellenen IP adresini kaldırmak i&ccedil;in bir sayı girin.  Bu se&ccedil;enek se&ccedil;ilmez veya <b>Engellemeyi sonra kaldır (g&uuml;n)</b> 0 olarak ayarlanmazsa engellenen IP adresleri listeden manuel olarak &ccedil;ıkarılmadık&ccedil;a sonsuza dek engelleme listesinde kalır.</li>

<li><b>Uygula</b>'ya tıklayın.</li>
</ol>

<h4>Engellenen IP adreslerini eklemek i&ccedil;in:</h4>
<p><strong>Engelleme Listesi</strong> sekmesine tıklayın ve <strong>Oluştur</strong> a&ccedil;ılan men&uuml;s&uuml;nden aşağıdakilerden birini se&ccedil;in:</p>
<ul>
<li><strong>IP adresi ekle</strong></li>
<p>Bir IP adresi girin ve sona erme zamanını ayarlayın.<p/>
<li><strong>IP adres listesini al</strong></li>
<p>Bir kerede birtakım IP adreslerini eklemek ve sona erme zamanı ayarlamak i&ccedil;in, IP adreslerinin listelendiği bir metin dosyasını i&ccedil;e aktarın. Var olan IP adreslerinin &uuml;zerine yazmak isterseniz uygun onay kutusunu işaretleyin. Se&ccedil;enek işaretlenmezse, aynı IP adresleri atlanacaktır.</p>
<p>Bir dosyayı i&ccedil;e aktarmak i&ccedil;in, dosyanın aşağıdaki kriterlere uyması gerekir:</p>
<ul>
<li>Dosya d&uuml;z metin dosyası olmalıdır.</li>
<li>Dosyanın her bir satırı yalnızca bir IP adresi i&ccedil;ermelidir.</li>
<li>Yorum satırları # (diyez işareti) ile başlar.</li>
<p>Se&ccedil;tiğiniz dosya doğru bi&ccedil;ime sahipse, &ouml;nizleme alanında t&uuml;m IP adreslerini g&ouml;receksiniz. İ&ccedil;e aktarmak i&ccedil;in <strong>Tamam</strong>'a tıklayın.</p>
</ul>
</ul>

<h4>Engellenen IP adreslerini kaldırmak i&ccedil;in:</h4>
<ol>
<li>
Engellenmiş IP adreslerinin listesini g&ouml;rmek i&ccedil;in <b>Engelleme Listesi</b> sekmesine tıklayın.
</li>
<li>
Listeden kaldırmak istediğiniz IP adreslerini se&ccedil;ip <b>Kaldır</b>'a tıklayın.
</li>
</ol>


<h4>İzin verilen IP adreslerini eklemek i&ccedil;in:</h4>
<p><strong>İzin listesi</strong> sekmesine tıklayın ve <strong>Oluştur</strong> a&ccedil;ılan men&uuml;s&uuml;nden aşağıdakilerden birini se&ccedil;in:</p>
<ul>
<li><strong>IP adresi ekle</strong></li>
<p>Bir IP adresi girin.<p/>
<li><strong>IP adres listesini al</strong></li>
<p>Bir kerede birtakım IP adreslerini eklemek i&ccedil;in, IP adreslerinin listelendiği bir metin dosyasını i&ccedil;e aktarın. Var olan IP adreslerinin &uuml;zerine yazmak isterseniz uygun onay kutusunu işaretleyin. Se&ccedil;enek işaretlenmezse, aynı IP adresleri atlanacaktır.</p>
<p>Bir dosyayı i&ccedil;e aktarmak i&ccedil;in, dosyanın aşağıdaki kriterlere uyması gerekir:</p>
<ul>
<li>Dosya d&uuml;z metin dosyası olmalıdır.</li>
<li>Dosyanın her bir satırı yalnızca bir IP adresi i&ccedil;ermelidir.</li>
<li>Yorum satırları # (diyez işareti) ile başlar.</li>
<p>Se&ccedil;tiğiniz dosya doğru bi&ccedil;ime sahipse, &ouml;nizleme alanında t&uuml;m IP adreslerini g&ouml;receksiniz. İ&ccedil;e aktarmak i&ccedil;in <strong>Tamam</strong>'a tıklayın.</p>
</ul>
</ul>

<h4>İzin verilen IP adreslerini kaldırmak i&ccedil;in:</h4>
<ol>
<li>
İzin verilen IP adreslerinin listesini g&ouml;rmek i&ccedil;in <b>İzin listesi</b> sekmesine tıklayın.
</li>
<li>
Listeden kaldırmak istediğiniz IP adreslerini se&ccedil;ip <b>Kaldır</b>'a tıklayın. </li>
</ol>


</body>
</html>
