<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Paylaştırılmış klas&ouml;r</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Paylaştırılmış klas&ouml;r</h1>
<p>Paylaşımlı klas&ouml;rler, DiskStation &uuml;r&uuml;n&uuml;n&uuml;zdeki dosyaları ve klas&ouml;rleri depolayabileceğiniz temel dizinlerdir. Herhangi bir dosyayı DiskStation &uuml;r&uuml;n&uuml;n&uuml;ze depolamadan &ouml;nce en az bir paylaşımlı klas&ouml;r oluşturmanız gerekecektir. Paylaşımlı klas&ouml;rlerde depolanan veriler, &ouml;zelleştirilebilir erişim izinlerine g&ouml;re &ouml;zel tutulabilir veya belirli kullanıcılar veya kullanıcı grupları ile paylaşılabilir. Buna ek olarak paylaşımlı klas&ouml;rler oluşturma sırasında şifrelenerek ilave bir koruma katmanı eklenebilir.</p>

<h3>Varsayılan Paylaşımlı Klas&ouml;rler</h3>

<p>Aşağıda, belirli uygulamalar, hizmetler veya paketler y&uuml;klendiğinde veya etkinleştirildiğinde otomatik oluşturulan paylaşımlı klas&ouml;rlerin bir listesi yer alır.</p> 

<table>
<tr>
<th>Adı</th>
<th>A&ccedil;ıklama</th>
</tr>
<tr>
<th>public</th>
<td><strong>Genel</strong> klas&ouml;r&uuml;, DiskStation &uuml;r&uuml;n&uuml;n&uuml;z ilk kurulduktan sonra otomatik olarak oluşturulur.*</td>
</tr>
<tr>
<th>web</th>
<td><strong>Web</strong> klas&ouml;r&uuml;, DiskStation &uuml;r&uuml;n&uuml;nde barındırılan web sitesi i&ccedil;erikleri i&ccedil;in varsayılan depolama konumudur. <strong>Web Station</strong> etkinleştirildiğinde otomatik olarak oluşturulur.</td>
</tr>
<tr>
<th>photo</th>
<td><strong>Photo</strong> klas&ouml;r&uuml; Photo&nbsp;Station &uuml;zerinde paylaşmak istediğiniz fotoğraf ve videoları depolamak i&ccedil;in kullanılır. <strong>Photo Station</strong> ya da <strong>DLNA/UPnP Ortam Sunucusu</strong> etkinleştirildiğinde otomatik olarak oluşturulur.</td>
</tr>
<tr>
<th>music</th>
<td><strong>Music</strong> klas&ouml;r&uuml; Audio Station ile dinlemek istediğiniz m&uuml;zikleri depolamak i&ccedil;in kullanılır. <strong>Audio Station</strong> etkinleştirildiğinde otomatik olarak oluşturulur.</td>
</tr>
<tr>
<th>video</th>
<td><strong>Video</strong> klas&ouml;r&uuml; DLNA/UPnP aygıtları aracılığıyla g&ouml;zatmak istediğiniz video dosyalarını depolamak i&ccedil;in kullanılır. <strong>Medya Sunucusu</strong> etkinleştirildiğinde otomatik olarak oluşturulur.</td>
</tr>
<tr>
<th>g&ouml;zetleme</th>
<td><strong>Surveillance</strong> klas&ouml;r&uuml; Surveillance&nbsp;Station kayıtlarını depolamak i&ccedil;in kullanılır. <strong>Surveillance Station</strong> etkinleştirildiğinde otomatik olarak oluşturulur. Salt okunurdur ve sadece sistem y&ouml;neticisi tarafından erişilebilir.</td>
</tr>
<tr>
<th>home</th>
<td><strong>Home</strong> klas&ouml;rleri, veri saklamak &uuml;zere her kullanıcı i&ccedil;in sadece kullanıcının erişebileceği &ouml;zel alanlar sağlar. <strong>Kullanıcı Ana Sayfa</strong> etkinleştirildiğinde otomatik olarak oluşturulur.</td>
</tr>
<tr>
<th>homes</th>
<td><strong>homes</strong> klas&ouml;r&uuml; t&uuml;m kullanıcıların home klas&ouml;rlerini i&ccedil;erir. <strong>Kullanıcı Ana Sayfa</strong> etkinleştirildiğinde otomatik olarak oluşturulur. Sadece sistem y&ouml;neticisi t&uuml;m kullanıcıların klas&ouml;rlerine erişebilir ve bunları y&ouml;netebilir.</td>
</tr>
<tr>
<th>NetBackup</th>
<td><strong>NetBackup</strong> klas&ouml;r&uuml; <strong>Ağ Yedekleme</strong> etkinleştirildiğinde otomatik olarak oluşturulur.</td>
</tr>
<tr>
<th>usbshare</th>
<td><strong>usbshare[sayı]</strong> klas&ouml;r&uuml;, DiskStation &uuml;r&uuml;n&uuml;n&uuml;n USB bağlantı noktasına bir USB harici disk aygıtı bağladığınızda otomatik olarak oluşturulur.*</td>
</tr>
<tr>
<th>satashare</th>
<td><strong>satashare</strong> klas&ouml;r&uuml;, DiskStation &uuml;r&uuml;n&uuml;n&uuml;n eSATA bağlantı noktasına bir eSATA harici disk aygıtı bağladığınızda otomatik olarak oluşturulur.*</td>
</tr>
</table>

<p>____<br> * Sadece belirli modellerde mevcuttur.</p>

</body>
</html>
