<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Paylaşımlı Klas&ouml;r</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Şifrelenmiş Klas&ouml;r&uuml; D&uuml;zenle</h2>
<p>Klas&ouml;r şifrelendikten sonra klas&ouml;r&uuml; d&uuml;zenlemek i&ccedil;in <b>Şifreleme</b> a&ccedil;ılan men&uuml;s&uuml;n&uuml; kullanabilirsiniz.</p>
<h4>Men&uuml;deki &ouml;ğeler se&ccedil;ilen paylaşımlı klas&ouml;r&uuml;n durumuna bağlıdır:</h4>
<ul>
<li>Şifrelenmiş bir paylaşımlı klas&ouml;r se&ccedil;erseniz <b>Şifreleme</b> a&ccedil;ılan men&uuml;s&uuml; devre dışı olur.</li>
<li>Tanıtılmış bir şifrelenmiş paylaşımlı klas&ouml;r se&ccedil;erseniz <b>Şifreleme</b> a&ccedil;ılan men&uuml;s&uuml;nden <b>Bağlantıyı kaldır</b> se&ccedil;imiyle klas&ouml;r&uuml;n bağlantısını kaldırabilir veya <b>Aktarma anahtarı</b> se&ccedil;imiyle şifreleme anahtarını kaydedebilirsiniz.</li>
<li>Bağlantısı kaldırılmış bir şifreli paylaştırılan klas&ouml;r se&ccedil;erseniz <b>Şifreleme</b> a&ccedil;ılan men&uuml;s&uuml;nden <b>Tanıt</b> se&ccedil;tikten sonra erişim i&ccedil;in klas&ouml;r&uuml; tanıtmak amacıyla şifreleme anahtarını girebilir veya alabilirsiniz.</li>
</ul>
<ol>
<span class="note_head">Not:</span>
<li><span  class="note_content">Şifreleme anahtarının hatırlanması &ccedil;ok &ouml;nemlidir.</span> Şifreleme anahtarını dışarı aktarıp kaydetmeniz &ouml;nemle &ouml;nerilir. Anahtarı unutur veya kaybederseniz şifrelenmiş veri hi&ccedil;bir şekilde kuratarılamaz.</li>
<li>Şifrelenmiş paylaşılan bir klas&ouml;r&uuml;n montajı kaldırılırsa yeniden adlandıramaz veya birim konumunu değiştiremezsiniz. Montajı kaldırdıktan sonra değişiklik yapabilirsiniz.</li></ol>
</body>
</html>
