<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Kullanıcı</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Şifre Ayarları</h2>
<p>Aşağıda a&ccedil;ıklanan ayarları g&ouml;r&uuml;nt&uuml;lemek ve değiştirmek i&ccedil;in <strong>Şifre Ayarları</strong> d&uuml;ğmesine tıklayın.</p>

<h3>Unutulan Şifreleri Sıfırla</h3>
<p>Bu b&ouml;l&uuml;m <strong>Y&ouml;netici dışındaki kullanıcıların unutulan şifreleri e-posta ile sıfırlamasına izin ver</strong> adında bir se&ccedil;enek i&ccedil;erir. Bu se&ccedil;enek etkinleştirildiğinde, <strong>Şifrenizi unuttunuz mu?</strong> adındaki bir bağlantı DSM oturum a&ccedil;ma sayfasında g&ouml;r&uuml;nt&uuml;lenir. Eğer bir kullanıcı şifresini unutursa, bu bağlantıya tıklayabilir ve kullanıcı adını girebilir. Bu durumda, sistem kullanıcıya unutulan şifresini sıfırlamak i&ccedil;in bir bağlantı i&ccedil;eren bir mesaj g&ouml;nderecektir. </p>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Bu se&ccedil;eneği etkinleştirmeden &ouml;nce, SMTP e-posta bildirimlerini etkinleştirmiş olduğunuzdan emin olun. Bunu yapmak i&ccedil;in, <strong>Denetim Masası</strong> &gt; <strong>Bildirim</strong> &gt; <strong>Genel</strong> &ouml;ğesine gidin. Bildirimler etkinleştirilmezse, sistem şifrelerini sıfırlamak isteyen kullanıcılara mesajlar g&ouml;nderemeyecektir.</li>
<li>Sistemden mesajlar almak i&ccedil;in, kullanıcılar hesaplarının kullanıcı bilgileri kısmında bir e-posta adresi belirtmelidirler.</li>
<li><strong>administrators</strong> grubu &uuml;yesi kullanıcılar bu se&ccedil;enekle şifreleri sıfırlayamazlar.</li>
<li>Etki alanı kullanıcıları bu se&ccedil;enekle şifreleri sıfırlayamazlar.</li>
<li>LDAP kullanıcıları, DiskStation LDAP dizin sunucusu olarak işlev g&ouml;rd&uuml;ğ&uuml; s&uuml;rece bu se&ccedil;enekle şifreleri sıfırlayabilirler.</li>

</ul>
</div>


<h3>Şifre G&uuml;c&uuml;</h3>
<p>DiskStation sunucunuz &uuml;zerindeki kullanıcılar i&ccedil;in şifre g&uuml;c&uuml; kurallarını belirleyebilirsiniz.</p>

<div class="section">
<h4>Not:</h4>
<p>Şifre g&uuml;c&uuml; kuralları sadece yeni şifreler i&ccedil;in ge&ccedil;erlidir. &Ouml;rneğin, yeni şifre g&uuml;c&uuml; kuralları sadece yeni bir kullanıcı hesabı oluşturulurken veya mevcut bir kullanıcı şifresini değiştirdiğinde uygulanır. Mevcut şifreler ve i&ccedil;eri alınan kullanıcı hesaplarına ait olanlar yeni şifre kurallarından hari&ccedil; tutulurlar.</p>
</div>
<h4>Şifre g&uuml;c&uuml; kurallarını etkinleştirmek i&ccedil;in:</h4>
<ol>
<li><b>Parola g&uuml;c&uuml; kurallarını uygulayın</b> kutusunu işaretleyerek parola kısıtlamalarını etkinleştirin.</li>
<li>Aşağıdaki kurallardan birden fazla parola kısıtlaması se&ccedil;in:</li>
<ul>
<li><b>Kullanıcının adını ve a&ccedil;ıklamasını parolaya dahil etmeyin</b>: Parola kullanıcı adını veya kullanıcı a&ccedil;ıklamasını i&ccedil;ermelidir. Ancak UTF-8 kodlu karakterler hari&ccedil;tir.</li>
<li><b>B&uuml;y&uuml;k/k&uuml;&ccedil;&uuml;k karma harflere izin ver</b>: B&uuml;y&uuml;k k&uuml;&ccedil;&uuml;k harflerin parolada karışık kullanılmasına izin verilir.</li>
<li><b>Sayısal karakter dahil et</b>: Parolada en az bir sayı (0~9) bulunmalıdır.</li>
<li><b>&Ouml;zel karakter dahil et</b>: Parolada en az bir ASCII &ouml;zel karakteri bulunmalıdır (&ouml;rn., ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Minimum şifre uzunluğu</b>: Şifre en az metin alanında belirtilen değerde olmalıdır. Uzunluk 6 ile 127 arasında olmalıdır.</li>
</ul>
<li>Ayarları kaydetmek i&ccedil;in <b>Uygula</b>'ya tıklayın.</li>
</ol>
 
</body>
</html>

