<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Kullanıcı</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Kullanıcı Ana Sayfa</h2>
<p>Her kullanıcıya kişisel bir <b>ana sayfa</b> klas&ouml;r&uuml; oluşturmak i&ccedil;in kullanıcı ana sayfa etkinleştirilmelidir, <b>guest</b> bunun dışındadır. T&uuml;m kullanıcılar kendi ana sayfa klas&ouml;rlerine CIFS, AFP, FTP veya File Station yoluyla erişebilirler.</p>
<p>Admin <b>homes</b> varsayılan paylaşımlı klas&ouml;r&uuml;ndeki t&uuml;m kişisel klas&ouml;rlere erişebilir. Home klas&ouml;r&uuml;n&uuml;n adı kullanıcı hesabı ile aynıdır.</p>
<h4>Kullanıcı ana sayfa hizmetini etkinleştirmek i&ccedil;in:</h4>
<ol>
<li><b>Kullanıcı Ana Sayfa</b> &uuml;zerine tıklayın.</li>
<li><b>Kullanıcı ana sayfa hizmetini etkinleştir</b> kutusunu işaretleyin.</li>
<li>Synology DiskStation &uuml;zerinde birden fazla birim varsa, <b>homes</b> klas&ouml;r&uuml;n&uuml;n depolanacağı konumu se&ccedil;in.</li>
<li><b>TAMAM</b> &uuml;zerine tıklayın.</li>
</ol>
<p><span class="note_head">Not:</span> Yerel kullanıcı ana sayfa hizmeti devre dışı bırakıldığında, aynı zamanda etki alanı kullanıcı ana sayfa hizmeti de devre dışı bırakılacaktır.</p>
<h4>Kullanıcı ana sayfa hizmetini devre dışı bırakmak i&ccedil;in:</h4>
<ol>
<li><b>Kullanıcı Ana Sayfa</b> &uuml;zerine tıklayın.</li>
<li><b>Kullanıcı ana sayfa hizmetini etkinleştir</b>'in işaretini kaldırın.</li>
</ol>
<p>Kullanıcı ana sayfa servisi engellendikten sonra, <b>homes</b> paylaşımlı klas&ouml;r&uuml; admin erişimi i&ccedil;in ayrılacaktır.  Kullanıcı ana sayfa servisi yeniden etkinleştirildiğinde kullanıcılar home klas&ouml;rlerine tekrar erişebileceklerdir.</p>
<ol>
<span class="note_head">Not:</span>
<li><b>homes</b> paylaşımlı klas&ouml;r&uuml;n&uuml; silmek i&ccedil;in, &ouml;nce kullanıcı ana sayfa servisi devre dışı bırakılmalıdır.</li>
<li>Yerel kullanıcı ana sayfa hizmeti devre dışı bırakılırsa etki alanı kullanıcı ana sayfa hizmeti devre dışı olacaktır.</li> 
</ol> 
</body>	
</html> 
