<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Paylaşımlı Klas&ouml;r</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Gelişmiş Paylaşımlı Klas&ouml;r İzinlerini Y&ouml;net</h2>

<p><strong>Denetim Masası</strong> &gt; <strong>Paylaşımlı Klas&ouml;r</strong> &gt; <strong>D&uuml;zenle</strong> &gt; <strong>Gelişmiş</strong> sayfası paylaşımlı bir klas&ouml;r&uuml;n erişim izinlerini daha da ince ayarlamak i&ccedil;in aşağıdaki se&ccedil;enekleri i&ccedil;erir.</p>

<h3>Gelişmiş Paylaşım İzinleri</h3>
<p>Gelişmiş paylaşım izinleri, paylaşımlı klas&ouml;rlerin erişim izinlerini ayarlamak i&ccedil;in ekstra bir kontrol d&uuml;zeyi sunar. Etkinleştirildiğinde, kullanıcılar ve gruplar paylaşımlı bir klas&ouml;r&uuml;n i&ccedil;eriklerini ancak gelişmiş paylaşım izinleri <em>ve</em> Windows ACL izinleri (<strong>Paylaşımlı Klas&ouml;r</strong> &gt; <strong>D&uuml;zenle</strong> &gt; <strong>İzinler</strong> b&ouml;l&uuml;m&uuml;nde bulunur) verilmişse g&ouml;r&uuml;nt&uuml;leyebilir veya değiştirebilirler.</p>

<h4>Gelişmiş paylaşım izinlerini etkinleştirmek i&ccedil;in:</h4>

<ol>
<li><strong>Gelişmiş paylaşım izinlerini etkinleştir</strong> onay kutusunu işaretleyin.</li>
<li>Paylaşımlı klas&ouml;r&uuml;n gelişmiş paylaşım izinlerini değiştirmek i&ccedil;in <strong>Gelişmiş Paylaşım İzinleri</strong> &ouml;ğesine tıklayın. </li>
</ol>

<div class="section">
  <h4>Not:</h4>
<ul>
<li>Gelişmiş paylaşım izinleri, bir kullanıcı aşağıdaki dosya hizmetleri aracılığıyla paylaşımlı bir klas&ouml;re eriştiğinde uygulanır: Windows Dosya Paylaşımı, Apple Dosya Paylaşımı, File Station, FTP ve WebDAV.</li>
</ul>
</div>

<h3>Gelişmiş Ayarlar</h3>

<p>Gerekirse, File Station, FTP veya WebDAV yoluyla paylaşımlı klas&ouml;re eriştiklerinde kullanıcılara daha fazla kısıtlama getirebilirsiniz.</p>
	<ul>
    <li><strong>Dizin taramayı ge&ccedil;ersiz kıl:</strong> Bu se&ccedil;eneğin devre dışı bırakılması kullanıcıların paylaşımlı bir klas&ouml;r&uuml; g&ouml;r&uuml;nt&uuml;lemesini engeller.</li>
    <li><strong>Varolan dosyaların değiştirilmesini ge&ccedil;ersiz kıl:</strong> Bu se&ccedil;eneğin etkinleştirilmesi kullanıcıların paylaşımlı klas&ouml;rde bulunan dosyaları taşımasını, silmesini veya modifiye etmesini kısıtlar. Kullanıcıların halen paylaşımlı klas&ouml;r&uuml;n i&ccedil;eriğini g&ouml;r&uuml;nt&uuml;leyebileceğini, indirebileceğini/karşıya y&uuml;kleyebileceğini, kopyalayabileceğini veya a&ccedil;abileceğini unutmayın.</li>
    <li><strong>Dosya indirmeyi ge&ccedil;ersiz kıl:</strong> Bu se&ccedil;eneğin devre dışı bırakılması kullanıcıların paylaşımlı bir klas&ouml;r&uuml; indirmesini engeller.</li>
    </ul>

<div class="section">
<h4>Not:</h4>
<p><strong>administrators</strong> grubuna ait olan kullanıcılar i&ccedil;in yukarıdaki kısıtlamaların ge&ccedil;erli olmayacağına dikkat edin.</p>
</div>
</body>
</html>
