<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>G&ouml;rev Programlayıcı</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>G&ouml;rev Programlayıcı</h1>
<p>G&ouml;rev Programlayıcı, hizmetleri ya da komut dizilerini zamanlamanıza ve &ouml;nceden tanımlı zamanlarda &ccedil;alıştırmanıza olanak tanır.</p>
<h2>Desteklenen g&ouml;revler</h2>
<p>G&ouml;revler, aşağıdakileri yapmak i&ccedil;in oluşturulabilir:</p>
<ul class="disable-eds14">
<li><strong>Kullanıcı tanımlı komut dizisi:</strong> Kullanıcı tanımlı komut dizilerini ya da komutları &ccedil;alıştırın.</li>
<li><strong>Geri d&ouml;n&uuml;ş&uuml;m kutusu:</strong> Belirli paylaşımlı klas&ouml;rlerin Geri D&ouml;n&uuml;ş&uuml;m Kutusunu boşalt. Ayrıca, <strong>Tutma İlkesi</strong> ayarları Geri D&ouml;n&uuml;ş&uuml;m Kutusu boşaltılırken hangi dosyaların kalıcı olarak silineceğini kontrol etmenizi sağlar. &Ouml;rneğin, boyuta, silme zamanına veya dosya bi&ccedil;imine g&ouml;re dosyalar silinebilir veya korunabilir.</li>
<li><strong>Bip Denetimi:</strong> DiskStation &uuml;r&uuml;n&uuml;n&uuml;n bip sesi &ccedil;ıkarmasını sağlayın.</li> 
<li><strong>Hizmet:</strong> Windows Dosya Hizmeti, FTP, Otomatik Engelleme vb. ağ hizmetlerini başlatın ya da durdurun.</li>
</ul>


<ul class="enable-eds14">
<li><strong>Kullanıcı tanımlı komut dizisi:</strong> Kullanıcı tanımlı komut dizilerini ya da komutları &ccedil;alıştırın.</li>
<li><strong>Geri d&ouml;n&uuml;ş&uuml;m kutusu:</strong> Belirli paylaşımlı klas&ouml;rlerin Geri D&ouml;n&uuml;ş&uuml;m Kutusunu boşalt. Ayrıca, <strong>Tutma İlkesi</strong> ayarları Geri D&ouml;n&uuml;ş&uuml;m Kutusu boşaltılırken hangi dosyaların kalıcı olarak silineceğini kontrol etmenizi sağlar. &Ouml;rneğin, boyuta, silme zamanına veya dosya bi&ccedil;imine g&ouml;re dosyalar silinebilir veya korunabilir.</li>
<li><strong>Hizmet:</strong> Windows Dosya Hizmeti, FTP, Otomatik Engelleme vb. ağ hizmetlerini başlatın ya da durdurun.</li>
</ul>


<h2>G&ouml;revleri Y&ouml;netme</h2>
<p>G&ouml;rev Programlayıcının ana sayfası, var olan t&uuml;m g&ouml;revleri g&ouml;r&uuml;nt&uuml;ler ve g&ouml;revleri oluşturma, d&uuml;zenleme ya da &ccedil;alıştırmaya y&ouml;nelik se&ccedil;enekler sağlar.</p>

<h4>Programlanmış bir g&ouml;rev oluşturmak i&ccedil;in:</h4>
<p>Programlanmış g&ouml;revler belirlenen bir tarih, zaman veya aralıkta yapılan g&ouml;revlerdir.</p>

<ol>
<li><strong>Denetim Masası</strong> &gt; <strong>G&ouml;rev Programlayıcı</strong>'ya gidin ve <strong>Oluştur</strong>'a tıklayın ve <strong>Zamanlanmış Görev</strong>'ı se&ccedil;in.</li>
<li>Programlanacak istenilen t&uuml;rde g&ouml;revleri se&ccedil;in. <strong>Kullanıcı tanımlı komut dizisi</strong>, <strong>Geri D&ouml;n&uuml;ş&uuml;m Kutusu</strong>, <strong>Bip Denetimi</strong> veya <strong>Hizmet</strong>.</li>
<li><strong>G&ouml;rev oluştur</strong> penceresi a&ccedil;ıldığında, <strong>Genel</strong> sekmesine tıklayın ve aşağıdaki ayarları değiştirin:
<ul>
<li><strong>Genel Ayarlar:</strong> Bir g&ouml;rev adı girin, g&ouml;revin &ccedil;alışacağı bir kulalnıcı se&ccedil;in ve g&ouml;revi etkinleştirin veya devre dışı bırakın. </li>
</ul>
</li>
<li><strong>Program</strong>'a tıklayın ve aşağıdaki ayarları modifiye edin:
<ul>
<li><strong>Tarih:</strong> G&ouml;revin &ccedil;alışma zamanını belirleyin. G&ouml;revler, haftanın belirli g&uuml;nlerinde (&ouml;rn. her g&uuml;n, hafta sonları ya da her Pazar gibi) veya belirli tarihlerde (&ouml;rn. 21/10/2015) &ccedil;alışmak &uuml;zere zamanlanabilir.</li>
<li><strong>Saat:</strong> G&ouml;revin, ilk ve son &ccedil;alışma zamanının yanı sıra her g&uuml;n ka&ccedil; kez &ccedil;alışacağını da belirleyin.</li>
</ul>
</li>
<li>G&ouml;reve &ouml;zel ayarları yapmak i&ccedil;in <strong>G&ouml;rev Ayarları</strong>'na tıklayın (sadece belirli g&ouml;revler i&ccedil;in).
<ul>
<li>G&ouml;revin &ccedil;alıştırma ayrıntılarını almak i&ccedil;in, <strong>&Ccedil;alıştırma ayrıntılarını e-posta ile g&ouml;nder</strong>'i se&ccedil;in.</li>
<li>Anormallikler ger&ccedil;ekleştiğinde bildirim almak i&ccedil;in, <strong>	&Ccedil;alıştırma ayrıntılarını sadece komut dizesi anormal şekilde sonlandığında g&ouml;nder</strong> &ouml;ğesini se&ccedil;in.</li>
<li>G&ouml;rev i&ccedil;eriğini &ouml;zelleştirmek i&ccedil;in, <strong>Kullanıcı tanımlı komut dizisi</strong> altında komut dizisini girin.</li>
<li>Adım 2'de <strong>Geri D&ouml;n&uuml;ş&uuml;m Kutusu</strong> veya <strong>Hizmet</strong> se&ccedil;imi yaptıysanız, Geri D&ouml;n&uuml;ş&uuml;m Kutularının nasıl ve ne zaman temizleneceğini veya hangi hizmetin nasıl ve ne zaman başlayıp/duracağını belirleyebilirsiniz.</li>
</ul>
</li>
<li><strong>Tamam</strong> &uuml;zerine tıklayarak ayarları kaydedin.</li>
</ol>



<h4>Tetiklenmiş bir g&ouml;rev oluşturmak i&ccedil;in:</h4>
<p>Tetiklenen g&ouml;revler belirli olayların tamamlanması &ouml;ncesinde/sonrasında &ccedil;alışan g&ouml;revlerdir.</p>

<ol>
<li><strong>Denetim Masası</strong> &gt; <strong>G&ouml;rev Programlayıcı</strong>'ya gidin, <strong>Oluştur</strong>'a tıklayın ve <strong>Tetiklenen Görev</strong>'i se&ccedil;in.</li>
<li><strong>Kullanıcı tanımlı komut dizisi</strong> &ouml;ğesini se&ccedil;in.</li>
<li><strong>G&ouml;rev oluştur</strong> penceresi a&ccedil;ıldığında, <strong>Genel</strong> sekmesine tıklayın ve aşağıdaki ayarları değiştirin:
<ul>
<li><strong>Genel Ayarlar:</strong> Bir g&ouml;rev adı girin, g&ouml;revin &ccedil;alışacağı bir kullanıcı se&ccedil;in, g&ouml;revi tetikleyen bir olay/&ouml;n g&ouml;rev se&ccedil;in ve g&ouml;revi etkinleştirin veya devre dışı bırakın. </li>
</ul>
</li>
<li>G&ouml;reve &ouml;zel ayarları yapmak i&ccedil;in <strong>G&ouml;rev Ayarları</strong>'na tıklayın (sadece belirli g&ouml;revler i&ccedil;in).
<ul>
<li>G&ouml;revin &ccedil;alıştırma ayrıntılarını almak i&ccedil;in, <strong>&Ccedil;alıştırma ayrıntılarını e-posta ile g&ouml;nder</strong>'i se&ccedil;in.</li>
<li>Anormallikler ger&ccedil;ekleştiğinde bildirim almak i&ccedil;in, <strong>&Ccedil;alıştırma ayrıntılarını sadece komut dizesi anormal şekilde sonlandığında g&ouml;nder</strong> &ouml;ğesini se&ccedil;in.</li>
<li>G&ouml;rev i&ccedil;eriğini &ouml;zelleştirmek i&ccedil;in, <strong>Kullanıcı tanımlı komut dizisi</strong> altında komut dizisini girin.</li>
</ul>
</li>
<li><strong>Tamam</strong> &uuml;zerine tıklayarak ayarları kaydedin.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Tetiklenmiş bir g&ouml;rev oluştururken, &ouml;n g&ouml;rev(ler)i belirlemeniz gerekebilir. Oluşturulan g&ouml;rev sadece &ouml;n g&ouml;rev yapıldıktan sonra &ccedil;alışacaktır.</li>
<li><strong>&Ccedil;alıştırma ayrıntılarını sadece komut dizesi anormal şekilde sonlandığında g&ouml;nder</strong> &ouml;ğesini etkinleştirdikten sonra, sistem komut dizesi 0 ile biterse ayrıntıları vermez.</li>
</ul>
</div>

<h4>G&ouml;rev ayarlarını d&uuml;zenlemek i&ccedil;in:</h4>
<ol>
<li>Var olan bir g&ouml;revi se&ccedil;in.</li>
<li><strong>D&uuml;zenle</strong>'ye tıklayın.</li>
<li>G&ouml;rev ayarlarını değiştirebileceğiniz bir pencere a&ccedil;ılır.</li>
</ol>
<h4>Bir g&ouml;revi silmek i&ccedil;in:</h4>
<ol>
<li>Var olan bir g&ouml;revi se&ccedil;in.</li>
<li><strong>Eylem</strong> &gt; <strong>Sil</strong>'e tıklayın.</li>
</ol>

<h4>Bir g&ouml;revi etkinleştirmek veya devre dışı bırakmak i&ccedil;in:</h4>
<ol>
<li><strong>G&ouml;rev Programlayıcı</strong> ana sayfasında, bir g&ouml;revi etkinleştirmek ya da devre dışı bırakmak i&ccedil;in <strong>Etkin</strong> altındaki uygun onay kutusunu işaretleyin veya işaretini kaldırın.</li>
<li><strong>Kaydet</strong>'e tıklayın.</li>
</ol>


<h4>Bir g&ouml;revi elle &ccedil;alıştırmak i&ccedil;in:</h4>
<ol>
<li>Var olan g&ouml;revlerden birini ya da daha fazlasını se&ccedil;in.</li>
<li><strong>&Ccedil;alıştır</strong>'a tıklayın.</li>
</ol>

<div class="section">
<h4>G&ouml;rev Programlayıcı Sınırlamaları:</h4>
<ul class="disable-eds14">
<li>G&ouml;rev adları 512 g&ouml;r&uuml;nt&uuml;lenebilir karakter i&ccedil;erebilir.</li>
<li>En fazla g&ouml;rev sayısı: 1024.</li>
<li>En fazla komut dizisi yolu ya da komut satırı uzunluğu: 4095.</li>
<li>Bip s&uuml;resi 1 ila 600 saniye arasında ayarlanabilir.</li>
</ul>


<ul class="enable-eds14">
<li>G&ouml;rev adları 512 g&ouml;r&uuml;nt&uuml;lenebilir karakter i&ccedil;erebilir.</li>
<li>En fazla g&ouml;rev sayısı: 1024.</li>
<li>En fazla komut dizisi yolu ya da komut satırı uzunluğu: 4095.</li>
</ul>

</div>

</body> </html>
