<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servicios web</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Aplicaciones web</h2>

<p>Con la caracter&iacute;stica incorporada de Web Station y la compatibilidad PHP, podr&aacute; alojar f&aacute;cilmente un sitio web en su DiskStation y crear sitios web din&aacute;micos para su empresa o afici&oacute;n. Adem&aacute;s, el Centro de paquetes ofrece una gran variedad de paquetes de terceros, como Administraci&oacute;n de contenido, Administraci&oacute;n de relaciones con clientes y Sistema de comercio electr&oacute;nico. Una carpeta compartida predeterminada llamada <b>web</b> se crear&aacute; para almacenar archivos para su sitio web.</p>
<h4>Para habilitar Web Station:</h4>
<ol>
<li>Vaya al <strong>Panel de control</strong> &gt; <strong>Servicios web</strong>.</li>
<li>Marque <b>Habilitar Web Station</b>.</li>
<li>Haga clic en <b>Aplicar</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para una mayor flexibilidad y seguridad, Web Station utiliza el grupo de usuarios <strong>http</strong> para realizar las tareas. Por lo tanto, para controlar los permisos de acceso de sus p&aacute;ginas web, cambie los permisos de acceso del grupo <strong>http</strong> para cada carpeta y fichero correspondiente. Por ejemplo, si desea que el fichero <strong>sample.htm</strong> en la carpeta compartida <strong>web</strong> sea accesible con Web Station, necesitar&aacute; asegurarse de que el grupo <strong>http</strong> tiene los permisos de lectura/escritura para la carpeta compartida <strong>web</strong> adem&aacute;s del archivo <strong>sample.htm</strong>.</li>

<li>El archivo de la p&aacute;gina principal debe denominarse <strong>index.htm</strong>, <strong>index.html</strong> o <strong>index.php</strong>.</li>

<li>Cuando utilice la funci&oacute;n PHP mail(), el sistema recuperar&aacute; autom&aacute;ticamente y utilizar&aacute; la informaci&oacute;n de servidor SMTP en la p&aacute;gina <strong>Notificaci&oacute;n</strong>. Aseg&uacute;rese de que ha habilitado las notificaciones por correo electr&oacute;nico y ha introducido la informaci&oacute;n correcta del servidor SMTP.</li>

<li>La ruta real de la carpeta compartida <b>web</b> es <b>/volume1/web</b>. Algunas aplicaciones requieren que el usuario defina la ruta en el archivo de configuraci&oacute;n.</li>


<li>Los nombre <strong>blog</strong>, <strong>photo</strong>, <strong>photosrc</strong>, y <strong>webdefault</strong> son nombres de carpeta reservados. Estos nombres no se pueden usar en Web Station, por lo que no debe crear carpetas con estos nombres en la carpeta compartida <b>web</b>.</li>

<li>Puede personalizar la p&aacute;gina de error creando un archivo <b>missing.html</b>, <b>missing.htm</b> o <b>missing.php</b>. Primero habilite Web Station. A continuaci&oacute;n, coloque el archivo <b>missing.html</b>, <b>missing.htm</b> o <b>missing.php</b> en la carpeta compartida <b>web</b> del servidor. Cuando los usuarios se enlacen a una p&aacute;gina que no existe, ver&aacute;n esta p&aacute;gina de error personalizada.</li>

<li>N&uacute;mero m&aacute;ximo de conexiones HTTP activas: 256</li>

<li>N&uacute;mero m&aacute;ximo de hosts virtuales: 30</li>
</ul>
</div>

<h3>Habilitar host virtual para alojar sitios web</h3>
<p>Puede alojar varios sitios web en un &uacute;nico servidor con la funci&oacute;n del host virtual. Para comenzar, deber&aacute; registrar un par de nombres de dominio y configurar el alojamiento virtual siguiendo los pasos que se indican a continuaci&oacute;n.</p>
<h4>Para habilitar el host virtual:</h4>
<ol>
<li>Haga clic en <b>Host virtual</b>.</li>
<li>Haga clic en <b>Crear</b>.</li>
<li>Escriba un nombre para la subcarpeta o carpeta compartida <b>web</b>, que almacenar&aacute; los archivos del sitio web.</li>
<li>Especifique un nombre de host para el sitio web.</li>
<li>Especifique un puerto para el sitio web.</li>
<li>Haga clic en <b>OK</b>.</li>
</ol>
<h3>Habilitar sitio web personal</h3>
<P>La funci&oacute;n sitio web personal es una forma pr&aacute;ctica de permitir que los usuarios locales, los usuarios de dominio y los usuarios de LDAP puedan crear su propio sitio web personal.</p>
<h4>Para usuarios locales</h4><p>Cada usuario local tendr&aacute; una direcci&oacute;n exclusiva para su sitio web, como <strong>server-IP/~username</strong> o <strong>server-name/~username</strong>. Por ejemplo:</p>
<ol>
<li>192.168.1.1/~ken</li>
<li>SynologyNAS/~ken</li>
</ol>
<h4 class="disable-eds14">Para usuarios de dominio:</h4>
<p class="disable-eds14">Cada usuario de dominio tendr&aacute; una direcci&oacute;n exclusiva para su sitio web, como <strong>server-IP/~domainname%5cusername</strong> o <strong>server-name/~domainname%5cusername</strong>. Por ejemplo:</p>
<ol class="disable-eds14">
<li>192.168.1.1/~testdomain<b>%5c</b>ken</li>
<li>SynologyNAS/~testdomain<b>%5c</b>ken</li>
</ol>

<h4 class="disable-eds14">Para usuarios de LDAP</h4>
<p class="disable-eds14">Cada usuario de LDAP tendr&aacute; una direcci&oacute;n exclusiva para su sitio web, como <strong>server-IP/~username@domainname</strong> o <strong>server-name/~username@domainname</strong>. Por ejemplo:</P>
<ol class="disable-eds14">
<li>192.168.1.1/~ken<b>@</b>testdomain</li>
<li>SynologyNAS/~ken<b>@</b>testdomain</li>
</ol>

<div class="section disable-eds14">
<h4>Nota:</h4>
<p>Antes de habilitar esta caracter&iacute;stica, aseg&uacute;rese de que <strong>homes de usuarios</strong> se han habilitado. Para usuarios locales, vaya a <b>Panel de control</b> &gt; <b>Usuario</b> &gt; <b>Avanzado</b>; para usuarios de dominio, vaya a <b>Panel de control</b> &gt; <b>Servicio de directorio</b> &gt; <b>Usuarios de dominio</b> &gt; <b>Inicio de usuario</b>; para usuarios de LDAP, vaya a <b>Panel de control</b> &gt; <b>Servicio de directorio</b> &gt; <b>Usuarios de LDAP</b> &gt; <b>Inicio de usuario</b>.</p>
</div>

<div class="section enable-eds14">
<h4>Nota:</h4>
<p>Antes de habilitar esta caracter&iacute;stica, aseg&uacute;rese de que <strong>homes de usuarios</strong> se han habilitado. Para locales, vaya a <b>Panel de control</b> &gt; <b>Usuario</b> &gt; <b>Avanzado</b>.</p>
</div>

<h4>Para crear un sitio web personal:</h4>
<ol>
<li>Si ha marcado <strong>Habilitar sitio web personal</strong>, se crear&aacute; una carpeta <strong>www</strong> autom&aacute;ticamente en el directorio inicial del usuario.</li>
<li>Ahora el usuario podr&aacute; cargar archivos relacionados con el sitio web (por ejemplo, p&aacute;ginas web y archivos de sonido) en la carpeta <strong>www</strong>.</li>
<li>Aseg&uacute;rese de que el usuario tiene permisos de acceso adecuados en los archivos cargados.</li>
</ol>


<h4>Para personalizar la p&aacute;gina de error:</h4>
<ol>
<li>Guarde la p&aacute;gina de error como <b>missing.html</b>, <b>missing.htm</b> o <b>missing.php</b>.</li>
<li>Cargue el archivo a la carpeta <strong>www</strong>.</li>
</ol>
<p>Si los usuarios se enlazan a una p&aacute;gina que no existe en el sitio web del usuario local, se mostrar&aacute; la p&aacute;gina de error personalizada.<strong></strong></p>
<h4>Compatibilidad y limitaciones:</h4>
<p>Los usuarios locales solo pueden acceder a datos debajo de lo siguiente:</p>
<ul>
<li>Su propio sitio de inicio</li>
<li>/var/tmp</li>
<li>/tmp</li>
<li>/volumeX/@tmp</li>
</ul>

<h2>Servicio HTTP</h2>

<p>Aparte de los n&uacute;meros de puertos predeterminados 80 (para HTTP) o 443 (para HTTPS), se pueden agregar n&uacute;meros de puertos adicionales para acceder a Photo Station y Web Station. Puede agregar un n&uacute;mero de puerto adicional de 1 a 65535 para HTTP o HTTPS.</p>
<h4>Para agregar un n&uacute;mero de puerto adicional para acceso HTTP o HTTPS:</h4>
<ol>
<li>Marque <b>Agregar puerto HTTP adicional</b> o <b>Agregar puerto HTTPS adicional</b> (la opci&oacute;n <strong>Habilitar conexi&oacute;n HTTPS para servicios web</strong> debe estar habilitada antes de agregar un puerto para HTTPS).</li>
<li>Escriba el n&uacute;mero de puerto deseado en el campo. </li>
</ol>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Deben excluirse los siguientes puertos: 20, 21, 22, 23, 25, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002, puertos predeterminados de eMule: 4662 (TCP), 4672 (UDP), e intervalo de puertos por defecto para FTP:&nbsp;el intervalo concreto puede variar dependiendo de los distintos modelos.</li>
</ul>
</div>
</body>
</html>
