<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servicio de indexaci&oacute;n de medios</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Carpeta indexada</h2>

<p>
De forma predeterminada, los archivos multimedia de las carpetas compartidas <b>photo</b>, <b>video</b> y <b>music</b> est&aacute;n indexados por el Servicio de indexaci&oacute;n de medios. Si desea que los dispositivos y las aplicaciones de fotos, v&iacute;deo o m&uacute;sica de DMA accedan a m&aacute;s archivos en su DiskStation, puede a&ntilde;adir aqu&iacute; m&aacute;s carpetas indexadas.
</p>

<h4><a name="add"></a>Para a&ntilde;adir una carpeta indexada:</h4>
<ol>
<li>
Haga clic en <b>Crear</b>.
</li>
<li>
En la ventana que aparecer&aacute;, asigne a la carpeta un nombre que ver&aacute; los dispositivos de DMA y las aplicaciones de DSM en el campo <b>Nombre</b>.
</li>
<li>
Haga clic en <b>Seleccionar</b>, vaya a la carpeta que desee indexar y haga clic en <b>OK</b>.
</li>
<li>
En la secci&oacute;n <b>Tipo de archivo</b>, marque las casillas de verificaci&oacute;n para especificar los tipos de archivos multimedia que se van a indexar. Los dispositivos DMA y las aplicaciones de DSM solo pueden examinar y reproducir archivos multimedia que coincidan con los tipos de archivos especificados.
</li>
<li>
Haga clic en <b>OK</b> y, a continuaci&oacute;n, en <b>Guardar</b>.
</li>
</ol>
<div class="section">
<ul>
<span class="note_head">Nota: </span> 
<li>
Las carpetas remotas instaladas con ayuda de File Station no pueden a&ntilde;adirse como carpetas indexadas.
</li>

<li>
Puede a&ntilde;adir hasta 100 carpetas indexadas en su DiskStation.
</li>
</ul>
</div>
<h4>Para editar una carpeta indexada:</h4>
<ol>
<li>
Seleccione la carpeta en la lista de carpetas y haga clic en <b>Editar</b>.
</li>
<li>
Realice cambios en la configuraci&oacute;n. (Consulte <a href="#add">Para a&ntilde;adir una carpeta indexada</a> para obtener informaci&oacute;n detallada.)
</li>
<li>
Haga clic en <b>OK</b> y, a continuaci&oacute;n, en <b>Guardar</b>.
</li>
</ol>
<h4>Para quitar carpetas de la lista de carpetas indexadas:</h4>
<ol>
<li>
Seleccione la(s) carpeta(s) de la lista de carpetas y haga clic en <b>Eliminar</b>. (Pulse y mantenga pulsada la tecla May&uacute;s o Ctrl para la selecci&oacute;n de varios elementos.)
</li>
<li>
Haga clic en <b>S&iacute;</b> y, a continuaci&oacute;n, en <b>Guardar</b>.
</li>
</ol>
<div class="section">
<ul>
<span class="note_head">Nota: </span>
<li>
Al eliminar carpetas no se quitan realmente de su DiskStation. Solo se impide que los dispositivos DMA y las aplicaciones de DSM las exploren y reproduzcan su contenido.
</li>
</ul>
</div>
</body>
</html>
