<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servicio de indexaci&oacute;n de medios</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Configuraci&oacute;n de conversi&oacute;n</h2>
<p>Cuando cargue fotos o v&iacute;deos para su uso con el Servidor multimedia y Photo Station, se crear&aacute;n miniaturas para mejorar la experiencia de exploraci&oacute;n. Aqu&iacute; puede configurar la calidad de las miniaturas y supervisar el progreso de la conversi&oacute;n.</p>
<p>Mientras tanto, si desea ver v&iacute;deos en la carpeta compartida <strong>photo</strong> de Photo Station en sus dispositivos m&oacute;viles, podr&aacute; habilitar la conversi&oacute;n de v&iacute;deos y ver tambi&eacute;n el progreso de la conversi&oacute;n.</p>
<h4>Para definir la calidad de las miniaturas:</h4>
<ol>
<li>
Elija una calidad en el men&uacute; desplegable.
</li>
<li>
Haga clic en <b>Aplicar</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>Crear miniaturas de alta calidad llevar&aacute; m&aacute;s tiempo.</li>
</ul>
</div>
<h4>Para habilitar la conversi&oacute;n de v&iacute;deo para dispositivos m&oacute;viles:</h4>
<ol>
<li>Marque <strong>Habilitar la conversi&oacute;n de v&iacute;deo para dispositivos m&oacute;viles</strong>.</li>
<li>Haga clic en <strong>Aplicar</strong>, y podr&aacute; ver los v&iacute;deos en sus dispositivos m&oacute;viles sobre la marcha.
</li>
</ol>

<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>Solo los v&iacute;deos cargados en la carpeta compartida <strong>photo</strong> de Photo Station podr&aacute;n convertirse al formato compatible con los dispositivos m&oacute;viles.</li>
<li>Los archivos MP4 no se convertir&aacute;n.</li>
</ul>
</div>
<h4>Para ver el progreso de conversi&oacute;n de las fotos/v&iacute;deos:</h4>
<ol>
<li>Cuando se cargan fotos o v&iacute;deos en DiskStation, haga clic en el icono de <strong>Progreso de la conversi&oacute;n</strong> que aparecer&aacute; en la esquina superior derecha de la barra de tareas. </li>
<li>
En la ventana que aparezca, realice una de las siguientes acciones:
</li>
<ul>
<li>
En la secci&oacute;n <b>Progreso de la conversi&oacute;n</b>, supervise el progreso y el estado de la creaci&oacute;n de miniaturas realizado en segundo plano.
</li>
<li>
Realice lo siguiente para pausar el progreso de conversi&oacute;n:
</li>
<ol>
<li>
Elija <b>Retraso durante [n&uacute;mero] hora(s)</b> en el men&uacute; desplegable y haga clic en <b>Pausar</b> para pausar el progreso. (De manera predeterminada, se elige <b>Retraso durante 1 hora(s)</b>.)
</li>
<li>El progreso de conversi&oacute;n se reanudar&aacute; despu&eacute;s del tiempo de retraso especificado; tambi&eacute;n puede hacer clic en <b>Continuar</b> para reanudar el proceso inmediatamente.
</li>
</ol>
<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>Dado que la progresi&oacute;n de conversi&oacute;n demanda m&aacute;s recursos de la CPU, hacer una pausa en el proceso puede ahorrar recursos del sistema para cualquier otra tarea en curso.</li>
</ul>
</div>
</ul>
<li>
Cuando el proceso de conversi&oacute;n se complete, el icono de la barra de herramientas desaparecer&aacute;.
</li>
</ol>

<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>Dado que Photo Station Uploader ofrece un mejor rendimiento para la creaci&oacute;n de miniaturas, le recomendamos que use Photo Station Uploader si desea cargar un gran n&uacute;mero de fotos/v&iacute;deos en su biblioteca de Photo Station.</li>
</ul>
</div>

</body>
</html>