<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Configuraci&oacute;n de DSM</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="https"></a>Enrutamiento de red</h2>
<p>DSM proporciona numerosas opciones de ruta de red para diferentes requisitos de configuraci&oacute;n de red.</p>
<h4>Para separar el flujo de red de las interfaces de red en la misma LAN:</h4>
<ol>
<li>Vaya al <strong>Panel de control</strong> &gt; <strong>Red</strong> &gt; <strong>Avanzada</strong>.</li>
<li>En <strong>General</strong>, marque <strong>Contestar a las peticiones ARP si la direcci&oacute;n IP de destino es una direcci&oacute;n local configurada en la interfaz entrante</strong>.<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</ol><p>Esto establece la regla de ruta predeterminada para cada interfaz de red, lo que sacar&aacute; los paquetes de red de cada interfaz de sus respectivas interfaces de red f&iacute;sicas.</p>
<p>Adem&aacute;s, si tiene m&aacute;s de dos interfaces de red en la misma LAN, al habilitar esta opci&oacute;n el flujo de red en cada interfaz se transportar&aacute; por separado. Entonces podr&aacute; aplicar reglas de cortafuego separadas para cada interfaz.</p>


<h4>Para enrutar cada interfaz de red a trav&eacute;s de sus respectivas pasarelas:</h4>
<ol>
  <li>Vaya al <strong>Panel de control</strong> &gt; <strong>Red</strong>.</li>
  <li>En <strong>General</strong>, compruebe <strong>Habilitar pasarelas m&uacute;ltiples</strong>.<li>Haga clic en <strong>Aplicar</strong> para guardar la configuraci&oacute;n.</ol>
<p>Esto har&aacute; que la ruta de cada interfaz de red en su red pase a trav&eacute;s de su pasarela respectiva. </p>


<h4>Para cambiar la ruta predeterminada:</h4>
<ol>
  <li>Vaya al <strong>Panel de control</strong> &gt; <strong>Red</strong>.</li>
  <li>En <strong>Interfaz de red</strong>, haga clic en <strong>Pedido de servicio</strong>.<li>Redistribuya sus pasarelas seleccion&aacute;ndolas y haciendo clic en <strong>Arriba</strong> o <strong>Abajo</strong>.<li>Haga clic en <strong>OK</strong>.</ol>
<p>La pasarela en la parte superior del pedido se utilizar&aacute; como pasarela predeterminada de su LAN.</p> 


<h4>Para configurar rutas est&aacute;ticas:</h4>
<ol>
  <li>Vaya al <strong>Panel de control</strong> &gt; <strong>Red</strong>.</li>
  <li>En <strong>Ruta est&aacute;tica</strong>, haga clic en <strong>Crear</strong>.<li>En <strong>Red de destino</strong>, introduzca la direcci&oacute;n IP de su destino.<li>En <strong>M&aacute;scara de red</strong>, introduzca la m&aacute;scara de red de su destino.<li>En <strong>Pasarela</strong>, introduzca la direcci&oacute;n de la pasarela de su destino.<li>En <strong>Interfaz</strong>, seleccione la interfaz de su destino.<li>Haga clic en <strong>OK</strong>.</ol>

<h4>Para ver la tabla de rutas IP:</h4>
<ol>
  <li>Vaya al <strong>Panel de control</strong> &gt; <strong>Red</strong>.</li>
  <li>En <strong>Red est&aacute;tica</strong>, haga clic en <strong>Tabla de rutas IP</strong>.<li>Seleccione una interfaz de red para ver su table de rutas IP desde la lista desplegable en la zona superior izquierda.</ol>

</body>
</html>

