
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Red</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>General</h2>

<p>Opciones gen&eacute;ricas de red, como pasarela predeterminada, DNS server, proxy y tunelizaci&oacute;n IPv6 est&aacute;n disponibles en <strong>Panel de control</strong> &gt; <strong>Red</strong> &gt; <strong>General</strong>.</p>


<h3>Cambiar el nombre del dispositivo DiskStation</h3>
<p>Para cambiar el nombre del dispositivo DiskStation, introduzca el nuevo nombre del servidor y haga clic en <b>Aplicar</b>.</p>
<p>El nombre del servidor distingue entre may&uacute;sculas y min&uacute;sculas, y puede tener entre 1 y 15 caracteres, que pueden ser letras, n&uacute;meros, caracteres de subrayado y signos menos. El primer car&aacute;cter del nombre debe ser una letra.</p>


<h3>Especificar la pasarela predeterminada</h3>
<p>Sencillamente introduzca la direcci&oacute;n IP para la pasarela predeterminada y haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</p>


<h3>Especificar la direcci&oacute;n IP del DNS Server</h3>
<p>Puede optar por configurar manualmente la direcci&oacute;n IP de su DNS Server. En ese caso, se debe introducir la direcci&oacute;n IP de su DNS Server preferido. Tambi&eacute;n se puede introducir una direcci&oacute;n IP de DNS Server que servir&aacute; de respaldo si el servidor DNS preferido experimenta problemas. Una vez que haya configurado las direcciones IP del DNS Server como desee, haga clic en <strong>Aplicar</strong> para guardar su configuraci&oacute;n.</p>


<div class="section">
<h4>Nota:</h4>
<p>Los campos DNS Server y Puerta de enlace predeterminada se configurar&aacute;n autom&aacute;ticamente y no podr&aacute;n cambiarse si todas sus interfaces se configuran autom&aacute;ticamente o si est&aacute; utilizando la conexi&oacute;n PPPoE.</p>
</div>



<h3><a name="proxy"></a>Conectar a trav&eacute;s de un servidor proxy</h3>
<p>Para permitir que su dispositivo DiskStation conecte a trav&eacute;s de un servidor proxy, marque <b>Conectar a trav&eacute;s de un servidor proxy</b>, introduzca la <b>Direcci&oacute;n</b> y <b>Puerto</b> y a continuaci&oacute;n haga clic en <b>Aplicar</b>.</p>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Haga clic en <strong>Configuraci&oacute;n avanzada</strong> para configurar el proxy HTTP, el proxy HTTPS y la informaci&oacute;n de autenticaci&oacute;n.<li>De manera predeterminada, la configuraci&oacute;n del proxy HTTPS es la misma que la del proxy HTTP.</li>
<li>Si se marca <b>Conectar a trav&eacute;s de un servidor proxy</b>, Actualizaci&oacute;n de DSM y Centro de paquetes, adem&aacute;s de otros paquetes, se conectar&aacute;n siempre a trav&eacute;s de Internet a trav&eacute;s de un proxy.</li>
<li>Si <b>Omitir servidor proxy para direcciones locales</b> se ha marcado, aseg&uacute;rese de que el DNS server utilizado por el DiskStation puede resolver consultas de dispositivos en la red local.</li>
</ul>
</div>


<h3>Habilitar la tunelizaci&oacute;n IPv6</h3>
<p>Hasta que IPv6 sustituya completamente a IPv4, la tunelizaci&oacute;n IPv6 es necesaria para permitir que hosts con direcciones IPv6 alcancen los servicios IPv4. Esta t&eacute;cnica proporciona una manera de llevar tr&aacute;fico IPv6 dentro de redes IPv4 existentes.<br> Si no est&aacute; seguro sobre el modo de configurar IPv6 o afronta problemas de conexi&oacute;n, p&oacute;ngase en contacto con su Proveedor de servicios de Internet.</p>
<h4>Para habilitar IPv6 Tunnel:</h4>
<ol>
<li>Marque la casilla de verificaci&oacute;n <b>Habilitar t&uacute;nel</b> para habilitar la compatibilidad con el t&uacute;nel.</li>

<li>En <b>Direcci&oacute;n de servidor</b>, escriba el nombre de host o la direcci&oacute;n de IP del proveedor de servicios de t&uacute;nel, por ejemplo: anonymous.freenet6.net.</li>

<li>Seleccione si desea <b>Conectar de forma an&oacute;nima</b> o <b>Conectar con una cuenta existente</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<p>Es posible que su direcci&oacute;n IPv6 sea actualizada autom&aacute;ticamente por el proveedor de servicios. No obstante, DiskStation no quitar&aacute; inmediatamente la antigua direcci&oacute;n IPv6.</p>
</div>



</body>
</html>
