<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Esta p&aacute;gina ofrece opciones para administrar adaptadores Bluetooth y conectar dispositivos Bluetooth a su DiskStation. Una vez conectados, algunos dispositivos Bluetooth, como altavoces o auriculares, se pueden seleccionar como salida de audio para Audio Station, de forma que pueda escuchar f&aacute;cilmente la m&uacute;sica almacenada en su DiskStation.</p>
<h2>Primeros pasos</h2>
<p>Conecte un adaptador Bluetooth USB a un puerto USB de su DiskStation. En la parte izquierda de la p&aacute;gina principal de Bluetooth, se muestra una lista de adaptadores Bluetooth. En la parte derecha se muestra la informaci&oacute;n y las opciones relacionadas con los dispositivos Bluetooth.</p>
<h4>Para habilitar o deshabilitar adaptadores Bluetooth:</h4>
<ol>
<li>Seleccione un adaptador Bluetooth.</li>
<li>Haga clic en <strong>Configuraci&oacute;n avanzada</strong>.</li>
<li>Marque la casilla <strong>Habilitar Bluetooth</strong>.</li>
<li>Haga clic en <strong>Aceptar</strong> para guardar la configuraci&oacute;n.</li>
</ol>
<h2>Administrar dispositivos Bluetooth</h2>
<p>Cuando conecte un nuevo dispositivo Bluetooth, aseg&uacute;rese de que est&eacute; visible, de que se encuentre en un radio de 10 metros del DiskStation y de que utilice A2DP (Advanced Audio Distribution Profile). Consulte el manual de usuario del dispositivo Bluetooth para obtener m&aacute;s detalles sobre la configuraci&oacute;n.</p>
<h4>Para conectar un dispositivo Bluetooth:</h4>
<ol>
<li>En la p&aacute;gina principal de <strong>Bluetooth</strong>, seleccione el dispositivo Bluetooth que desee conectar a DiskStation. Si el dispositivo no aparece, pruebe a hacer clic en <strong>Actualizar</strong> para buscar dispositivos cercanos.</li>
<li>Seleccione el dispositivo cuando aparezca.</li>
<li>Haga clic en <strong>Conectar</strong>.</li>
<li>Si es necesario, introduzca el PIN de su dispositivo.</li>
</ol>
<h4>Para ver la informaci&oacute;n del dispositivo Bluetooth:</h4>
<ol>
<li>Seleccione un dispositivo Bluetooth conectado.</li>
<li>Haga clic en <strong>Informaci&oacute;n</strong>.</li>
<li>Aparecer&aacute; una ventana con informaci&oacute;n, como la direcci&oacute;n Bluetooth, el nombre, el tipo y el estado.</li>
</ol>
<h4>Para eliminar un dispositivo Bluetooth:</h4>
<ol>
<li>Seleccione un dispositivo Bluetooth que ya no desee usar con su DiskStation.</li>
<li>Haga clic en <strong>Eliminar</strong>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Al reproducir m&uacute;sica a trav&eacute;s de altavoces o auriculares Bluetooth, puede experimentar problemas de reproducci&oacute;n si se modifica la configuraci&oacute;n de su adaptador Bluetooth o conecta demasiados dispositivos Bluetooth a la vez.</li>
<li>Dependiendo del dispositivo, si un par de auriculares Bluetooth que se han conectado a su DiskStation se conectan luego a otro DiskStation (o reproductor de m&uacute;sica Bluetooth), puede que los altavoces olviden su DiskStation. En ese caso, se producir&aacute; un error al intentar reproducir m&uacute;sica con los altavoces. Para resolver este problema, desconecte los altavoces y pruebe a conectarlos de nuevo.</li>
</ul>

</div>
</body>
</html>
