<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Cortafuegos</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_firewall"></a>Permitir / Denegar</h2>
<p>
El cortafuegos incorporado puede impedir inicios de sesi&oacute;n no autorizados y controlar a qu&eacute; servicios se puede acceder. Adem&aacute;s, puede elegir entre permitir o denegar el acceso a determinados puertos de red desde direcciones IP espec&iacute;ficas.</p>
<h4>Para crear una regla de cortafuegos:</h4>
<ol>
<li>Vaya a <b>Panel de control</b> &gt; <b>Cortafuegos</b> y seleccione la interfaz de red de la columna izquierda seg&uacute;n el tipo de conexi&oacute;n de red.</li>
<li>Haga clic en <b>Crear</b>.</li>
<li>En la secci&oacute;n <b>Puertos</b>, seleccione una de las siguientes opciones para la regla:</li>
<ul>
<li>Elija <b>Todo</b> para aplicar las reglas a todos los puertos.</li>
<li>Elija <b>Seleccione de una lista de aplicaciones incorporadas</b>.</li>
<li>Elija <b>Personalizado</b> y haga clic en <b>Personalizado</b> y escriba hasta 15 puertos separados por comas o especifique un intervalo de puertos.</li>
<li class="no">
Tambi&eacute;n puede especificar los protocolos.
</li>
</ul>
<li>En la secci&oacute;n <b>IP origen</b>, seleccione una de las siguientes opciones para la regla:</li>
<ul>
<li>Elija <b>Todo</b> para permitir o denegar todas las direcciones IP.</li>
<li>Escriba una <b>Direcci&oacute;n IP de host sencillo.</b></li>
<li>Escriba una <b>Subred.</b> </li>
</ul>
<li>En la secci&oacute;n <b>Acci&oacute;n</b>, seleccione una de las siguientes opciones para la regla:</li>
<ul>
<li>Elija <b>Permitir</b> para permitir el acceso a los puertos y a la configuraci&oacute;n IP de origen anterior.</li>
<li>Elija <b>Denegar</b> para denegar el acceso a los puertos y a la configuraci&oacute;n IP de origen anterior.</li>
</ul>
</ol>
<p>
Ahora puede ver la regla de cortafuegos creada en la lista de reglas.
</p>
<h4>Para eliminar las reglas del cortafuegos, realice una de las siguientes acciones:</h4>
<ul>
<li>Desactive la casilla de verificaci&oacute;n de la regla en la columna <b>Habilitado</b> de la lista</li>
<li>Eliminar la regla del cortafuegos</li>
</ul>
<p>
Tambi&eacute;n puede elegir <b>Permitir acceso</b> o <b>Denegar acceso</b> en la parte inferior de la lista de reglas para permitir o denegar el acceso que no coincide con ninguna regla.
</p>
<ol>
<span class="note_head">Nota:</span>
<li>Puede crear hasta 100 reglas para una interfaz de red y reordenar las reglas de la lista con funciones de arrastrar y soltar.</li>
<li>Las reglas se priorizan en funci&oacute;n de sus posiciones en la lista.</li>
<li>Si el sistema tiene m&uacute;ltiples puertos de red conectados a la misma subred, es posible que las reglas de cortafuegos no funcionen correctamente.* </li>
<li>Cuando combine m&uacute;ltiples puertos LAN con link aggregation, el cortafuegos aplicar&aacute; las reglas de la primera interfaz de red y reservar&aacute; las reglas de la segunda interfaz de red.</li>
</ol>
<p>____<br> * S&oacute;lo se aplica a determinados modelos.</p>
</body>
</html>
