<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Bloqueo autom&aacute;tico</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Bloqueo autom&aacute;tico</h2>

<p>Bloqueo autom&aacute;tico permite impedir conexiones no autorizadas. Una vez habilitado el servicio, se bloquear&aacute; una direcci&oacute;n IP si tiene demasiados intentos de conexi&oacute;n fallidos. Los intentos de conexi&oacute;n fallidos mediante SSH, Telnet, rsync, Copia de seguridad de red, Sincronizaci&oacute;n de carpetas compartidas, FTP, WebDAV, aplicaciones m&oacute;viles de Synology, File Station o DSM se ir&aacute;n acumulando. Tambi&eacute;n puede tener una Lista de permiso que incluye las direcciones IP que nunca se bloquear&aacute;n.</p>

<h4>Para configurar el bloqueo autom&aacute;tico:</h4>
<ol>
<li>Vaya a la ficha <strong>General</strong> y marque <b>Habilitar bloqueo autom&aacute;tico</b>.</li>
<li>Introduzca un n&uacute;mero para <b>Intentos de conexi&oacute;n</b> y <b>En (minutos)</b> para bloquear una direcci&oacute;n IP al cabo de un n&uacute;mero definido de intentos de conexi&oacute;n fallidos en un n&uacute;mero de minutos especificado.</li>
<li>Marque <b>Habilitar caducidad del bloqueo</b> y introduzca un n&uacute;mero para quitar una direcci&oacute;n IP bloqueada al cabo del n&uacute;mero de d&iacute;as especificado.  Las direcciones IP bloqueadas permanecer&aacute;n indefinidamente en la lista de bloqueo a menos que se quite de la lista si no se selecciona esta opci&oacute;n o si <b>Desbloquear al cabo de (d&iacute;as)</b> se define en 0.</li>

<li>Haga clic en <b>Aplicar</b>.</li>
</ol>

<h4>Para a&ntilde;adir direcciones IP bloqueadas:</h4>
<p>Haga clic en la ficha <strong>Lista de bloqueo</strong> y seleccione cualquiera de las siguientes opciones del men&uacute; desplegable <strong>Crear</strong>:</p>
<ul>
<li><strong>A&ntilde;adir direcci&oacute;n IP</strong></li>
<p>Introduzca una direcci&oacute;n IP y establezca el tiempo de caducidad.<p/>
<li><strong>Importar lista de direcciones IP</strong></li>
<p>Importe un archivo de texto con las direcciones IP para a&ntilde;adir varias direcciones IP y establecer la fecha de caducidad a la vez. Marque la casilla de verificaci&oacute;n adecuada si desea sobrescribir direcciones IP existentes. Si no se selecciona esta opci&oacute;n, se omitir&aacute;n las direcciones IP duplicadas.</p>
<p>Para importar un archivo, el archivo debe cumplir los siguientes criterios:</p>
<ul>
<li>El archivo debe ser un archivo de solo texto.</li>
<li>Cada l&iacute;nea del archivo debe contener una &uacute;nica direcci&oacute;n IP.</li>
<li>Las l&iacute;neas de comentario deben empezar por # (signo de libra).</li>
<p>Si el archivo seleccionado tiene el formato correcto, ver&aacute; todas las direcciones IP en el &aacute;rea de vista previa. Haga clic en <strong>Aceptar</strong> para importar.</p>
</ul>
</ul>

<h4>Para eliminar direcciones IP bloqueadas:</h4>
<ol>
<li>
Haga clic en la ficha <b>Lista de bloqueo</b> para ver la lista de direcciones IP bloqueadas.
</li>
<li>
Seleccione las direcciones IP que desee eliminar de la lista y haga clic en <b>Eliminar</b>.
</li>
</ol>


<h4>Para a&ntilde;adir direcciones IP permitidas:</h4>
<p>Haga clic en la ficha <strong>Lista de permiso</strong> y seleccione cualquiera de las siguientes opciones del men&uacute; desplegable <strong>Crear</strong>:</p>
<ul>
<li><strong>A&ntilde;adir direcci&oacute;n IP</strong></li>
<p>Introduzca una direcci&oacute;n IP.<p/>
<li><strong>Importar lista de direcciones IP</strong></li>
<p>Importe un archivo de texto con las direcciones IP para a&ntilde;adir varias direcciones IP a la vez. Marque la casilla de verificaci&oacute;n adecuada si desea sobrescribir direcciones IP existentes. Si no se selecciona esta opci&oacute;n, se omitir&aacute;n las direcciones IP duplicadas.</p>
<p>Para importar un archivo, el archivo debe cumplir los siguientes criterios:</p>
<ul>
<li>El archivo debe ser un archivo de solo texto.</li>
<li>Cada l&iacute;nea del archivo debe contener una &uacute;nica direcci&oacute;n IP.</li>
<li>Las l&iacute;neas de comentario deben empezar por # (signo de libra).</li>
<p>Si el archivo seleccionado tiene el formato correcto, ver&aacute; todas las direcciones IP en el &aacute;rea de vista previa. Haga clic en <strong>Aceptar</strong> para importar.</p>
</ul>
</ul>

<h4>Para eliminar direcciones IP permitidas:</h4>
<ol>
<li>
Haga clic en la ficha <b>Lista de permiso</b> para ver la lista de direcciones IP permitidas.
</li>
<li>
Seleccione las direcciones IP que desee eliminar de la lista y haga clic en <b>Eliminar</b>. </li>
</ol>


</body>
</html>
