
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>LAN / LAN inal&aacute;mbrica</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="lan"></a>LAN/Internet</h2>
<p>Seg&uacute;n el modelo de DiskStation y la configuraci&oacute;n de red, puede configurar los par&aacute;metros DHCP para LAN o Internet en <strong>Panel de control</strong> &gt; <strong>Red</strong> &gt; <strong>Interfaz de red</strong>. DHCP es un protocolo de red para la configuraci&oacute;n autom&aacute;tica de IP. Para dejar que DHCP asigne un IP para el sistema, haga clic en <strong>Editar</strong> y elija <b>Obtener la configuraci&oacute;n de la red autom&aacute;ticamente (DHCP)</b> en la pesta&ntilde;a <strong>IPv4</strong>.</p>
<p>Si utiliza una direcci&oacute;n IP espec&iacute;fica de su proveedor de servicios de red, elija <b>Utilizar configuraci&oacute;n manual</b> y escriba manualmente la direcci&oacute;n IP y la m&aacute;scara de subred. Si no est&aacute;n disponibles un DNS Server o una pasarela predeterminada, deje el campo en blanco.</p>

<div class="section">
<h4>Nota:</h4>
<ol>
<li>Para estar seguro de que las notificaciones por correo electr&oacute;nico se env&iacute;an correctamente a trav&eacute;s del servidor SMTP, debe especificarse un IP de DNS Server v&aacute;lido.</li>
<li>Los Jumbo Frames son marcos de Ethernet con m&aacute;s de los 1500 bytes convencionales de la Unidad de transmisi&oacute;n m&aacute;xima (MTU), permitiendo la transmisi&oacute;n por Ethernet de archivos grandes para ser m&aacute;s eficientes. Solamente puede habilitarse en el entorno de red Gigabit.  Para asegurarse de que Jumbo Frame funciona correctamente, es necesario que todos los equipos y dispositivos de la red que accedan a DiskStation lo admitan y utilicen el mismo valor de MTU.</li>
</ol>
</div>

<h3><a name="vlan"></a>VLAN</h3>
<p>Cuando el entorno de red requiera la configuraci&oacute;n de una VLAN, puede habilitar la opci&oacute;n VLAN e introducir una ID de VLAN para el entorno de red en la pesta&ntilde;a <strong>IPv4</strong> en la ventana de Editar.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Aseg&uacute;rese de que el interruptor de red est&aacute; bien configurado, ya que, de lo contrario, es posible que no se pueda acceder a DiskStation.</li>
<li>Si no puede conectar con la unidad DiskStation tras modificar la configuraci&oacute;n anterior, pulse el bot&oacute;n RESET ubicado en la unidad DiskStation para restaurar la configuraci&oacute;n predeterminada.</li>
</ul>
</div>


<h3><a name="ipv6"></a>Configuraci&oacute;n de IPv6</h3>
<p>Los dispositivos de DiskStation son compatibles con los esquemas de pila dual IPv4/IPv6. Esto significa que tanto IPv4 como IPv6 pueden trabajar simult&aacute;neamente en el DiskStation. La configuraci&oacute;n predeterminada para IPv6 es <b>Autom&aacute;tico</b>. Seleccione una interfaz de red existente, haga clic en el bot&oacute;n <b>Editar</b> y vaya a la pesta&ntilde;a <b>IPv6</b> para cambiar la configuraci&oacute;n.</p>

<h4>Para ajustar la configuraci&oacute;n de IPv6:</h4>
<ol>
<li>Vaya al <strong>Panel de control</strong> &gt; <strong>Red</strong> &gt; <strong>Interfaz de red</strong>.</li>
<li>Seleccione una interfaz de red existente, haga clic en <strong>Editar</strong>.</li>
<li>En la pesta&ntilde;a <strong>IPv6</strong> seleccione un tipo de configuraci&oacute;n desde <strong>Configuraci&oacute;n de IPv6</strong>:<ul>
    <li><b>Autom&aacute;tico</b>: El DiskStation generar&aacute; autom&aacute;ticamente una direcci&oacute;n de IPv6 seg&uacute;n la publicidad del enrutador LAN (RA).</li>
	<ul>
	  <li><strong>Modo sin estado</strong>: Permite que dispositivos conectados al enrutador configuren autom&aacute;ticamente una direcci&oacute;n IPv6 sin configurar el DNS Server de IPv6.</li>
      <li><strong>Modo sin estado DHCPv6</strong>: Permite que dispositivos conectados al enrutador configuren autom&aacute;ticamente una direcci&oacute;n IPv6 y obtengan la informaci&oacute;n DNS a trav&eacute;s de DHCPv6.</li>
      <li><strong>Modo con estado</strong>: Permite que dispositivos conectados al enrutador obtener una direcci&oacute;n IPv6 y la informaci&oacute;n DNS a trav&eacute;s de DHCPv6. En este modo tiene que habilitar el DHCPv6 server y configurar la <strong>Inicio de dirección IP </strong> y la <strong>Fin de dirección IP</strong> del DHCPv6 server.</li>
	</ul>
<li><b>Manual</b>: Configure IPv6 manualmente introduciendo la informaci&oacute;n en <b>Direcci&oacute;n IPv6</b>, <b>Longitud de Prefix</b> y <b>Pasarela predeterminada</b>.</li>
<li><b>Desactivado</b>: Desactiva la compatibilidad con IPv6.</li>
  </ul>
</ol>
<p>Hasta que IPv6 sustituya completamente a IPv4, los mecanismos de transici&oacute;n de IPv6 son necesarios para habilitar los hosts con direcciones IPv4 y alcanzar los servicios IPv6. Elija entre los diferentes mecanismos de transici&oacute;n IPv6:</p>
<ul>
  <li><b>6in4</b>: Conecte a la red IPv6 con un agente de tunelizaci&oacute;n. Deber&aacute; rellenar <b>Direcci&oacute;n IPv6</b>, <b>Longitud de Prefix</b>, <b>Prefix</b> y <b>Direcci&oacute;n IPv4 de agente de t&uacute;nel</b>. Esto requiere una direcci&oacute;n IPv4 p&uacute;blica.</li>
<li><b>6to4</b>: Conecte a la red IPv6 con un agente de tunelizaci&oacute;n con anycast. Esto requiere una direcci&oacute;n IPv4 p&uacute;blica.</li>
<li><b>DHCP-PD</b>: Obtenga un prefijo IPv6 del DHCP Server mediante la delegaci&oacute;n de prefijo dentro de LAN. Esto requiere la compatibilidad con ISP y solo funciona en el modo de enrutador.</li>
<li><strong>Tunelizaci&oacute;n IPv6 (TSP)</strong>: Vaya a <strong>Panel de control</strong> &gt; <strong>Red</strong> &gt; <strong>General</strong> para configurar esta opci&oacute;n.</li>
</ul>

<h3>802.1X</h3>
<p>802.1X es el estándar de autenticación desarrollado por la IEEE para redes de conexión de usuarios. 802.1X puede usarse en redes para autenticar el cliente y denegar el acceso a la red protegida a los clientes que no superen correctamente la autenticación. </p>
<p>Puede permitir a su Synology NAS conectarse a la red protegida mediante autenticación 802.1X.</p>

<h4>Para habilitar la autenticación 802.1X:</h4>
<ol>
<li>Vaya al <strong>Panel de control</strong> > <strong>Red</strong> > <strong>Interfaz de red</strong>. </li>
<li>Seleccione una interfaz de red cableada (por ejemplo LAN) y haga clic en <strong>Editar</strong>. </li>
<li>Vaya a la ficha <strong>802.1X</strong> y marque <strong>Habilitar autenticación 802.1X</strong>. </li>
<li>Seleccione uno de los siguientes protocolos en el menú desplegable <strong>Autenticación</strong>. Si no está seguro de qué protocolo es el más adecuado, seleccione <strong>Auto</strong>.<ul>
<li><strong>EAP protegido (PEAP)</strong>: usa un certificado CA (opcional) para establecer una conexión segura. Esta conexión segura se usará para la autenticación interna.</li>
<li><strong>TLS tunelizado (TTLS)</strong>: usa un certificado CA (opcional) para establecer una conexión segura. Esta conexión segura se usará para la autenticación interna.</li>
<li><strong>TLS</strong>: usa TLS (Transport Layer Security) para la autenticación.</li> </ul> </li>
<li>Si selecciona <strong>TTLS</strong> o <strong>PEAP</strong>, seleccione uno de los protocolos de autenticación interna del menú desplegable.<ul>
<li><strong>MS CHAP v2</strong>: la información de autenticación se cifrará con Microsoft CHAP v2.</li>
<li><strong>GTC</strong>: la información de autenticación usará GTC (Generic Token Card) para el cifrado.</li>
</ul></li>
<li>Escriba el nombre de usuario y la contraseña.</li>
<li>Si fuera necesario, haga clic en <strong>Importar</strong> y, a continuación, <strong>Examinar</strong> para buscar e importar un certificado exportado del servidor Radius (por ejemplo ca.crt).</li>
<li>Haga clic en <strong>OK</strong> para guardar su configuración.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para configurar la autenticación 802.1X para redes inalámbricas, vaya a <strong>Panel de control</strong> > <strong>Inalámbrico</strong> > <strong>Wi-Fi</strong>.</li>
<li>La configuración de autenticación debe ser la misma que la configurada en el servidor Radius. Para obtener más información, póngase en contacto con el administrador del servidor Radius.</li>
</ul>
</div>

<h2>LAN inal&aacute;mbrica*</h2>
<p>Cuando DiskStation act&uacute;a como enrutador inal&aacute;mbrico, puede configurar los siguientes par&aacute;metros para LAN inal&aacute;mbrico en <strong>Panel de control</strong> &gt; <strong>Red</strong> &gt; <strong>Interfaz de red</strong>.</p>
<h3>Configuraci&oacute;n IPv4</h3>

<h4>Direcci&oacute;n IP y m&aacute;scara de subred</h4> 
<p>Puede configurar la direcci&oacute;n de IP y la m&aacute;scara de subred para DiskStation aqu&iacute;.</p>
<h4>DHCP Server</h4>
<p>Marque la opci&oacute;n <strong>Habilitar DHCP Server</strong> para permitir que DiskStation asigne direcciones IP a los dispositivos cliente que se conecten a la red local proporcionada por DiskStation.</p>
<h4>Transmisi&oacute;n PPPoE</h4>
<p>Habilite la <strong>Transmisi&oacute;n PPPoE</strong> para permitir que los dispositivos conectados a DiskStation se conecten a Internet mediante una conexi&oacute;n PPPoE.</p>

<h4>Configurar como pasarela de Internet UPnP</h4>
<p>Habilite el servicio <strong>UPnP</strong> para permitir que su DiskStation se convierta en un dispositivo de pasarela de Internet UPnP, de manera que los dispositivos conectados a la red local de DiskStation puedan configurar par&aacute;metros de reenv&iacute;o de puertos con UPnP.</p>

<h3>Configuraci&oacute;n IPv6</h3>
<p>Puede conseguir una direcci&oacute;n IPv6 y un prefijo de <strong>LAN/Internet</strong> con 6in4, 6to4 o DHCP-PD. Con esta informaci&oacute;n, puede configurar aqu&iacute; las opciones de enrutamiento IPv6 del DiskStation.</p>
<ul>
<li><strong>Direcci&oacute;n IPv6</strong>: Introduzca la direcci&oacute;n IPv6 obtenida de <strong>LAN/Internet</strong>.</li>
<li><strong>Longitud de Prefix</strong>: Introduzca la longitud de prefijo de la direcci&oacute;n IPv6 obtenida de <strong>LAN/Internet</strong>, normalmente 64.</li>
<li><strong>DNS primario</strong>: El DNS server primario para los dispositivos conectados al enrutador. No es necesario configurar esto en el <strong>Modo sin estado</strong>.</li>
<li><strong>DNS secundario</strong>: El DNS server secundario para los dispositivos conectados al enrutador. No es necesario configurar esto en el <strong>Modo sin estado</strong>.</li>
</ul>
<p>Existen tres modos de publicidad de enrutador (RA) para seleccionar entre:</p>
<ul>
<li><strong>Modo sin estado</strong>: Permite que dispositivos conectados al enrutador configuren autom&aacute;ticamente una direcci&oacute;n IPv6 sin configurar el DNS Server de IPv6.</li>
<li><strong>Modo sin estado DHCPv6</strong>: Permite que dispositivos conectados al enrutador configuren autom&aacute;ticamente una direcci&oacute;n IPv6 y obtengan la informaci&oacute;n DNS a trav&eacute;s de DHCPv6.</li>
<li><strong>Modo con estado</strong>: Permite que dispositivos conectados al enrutador obtener una direcci&oacute;n IPv6 y la informaci&oacute;n DNS a trav&eacute;s de DHCPv6. En este modo tiene que habilitar el DHCPv6 server y configurar la <strong>Inicio de dirección IP</strong> y la <strong>Fin de dirección IP</strong> del DHCPv6 server.</li>
</ul>

<h3>Clientes DHCP</h3>
<p>Aqu&iacute; puede ver una lista de clientes DHCP y sus configuraciones de red (por ejemplo, direcci&oacute;n MAC, direcci&oacute;n IP, nombre de host y la cantidad de tiempo que queda antes de que expire el uso de DHCP).</p>
<p>Puede filtrar la lista desplegable de clientes IPv4/IPv6 para mostrar los clientes que utilizan IPv4 y IPv6 respectivamente. Elija un cliente y haga clic en <strong>Agregar a la lista de direcciones reservadas</strong> para agregar el cliente a la lista de direcciones reservadas.</p>

<h3>Reserva de DHCP</h3>
<p>Si desea que un cliente reciba siempre la misma direcci&oacute;n IP al renovar el uso de DHCP, puede agregar el cliente a la lista de direcciones reservadas.</p>
<p>Puede filtrar la lista desplegable de direcciones reservadas de IPv4/IPv6. Las direcciones IPv4 se identifican con direcciones MAC, mientras que las direcciones IPv6 se identifican con DUID.</p>
<h4>Para agregar un cliente a la lista de direcciones reservadas:</h4>
<ul>
<li>Seleccione un cliente y haga clic en <b>Agregar</b>.</li>
<li>Especifique la direcci&oacute;n MAC o DUID del cliente, la direcci&oacute;n IPv4/IPv6 que quiere asignar al cliente y el nombre de host del cliente. </li>
<li>Haga clic en <b>OK</b> para guardar su configuraci&oacute;n.</li>
</ul>
<p><b>_____</b> <br>* Solo disponible en determinados modelos o seg&uacute;n su entorno.</p>
</body>
</html>
