<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Usuario</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Configuraci&oacute;n de contrase&ntilde;a</h2>
<p>haga clic en el bot&oacute;n de <strong>Configuraci&oacute;n de contrase&ntilde;a</strong> para visualizar y modificar la configuraci&oacute;n que se describe a continuaci&oacute;n.</p>

<h3>Restablecer contrase&ntilde;as olvidadas</h3>
<p>Esta secci&oacute;n incluye una opci&oacute;n marcada como <strong>Permitir que usuarios no administradores restablezcan contrase&ntilde;as olvidadas por correo electr&oacute;nico</strong>. Cuando se habilita esta opci&oacute;n, en la p&aacute;gina de inicio de sesi&oacute;n de DSM aparecer&aacute; un enlace marcado como <strong>&iquest;Ha olvidado la contrase&ntilde;a?</strong> Si un usuario olvida su contrase&ntilde;a, puede hacer clic en este enlace e introducir su nombre de usuario. En este caso, el sistema enviar&aacute; un mensaje al usuario con un enlace para restablecer su contrase&ntilde;a olvidada. </p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Antes de habilitar esta opci&oacute;n, aseg&uacute;rese de haber habilitado primero las notificaciones por correo electr&oacute;nico de SMTP. Para hacer esto, vaya a <strong>Panel de control</strong> &gt; <strong>Notificaci&oacute;n</strong> &gt; <strong>General</strong>. Si las notificaciones no est&aacute;n habilitadas, el sistema ser&aacute; incapaz de enviar mensajes a los usuarios que deseen restablecer sus contrase&ntilde;as.</li>
<li>Para recibir mensajes del sistema, los usuarios deben proporcionar una direcci&oacute;n de correo electr&oacute;nico en la secci&oacute;n de informaci&oacute;n de usuario de sus cuentas.</li>
<li>Los usuarios que pertenezcan al grupo de <strong>administrators</strong> no puede restablecer sus contrase&ntilde;as con esta opci&oacute;n.</li>
<li>Los usuarios de dominio no pueden restablecer contrase&ntilde;as con esta opci&oacute;n.</li>
<li>Los usuarios de LDAP pueden restablecer contrase&ntilde;as con esta opci&oacute;n, siempre que DiskStation funcione como servidor de directorio de LDAP.</li>

</ul>
</div>


<h3>Fortaleza de contrase&ntilde;a</h3>
<p>Puede definir reglas de fortaleza de contrase&ntilde;a para los usuarios en DiskStation.</p>

<div class="section">
<h4>Nota:</h4>
<p>Las reglas de fortaleza de contrase&ntilde;a solo ser&aacute;n aplicables a las contrase&ntilde;as nuevas. Por ejemplo, las reglas de fortaleza de contrase&ntilde;as solo se aplican al crear nuevas cuentas de usuario o cuando un usuario existente cambie su contrase&ntilde;a. Las contrase&ntilde;as existentes y aquellas pertenecientes a cuentas de usuario importadas, est&aacute;n excluidas de las nuevas reglas de contrase&ntilde;as.</p>
</div>
<h4>Para habilitar las reglas de fortaleza de contrase&ntilde;a:</h4>
<ol>
<li>Marque la casilla de verificaci&oacute;n <b>Aplicar reglas de fortaleza de contrase&ntilde;a</b> para habilitar las restricciones de contrase&ntilde;a.</li>
<li>Seleccione m&aacute;s de una restricci&oacute;n de contrase&ntilde;a de las siguientes reglas:</li>
<ul>
<li><b>Excluir de la contrase&ntilde;a el nombre y descripci&oacute;n del usuario</b>: La contrase&ntilde;a no debe contener el nombre del usuario o la descripci&oacute;n del usuario. Pero se excluyen los caracteres codificados UTF-8.</li>
<li><b>Permitir may&uacute;sculas y min&uacute;sculas mezcladas</b>: Se permiten las may&uacute;sculas y min&uacute;sculas mezcladas en la contrase&ntilde;a.</li>
<li><b>Car&aacute;cter num&eacute;rico incluido</b>: La contrase&ntilde;a debe contener, como m&iacute;nimo, un car&aacute;cter num&eacute;rico (0~9).</li>
<li><b>Incluir car&aacute;cter especial</b>: La contrase&ntilde;a debe contener, como m&iacute;nimo, uno de los caracteres especiales ASCII (por ejemplo, ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Longitud m&iacute;nima de la contrase&ntilde;a</b>: La contrase&ntilde;a debe tener al menos el valor especificado en el campo de texto. La longitud deber&aacute; ser un n&uacute;mero situado entre el 6 y el 127.</li>
</ul>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>
</ol>
 
</body>
</html>

