<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Carpeta compartida</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Carpeta compartida</h1>
<p>Las carpetas compartidas son los directorios b&aacute;sicos en los que puede almacenar archivos y carpetas de su DiskStation. Antes de almacenar archivos en su DiskStation, debe crear al menos una carpeta compartida. Los datos almacenados en carpetas compartidas se pueden mantener privados o se pueden compartir con usuarios espec&iacute;ficos o grupos de usuarios de acuerdo con permisos de acceso personalizables. Adem&aacute;s, las carpetas compartidas se pueden cifrar durante su creaci&oacute;n, a&ntilde;adiendo un nivel adicional de protecci&oacute;n.</p>

<h3>Carpetas compartidas predeterminadas</h3>

<p>A continuaci&oacute;n se presenta una lista de carpetas predeterminadas creadas autom&aacute;ticamente cuando ciertas aplicaciones, servicios o paquetes se instalan o habilitan.</p> 

<table>
<tr>
<th>Nombre</th>
<th>Descripci&oacute;n</th>
</tr>
<tr>
<th>public</th>
<td>La carpeta <strong>public</strong> se crea autom&aacute;ticamente despu&eacute;s de configurar DiskStation por primera vez.*</td>
</tr>
<tr>
<th>web</th>
<td>La carpeta <strong>web</strong> es la ubicaci&oacute;n predeterminada de almacenamiento para los contenidos de un sitio web alojado en DiskStation. Se crea autom&aacute;ticamente cuando se habilita <strong>Web Station</strong>.</td>
</tr>
<tr>
<th>photo</th>
<td>La carpeta <strong>photo</strong> se utiliza para almacenar fotos y v&iacute;deos que desee compartir en Photo&nbsp;Station. Se crear&aacute; autom&aacute;ticamente cuando se habilita <strong>Photo Station</strong> o el <strong> servidor multimedia DLNA/UPnP</strong>.</td>
</tr>
<tr>
<th>music</th>
<td>La carpeta <strong>music</strong> se utiliza para almacenar la m&uacute;sica que desee escuchar con Audio Station. Se crea autom&aacute;ticamente cuando se habilita <strong>Audio Station</strong>.</td>
</tr>
<tr>
<th>video</th>
<td>La carpeta <strong>video</strong> se utiliza para almacenar archivos de v&iacute;deo que desee examinar a trav&eacute;s de dispositivos DLNA/UPnP. Se crea autom&aacute;ticamente cuando se habilita <strong>Servidor multimedia</strong>.</td>
</tr>
<tr>
<th>surveillance</th>
<td>La carpeta <strong>surveillance</strong> se utiliza para almacenar las grabaciones de Surveillance&nbsp;Station. Se crea autom&aacute;ticamente cuando se habilita <strong>Surveillance Station</strong>. Es de s&oacute;lo lectura y solamente puede acceder a ella el administrador del sistema.</td>
</tr>
<tr>
<th>home</th>
<td>La carpeta <strong>home</strong> proporciona espacios privados para cada usuario, para que pueda almacenar datos donde s&oacute;lo &eacute;l pueda acceder. Se crea autom&aacute;ticamente cuando la caracter&iacute;stica <strong>Inicio de usuario</strong> se habilita.</td>
</tr>
<tr>
<th>homes</th>
<td>La carpeta <strong>homes</strong> contiene las carpetas Inicio de todos los usuarios. Se crea autom&aacute;ticamente cuando la caracter&iacute;stica <strong>Inicio de usuario</strong> se habilita. Solamente el administrador del sistema puede acceder a las carpetas home de todos los usuarios y administrarlas.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>La carpeta <strong>NetBackup</strong> se crea autom&aacute;ticamente cuando se habilita <strong>Copia de seguridad de red</strong>.</td>
</tr>
<tr>
<th>usbshare</th>
<td>La carpeta <strong>usbshare[n&uacute;mero]</strong> se crea autom&aacute;ticamente cuando conecta un dispositivo con unidad USB externa al puerto USB de DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>La carpeta <strong>satashare[n&uacute;mero]</strong> se crea autom&aacute;ticamente cuando conecta un dispositivo con unidad eSATA externa al puerto eSATA de DiskStation.*</td>
</tr>
</table>

<p>____<br> * S&oacute;lo disponible en determinados modelos.</p>

</body>
</html>
