<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Carpeta compartida</h2>
<p>Las carpetas compartidas son los directorios b&aacute;sicos en los que puede almacenar archivos y carpetas de su DiskStation. Antes de almacenar archivos en su DiskStation, debe crear al menos una carpeta compartida en DSM. Los datos almacenados en carpetas compartidas se pueden mantener privados o se pueden compartir con usuarios espec&iacute;ficos o grupos de usuarios de acuerdo con permisos de acceso personalizables.</p>



<p>A continuaci&oacute;n se presenta una lista de carpetas compartidas predeterminadas, creadas autom&aacute;ticamente cuando ciertas aplicaciones, servicios o paquetes se instalan o habilitan.</p> 
<table>
<tr>
<th>Nombre</th>
<th>Descripci&oacute;n</th>
</tr>
<tr>
<th>public</th>
<td>La carpeta <strong>public</strong> se crea autom&aacute;ticamente despu&eacute;s de configurar DiskStation por primera vez.*</td>
</tr>
<tr>
<th>web</th>
<td>La carpeta <strong>web</strong> es la ubicaci&oacute;n predeterminada de almacenamiento para los contenidos de un sitio web alojado en DiskStation. Se crea autom&aacute;ticamente cuando se habilita <strong>Web Station</strong>.</td>
</tr>
<tr>
<th>photo</th>
<td>La carpeta <strong>photo</strong> se utiliza para almacenar fotos y v&iacute;deos que desee compartir en Photo&nbsp;Station. Se crear&aacute; autom&aacute;ticamente cuando se habilita <strong>Photo Station</strong> o el <strong> servidor multimedia DLNA/UPnP</strong>.</td>
</tr>
<tr>
<th>music</th>
<td>La carpeta <strong>music</strong> se utiliza para almacenar la m&uacute;sica que desee escuchar con Audio Station. Se crea autom&aacute;ticamente cuando se habilita <strong>Audio Station</strong> o el <b> servidor multimedia DLNA/UPnP</b>.</td>
</tr>
<tr>
<th>video</th>
<td>La carpeta <strong>video</strong> se utiliza para almacenar archivos de v&iacute;deo que desee examinar a trav&eacute;s de dispositivos DLNA/UPnP. Se crea autom&aacute;ticamente cuando se habilita <b>Video Station</b> o el <strong> servidor multimedia DLNA/UPnP</strong>.</td>
</tr>
<tr>
<th>surveillance</th>
<td>La carpeta <strong>surveillance</strong> se utiliza para almacenar las grabaciones de Surveillance&nbsp;Station. Se crea autom&aacute;ticamente cuando se habilita <strong>Surveillance Station</strong>. Es de s&oacute;lo lectura y solamente puede acceder a ella el administrador del sistema.</td>
</tr>
<tr>
<th>home</th>
<td>La carpeta <strong>home</strong> proporciona espacios privados para cada usuario, para que pueda almacenar datos donde s&oacute;lo &eacute;l pueda acceder. Se crea autom&aacute;ticamente cuando la caracter&iacute;stica <strong>Inicio de usuario</strong> se habilita.</td>
</tr>
<tr>
<th>homes</th>
<td>La carpeta <strong>homes</strong> contiene las carpetas Inicio de todos los usuarios. Se crea autom&aacute;ticamente cuando la caracter&iacute;stica <strong>Inicio de usuario</strong> se habilita. Solamente el administrador del sistema puede acceder a las carpetas home de todos los usuarios y administrarlas.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>La carpeta <strong>NetBackup</strong> se crea autom&aacute;ticamente cuando se habilita <strong>Copia de seguridad de red</strong>.</td>
</tr>
<tr>
<th>usbshare</th>
<td>La carpeta <strong>usbshare[n&uacute;mero]</strong> se crea autom&aacute;ticamente cuando conecta un dispositivo con unidad USB externa al puerto USB de DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>La carpeta <strong>satashare[n&uacute;mero]</strong> se crea autom&aacute;ticamente cuando conecta un dispositivo con unidad eSATA externa al puerto eSATA de DiskStation.*</td>
</tr>
</table>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Solo podr&aacute; editar permisos de carpetas compartidas de usuarios en el modo sencillo. Si desea crear grupos de usuarios o administrar los privilegios de acceso de grupos a carpetas compartidas, vaya a <b>Panel de control (modo avanzado)</b> &gt; <b>Grupo</b>.</li>
</ul>
</div>

<h4>Para crear una carpeta compartida:</h4>
<ol>
<li>Vaya a <b>Panel de control (modo sencillo)</b> &gt; <b>Carpeta compartida</b> y haga clic en el s&iacute;mbolo <b>+</b> en el panel izquierdo.</li>
<li>Especifique un nombre y seleccione un volumen en el que crear la carpeta compartida.</li>
<li>Marque <b>Habilitar papelera de reciclaje</b> si fuera necesario. Si se habilita esta opci&oacute;n, cuando se eliminan archivos de la carpeta compartida, se mover&aacute;n a una carpeta llamada <b>#recycle</b>. El acceso a la papelera de reciclaje estar&aacute; limitado a usuarios que pertenecen al grupo de <b>administrators</b>.</li>
<li>Marque o desmarque las casillas adecuadas para cada usuario, a fin de personalizar sus permisos de acceso de la carpeta compartida:</li>
<ul>
<li><b>Lectura/Escritura:</b> El usuario puede acceder a los archivos y subcarpetas de la carpeta compartida y hacer cambios.</li>
<li><b>S&oacute;lo lectura:</b> El usuario puede acceder a los archivos y subcarpetas de la carpeta compartida.</li>
<li><b>Sin acceso:</b> El usuario no puede acceder a los archivos ni subcarpetas de la carpeta compartida.</li>
</ul>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Los nombres de las carpetas compartidas no distinguen entre may&uacute;sculas y min&uacute;sculas y pueden incluir de 1 a 32 caracteres. Los nombres no puede incluir los siguientes caracteres:<br> <strong>! &quot; # $ % &amp; &apos; ( ) * + , / : ; <= > ? @ [ ] \ ^ ` { } | ~</strong></li>
<li>Los siguientes nombres de est&aacute;n reservados para el uso del sistema:<br> <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong></li>
<li>El primer car&aacute;cter de una carpeta compartida no puede ser un signo menos o un espacio y el &uacute;ltimo no puede ser un espacio.</li>
<li>Cuando encuentre conflictos de permisos, la prioridad de los permisos es la siguiente: <b>Sin acceso</b> &gt; <b>Lectura/Escritura</b> &gt; <b>S&oacute;lo lectura</b>.</li>
<li>Al crear una carpeta compartida nueva, si los permisos del usuario perteneciente al grupo de <b>administrators</b> est&aacute; configurado como <b>Sin acceso</b>, estos usuarios solo podr&aacute;n ver carpetas compartidas en <b>Panel de control</b> &gt; <b>Carpeta compartida</b>.</li>
<li> Puede ajustar la configuraci&oacute;n de privilegios de la carpeta Papelera de reciclaje de File Station haciendo clic con el bot&oacute;n secundario en la carpeta <b>#recycle</b>. Elija <b>Propiedades</b> y haga clic en la pesta&ntilde;a <b>Permiso</b>.</li>
</ul>
</div>

<h4>Para editar una carpeta compartida:</h4>
<ol>
<li>Vaya al <b>Panel de control (modo sencillo)</b> &gt; <b>Carpeta compartida</b>.</li>
<li>Seleccione la carpeta compartida deseada en el panel izquierdo.</li>
<li>Edite la informaci&oacute;n general de la carpeta compartida, como por ejemplo el nombre, la ubicaci&oacute;n y los permisos de usuario.</li>
<li>Si ya se ha marcado <b>Habilitar la papelera de reciclaje</b>, puede hacer clic en <b>Vaciar la papelera de reciclaje</b> para quitar permanentemente todos los archivos eliminados que se encuentran en la papelera de reciclaje.</li>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>
</ol>

<h4>Para eliminar una carpeta compartida:</h4>
<ol>
<li>Vaya al <b>Panel de control (modo sencillo)</b> &gt; <b>Carpeta compartida</b>.</li>
<li>Seleccione la carpeta compartida deseada en el panel izquierdo.</li>
<li>Haga clic en el icono de <b>Papelera</b> del panel de la izquierda para eliminar la carpeta compartida seleccionada.</li>

</ol>


<p>____<br> * Solo disponible en ciertos modelos.</p>
</body>
</html>