<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Usuario</h2>
<p>Con opciones de administraci&oacute;n flexible de usuarios, puede crear cuentas de usuarios para miembros individuales de su familia o empresa y definir permisos de acceso a carpetas compartidas para cada persona.</p>

<h4>Para crear un usuario:</h4>
<ol>
<li>Vaya a <b>Panel de control (modo sencillo)</b> &gt; <b>Usuario</b> y haga clic en el s&iacute;mbolo <b>+</b> en el panel izquierdo.</li>
<li>Especifique un nombre y una contrase&ntilde;a para el usuario.</li>
<li>Especifique los grupos a los que pertenecer&aacute; el usuario nuevo.</li>
<li>Asigne los permisos adecuados de carpeta compartida al usuario nuevo. Cuando encuentre conflictos de permisos, la prioridad de los permisos es la siguiente: <b>Sin acceso</b> &gt; <b>Lectura/Escritura</b> &gt; <b>S&oacute;lo lectura</b>.</li>
<ul>
<li><b>Vista previa:</b> Esta columna muestra los privilegios reales de acceso a la carpeta compartida del usuario de acuerdo con la configuraci&oacute;n actual y los grupos a los que pertenece el usuario.</li>
<li><b>Lectura/Escritura:</b> El usuario puede acceder a los archivos y subcarpetas de la carpeta compartida correspondiente y hacer cambios.</li>
<li><b>S&oacute;lo lectura:</b> El usuario puede acceder a los archivos y subcarpetas de la carpeta compartida correspondiente.</li>
<li><b>Sin acceso:</b> El usuario no puede acceder a los archivos ni subcarpetas de la carpeta compartida correspondiente.</li>
</ul>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>

<div class="section">
<h4>Limitaci&oacute;n de nombre de usuario:</h4>
<ul>
<li>El nombre de usuario no distingue entre may&uacute;sculas y min&uacute;sculas y puede incluir de 1 a 64 caracteres Unicode, excluyendo los siguientes s&iacute;mbolos:<br> <b>! &quot; # $ % &amp; &apos; ( ) * + , / : ; < = > ? @ [ ] \ ^ ` { } | ~</b></li>
<li>El primer car&aacute;cter no puede ser un signo menos o un espacio y el &uacute;ltimo no puede ser un espacio.</li>
<li>Los siguientes nombres de usuario est&aacute;n reservados para el uso del sistema:<br> <b>mailer-daemon</b>, <b>postmaster</b></li>
</ul>
<h4>Limitaci&oacute;n de la contrase&ntilde;a:</h4>
<ul>
<li>La contrase&ntilde;a distingue entre may&uacute;sculas y min&uacute;sculas y est&aacute; limitada a 127 caracteres que se puedan mostrar, incluidas letras, n&uacute;meros, signos y espacios.</li>
</ul>
</div>

</ol>
<h4>Para editar un usuario:</h4>
<ol>
<li>Vaya al <b>Panel de control (modo sencillo)</b> &gt; <b>Usuario</b>.</li>
<li>Seleccione el usuario deseado en el panel izquierdo.</li>
<li>Edite la informaci&oacute;n general del usuario, como por ejemplo el nombre, contrase&ntilde;a, grupo y permisos de carpeta compartida.</li>
<li>Marque <b>Deshabilitar esta cuenta</b> si quiere que la cuenta deje de funcionar.</li>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>
</ol>

<h4>Para quitar un usuario:</h4>
<ol>
<li>Vaya al <b>Panel de control (modo sencillo)</b> &gt; <b>Usuario</b>.</li>
<li>Seleccione el usuario deseado en el panel izquierdo.</li>
<li>Haga clic en el icono de <b>Papelera</b> del panel de la izquierda para eliminar el usuario seleccionado.</li>
</ol>
</body>
</html>