<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Actualizaci&oacute;n de DSM</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Actualizaci&oacute;n de DSM</h1>
<p>De manera peri&oacute;dica, Synology publica actualizaciones gratuitas para DSM. Las actualizaciones pueden incluir caracter&iacute;sticas nuevas, mejoras a funciones y mejoras de rendimiento.</p>
<p><span class="note_head">Importante:</span> Normalmente, la actualizaci&oacute;n de DSM no afecta a los datos de DiskStation. Sin embargo, para mayor seguridad de los datos, se recomienda encarecidamente hacer una copia de seguridad de los datos antes de empezar.</p>

<h2>Realizar la actualizaci&oacute;n manual de DSM</h2>
<p>Puede descargar el archivo de actualizaci&oacute;n .pat desde el <a href="http://www.synology.com/support/download.php" target="_blank">Centro de descargas</a> de Synology y realizar la actualizaci&oacute;n manual de DSM.</p>
<h4>Para realizar una actualizaci&oacute;n manual de DSM:</h4>

<ol>
<li>Visite <a href="http://www.synology.com" target="_blank">www.synology.com</a> para descargar la actualizaci&oacute;n de DSM m&aacute;s reciente a su equipo local. Descomprima el archivo para obtener un archivo de actualizaci&oacute;n .pat.</li>
<li>Haga clic en <b>Actualizaci&oacute;n DSM manual</b> para acceder a la p&aacute;gina Actualizaci&oacute;n DSM manual</li>
<li>Haga clic en <b>Examinar</b> para seleccionar el archivo de actualizaci&oacute;n.</li>
<li>Haga clic en <b>Aplicar</b> para comenzar a actualizar DSM. El sistema se reiniciar&aacute; de forma autom&aacute;tica cuando finalice la actualizaci&oacute;n.</li>
</ol>
<div class="section">
<h4>Resoluci&oacute;n de problemas:</h4>
<p>Si no puede actualizar DSM, las siguientes sugerencias pueden ayudarle a solucionar el problema:</p>
<ul>
<li>Compruebe si el proceso de actualizaci&oacute;n ha sido interrumpido por los usuarios, o si se han producido otros eventos inesperados, como un corte el&eacute;ctrico.</li>
<li>Compruebe la versi&oacute;n de DSM. S&oacute;lo puede actualizar el sistema con una versi&oacute;n m&aacute;s reciente de DSM.</li>
<li>Descargue de nuevo la actualizaci&oacute;n de DSM, pues es posible que el archivo de actualizaci&oacute;n est&eacute; da&ntilde;ado.</li>
</ul>
<p>Si contin&uacute;a sin resolver el problema, p&oacute;ngase en contacto con el <a href="https://account.synology.com/support/support_form.php" target="_blank">Soporte t&eacute;cnico</a> de Synology.</p>
</div>

<h2>Realizar la actualizaci&oacute;n autom&aacute;tica de DSM</h2>
<p>Aparte de la actualizaci&oacute;n manual, cada vez que vaya a <b>Actualizaci&oacute;n de DSM</b>, el sistema comprobar&aacute; con Synology para ver si est&aacute; disponible un nuevo DSM para su descarga y mostrar&aacute; a continuaci&oacute;n el resultado en texto verde o rojo. Si los resultados indican que el DSM m&aacute;s reciente est&aacute; listo para su descarga, puede hacer que el sistema descargue autom&aacute;ticamente el &uacute;ltimo DSM y, a continuaci&oacute;n, realizar la actualizaci&oacute;n.</p>
<h4>Para que el sistema descargue el DSM m&aacute;s reciente y realice la actualizaci&oacute;n:</h4>
<ol>
<li>Si el DSM m&aacute;s reciente est&aacute; listo para descargar, haga clic en el v&iacute;nculo <b>Descargar</b> para que el sistema descargue el DSM m&aacute;s reciente.</li>
<li>El sistema mostrar&aacute; cualquiera de las siguientes notificaciones de escritorio para indicarle si la descarga es correcta o no: <b>Descarga DSM completada</b> o <b>Descarga DSM err&oacute;nea</b>.</li>
<li>Haga clic en la ventana de notificaciones de escritorio para acceder a <b>Actualizaci&oacute;n de DSM</b>.</li>
<li>Realice cualquiera de las siguientes operaciones:<ul>
<li>Si la descarga de DSM se ha completado, haga clic en <b>Actualizar ahora</b> para empezar a actualizar DSM de forma inmediata.</li>
<li>Si la descarga de DSM ha sido err&oacute;nea, haga clic en <b>Reintentar</b> para que el sistema vuelva a descargar el DSM m&aacute;s reciente de Synology.</li>
</ul>
</li>
</ol>
<h4>Para comprobar actualizaciones de forma regular:</h4>
<ol>
<li>Marque <b>Buscar actualizaciones de DSM autom&aacute;ticamente</b>.</li>
<li>Seleccione un plan de actualizaci&oacute;n y configure el <b>Programa de instalaci&oacute;n</b>.</li>
<li>Haga clic en <b>OK</b>.</li>
</ol>
<p>Se mostrar&aacute; una notificaci&oacute;n en el escritorio cuando la actualizaci&oacute;n de DSM se haya descargado y est&eacute; lista para la instalaci&oacute;n. Para evitar que DSM se actualice autom&aacute;ticamente, puede cancelar esta opci&oacute;n en las notificaciones de escritorio o cambiando la <strong>Configuraci&oacute;n de actualizaciones</strong>. Las actualizaciones de DSM se instalar&aacute;n antes de los apagados programados si ha habilitado <strong>Apagar</strong> en <strong>Programa de energ&iacute;a</strong>.</p>

<div class="section">
<h4>Resoluci&oacute;n de problemas:</h4>
<p>Si ve mensajes de error (en el texto en rojo) durante la comprobaci&oacute;n o descarga del DSM m&aacute;s reciente, los siguientes consejos pueden ayudarle a solucionar el problema:</p>
<ul>
<li>Compruebe que su DiskStation est&eacute; conectado a Internet.</li>
<li>Es posible que el servidor de descargas de Synology est&eacute; ocupado en este momento. Vuelva a intentar la descarga m&aacute;s adelante.</li>
</ul>
<p>Si contin&uacute;a sin resolver el problema, p&oacute;ngase en contacto con el <a href="https://account.synology.com/support/support_form.php" target="_blank">Soporte t&eacute;cnico</a> de Synology.</p>
</div>

</body>
</html>
