<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="login"></a>Estilo de inicio de sesi&oacute;n</h2>

<p>Puede personalizar el aspecto de la pantalla de inicio de sesi&oacute;n de DSM eligiendo de entre una gran variedad de plantillas, cambiando la imagen de fondo o agregando un logotipo. Para hacer esto, vaya a <strong>Panel de control</strong> &gt; <strong>Estilo de inicio de sesi&oacute;n</strong>.</p>

<h4>Para personalizar la pantalla de inicio de sesi&oacute;n a DSM:</h4>
<p>Las siguientes opciones aparecer&aacute;n en la p&aacute;gina de <strong>Estilo de inicio de sesi&oacute;n</strong>:</p>
<ul>
<li><strong>T&iacute;tulo de p&aacute;gina de inicio de sesi&oacute;n:</strong> El texto introducido aqu&iacute; aparece en la pantalla de inicio de sesi&oacute;n.</li>
<li><strong>Informaci&oacute;n del tiempo:</strong> Elija mostrar u ocultar informaci&oacute;n del tiempo local en la pantalla de inicio de sesi&oacute;n.</li>
<li><strong>Plantilla:</strong> Seleccione una paleta de colores y una imagen de fondo predeterminada. La plantilla elegida tendr&aacute; efecto la siguiente ocasi&oacute;n en la que conecte a DiskStation.</li>
<li><strong>Fondo:</strong> Para cambiar la imagen de fondo que aparece en la pantalla de inicio de sesi&oacute;n, haga clic en la imagen actual o el signo m&aacute;s (<strong>+</strong>) si no ha seleccionado ninguna imagen previamente. Puede elegir fondos de pantalla predeterminados, im&aacute;genes almacenadas en DiskStation o im&aacute;genes utilizadas previamente. Los formatos de archivos de imagen compatibles son &uacute;nicamente JPE, JPEG, JPG, BMP, GIF o PNG.</li>
<li><strong>Logotipo:</strong> Para agregar un logotipo a la pantalla de inicio de sesi&oacute;n, haga clic en el logotipo actual o el signo m&aacute;s (<strong>+</strong>) si no ha seleccionado ninguna imagen previamente. Puede cargar una imagen menor de 1 MB, elegir im&aacute;genes almacenadas en DiskStation o seleccionar una imagen utilizada previamente.</li>
</ul>

</body>
</html>

