<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Notificaci&oacute;n</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Avanzada</h2>
<p>Puede seleccionar los tipos de eventos que activar&aacute;n el sistema para que env&iacute;e mensajes de notificaci&oacute;n as&iacute; como el medio (correo electr&oacute;nico, SMS, m&oacute;vil y programas de mensajer&iacute;a instant&aacute;nea) en que recibir&aacute; los mensajes. </p>
<p>Cada uno de los eventos tiene su propio mensaje de notificaci&oacute;n predeterminado, pero usted tambi&eacute;n cuenta con la opci&oacute;n de personalizar su propio contenido de notificaci&oacute;n editando el mensaje de notificaci&oacute;n. El mensaje predeterminado puede restaurarse si decide rechazar m&aacute;s tarde su configuraci&oacute;n personalizada.</p>

<ul class="disable-eds14">
<li><strong>Todas las notificaciones</strong>: Como el nombre indica, incluye todo tipo de eventos de notificaciones.</li>
<li><b>Por prioridad:</b> Seg&uacute;n la importancia de los eventos de notificaci&oacute;n, se filtrar&aacute;n en dos grupos: <strong>Cr&iacute;tico</strong> e <strong>Informativo</strong>.</li>
<ul>
<li><b>Cr&iacute;tico</b>: Los eventos que requieren que tome acciones correctivas de inmediato pertenecen a este grupo.</li>
<li><strong>Informativo</strong>: Los eventos que no requieren acciones correctivas y tiene por objetivo informarle del cambio de estado del sistema pertenecen a este grupo.</li>
</ul>
<li><b>Por categor&iacute;a</b>: En funci&oacute;n de la naturaleza de los eventos de notificaciones, se filtran en seis grupos: <strong>Sistema</strong>, <strong>Almacenamiento interno</strong>, <strong>Copia de seguridad y restauraci&oacute;n</strong>, <strong>Alimentaci&oacute;n</strong>, <strong>USBCopy</strong>, <strong>CMS</strong> y <strong>Almacenamiento externo</strong>.</li>
<ul>
<li><b>Sistema</b>: Los eventos correspondientes a errores del sistema o cambios pertenecen a este grupo.</li>
<li><strong>Almacenamiento interno</strong>: Los eventos correspondientes al almacenamiento interno pertenecen a este grupo.</li>
<li><strong>Copia de seguridad y restauraci&oacute;n</strong>: Los eventos correspondientes a tareas de copia de seguridad y restauraci&oacute;n pertenecen a este grupo.</li>
<li><strong>Alimentaci&oacute;n</strong>: Los eventos correspondientes a la alimentaci&oacute;n pertenecen a este grupo. </li>
<li><strong>USBCopy</strong>: Los eventos correspondientes a USBCopy pertenecen a este grupo.</li>
<li><strong>CMS</strong>: Los eventos correspondientes a la conexi&oacute;n/desconexi&oacute;n con el host de CMS pertenecen a este grupo.</li>
<li><strong>Almacenamiento externo</strong>: Los eventos correspondientes al almacenamiento externo pertenecen a este grupo.</li>
</ul>
</ul>

<ul class="enable-eds14">
<li><strong>Todas las notificaciones</strong>: Como el nombre indica, incluye todo tipo de eventos de notificaciones.</li>
<li><b>Por prioridad:</b> Seg&uacute;n la importancia de los eventos de notificaci&oacute;n, se filtrar&aacute;n en dos grupos: <strong>Cr&iacute;tico</strong> e <strong>Informativo</strong>.</li>
<ul>
<li><b>Cr&iacute;tico</b>: Los eventos que requieren que tome acciones correctivas de inmediato pertenecen a este grupo.</li>
<li><strong>Informativo</strong>: Los eventos que no requieren acciones correctivas y tiene por objetivo informarle del cambio de estado del sistema pertenecen a este grupo.</li>
</ul>
<li><b>Por categor&iacute;a</b>: En funci&oacute;n de la naturaleza de los eventos de notificaciones, se filtran en seis grupos: <strong>Sistema</strong>, <strong>Almacenamiento interno</strong>, <strong>Copia de seguridad y restauraci&oacute;n</strong>, <strong>Alimentaci&oacute;n</strong>, y <strong>Almacenamiento externo</strong>.</li>
<ul>
<li><b>Sistema</b>: Los eventos correspondientes a errores del sistema o cambios pertenecen a este grupo.</li>
<li><strong>Copia de seguridad y restauraci&oacute;n</strong>: Los eventos correspondientes a tareas de copia de seguridad y restauraci&oacute;n pertenecen a este grupo.</li>
<li><strong>Alimentaci&oacute;n</strong>: Los eventos correspondientes a la alimentaci&oacute;n pertenecen a este grupo. </li>
<li><strong>CMS</strong>: Los eventos correspondientes a la conexi&oacute;n/desconexi&oacute;n con el host de CMS pertenecen a este grupo.</li>
<li><strong>Almacenamiento externo</strong>: Los eventos correspondientes al almacenamiento externo pertenecen a este grupo.</li>
</ul>
</ul>



<h4>Para seleccionar los tipos y el medio de eventos de notificaci&oacute;n:</h4>
<ol>
<li>Seleccione un grupo de eventos del men&uacute; desplegable bajo las fichas. Se mostrar&aacute;n los eventos del grupo seleccionado.</li>
<li>Marque las casillas de verificaci&oacute;n para cada uno de los eventos para seleccionar el medio de notificaci&oacute;n que prefiera.</li>
<li>Haga clic en <b>Guardar</b> para aplicar la configuraci&oacute;n.</li>
</ol>
<h4>Para editar mensaje de notificaci&oacute;n:</h4>
<ol>
<li>Seleccione un evento cuyo mensaje de notificaci&oacute;n desee editar de la lista de eventos y luego haga clic en <b>Editar mensaje</b>.</li>
<li>En la ventana que aparece, escriba la l&iacute;nea de asunto y el contenido del cuerpo para personalizar el mensaje de notificaci&oacute;n y luego haga clic en <strong>Guardar</strong> para aplicar los cambios.</li>
<li>Si desea restaurar el mensaje predeterminado de una notificaci&oacute;n una vez guardados los cambios, haga lo siguiente:</li>
<ol>
<li>Seleccione un evento cuyo mensaje de notificaci&oacute;n desee restaurar a sus valores predeterminados de la lista de eventos y luego haga clic en <b>Editar mensaje</b>.</li>
<li>En la ventana que aparece, haga clic en <b>Restaurar los valores por defecto</b> y luego en <strong>S&iacute;</strong> en el cuadro de di&aacute;logo de confirmaci&oacute;n.</li>
</ol>
</ol>

<p><span class="note_head">Nota:</span> Se recomienda que reserve los segmentos de cadenas que contengan &apos;%&apos; tanto en la l&iacute;nea de asunto como en el contenido del cuerpo. Se sustituir&aacute;n por la informaci&oacute;n real del sistema cuando se env&iacute;e una notificaci&oacute;n.</p>
</body>
</html>
