<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SNMP</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SNMP</h2>

<p>El servicio SNMP (en <strong>Panel de control</strong> &gt; <strong>Terminal y SNMP</strong> &gt; <strong>SNMP</strong>) que permite a los usuarios controlar DiskStation con el software de administraci&oacute;n de red. En la actualidad, se admiten los protocolos SNMPv1, SNMPv2c y SNMPv3. </p>


<h3>Habilitar servicio SNMP</h3>

<p>Marque <b>Habilitar servicio SNMP</b> y siga estos pasos.</p>
<h4>Para habilitar el servicio SNMPv1, SNMPv2c:</h4>
<ol>
<li>Marque <b>Servicio SNMPv1, SNMPv2c</b>.<li>Escriba un nombre de <b>Comunidad</b>.<li>Haga clic en <b>Aplicar.</b></ol>
<h4>Para habilitar el servicio SNMPv3:</h4>
<ol>
<li>Marque <b>Servicio SNMPv3</b>.<li>Introduzca un <b>Nombre de usuario</b> y <b>Contrase&ntilde;a</b>. Vuelva a introducir su contrase&ntilde;a para <b>Confirmar contrase&ntilde;a</b>.<li>Haga clic en <b>Aplicar</b>.</ol>
<p>Adem&aacute;s, si introduce <b>Nombre</b>, <b>Ubicaci&oacute;n</b> y <b>Contacto</b>, le resultar&aacute; m&aacute;s f&aacute;cil identificar su DiskStation. Estos campos son opcionales.</p>


<div class="section">
<h4>Nota:</h4>
<ol>
<li>IPv4 y IPv6 son compatibles con el servicio SNMP. </li>
<li>El servicio SNMP admite SNMPv1, SNMPv2c y SNMPv3 al mismo tiempo. </li>
</ol>
</div>


<div class="section">
<h4>Limitaci&oacute;n del nombre de comunidad de SNMPv1, SNMPv2c:</h4>
<p>El nombre de comunidad debe contener entre 1 y 64 caracteres visibles. Los siguientes caracteres no est&aacute;n permitidos: <br>&quot; &apos; \ y espacio.</p>
<h4>Limitaci&oacute;n del nombre de usuario de SNMPv3:</h4>
<p>El nombre de usuario debe contener entre 1 y 64 caracteres visibles. Los siguientes caracteres no est&aacute;n permitidos: <br>&quot; &apos; \ y espacio.</p>
<h4>Limitaci&oacute;n de la contrase&ntilde;a de SNMPv3:</h4>
<p>La contrase&ntilde;a distingue entre may&uacute;sculas y min&uacute;sculas, y debe contener entre 8 y 127 caracteres visibles, incluyendo letras, n&uacute;meros y signos. Los siguientes caracteres no est&aacute;n permitidos: <br>&quot; &apos; \ y espacio.</p>
<p>&nbsp;</p>
</div>
<h3>Descargar archivos MIB de Synology</h3>
<p class="disable-eds14">Synology ofrece la posibilidad de controlar DiskStation a trav&eacute;s de sistemas de gesti&oacute;n de red, incluyendo sistema, disco y estado de vol&uacute;menes RAID.</p>

<p class="enable-eds14">Synology ofrece la posibilidad de controlar DiskStation a trav&eacute;s de sistemas de gesti&oacute;n de red, incluyendo sistema, disco y estado de vol&uacute;menes.</p>

<p>Visite el <a href="http://www.synology.com/support/snmp_mib" target="_blank">sitio web de Synology</a> para obtener m&aacute;s informaci&oacute;n y descargar archivos relacionados.</p>

<div class="section">
<h4>Nota:</h4>
<p>Los sistemas de gesti&oacute;n de red se basan en archivos MIB para las definiciones de los dispositivos controlados. Para obtener m&aacute;s informaci&oacute;n, haga clic: <a href="http://en.wikipedia.org/wiki/Management_information_base" target="_blank">aqu&iacute;</a>.</p>
</div>

</body>
</html>
