<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Vis&atilde;o geral</h2>
	<p>Essa p&aacute;gina exibe o status geral dos alvos dos seus instant&acirc;neos e dos instant&acirc;neos propriamente ditos.</p>
<h3>Resumo</h3>
	<p>Esta se&ccedil;&atilde;o exibe tr&ecirc;s status listados abaixo dos alvos dos instant&acirc;neos (incluindo as pastas compartilhadas e iSCSI LUNs). Os tamanhos totais dos alvos dos instant&acirc;neos nos respectivos status s&atilde;o apresentados nesta se&ccedil;&atilde;o tamb&eacute;m.</p>
	<ul>
		<li><b>Instant&acirc;neo programado</b>: A realiza&ccedil;&atilde;o do instant&acirc;neo dos alvos de instant&acirc;neos est&aacute; programada.</li>
		<li><b>N&atilde;o programado</b>: Os instant&acirc;neos foram tirados para os alvos dos instant&acirc;neos, mas a realiza&ccedil;&atilde;o do instant&acirc;neo n&atilde;o est&aacute; programada.</li>
		<li><b>N&atilde;o protegido</b>: Nenhum instant&acirc;neo foi tirado para os alvos de instant&acirc;neos.</li> 
   </ul>
<h3>Instant&acirc;neos recentes</h3>
	<p>Esta se&ccedil;&atilde;o apresenta uma linha do tempo dos instant&acirc;neos categorizados para facilitar a recupera&ccedil;&atilde;o de seus dados.</p>
<h4>Para restaurar/clonar suas pastas compartilhadas ou iSCSI LUNs de instant&acirc;neos recentes:</h4>
<ol>
	<li>Clique no &iacute;cone do calend&aacute;rio e selecione a data para a qual deseja restaurar os dados.</li>
  <li>Arraste a linha do tempo para voltar ou avan&ccedil;ar e selecione um ponto espec&iacute;fico no tempo em que os instant&acirc;neos foram tirados.</li>
	<li>Selecione uma pasta compartilhada ou um iSCSI LUN que deseje restaurar/clonar.</li>
  <li>Voc&ecirc; ser&aacute; direcionado para a p&aacute;gina <strong>Recupera&ccedil;&atilde;o</strong>. Para obter mais informa&ccedil;&otilde;es sobre as etapas seguintes, consulte <a href="recovery.html">Recupera&ccedil;&atilde;o</a>.</li>
</ol>
</body>
</html>
