<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Recupera&ccedil;&atilde;o</h2>
<p>Essa p&aacute;gina permite que os administradores do sistema realizem a recupera&ccedil;&atilde;o. Para permitir que os usu&aacute;rios acessem os instant&acirc;neos da pasta compartilhada, habilite <strong>Tornar o instant&acirc;neo vis&iacute;vel</strong> para cada pasta compartilhada para que os usu&aacute;rios possam acessar os instant&acirc;neos atrav&eacute;s do File Station ou Explorador de arquivos do Windows.</p>
<h3>Pasta Compartilhada</h3>
<h4>Para restaurar arquivos/pastas individuais em uma pasta compartilhada:</h4>
<ol>
	<li>Selecione a pasta compartilhada que deseje restaurar.</li>
	<li>Clique em <strong>Recuperar</strong>.</li>
	<li>Selecione uma vers&atilde;o do instant&acirc;neo do qual deseje restaurar.</li>
  <li>Clique em <strong>Procurar</strong> e copie os arquivos/pastas que deseja restaurar para o destino.</li>
</ol>
<h4>Para restaurar uma pasta compartilhada:</h4>
<ol>
	<li>Selecione a pasta compartilhada que deseje restaurar.</li>
	<li>Clique em <strong>Recuperar</strong>.</li>
	<li>Selecione uma vers&atilde;o do instant&acirc;neo do qual deseje restaurar.</li>
	<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Restaurar no local</strong> da lista suspensa.</li>
  <li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para clonar um instant&acirc;neo para uma nova pasta compartilhada:</h4>
<ol>
<li>Selecione a pasta compartilhada que deseje clonar.</li>
<li>Clique em <strong>Recuperar</strong>.</li>
<li>Selecione uma vers&atilde;o do instant&acirc;neo que deseja clonar para uma nova pasta compartilhada.</li>
<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Clonar com um novo nome</strong> da lista suspensa.</li>
<li>Voc&ecirc; ser&aacute; redirecionado para a p&aacute;gina <strong>Clonar</strong> em <strong>Painel de controle</strong> &gt; <strong>Pasta compartilhada</strong> &gt; <strong>Criar</strong>. Digite o nome da pasta compartilhada clonada e clique em <strong>OK</strong> para concluir.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>A pasta compartilhada &quot;homes&quot; n&atilde;o pode ser restaurada.</li>
	<li>As pastas compartilhadas clonadas n&atilde;o podem ser criptografadas.</li>
	<li>Se um instant&acirc;neo for tirado enquanto a transfer&ecirc;ncia de qualquer arquivo ainda estiver em andamento, a consist&ecirc;ncia dos dados n&atilde;o ser&aacute; garantida.</li>
	<li>Limita&ccedil;&otilde;es sobre pastas compartilhadas criptografadas:
		<ul>
			<li>Nenhum dos tipos de recupera&ccedil;&atilde;o est&aacute; dispon&iacute;vel para as pastas compartilhadas criptografadas montadas.</li>
			<li><strong>Clonar com um novo nome</strong> n&atilde;o est&aacute; dispon&iacute;vel para as pastas compartilhadas criptografadas.</li>
			<li>As pastas compartilhadas criptografadas desmontadas podem ser restauradas de instant&acirc;neos tirados anteriormente usando-se <strong>Restaurar no local</strong>.</li>
		</ul>
	</li>
</ul>
</div>
<h4>Para mudar a replica&ccedil;&atilde;o de uma pasta compartilhada:</h4>
<ol>
	<li>Selecione a pasta compartilhada replicada que deseje mudar.</li>
	<li>Clique em <strong>Mudan&ccedil;a</strong>.</li>
	<li>Selecione o novo servidor de destino se houver v&aacute;rias tarefas de replica&ccedil;&atilde;o da pasta compartilhada.</li>
	<li>Clique em <strong>Mudan&ccedil;a</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para fazer failover em um replica&ccedil;&atilde;o de pasta compartilhada:</h4>
<ol>
	<li>Selecione a pasta compartilhada replicada que deseje fazer failover.</li>
	<li>Clique em <strong>Failover</strong> &gt; <strong>Failover</strong>.</li>
	<li>Selecione a vers&atilde;o do instant&acirc;neo para restaurar.</li>
	<li>Clique em <strong>Failover</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Voc&ecirc; pode iniciar um Failover somente ap&oacute;s falha do servidor de origem.</li>
</ul>
</div>
<h4>Para proteger novamente a replica&ccedil;&atilde;o de uma pasta compartilhada:</h4>
<p>Quando houver failover no servidor de destino, a tarefa de replica&ccedil;&atilde;o interromper&aacute; a sincroniza&ccedil;&atilde;o de dados entre os dois servidores. Ser&aacute; necess&aacute;rio proteger novamente a tarefa de replica&ccedil;&atilde;o ap&oacute;s a recupera&ccedil;&atilde;o do servidor de origem original.</p>
<ol>
<li>Selecione a pasta compartilhada com failover que deseje proteger novamente.</li>
<li>Clique em <strong>Failover</strong> &gt; <strong>Proteger novamente</strong>.</li>
<li>Selecione o novo servidor de origem.</li>
<li>Selecione o novo servidor de destino se houver v&aacute;rias tarefas de replica&ccedil;&atilde;o da pasta compartilhada.</li>
<li>Clique em <strong>Proteger novamente</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Os dados da pasta compartilhada replicada existentes no novo servidor de destino ser&atilde;o sobrescritos pelos do novo servidor de origem.</li>
	<li>Se a vers&atilde;o do instant&acirc;neo selecionado para o failover n&atilde;o existir no servidor parceiro, pode levar mais tempo para proteger novamente.</li>
</ul>
</div>
<h4>Para realizar um teste de failover para uma pasta compartilhada replicada:</h4>
<ol>
	<li>Selecione a pasta compartilhada replicada que deseje testar.</li>
	<li>Clique em <strong>Failover de teste</strong> &gt; <strong>Failover de teste</strong>.</li>
	<li>Selecione o <strong>Servidor de teste</strong> se houver v&aacute;rias tarefas de replica&ccedil;&atilde;o da pasta compartilhada.</li>
	<li>Digite o <strong>Nome do failover de teste</strong> da pasta compartilhada e selecione uma vers&atilde;o do instant&acirc;neo para testar.</li>
	<li>Clique em <strong>Failover de teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>A realiza&ccedil;&atilde;o de uma mudan&ccedil;a/failover de uma replica&ccedil;&atilde;o limpar&aacute; seu teste de failover.</li>
	<li>N&atilde;o &eacute; poss&iacute;vel criar uma tarefa de replica&ccedil;&atilde;o para uma pasta compartilhada de failover de teste.</li>
</ul>
</div>
<h4>Para limpar um failover de teste de uma pasta compartilhada replicada:</h4>
<ol>
	<li>Selecione a pasta compartilhada replicada da qual voc&ecirc; deseja limpar o failover de teste.</li>
	<li>Clique em <strong>Failover de teste</strong> &gt; <strong>Limpeza do failover de teste</strong>.</li>
	<li>Marque o failover de teste que deseja limpar.<br /><span class="note_head">Nota:</span> Marque <strong>Excluir dados do failover de teste</strong> se n&atilde;o quiser mais manter a pasta compartilhada criada para o failover de teste.</li>
	<li>Clique em <strong>Limpeza do failover de teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<h3>iSCSI LUN</h3>
<h4>Para restaurar um iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN que deseja restaurar.</li>
	<li>Clique em <strong>Recuperar</strong>.</li>
	<li>Selecione uma vers&atilde;o do instant&acirc;neo do qual deseje restaurar.</li>
	<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Restaurar no local</strong> da lista suspensa.</li>
  <li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para clonar um instant&acirc;neo para um novo iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN que deseja clonar.</li>
	<li>Clique em <strong>Recuperar</strong>.</li>
	<li>Selecione uma vers&atilde;o do instant&acirc;neo que deseja clonar para um novo iSCSI LUN.</li>
	<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Clonar com um novo nome</strong> da lista suspensa.</li>
	<li>Voc&ecirc; ser&aacute; redirecionado para a p&aacute;gina <strong>Clonar</strong> em <strong>Gerenciador de armazenamento</strong> &gt; <strong>iSCSI LUN</strong>. Digite o nome do iSCSI LUN clonado e clique em <strong>OK</strong> para concluir.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Se um instant&acirc;neo for tirado enquanto a transfer&ecirc;ncia de qualquer arquivo ainda estiver em andamento, a consist&ecirc;ncia dos dados n&atilde;o ser&aacute; garantida.</li>
</ul>
</div>
<h4>Para mudar a replica&ccedil;&atilde;o de uma pasta compartilhada:</h4>
<ol>
	<li>Selecione o iSCSI LUN replicado que deseje mudar.</li>
	<li>Clique em <strong>Mudan&ccedil;a</strong>.</li>
	<li>Selecione o novo servidor de destino se houver v&aacute;rias tarefas de replica&ccedil;&atilde;o do iSCSI LUN.</li>
	<li>Clique em <strong>Mudan&ccedil;a</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para fazer failover em um replica&ccedil;&atilde;o do iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN replicado que deseje fazer o failover.</li>
	<li>Clique em <strong>Failover</strong> &gt; <strong>Failover</strong>.</li>
	<li>Selecione a vers&atilde;o do instant&acirc;neo para restaurar.</li>
	<li>Clique em <strong>Failover</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Voc&ecirc; pode iniciar um Failover somente ap&oacute;s falha do servidor de origem.</li>
</ul>
</div>
<h4>Para proteger novamente a replica&ccedil;&atilde;o de um iSCSI LUN:</h4>
<p>Quando houver failover no servidor de destino, a tarefa de replica&ccedil;&atilde;o interromper&aacute; a sincroniza&ccedil;&atilde;o de dados entre os dois servidores. Ser&aacute; necess&aacute;rio proteger novamente a tarefa de replica&ccedil;&atilde;o ap&oacute;s a recupera&ccedil;&atilde;o do servidor de origem original.</p>
<ol>
<li>Selecione o iSCSI LUN com failover que deseje proteger novamente.</li>
<li>Clique em <strong>Failover</strong> &gt; <strong>Proteger novamente</strong>.</li>
<li>Selecione o novo servidor de origem.</li>
<li>Selecione o novo servidor de destino se houver v&aacute;rias tarefas de replica&ccedil;&atilde;o do iSCSI LUN.</li>
<li>Clique em <strong>Proteger novamente</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Os dados do iSCSI LUN replicado existentes no novo servidor de destino ser&atilde;o sobrescritos pelos do novo servidor de origem.</li>
	<li>Se a vers&atilde;o do instant&acirc;neo selecionado para o failover n&atilde;o existir no servidor parceiro, pode levar mais tempo para proteger novamente.</li>
</ul>
</div>
<h4>Para realizar um teste de failover para um iSCSI LUN replicado:</h4>
<ol>
	<li>Selecione o iSCSI LUN replicado que deseje testar.</li>
	<li>Clique em <strong>Failover de teste</strong> &gt; <strong>Failover de teste</strong>.</li>
	<li>Selecione o <strong>Servidor de teste</strong> se houver v&aacute;rias tarefas de replica&ccedil;&atilde;o do iSCSI LUN.</li>
	<li>Digite o <strong>Nome do failover de teste</strong> do iSCSI LUN e selecione uma vers&atilde;o do instant&acirc;neo para testar.</li>
	<li>Clique em <strong>Failover de teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>A realiza&ccedil;&atilde;o de uma mudan&ccedil;a/failover de uma replica&ccedil;&atilde;o limpar&aacute; seu teste de failover.</li>
	<li>N&atilde;o &eacute; poss&iacute;vel criar uma tarefa de replica&ccedil;&atilde;o para um iSCSI LUN de failover de teste.</li>
</ul>
</div>
<h4>Para limpar um failover de teste de um iSCSI LUN replicado:</h4>
<ol>
	<li>Selecione o iSCSI LUN replicado do qual voc&ecirc; deseja limpar o failover de teste.</li>
	<li>Clique em <strong>Failover de teste</strong> &gt; <strong>Limpeza do failover de teste</strong>.</li>
	<li>Marque o failover de teste que deseja limpar.<br /><span class="note_head">Nota:</span> Marque <strong>Excluir dados do failover de teste</strong> se n&atilde;o quiser mais manter o iSCSI LUN criado para o failover de teste.</li>
	<li>Clique em <strong>Limpeza do failover de teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>
</body>
</html>
