<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Replica&ccedil;&atilde;o</h2>
<p>Essa p&aacute;gina permite que os administradores do sistema gerenciem as replica&ccedil;&otilde;es. Voc&ecirc; pode criar, editar e excluir tarefas de replica&ccedil;&atilde;o. Voc&ecirc; tamb&eacute;m pode executar/interromper a sincroniza&ccedil;&atilde;o e visualizar as informa&ccedil;&otilde;es de suas tarefas de replica&ccedil;&atilde;o.</p>
<h3>Pasta Compartilhada</h3>
<h4>Para criar uma tarefa de replica&ccedil;&atilde;o para uma pasta compartilhada:</h4>
<ol>
	<li>Va para a guia <strong>Pasta compartilhada</strong>:</li>
	<li>Clique em <strong>Criar</strong>.</li>
	<li>Voc&ecirc; ver&aacute; o assistente <strong>Criar tarefa de replica&ccedil;&atilde;o</strong>. Siga as etapas do assistente para criar uma replica&ccedil;&atilde;o de pasta compartilhada.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>A pasta compartilhada &quot;homes&quot; n&atilde;o pode ser replicada.</li>
	<li>A pasta compartilhada criptografada n&atilde;o pode ser replicada.</li>
	<li>A pasta compartilhada deve ser localizada em um volume Btrfs.</li>
	<li>Voc&ecirc; pode criar <a href="#multiple_replication">replica&ccedil;&otilde;es estendidas/um para muitos</a> para uma pasta compartilhada para diferentes servidores de destino. Entretanto, voc&ecirc; pode criar somente uma replica&ccedil;&atilde;o para um servidor de destino para cada pasta compartilhada.</li>
</ul>
</div>
<h4>Para excluir uma replica&ccedil;&atilde;o de pasta compartilhada:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o da pasta compartilhada que deseja excluir.</li>
	<li>Clique em <strong>Excluir</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Excluir</strong> para confirmar a exclus&atilde;o.</li>
</ol>
<h4>Para editar uma replica&ccedil;&atilde;o de pasta compartilhada:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o da pasta compartilhada que deseja editar.</li>
	<li>Clique em <strong>Editar</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma janela contendo as seguintes guias:
	  <ul>
			<li>Servidor parceiro</li>
			<li>Programa&ccedil;&atilde;o</li>
			<li>Reten&ccedil;&atilde;o</li>
		</ul>
	</li>
	<li>Na guia <strong>Servidor parceiro</strong>, voc&ecirc; pode editar as informa&ccedil;&otilde;es do servidor parceiro, incluindo nome do host, porta, nome de usu&aacute;rio e senha.</li>
	<li>Na guia <strong>Programa&ccedil;&atilde;o</strong> marque a caixa de sele&ccedil;&atilde;o <strong>Habilitar programa&ccedil;&atilde;o de instant&acirc;neo</strong> e ajuste o tempo e a frequ&ecirc;ncia para tirar instant&acirc;neos. Voc&ecirc; pode desmarcar a caixa de sele&ccedil;&atilde;o para cancelar os instant&acirc;neos programados para a pasta compartilhada.</li>
	<li>Na guia <strong>Reten&ccedil;&atilde;o</strong>, selecione qualquer uma das seguintes op&ccedil;&otilde;es:
		<ul>
			<li><strong>Manter 256 &uacute;ltimos instant&acirc;neos:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos (256) for atingido, os instant&acirc;neos mais antigos ser&atilde;o sobrescritos pelos mais novos.</li>
			<li><strong>Sempre manter instant&acirc;neos:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos for atingido, a fun&ccedil;&atilde;o Instant&acirc;neo e replica&ccedil;&atilde;o parar&aacute; de tirar novos instant&acirc;neos sem remover os j&aacute; tirados.</li>
			<li><strong>Manter os instant&acirc;neos com a pol&iacute;tica a seguir:</strong> Voc&ecirc; pode configurar as regras de reten&ccedil;&atilde;o para as faixas de tempo especificadas.</li>
		</ul>
	</li>
	<li>Clique em <strong>OK</strong> para aplicar as novas configura&ccedil;&otilde;es.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Voc&ecirc; pode editar apenas a programa&ccedil;&atilde;o da tarefa de replica&ccedil;&atilde;o no servidor de origem.</li>
	<li>A altera&ccedil;&atilde;o das configura&ccedil;&otilde;es de reten&ccedil;&atilde;o afetar&aacute; as configura&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Instant&acirc;neo</strong>.</li>
</ul>
</div>
<h4>Para visualizar as informa&ccedil;&otilde;es da replica&ccedil;&atilde;o da pasta compartilhada:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o da pasta compartilhada que deseja visualizar.</li>
	<li>Clique em <strong>Informa&ccedil;&otilde;es</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma janela contendo as seguintes informa&ccedil;&otilde;es:
	  <ul>
			<li><strong>Status</strong> dessa replica&ccedil;&atilde;o.</li>
			<li><strong>Estat&iacute;sticas</strong> dessa replica&ccedil;&atilde;o.</li>
		</ul>
	</li>
</ol>
<h4>Para executar a sincroniza&ccedil;&atilde;o de uma replica&ccedil;&atilde;o de pasta compartilhada:</h4>
<ol>
	<li>Selecione a replica&ccedil;&atilde;o da pasta compartilhada que deseja sincronizar.</li>
	<li>Clique em <strong>Executar</strong>.</li>
	<li>Digite a descri&ccedil;&atilde;o do instant&acirc;neo a ser tirado.</li>
	<li>Clique em <strong>OK</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para interromper a sincroniza&ccedil;&atilde;o de uma replica&ccedil;&atilde;o de pasta compartilhada:</h4>
<ol>
	<li>Selecione a sincroniza&ccedil;&atilde;o da replica&ccedil;&atilde;o da pasta compartilhada que deseja interromper.</li>
	<li>Clique em <strong>Interromper</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Interromper</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h3>iSCSI LUN</h3>
<h4>Para criar uma tarefa de replica&ccedil;&atilde;o para um iSCSI LUN:</h4>
<ol>
	<li>V&aacute; para a guia <strong>iSCSI LUN</strong>.</li>
	<li>Clique em <strong>Criar</strong>.</li>
	<li>Voc&ecirc; ver&aacute; o assistente <strong>Criar tarefa de replica&ccedil;&atilde;o</strong>. Siga as etapas do assistente para criar uma replica&ccedil;&atilde;o de iSCSI LUN.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>O iSCSI LUN deve ter sido criado como <strong>LUN avan&ccedil;ado</strong>.</li>
	<li>Voc&ecirc; pode criar <a href="#multiple_replication">replica&ccedil;&otilde;es estendidas/um para muitos</a> para um iSCSI LUN para diferentes servidores de destino. Entretanto, voc&ecirc; pode criar somente uma replica&ccedil;&atilde;o para um servidor de destino para cada iSCSI LUN.</li>
</ul>
</div>
<h4>Para excluir uma replica&ccedil;&atilde;o de iSCSI LUN:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o do iSCSI LUN que deseja excluir.</li>
	<li>Clique em <strong>Excluir</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Excluir</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para editar uma replica&ccedil;&atilde;o do iSCSI LUN:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o do iSCSI LUN que deseja editar.</li>
	<li>Clique em <strong>Editar</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma janela contendo as seguintes guias:
	  <ul>
			<li>Servidor parceiro</li>
			<li>Programa&ccedil;&atilde;o</li>
			<li>Reten&ccedil;&atilde;o</li>
		</ul>
	</li>
	<li>Na guia <strong>Servidor parceiro</strong>, voc&ecirc; pode editar as informa&ccedil;&otilde;es do servidor parceiro, incluindo nome do host, porta, nome de usu&aacute;rio e senha.</li>
	<li>Na guia <strong>Programa&ccedil;&atilde;o</strong> marque a caixa de sele&ccedil;&atilde;o <strong>Habilitar programa&ccedil;&atilde;o de instant&acirc;neo</strong> e ajuste o tempo e a frequ&ecirc;ncia para tirar instant&acirc;neos. Voc&ecirc; pode desmarcar a caixa de sele&ccedil;&atilde;o para cancelar os instant&acirc;neos programados para o iSCSI LUN.</li>
	<li>Na guia <strong>Reten&ccedil;&atilde;o</strong>, selecione qualquer uma das seguintes op&ccedil;&otilde;es:
		<ul>
			<li><strong>Manter 256 &uacute;ltimos instant&acirc;neos:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos (256) for atingido, os instant&acirc;neos mais antigos ser&atilde;o sobrescritos pelos mais novos.</li>
			<li><strong>Sempre manter instant&acirc;neos:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos for atingido, a fun&ccedil;&atilde;o Instant&acirc;neo e replica&ccedil;&atilde;o parar&aacute; de tirar novos instant&acirc;neos sem remover os j&aacute; tirados.</li>
			<li><strong>Manter os instant&acirc;neos com a pol&iacute;tica a seguir:</strong> Voc&ecirc; pode configurar as regras de reten&ccedil;&atilde;o para as faixas de tempo especificadas.</li>
		</ul>
	</li>
	<li>Na guia <strong>Aplicativo</strong>, marque <strong>Habilitar instant&acirc;neos consistentes com o aplicativo</strong> para habilitar os instant&acirc;neos consistentes com o aplicativo. Para cancelar os instant&acirc;neos consistentes com o aplicativo, desmarque a caixa de sele&ccedil;&atilde;o.</li>
	<li>Clique em <strong>OK</strong> para aplicar as novas configura&ccedil;&otilde;es.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Voc&ecirc; pode editar apenas a programa&ccedil;&atilde;o na origem da replica&ccedil;&atilde;o.</li>
	<li>A altera&ccedil;&atilde;o das configura&ccedil;&otilde;es de reten&ccedil;&atilde;o/aplicativo afetar&aacute; as configura&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Instant&acirc;neo</strong>.</li>
</ul>
</div>
<h4>Para visualizar informa&ccedil;&otilde;es de uma replica&ccedil;&atilde;o do iSCSI LUN:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o do iSCSI LUN que deseja visualizar.</li>
	<li>Clique em <strong>Informa&ccedil;&otilde;es</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma janela contendo as seguintes informa&ccedil;&otilde;es:
	  <ul>
			<li><strong>Status</strong> dessa replica&ccedil;&atilde;o.</li>
			<li><strong>Estat&iacute;sticas</strong> dessa replica&ccedil;&atilde;o.</li>
		</ul>
	</li>
</ol>
<h4>Para executar a sincroniza&ccedil;&atilde;o de uma replica&ccedil;&atilde;o do iSCSI LUN:</h4>
<ol>
  <li>Selecione a tarefa de replica&ccedil;&atilde;o do iSCSI LUN que deseja sincronizar.</li>
	<li>Clique em <strong>Executar</strong>.</li>
	<li>Digite a descri&ccedil;&atilde;o do instant&acirc;neo a ser tirado.</li>
	<li>Clique em <strong>OK</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para interromper a sincroniza&ccedil;&atilde;o de uma replica&ccedil;&atilde;o do iSCSI LUN:</h4>
<ol>
	<li>Selecione a sincroniza&ccedil;&atilde;o da tarefa de replica&ccedil;&atilde;o do iSCSI LUN que deseja interromper.</li>
	<li>Clique em <strong>Interromper</strong>.</li>
	<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Interromper</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h3><a name="multiple_replication"></a>Replica&ccedil;&atilde;o estendida/Um para muitos</h3>
<p>Voc&ecirc; pode criar v&aacute;rias replica&ccedil;&otilde;es para um pasta compartilhada/iSCSI LUN para v&aacute;rios servidores de destino formando um esquema <strong>um para muitos</strong>. Voc&ecirc; tamb&eacute;m pode criar uma replica&ccedil;&atilde;o estendida para uma pasta compartilhada replicada/iSCSI LUN formando um esquema <strong>estendido</strong>.</p>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>Quer seja em um esquema um para muitos ou estendido, qualquer tarefa de replica&ccedil;&atilde;o pode ter apenas tr&ecirc;s servidores de destino, no m&aacute;ximo.</li>
</ul>
</div>
<div class="section"><h4><a name="smart_retention"></a>Pol&iacute;tica de reten&ccedil;&atilde;o</h4>
<p>Essa op&ccedil;&atilde;o fornece uma solu&ccedil;&atilde;o ideal para ajud&aacute;-lo a especificar a quantidade m&aacute;xima de vers&otilde;es de instant&acirc;neos para economizar espa&ccedil;o de volume, mas pode ser necess&aacute;rio reter seus instant&acirc;neos por per&iacute;odos mais prolongados.</p>
<p>A Synology emprega a GFS ou Pol&iacute;tica de reten&ccedil;&atilde;o Av&ocirc;-Pai-Filho. &Eacute; poss&iacute;vel configurar a quantidade m&aacute;xima de vers&otilde;es de instant&acirc;neos a serem retidos para as seguintes faixas de tempo respectivamente: <strong>a cada hora</strong>, <strong>diariamente</strong>, <strong>semanalmente</strong>, <strong>mensalmente</strong> e <strong>anualmente</strong>.</p>
<p>O Gerenciador de prote&ccedil;&atilde;o de dados manter&aacute; o n&uacute;mero m&aacute;ximo configurado de instant&acirc;neos para cada faixa de tempo. Se houver mais de uma vers&atilde;o de um instant&acirc;neo dentro de uma faixa de tempo, apenas o mais recente ser&aacute; mantido. Por exemplo, se voc&ecirc; definir uma pol&iacute;tica de 10 <strong>instant&acirc;neos semanalmente</strong>, o Gerenciador de prote&ccedil;&atilde;o de dados manter&aacute; o instant&acirc;neo mais recente (se for tirado mais de um instant&acirc;neo em uma semana) para cada uma das &uacute;ltimas 10 semanas.</p>
<img class="help_image" src="https://help.synology.com/file/DSM/5.2/online_img/dsm/DisasterRecovery/retention_policy.png">
<p>Al&eacute;m disso, todas as vers&otilde;es de instant&acirc;neos dentro de uma hora desde a realiza&ccedil;&atilde;o do instant&acirc;neo mais recente ser&atilde;o mantidas por padr&atilde;o para sua conveni&ecirc;ncia, para que voc&ecirc; encontre e restaure as vers&otilde;es de instant&acirc;neos recentes. Voc&ecirc; tamb&eacute;m pode bloquear um instant&acirc;neo para impedir que ele seja removido automaticamente pelas suas regras de reten&ccedil;&atilde;o.</p>
</div>
</body>
</html>
