<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Instant&acirc;neos</h2>
	<p>Essa p&aacute;gina permite que voc&ecirc; tire, remova e edite instant&acirc;neos, bem como ajuste as configura&ccedil;&otilde;es de reten&ccedil;&atilde;o e programa&ccedil;&atilde;o de instant&acirc;neos.</p>
    <p>Voc&ecirc; pode armazenar at&eacute; 256 c&oacute;pias de instant&acirc;neos por vez para cada pasta compartilhada ou iSCSI LUN. Os instant&acirc;neos minimizam o consumo do disco preservando blocos individuais em vez de arquivos inteiros. O espa&ccedil;o extra pode ser consumido quando os arquivos nas pastas compartilhadas ou blocos nos iSCSI LUNs s&atilde;o atualizados ou removidos.</p>
<h3>Pasta Compartilhada</h3>
<h4>Para tirar um instant&acirc;neo para uma pasta compartilhada:</h4>
<ol>
  <li>Selecione a pasta compartilhada da qual deseja tirar um instant&acirc;neo.</li>
	<li>Clique em <strong>Tirar um instant&acirc;neo</strong>.</li>
	<li>Digite a descri&ccedil;&atilde;o em <strong>Descri&ccedil;&atilde;o</strong> para o instant&acirc;neo a ser tirado.</li>
	<li>Marque/desmarque a caixa de sele&ccedil;&atilde;o <strong>Bloquear</strong> para determinar se o instant&acirc;neo ignorar&aacute; as configura&ccedil;&otilde;es de reten&ccedil;&atilde;o quando a remo&ccedil;&atilde;o autom&aacute;tica for disparada.</li>
  <li>Clique em <strong>OK</strong> para come&ccedil;ar a tirar um instant&acirc;neo.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul><li>Entre as configura&ccedil;&otilde;es na p&aacute;gina <strong>Painel de controle</strong> &gt; <strong>Pasta compartilhada</strong> &gt; <strong>Editar</strong>, apenas a permiss&atilde;o ACL do Windows ser&aacute; gravada em um instant&acirc;neo.</li></ul>
</div>
<h4>Para procurar os instant&acirc;neos de pastas compartilhadas:</h4>
<ol>
  <li>Selecione uma pasta compartilhada da qual deseja procurar os instant&acirc;neos.</li>
	<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
  <li>Selecione um instant&acirc;neo que deseja procurar e clique em <strong>Procurar</strong>.</li>
</ol>
<div class="section"><h4>Nota:</h4>
	<ul>
		<li><strong>Procurar</strong> instant&acirc;neo n&atilde;o est&aacute; dispon&iacute;vel para pastas compartilhadas criptografadas.</li>
		<li>Se voc&ecirc; n&atilde;o conseguir procurar o instant&acirc;neo, v&aacute; para <strong>Painel de controle</strong> &gt; <strong>Pasta compartilhada</strong> &gt; <strong>Editar</strong> para habilitar <strong>Tornar o instant&acirc;neo vis&iacute;vel</strong>.</li>
	</ul>
</div>
<h4>Para remover os instant&acirc;neos de pastas compartilhadas:</h4>
<ol>
	<li>Selecione uma pasta compartilhada da qual deseja remover os instant&acirc;neos.</li>
	<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
	<li>Selecione um ou mais instant&acirc;neos que deseja remover e clique em <strong>Remover</strong>. (Pressione e segure a tecla Shift ou Ctrl para sele&ccedil;&atilde;o m&uacute;ltipla.)</li>
	<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Excluir</strong> para confirmar a remo&ccedil;&atilde;o.</li>
</ol>
<h4>Para editar os instant&acirc;neos de pastas compartilhadas:</h4>
<ol>
	<li>Selecione uma pasta compartilhada da qual deseja editar os instant&acirc;neos.</li>
	<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
	<li>Selecione um instant&acirc;neo que deseja editar e clique em <strong>Editar</strong>.</li>
	<li>Voc&ecirc; pode modificar a descri&ccedil;&atilde;o do instant&acirc;neo em <strong>Descri&ccedil;&atilde;o</strong> e marcar/desmarcar a caixa de sele&ccedil;&atilde;o <strong>Bloquear</strong> para determinar se o instant&acirc;neo ignorar&aacute; as configura&ccedil;&otilde;es de reten&ccedil;&atilde;o quando a remo&ccedil;&atilde;o autom&aacute;tica for disparada.</li>
	<li>Clique em <strong>OK </strong>para salvar suas configura&ccedil;&otilde;es.</li>
</ol>
<h4>Para configurar instant&acirc;neos programados:</h4>
<p>Com os instant&acirc;neos programados o Instant&acirc;neo e replica&ccedil;&atilde;o tirar&aacute; instant&acirc;neos automaticamente no tempo e frequ&ecirc;ncia predeterminados e ent&atilde;o aliviar&aacute; sua carga de trabalho para tirar um instant&acirc;neo manualmente.</p>
<ol>
	<li>Selecione uma pasta compartilhada.</li>
	<li>Clique em <strong>Definir programa&ccedil;&atilde;o</strong>.</li>
	<li>Na guia <strong>Programa&ccedil;&atilde;o</strong> marque a caixa de sele&ccedil;&atilde;o <strong>Habilitar programa&ccedil;&atilde;o de instant&acirc;neo</strong> e ajuste o tempo e a frequ&ecirc;ncia para tirar instant&acirc;neos. Para cancelar os instant&acirc;neos programados para essa pasta compartilhada, desmarque a caixa de sele&ccedil;&atilde;o.</li>
  <li>Clique em <strong>OK </strong>para salvar suas configura&ccedil;&otilde;es.</li>
  <li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>OK</strong> para confirmar a configura&ccedil;&atilde;o.</li>
</ol>
<div class="section"><h4>Nota:</h4>
	<ul>
	  <li>A configura&ccedil;&atilde;o dos instant&acirc;neos programados n&atilde;o ser&aacute; inclu&iacute;da no recurso <strong>Painel de controle</strong> &gt; <strong>Atualizar e restaurar</strong> &gt; <strong>Backup da configura&ccedil;&atilde;o</strong>.</li>
	</ul>
</div>
<h4>Para ajustar as configura&ccedil;&otilde;es de reten&ccedil;&atilde;o dos instant&acirc;neos programados:</h4>
<ol>
<li>Selecione uma pasta compartilhada.</li>
<li>Clique em <strong>Definir programa&ccedil;&atilde;o</strong>.</li>
<li>Selecione a guia <strong>Reten&ccedil;&atilde;o</strong>.</li>
<li>Ajuste suas configura&ccedil;&otilde;es de reten&ccedil;&atilde;o. Escolha uma das op&ccedil;&otilde;es a seguir:
	<ul>
		<li><strong>Remover instant&acirc;neos antigos ao atingir o limite:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos for atingido, os instant&acirc;neos mais antigos ser&atilde;o sobrescritos pelos mais novos.</li>
		<li><strong>Sempre manter instant&acirc;neos:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos for atingido, a fun&ccedil;&atilde;o Instant&acirc;neo e replica&ccedil;&atilde;o parar&aacute; de tirar novos instant&acirc;neos sem remover os j&aacute; tirados.</li>
		<li><strong>Manter os instant&acirc;neos com a pol&iacute;tica a seguir:</strong> Voc&ecirc; pode configurar as regras de reten&ccedil;&atilde;o para as faixas de tempo especificadas. Para obter mais informa&ccedil;&otilde;es, consulte a nota <a href="#smart_retention">Pol&iacute;tica de reten&ccedil;&atilde;o</a>.</li>
	</ul>
</li>
<li>Clique em <strong>OK </strong>para salvar suas configura&ccedil;&otilde;es.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>A altera&ccedil;&atilde;o das configura&ccedil;&otilde;es de reten&ccedil;&atilde;o afetar&aacute; as configura&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Replica&ccedil;&atilde;o</strong>.</li>
</ul>
</div>
<h3>iSCSI LUN</h3>
<h4>Para tirar um instant&acirc;neo de iSCSI LUN:</h4>
<ol>
<li>Selecione o iSCSI LUN do qual deseja tirar um instant&acirc;neo.</li>
<li>Clique em <strong>Tirar um instant&acirc;neo</strong>.</li>
<li>Digite a descri&ccedil;&atilde;o em <strong>Descri&ccedil;&atilde;o</strong> para o instant&acirc;neo a ser tirado.</li>
<li>Da lista suspensa <strong>Bloquear</strong>, selecione <strong>Sim</strong>/<strong>N&atilde;o</strong> para determinar se o instant&acirc;neo ignorar&aacute; as configura&ccedil;&otilde;es de reten&ccedil;&atilde;o quando a remo&ccedil;&atilde;o autom&aacute;tica precisar ser disparada.</li>
<li>Clique em <strong>OK</strong> para come&ccedil;ar a tirar um instant&acirc;neo.</li>
</ol>
<h4>Para remover um instant&acirc;neo de um iSCSI LUN:</h4>
<ol>
<li>Selecione um iSCSI LUN do qual deseja remover os instant&acirc;neos.</li>
<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
<li>Selecione um ou mais instant&acirc;neos que deseja remover e clique em <strong>Remover</strong>. (Pressione e segure a tecla Shift ou Ctrl para sele&ccedil;&atilde;o m&uacute;ltipla.)</li>
<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a remo&ccedil;&atilde;o.</li>
</ol>
<h4>Para editar um instant&acirc;neo de um iSCSI LUN:</h4>
<ol>
<li>Selecione um iSCSI LUN do qual deseja editar os instant&acirc;neos.</li>
<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
<li>Selecione um instant&acirc;neo que deseja editar e clique em <strong>Editar</strong>.</li>
<li>Voc&ecirc; pode executar qualquer uma das seguintes a&ccedil;&otilde;es para editar um instant&acirc;neo:
	<ul>
	  <li>Alterar a descri&ccedil;&atilde;o do instant&acirc;neo em <strong>Descri&ccedil;&atilde;o</strong>.</li>
	  <li>Selecionar o <strong>Tipo de instant&acirc;neo</strong> se o instant&acirc;neo <a href="#app-consistent">consistente com o aplicativo</a> estiver habilitado.</li>
	  <li>Alterne entre <strong>Sim</strong>/<strong>N&atilde;o</strong> da lista suspensa <strong>Bloquear</strong> para determinar se o instant&acirc;neo ignorar&aacute; as configura&ccedil;&otilde;es de reten&ccedil;&atilde;o quando a remo&ccedil;&atilde;o autom&aacute;tica precisar ser disparada.</li>
	</ul>
</li>
<li>Clique em <strong>OK </strong>para salvar suas configura&ccedil;&otilde;es.</li>
</ol>
<h4>Para configurar instant&acirc;neos programados:</h4>
<p>Com os instant&acirc;neos programados o Instant&acirc;neo e replica&ccedil;&atilde;o tirar&aacute; instant&acirc;neos automaticamente no tempo e frequ&ecirc;ncia predeterminados e ent&atilde;o aliviar&aacute; sua carga de trabalho para tirar um instant&acirc;neo manualmente.</p>
<ol>
	<li>Selecione um iSCSI LUN.</li>
	<li>Clique em <strong>Definir programa&ccedil;&atilde;o</strong>.</li>
	<li>Na guia <strong>Programa&ccedil;&atilde;o</strong> marque a caixa de sele&ccedil;&atilde;o <strong>Habilitar programa&ccedil;&atilde;o de instant&acirc;neo</strong> e ajuste o tempo e a frequ&ecirc;ncia para tirar instant&acirc;neos. Para cancelar os instant&acirc;neos programados para essa pasta compartilhada, desmarque a caixa de sele&ccedil;&atilde;o.</li>
  <li>Clique em <strong>OK </strong>para salvar suas configura&ccedil;&otilde;es.</li>
</ol>
<h4>Para ajustar as configura&ccedil;&otilde;es de reten&ccedil;&atilde;o dos instant&acirc;neos programados:</h4>
<ol>
<li>Selecione um iSCSI LUN.</li>
<li>Clique em <strong>Definir programa&ccedil;&atilde;o</strong>.</li>
<li>Selecione a guia <strong>Reten&ccedil;&atilde;o</strong>.</li>
<li>Ajuste suas configura&ccedil;&otilde;es de reten&ccedil;&atilde;o. Escolha uma das op&ccedil;&otilde;es a seguir:
	<ul>
		<li><strong>Remover instant&acirc;neos antigos ao atingir o limite:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos for atingido, os instant&acirc;neos mais antigos ser&atilde;o sobrescritos pelos mais novos.</li>
		<li><strong>Sempre manter instant&acirc;neos:</strong> Quando o n&uacute;mero m&aacute;ximo de instant&acirc;neos for atingido, a fun&ccedil;&atilde;o Instant&acirc;neo e replica&ccedil;&atilde;o parar&aacute; de tirar novos instant&acirc;neos sem remover os j&aacute; tirados.</li>
		<li><strong>Manter os instant&acirc;neos com a pol&iacute;tica a seguir:</strong> Voc&ecirc; pode configurar as regras de reten&ccedil;&atilde;o para as faixas de tempo especificadas. Para obter mais informa&ccedil;&otilde;es, consulte a nota <a href="#smart_retention">Pol&iacute;tica de reten&ccedil;&atilde;o</a>.</li>
	</ul>
</li>
<li>Clique em <strong>OK </strong>para salvar suas configura&ccedil;&otilde;es.</li>
<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>OK</strong> novamente para confirmar a configura&ccedil;&atilde;o.</li>
</ol>
<h4>Para configurar o estado consistente de seus instant&acirc;neos iSCSI LUN:</h4>
<ol>
<li>Selecione um iSCSI LUN.</li>
<li>Clique em <strong>Definir programa&ccedil;&atilde;o</strong>.</li>
<li>Selecione a guia <strong>Aplicativo</strong>.</li>
<li>Marque/desmarque a caixa de sele&ccedil;&atilde;o <strong>Habilitar instant&acirc;neos consistentes com o aplicativo</strong> para alternar entre os seguintes estados consistentes:
  <ul>
<li><a name="app-consistent"></a><strong>Aplicativo consistente</strong>: Os instant&acirc;neos nesse estado consistente podem ser tirados apenas quando o Synology Snapshot Manager estiver instalado no seu servidor Windows ou VMware vCenter Server, dependendo do ambiente operacional para se comunicar com o DSM. Quando os instant&acirc;neos consistentes com o aplicativo forem acionados no DSM, os aplicativos ser&atilde;o notificados e liberar&atilde;o todos os dados da mem&oacute;ria para os LUNs no qual o instant&acirc;neo foi tirado para garantir a consist&ecirc;ncia dos dados.
	<div class="section"><h4>Nota:</h4>
		<ul><li>Se o Synology Snapshot Manager ainda n&atilde;o foi instalado em seu ambiente operacional, o instant&acirc;neo consistente com o aplicativo permanecer&aacute; desabilitado mesmo que a caixa de sele&ccedil;&atilde;o esteja marcada.</li></ul>
	</div>
</li>
<li><strong>Falha consistente</strong>: se o Synology Snapshot Manager n&atilde;o estiver instalado em nenhum dos seus clientes, s&oacute; ser&aacute; poss&iacute;vel capturar instant&acirc;neos consistentes com a falha de LUNs. Quando os instant&acirc;neos consistentes com as falhas forem acionados, os aplicativos n&atilde;o ser&atilde;o notificados para liberar os dados da mem&oacute;ria para os LUNs e, portanto, n&atilde;o garantir&atilde;o a consist&ecirc;ncia dos dados.</li>
</ul>
</li>
<li>Clique em <strong>OK </strong>para salvar suas configura&ccedil;&otilde;es.</li>
</ol>
<div class="section"><h4>Nota:</h4>
<ul>
	<li>A altera&ccedil;&atilde;o das configura&ccedil;&otilde;es do estado consistente afetar&aacute; as configura&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Replica&ccedil;&atilde;o</strong>.</li>
</ul>
</div>
<p>____<br/>
<div class="section">
  <h4><a name="smart_retention"></a>Pol&iacute;tica de reten&ccedil;&atilde;o</h4>
  <p>Essa op&ccedil;&atilde;o fornece uma solu&ccedil;&atilde;o ideal para ajud&aacute;-lo a especificar a quantidade m&aacute;xima de vers&otilde;es de instant&acirc;neos para economizar espa&ccedil;o de volume, mas pode ser necess&aacute;rio reter seus instant&acirc;neos por per&iacute;odos mais prolongados.</p>
  <p>A Synology emprega a GFS ou Pol&iacute;tica de reten&ccedil;&atilde;o Av&ocirc;-Pai-Filho. &Eacute; poss&iacute;vel configurar a quantidade m&aacute;xima de vers&otilde;es de instant&acirc;neos a serem retidos para as seguintes faixas de tempo respectivamente: <strong>a cada hora</strong>, <strong>diariamente</strong>, <strong>semanalmente</strong>, <strong>mensalmente</strong> e <strong>anualmente</strong>.</p>
  <p>O Instant&acirc;neo e replica&ccedil;&atilde;o manter&aacute; o n&uacute;mero m&aacute;ximo configurado de instant&acirc;neos para cada faixa de tempo. Se houver mais de uma vers&atilde;o de um instant&acirc;neo dentro de uma faixa de tempo, apenas o mais recente ser&aacute; mantido. Por exemplo, se voc&ecirc; definir uma pol&iacute;tica de 10 <strong>instant&acirc;neos semanalmente</strong>, o Instant&acirc;neo e replica&ccedil;&atilde;o manter&aacute; o instant&acirc;neo mais recente (se for tirado mais de um instant&acirc;neo em uma semana) para cada uma das &uacute;ltimas 10 semanas.</p>
<img class="help_image" src="../../../online_img/dsm/DisasterRecovery/retention_policy.png">
  <p>Al&eacute;m disso, todas as vers&otilde;es de instant&acirc;neos dentro de uma hora desde a realiza&ccedil;&atilde;o do instant&acirc;neo mais recente ser&atilde;o mantidas por padr&atilde;o para sua conveni&ecirc;ncia, para que voc&ecirc; encontre e restaure as vers&otilde;es de instant&acirc;neos recentes. Voc&ecirc; tamb&eacute;m pode bloquear um instant&acirc;neo para impedir que ele seja removido automaticamente pelas suas regras de reten&ccedil;&atilde;o.</p>
</div>
</p>
</body>
</html>
