<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Destek Hizmetleri</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>Destek Hizmetleri</h2>
<p>
Destek Hizmetleri teknik destek m&uuml;hendislerimizin DiskStation &uuml;r&uuml;n&uuml;n&uuml;zdeki teknik sorunları Synology ofisten hızlıca g&ouml;r&uuml;nt&uuml;lemesine, tanılamasına ve &ccedil;&ouml;z&uuml;mlemesine izin vererek, hem uzak erişim hem de g&uuml;nl&uuml;k oluşturma ara&ccedil;larını i&ccedil;erir. Bunu yapmak i&ccedil;in, <b>Destek Merkezi</b> &gt; <b>Destek Hizmetleri</b>'ne gidin.
</p>

<h4>Uzak erişimi etkinleştirmek i&ccedil;in: </h4>
<p>
Yalnızca Synology teknik destek m&uuml;hendisleri tarafından istendiğinde, DiskStation &uuml;r&uuml;n&uuml;n&uuml;ze uzak erişimi etkinleştirin.
</p>
<ol>
<li><b>Uzak erişimi etkinleştir</b> onay kutusunu işaretleyin, ve değişikliklerin etkili olması i&ccedil;in <b>Uygula</b>'ya tıklayın.
</li>
<li>Synology teknik destek m&uuml;hendislerine y&ouml;netici şifrenizi ve destek tanımlama anahtarını e-postanız yoluyla sağlayın.
</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Uzak erişim 14 g&uuml;n sonra otomatik olara devre dışı bırakılır. Bir Synology teknik destek m&uuml;hendisi istemedik&ccedil;e manuel olarak devre dışı bırakılmamalıdır.
</li>
<li>L&uuml;tfen &ouml;zel olduğunu d&uuml;ş&uuml;nd&uuml;ğ&uuml;n&uuml;z herhangi bir i&ccedil;eriği DiskStation &uuml;r&uuml;n&uuml;n&uuml;zden kaldırın. 
</li>
<li>Synology uzak erişim uygulamasının sorununuzu &ccedil;&ouml;z&uuml;mleyeceğini garanti edemese de, Synology profesyonel bir şekilde destek hizmetlerini ger&ccedil;ekleştirmek i&ccedil;in makul &ccedil;aba sergileyecektir.
</li>	
</ul>
</div>

<h4>G&uuml;nl&uuml;kleri oluşturmak i&ccedil;in: </h4>
<p>
G&uuml;nl&uuml;kleri yalnızca Synology teknik destek m&uuml;hendislerine oluşturun ve sağlayın.
</p>
<ol>
<li>İndirme tamamlanmadan bir ka&ccedil; dakika &ouml;nce <b>G&uuml;nl&uuml;kler oluştur</b>'a tıklayın.
</li>
<li>Synology teknik destek m&uuml;hendislerine e-posta yoluyla g&uuml;nl&uuml;kleri sağlayın.
</li>
</ol>

<div class="section">
<h4>Destek Hizmetlerimiz hakkında bilmeniz gereken şeyler</h4>
<ul>
<li>DiskStation &uuml;r&uuml;n&uuml;n&uuml;ze kendimizinkiymiş gibi saygı duyuyoruz.</li>
<li>DiskStation &uuml;r&uuml;n&uuml;n&uuml;z yalnızca sistem tanılama amacıyla kullanılır. Synology DiskStation &uuml;r&uuml;n&uuml;n&uuml;zdeki herhangi bir kişisel bilgiye erişmez veya bunu ifşa etmez. </li> 

</ul>
</div>

</body>
</html>
