<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Backup &amp; kopiering</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>LUN-backup</h2>
<p>P&aring; fanen <b>Backup</b> i <b>Backup &amp; kopiering</b> kan du bruge <b>Lokal LUN-backup</b> til at udf&oslash;re backup p&aring; iSCSI LUN'er p&aring; DiskStation til lokale delte mapper. Du kan ogs&aring; bruge <b>Netv&aelig;rks-LUN-backup</b> for at udf&oslash;re backup til en anden DiskStation.</p>

<h4>S&aring;dan udf&oslash;rer du backup p&aring; en iSCSI LUN:</h4>
<ol>
<li>
V&aelig;lg <b>Opret</b> &gt; <b>LUN-backupopgave</b> for at &aring;bne <b>Guide til LUN-backup</b> og klikke p&aring; <b>N&aelig;ste</b>.
</li>
<li>
N&aring;r du bedes om at v&aelig;lge en destinationstype, skal du v&aelig;lge en af f&oslash;lgende:
</li>
<ul>
<li>
<b>Lokal LUN-backup</b>: V&aelig;lg denne mulighed for at udf&oslash;re backup p&aring; LUN'en fra DiskStation til en lokalt delt mappe eller et eksternt lager, som har forbindelse til USB- eller eSATA-porten p&aring; din DiskStation.
</li>
<li><b>Netv&aelig;rks-LUN-backup</b>: V&aelig;lg denne mulighed for at udf&oslash;re backup p&aring; en LUN fra din DiskStation til en anden DiskStation.
</li>
</ul>
<li>
N&aring;r du bedes om det, skal du angive backupdestinations- og kilde-LUN og angive backupplanen.
</li>
<li>
F&oslash;lg guiden for at fuldf&oslash;re ops&aelig;tningen.
</li>
</ol>
<p>N&aring;r backupopgaven er oprettet, vil DiskStation udf&oslash;re backupopgaven efter planen og gemme backup-LUN'en p&aring; destinationen. Backup-LUN'en bruges kun til backupform&aring;l. Hvis du vil have adgang til backup-LUN'en, kan du se <a href="restore.html">S&aring;dan gendanner du backup-LUN</a> for at se flere oplysninger.</p>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Der udføres backup på både almindelige filer og LUN'er på blokniveau som filbilleder på destinationen. Ved gendannelse bliver LUN'er på blokniveau ændre til fil-LUN'er.</li>
<li>Hver backupopgave kan kun indeholde en LUN som backupkilde.</li>
<li>Der kan ikke udf&oslash;res backup p&aring; LUN'er til en ekstern disk med formatet FAT, FAT32, HFS, HFS Plus eller NTFS.</li>
<li>F&oslash;r du udf&oslash;rer Netv&aelig;rks-LUN-backup, skal du logge ind p&aring; destinations-DiskStation og s&oslash;rge for, at netv&aelig;rksbackupstjenesten er aktiveret under <b>Backup &amp; kopiering</b> &gt; <b>Backuptjenester</b>.</li>
<li>Hvis din DiskStation opretter forbindelse til netv&aelig;rket via en router, skal du s&oslash;rge for, at du har angivet en portvideresendelsesregel for iSCSI-tjenesten (TCP-port 3260) p&aring; routeren, f&oslash;r du udf&oslash;rer netv&aelig;rks-LUN-backup.</li>
</ul>
</div>


<div class="section">
<h4>Om fuld backup og stigende backup:</h4>
<p>
DiskStation vil udf&oslash;re en fuld backup af den valgte LUN f&oslash;rste gang og se udf&oslash;re stigende backup senere. Hvis det delte mappenavn eller biblioteksnavn for backupdestinationen dog &aelig;ndres, vil DiskStation udf&oslash;re en fuld backup af opgaven igen.
</p>
</div>
</body></html>
