<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Del fillinks</h2>

<p>Filer eller mapper, der er gemt p&aring; DiskStation kan deles hurtigt og nemt. Bare h&oslash;jreklik p&aring; en fil eller mappe, og v&aelig;lg <strong>Del fillinks</strong>. Dette genererer et link og QR-kode, som kan sendes til venner eller andre brugere. De kan f&oslash;lge linket for at downloade den valgte fil eller mappe, lige meget om de har en DSM-konto eller ej.</p>


<h4>S&aring;dan deler du fillinks:</h4>
<ol>
<li>V&aelig;lg de filer og mapper, du vil dele.</li>
<li>H&oslash;jreklik p&aring; en af de valgte filer eller mapper, eller klik p&aring; menuen <b>Handling</b>. V&aelig;lg s&aring; <b>Del fillinks</b>.</li>
<li>Delte links og QR-koder vises i det vindue, der vises.</li>
<li>F&oslash;lgende valgmuligheder kan ogs&aring; &aelig;ndres:
<ul>
 <li><strong>Gyldighedsperiode:</strong> Du kan tilpasse gyldige adgangsperioder og adgangstidspunkter til delte links. 
  <ul>
<li><strong>Tilpas gyldighedsperiode</strong>: Du kan fastl&aelig;gge, hvor l&aelig;nge et delt link skal v&aelig;re aktivt efter oprettelse. Linket bliver ugyldigt, n&aring;r det er over den angivne periode.</li>
<li><strong>Tilpas gyldigt adgangsantal</strong>: Du kan fastl&aelig;gge, hvor mange gange et delt link kan &aring;bnes. Linket bliver ugyldigt, n&aring;r det er over det angivne antal gange.</li>
</ul>
</li>
<li><strong>Del med DSM-brugere:</strong> Du kan dele linket med DSM-brugere eller -grupper ved at v&aelig;lge dem i rullemenuen. Bem&aelig;rk, at du ikke kan dele med guest-konto og brugergruppe.</li>

<li><strong>Del med andre</strong>: Du kan dele adgangskodebeskyttede links med andet personer, herunder ikke-DSM brugere.</li>

</ul>
</li>
</ol>

<h4> S&aring;dan aktiverer du gofile.me-links: </h4> 
<ol>
<li>G&aring; til <strong>Kontrolpanel</strong> &gt; <strong>QuickConnect</strong>, og s&oslash;rg for, at <strong>Aktiver QuickConnect</strong> er markeret. Hvis du ikke har konfigureret QuickConnect, kan du g&oslash;re det p&aring; denne side.</li>
<li>Klik s&aring; p&aring; <strong>Avanceret</strong>, og s&oslash;rg for, at <strong>Fildeling</strong> er markeret.</li>
<li>Delte filer kan downloades uden at have en DSM-konto ved at &aring;bne gofile.me-deleliinket.</li> 
</ol>
<h3>Tilpas delt linkside</h3>
<p>File Station tilbyder din forskellige valgmuligheder til at tilpasse den delte linkside.</p>
<ol>
<li>G&aring; til <strong>File Station</strong> &gt; <strong>Indstillinger</strong> &gt; <strong>Delte links</strong> &gt; <strong>Tilpasset</strong>.</li>
<li>V&aelig;lg <strong>Tilpas delt linkside</strong>, og klik p&aring; <strong>Tilpassede indstillinger</strong>.</li>
<li>Du kan tilpasse siden p&aring; nedenst&aring;ende m&aring;der:
  <ul>
<li><strong>Skabelon</strong>: V&aelig;lg en af standardskabelonerne.</li>
<li><strong>Baggrund</strong>: Klik p&aring; miniaturen eller <strong>+</strong> for at v&aelig;lge et standardtapet, billede p&aring; din DiskStation eller et tidligere brugt billede.</li>
<li><strong>Logo</strong>: Klik p&aring; miniaturen eller <strong>+</strong> for at v&aelig;lge et uploadet billede (mindre end 1 MB), billede p&aring; din DiskStation eller et tidligere brugt billede. Logoen kan placeres i et af de fire hj&oslash;rner.</li>
</ul>
</li>
<li>Klik p&aring; <strong>Forh&aring;ndsvisning</strong> for at se, om eventuelle justeringer skal foretages.</li>
<li>Klik p&aring; <strong>OK</strong> for af anvende indstillingerne.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ol>
<li>De tilpassede indstillinger anvendes p&aring; alle delte links, uanset deres oprettelsestidspunkt.</li>
<li>Du kan kun bruge billeder i f&oslash;lgende formater som tapet/logo: .jpe, jpeg, .jpg, .bmp, .gif og .png</li></ol>
</div>

<h3>Administration af delte links</h3>
<p>Eksisterende delte links kan administreres ved at g&aring; til <strong>V&aelig;rkt&oslash;j</strong> &gt; <strong>Styring af delte links</strong>. I det vindue, som vises, findes valgmulighederne til redigering, deling eller fjernelse af eksisterende delte links.</p>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ol>
  <li>Du kan oprette op til 1000 delte links.</li>
  <li>Afsnittet <strong>Status</strong> for hver delt link viser en af f&oslash;lgende:
<ul>
<li><b>Gyldig:</b> Det delte link fungerer korrekt.</li>
<li><b>Udl&oslash;bet:</b> Gyldighedsperioden for det delte link er udl&oslash;bet.</li>
<li><b>Ugyldig:</b> Den delte fil eller mappe findes ikke l&aelig;ngere, eller du har ikke de korrekte privilegier til at &aring;bne filen eller mappen.</li>
<li><b>G&aelig;lder ikke endnu:</b> Det delte link er endnu ikke blevet aktivt.</li>
</ul>
</li>
</ol>

</div>
</body>
</html>
