<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Upload filer eller mapper</h2>
<p>Brug en af f&oslash;lgende metoder til at uploade filer eller mapper fra computeren til DiskStation.</p>
<p>F&aring; fuld adgang til de uploadfunktioner, der vises nedenfor, ved f&oslash;rst at installere den seneste Java Runtime Environment (JRE) og Flash Player . </p>


<h4>Metode 1:</h4>
<ol>
<li>
Fra &oslash;verste del af venstre panel v&aelig;lger du en destinationsmappe p&aring; DiskStation. 
</li>
<li>
Klik p&aring; <b>Upload</b>, v&aelig;lg <strong>Upload - Spring over</strong> eller <strong>Upload - Overskriv</strong>, og v&aelig;lg filer eller mapper fra den lokale computer. </li>
</ol>
<h4>Metode 2:</h4>
<ol>
	<li>G&aring; til <strong>Indstillinger</strong>, marker <strong>Gennemg&aring; filer fra lokal computer med File Station</strong>, og opdatere websiden for at se mapper p&aring; din lokale computer nederst til venstre i panelet.</li>
<div class="section">
<h4>Bem&aelig;rk:</h4>
<p>Valgmuligheden <strong>Gennemg&aring; filer fra lokal computer med File Station</strong> tr&aelig;der f&oslash;rst i kraft, n&aring;r du har installeret og aktiveret JRE p&aring; computeren.</p>
</div>
	<li>Fra den nederste del af det venstre panel skal du v&aelig;lge en mappe p&aring; den lokale computer. Hovedafsnittet viser nu indholdet af den valgte mappe.
	</li>
	<li>V&aelig;lg de filer og mapper, du vil have i hovedafsnittet, og klik p&aring; <b>Upload</b>. 
</li>
	<li>V&aelig;lg en destinationsmappe p&aring; DiskStation i det vindue, der &aring;bnes.
	</li>
	<li>&Oslash;verst til h&oslash;jre i vinduet v&aelig;lger du <b>Overskriv</b> , hvis du vil overskrive filer eller mapper med det samme navn i destinationsmappen. Ellers v&aelig;lger du <b>Spring over</b>.
</li>
	<li>Klik p&aring; <b>OK</b> for at starte upload.
</li>
</ol>
<h4>Metode 3:</h4>
<ol>
<li>G&aring; til <strong>Indstillinger</strong>, marker <strong>Gennemg&aring; filer fra lokal computer med File Station</strong>, og opdatere websiden for at se mapper p&aring; din lokale computer nederst til venstre i panelet.</li>
<li>
Tr&aelig;k en mappe fra computer (nedre del) til enhver mappe p&aring; DiskStation (&oslash;vre del) i venstre panel.
</li>
<li>
I den pop op-menu, der vises, v&aelig;lger du, om du vil overskrive eller springe filer/mapper med samme navn over i destinationsmappen.
</li>
</ol>
<h4>Metode 4:</h4>
<ol>
<li>
Fra &oslash;verste del af venstre panel v&aelig;lger du en destinationsmappe p&aring; DiskStation.
</li>

<li>
V&aelig;lg de filer p&aring; computerens skrivebord eller i stifinderen (f.eks. Windows Explorer eller Mac Finder), og tr&aelig;k-og-slip dem s&aring; til File Station i webbrowseren.
</li>

<li>
I den dialogboks, der vises, v&aelig;lger du, om du vil overskrive eller springe filer med samme navn over i destinationsmappen.</li>
<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li><b> Metode 4</b> underst&oslash;ttes kun i bestemte browsere: Chrome, Firefox, Safari 5.1 eller senere. Den underst&oslash;ttes dog ikke p&aring; Mac, n&aring;r <strong>Gennemg&aring; filer fra lokal computer med File Station</strong> er markeret.</li>
<li>
Du kan ogs&aring; tr&aelig;kke og slippe mapper eller tomme filer, men kun n&aring;r <strong>Gennemg&aring; filer fra lokal computer med File Station</strong> er markeret for ovenst&aring;ende browsere. Ellers kan du ikke uploade mapper og tomme filer med <strong>Metode 4</strong>.</li>
	<li>
Hvis du bruger Chrome for Linux og logget ind p&aring; DSM via HTTPS-protokollen, skal du importere et certifikat, du har tillid til, (under fanen HTTP-tjeneste i <b>Kontrolpanel</b> &gt; <b>Sikkerhed</b> &gt; <strong>Certifikat</strong>) for at kunne uploade med <b>Metode 4</b>.
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ol>
<li>
Du kan tilf&oslash;je op til 1000 filer i uploadk&oslash;en.
</li>
	<li>
Du kan uploade filer med st&oslash;rrelser over 4 GB, hvis du bruger Google Chrome, Firefox, Safari 5.1 eller senere, eller n&aring;r <strong>Gennemg&aring; filer fra lokal computer med File Station</strong> er markeret. Ellers kan du kun uploade op til 2 GB filer ad gangen.</li>
	<li>
I den ikke-krypteret delte mappe skal et fil-/mappenavn ligge inden for 255 tegn (op til ca. 80 tegn for ikke-latinske sprog). I en krypterede delt mappe skal det ligge inden for 143 tegn (op til ca. 47 tegn for ikke-latinske sprog).
</li>
<li>
Fil-/mappenavn m&aring; ikke indeholde f&oslash;lgende tegn: \ / : * ? &quot; &gt; |.
</li>
<li>
Fil-/mappenavn kan ikke starte med &quot;._&quot;.
</li>
<li>Du kan kun uploade filer, der re 0 KB i st&oslash;rrelse, n&aring;r du har installeret JRE.</li>
</ol>
</div>


<div class="section">
<h4>Fejlfinding</h4>
<p>Hvis du ikke kan gennemse lokale emner, der er gemt p&aring; din Mac med Safari korrekt, skal du g&oslash;re f&oslash;lgende:</p>
<ol>
<li>P&aring; Max: &Aring;bn Safari, og v&aelig;lg <strong>Pr&aelig;ferencer</strong> i Safarimenuen.</li>
<li>Klik p&aring; <strong>Administrer webstedsindstillinger</strong> p&aring; fanen <strong>Sikkerhed</strong>.</li>
<li>Under <strong>Java</strong> v&aelig;lger du DSM &quot;websted.&quot;</li>
<li>V&aelig;lg <strong>K&oslash;r i usikker tilstand</strong>.</li>
</ol>
</div>



</body>
</html>
