<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<title>High Availability-styring - Synology DSM - Hjælp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology High Availability uses two servers to form a high-availability cluster in which one server assumes the role of active server and another server acts as a standby passive server.">


 </head>
 <body>
  <h1>High Availability-styring</h1>

  <p>High Availability vedrører en serverlayoutløsning, der er designet til at reducere afbrydelser i tjenester, der skyldes serverfejl. High Availability bruger to servere til at danne en "high-availability-klynge", hvor en server påtager sig rollen som "aktiv server", og en anden server fungerer som en standby "passiv server." For at implementere og skabe en High Availability-klynge, skal du bruge to kompatible Synology-servere.</p>
  <p>En high availability-klynge anvender f&oslash;lgende komponenter og koncepter:</p>

  <ul>
   <li><b>Koncept: </b>Implementering af Synology High Availability kr&aelig;ver to Synology-servere for at oprette en High Availability-klynge. En server fungerer som &quot;aktiv server&quot; og den anden fungerer som &quot;passiv server&quot;. N&aring;r en High Availability-klynge er opretter, bliver data hele tiden kopieret fra den aktiv server til den passive. Alle filer p&aring; den aktive server vil findes kopieret p&aring; den passive server. I tilf&aelig;lde af at den aktive server fejler, vil den passive server kunne overtage alle tjenester med en fuldt afspejlet kopi af dataene p&aring; den aktive server. P&aring; den m&aring;de vil High Availability-klyngen fortsat kunne yde tjenester normalt og minimere serverens nedetid. Yderligere detaljer vedr&oslash;rende switchover findes under <a href="switchover_fail.html">Switchover</a></li>
   <li><b>Aktiv server:</b> Den aktive server styrer levering af alle tjenester. I tilf&aelig;lde af at der sker en fejl p&aring; den aktive server, kan du eller systemet starte en switchover til den passive server. I det tilf&aelig;lde bliver udf&oslash;relsen af disse tjenester overf&oslash;rt til den passive server, hvorefter den aktive server bliver den passive server.</li>
   <li><b>Passiv server:</b> Under normale betingelser forbliver den passive server i standby-tilstand. Data p&aring; den aktive server kopieres hele tiden til den passive server. I tilf&aelig;lde af at den aktive server ikke kan yde tjenesterne, kan du eller systemet starte en switchover til den passive server.</li>
   <li><b>Heartbeat-forbindelse:</b> Den aktive og passive server i en High Availability-klynge er linket af en dedikeret, privat netv&aelig;rksforbindelse, som kaldes en &quot;Heartbeat-forbindelse.&quot; N&aring;r en High Availability-klynge er oprettet, g&oslash;r Heartbeat-forbindelsen datasynkronisering og kopiering mellem den aktive og passive server nem. Hvis kontakten mellem serverne mistes i en given tidsperiode, vil systemet afg&oslash;re, at en switchover er n&oslash;dvendig.</li>
   <li><b>Diskenhed som hovedlager til High Availability-klynge:</b> Lagerenheden for den aktive server bliver hovedlagerenheden for High Availability-klyngen. Data kopieres til den passive servers lagerenhed via Heartbeat-forbindelsen.</li>
   <li><b>Diskenhed som reservelager til high availability-klynge: </b>Lagerenheden p&aring; den passive server bliver reservelagerenhed til high availability-klyngen. Data kopieres hele tiden fra den aktive servers lagerenhed til den passive lagerenhed via Heartbeat-forbindelsen. Dette sikrer konsekvens i filindholdet, n&aring;r en switchover sker.</li>
   <li><b>Navn p&aring; high availability-klyngeserver:</b> Servere i high availability-klyngen vil dele &eacute;t servernavn. P&aring; netv&aelig;rker kan du tilslutte med dette servernavn, hvorefter tjenester bliver leveret af den aktive server. </li>
   <li><b>High availability-klynge-IP: </b>Da den aktive og passive server i High Availability-klyngen hver har deres egen IP-adresse, vil High Availability-klyngen generere f&aelig;lles IP-adresser til adgang for at undg&aring; at skulle &aelig;ndre til en anden IP-adresse, n&aring;r der udf&oslash;res en switchover. For at f&aring; adgang til eventuelle DSM-tjenester uanset hvilken Synology-server, der er aktiv server, kan du oprette forbindelse via disse IP-adresser. </li>
  </ul>




 </body>
</html>
