<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Netv&aelig;rksindstillinger</h2>
	<p>Denne side indeholder tre faner, som viser netv&aelig;rksindstillinger for High Availability-klyngen, den aktive medlemsserver og den aktive medlemsserver.</p>
  
	<h3>Fanen HA-klynge</h3>
  	<p>N&aring;r der oprettes en High Availability-klynge, genererer systemet en f&aelig;lles IP-adresse til High Availability-klyngens IP til at modtage indg&aring;ende forbindelser. Yderligere High Availability-klynge IP-adresser kan oprettes efter behov. IP-adresserne for aktiverede netv&aelig;rksinterfacer p&aring; den aktive server vises p&aring; denne fane (det netv&aelig;rksinterface, der bruges af Heartbeat-forbindelsen vises ikke p&aring; denne side, da det bruges til datakopiering mellem de to servere). Denne fane viser nedenst&aring;ende oplysninger:</p>
    	<ul>
    	  <li><b>Netv&aelig;rksinterface:</b> Det aktiverede netv&aelig;rksinterface p&aring; den aktive server.</li>
          <li><b>Forbindelse:</b> Viser, om dette interface har forbindelse eller ej.</li>
          <li><b>IP-adresse:</b> N&aring;r der oprettes en High Availability-klynge, genererer systemet en f&aelig;lles IP-adresse til High Availability-klyngens IP til at modtage indg&aring;ende forbindelser. Du kan oprette forbindelse til high availability-klyngen ved hj&aelig;lp af denne IP-adresse, n&aring;r du vil logge ind p&aring; DiskStation Manager (DSM), uanset hvilken Synology-server, der er den aktive server. Dette forhindrer, at der skal oprettes forbindelse til forskellige IP-adresser, n&aring;r en switchover sker.</li>
            <li><b>Undernetmaske: </b>Den tilknyttede undernetmaske for den givne high availability-klynges IP-adresse.</li>
		</ul>
<h4>S&aring;dan redigerer du IP-adresse og undernetmaske:</h4>
	<ol>
		<li>V&aelig;lg den IP-adresse eller undernetmaske, som du vil redigere, og klik p&aring; <b>Rediger</b>, eller dobbeltklik p&aring; feltet for at starte redigering.</li>
        
        
   <li>Marker afkrydsningsfelterne <b>Aktiver</b> for at aktivere eller deaktivere hvert interface. Du kan aktivere mere end et klyngenetv&aelig;rksinterface, men det oprindelige netv&aelig;rksinterface, der blev konfigureret under klyngeoprettelse, kan ikke deaktiveres.</li>
        
        
    </ol>
<h4>S&aring;dan &aelig;ndrer du high availability-klyngens servernavn:</h4>
 	<ul>
    	<li>Klik p&aring; <b>Ret netv&aelig;rksindstillinger</b> for at se navnet p&aring; high availability-klyngen og &aelig;ndre indstillingerne.</li>
   		<li>Klik p&aring; <b>Anvend</b> for at gemme den aktuelle high availability-klynges navne- og IP-adresseindstillingerne.</li>
   		<li>Hvis du vil ignorere de aktuelle &aelig;ndringer, skal du klikke p&aring; <b>Annuller</b>. </li>
  </ul>

<h3>Fanerne Aktiv og Passiv server (vises som servernavn)</h3>
<p>Disse faner viser status for netv&aelig;rksinterfaces p&aring; den aktive eller passive server. Af disse vil Heartbeat-forbindelsen optage &eacute;t netv&aelig;rksinterface p&aring; hver af den aktive og passive server. Disse faner viser f&oslash;lgende oplysninger:</p>
	<ul>
    	<li><b>Netv&aelig;rksinterface:</b> Det fysiske netv&aelig;rksinterface p&aring; serveren.</li>
    	<li><b>IP-adresse:</b>Den tildelte IP-adresse til det givne netv&aelig;rksinterface.</li>
    	<li><b>Undernetmaske:</b>Den tilknyttede undernetmaske for den givne IP-adresse.</li>
    	<li><b>Beskrivelse:</b> Viser oplysninger for det givne netv&aelig;rksinterface og adgangen til den tildelte IP-adresse. Dette felt vil vise f&oslash;lgende mulige betingelser:</li>
		<ol>
			<li><b>Oprindelig IP-adresse med adgang</b>: Den oprindelige IP-adresse, der er tildelt til interfacet p&aring; den aktive server er parat til data og tjenester.</li>
			<li><b>Oprindelig IP-adresse uden adgang</b>: Den oprindelige IP-adresse, der er tildelt til interfacet p&aring; den passive server er ikke tilg&aelig;ngeligt.</li>
			<li><b>Heartbeat-forbindelses-IP, ikke adgang fra intranettet</b>: Den oprindelige IP-adresse, der er tildelt automatisk til Heartbeat-forbindelsen er ikke disponibel til data og tjenester.</li>
		</ol>
	</ul>
</body>
</html>