<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Tjenesteoverv&aring;gning</h2>

<p>Denne side s&aelig;tter dig i stand til at overv&aring;ge visse tjenester. Hvis en overv&aring;get tjeneste fejler p&aring; den aktive server, vil systemet failover til den passive standby-server (n&aring;r den passive server fungerer normalt). F&oslash;lgende afsnit vises p&aring; denne side:</p>

<ul>
  <li><b>Tjeneste:</b> Viser tjenester, der kan overv&aring;ges.</li>
  <li><b>Status: </b> Viser, om tjenester k&oslash;rer eller ej.</li>
  <li><b>Failover, n&aring;r tjeneste fejler: </b>Marker afkrydsningsfeltet ved siden af en tjeneste for at starte dens overv&aring;gning. Systemet vil failover, hvis den valgte tjenester fejler.</li>
</ul>

<h4>S&aring;dan overv&aring;ger du en tjeneste:</h4>

<ol>
<li>Find den tjenete, du vil overv&aring;ge. Marker afkrydsningsfeltet ved siden af den.</li>
<li>Klik p&aring; <b>Anvend</b> for at gemme indstillingerne.</li>
</ol>

<div class="section">
<h4>Underst&oslash;ttede tjenester</h4>
<p>Tjenester, der bliver overv&aring;get, er f&oslash;lgende: Windows-filtjeneste, iSCSI Target, FTP, Mac File Service, NFS Service.</p>
</div>

<div class="section">
<h4>Failover, n&aring;r netv&aelig;rksforbindelse mislykkes</h4>
<p>Hvis denne mulighed er markeret, vil systemet failover til den passivve server, n&aring;r netv&aelig;rksforbindelsen for den aktive server fejler, og netv&aelig;rksforbindelsen for den passive server stadig fungerer normalt.</p>

<ul>
<li>Failover bliver kun udl&oslash;st, hvis den passive server har sundere forbindelser. Hvis f.eks. den aktive server har tre forbindelser, og den ene fejler, vil systemet kun udl&oslash;se en failover, hvis den passive server har tre eller flere sunde forbindelser.</li>
<li>Forbindelser kombineret med Link Aggregation t&aelig;ller som &eacute;n forbindelse. Hvis f.eks. to forbindelser kombineres, og en af dem fejler, men den anden fungerer endnu, vil forbindelsen stadig blive anset for sund.</li>
</ul>

</div>

</body>
</html>
