<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
  <h2>Luk og nulstil</h2>
  <p>Nedenst&aring;ende instruktioner vil f&oslash;re dig gennem proceduren med lukning, fjernelse eller nulstilling af High Availability-klyngen.</p>

  <h4> S&aring;dan lukker du high-availability-klyngen med Synology High Availability:</h4>
  <p>N&aring;r du vil lukke en high-availability-klynge for at transportere serverne til en ny fysisk placering eller udf&oslash;re vedligeholdelse, men du &oslash;nsker ikke at fjerne konfigurationerne af high-availability-klyngen, skal du f&oslash;lge disse instruktioner.</p>
  <ol>
   <li>Log ind p&aring; DSM.</li>
   <li>&Aring;bn Synology High Availability.</li>
   <li>Klik p&aring; knappen med <b>Administration</b>.</li>
   <li>V&aelig;lg <b>Luk HA-klynge</b>.</li>
   <li>Der vises en bekr&aelig;ftelse. Klik p&aring; <b>Ja</b> for at bekr&aelig;fte.</li>
  </ol>

  <h4>S&aring;dan lukker du manuelt en high-availability-klynge:</h4>
  <p> High-availability-klynge kan ogs&aring; lukkes manuelt ved hj&aelig;lp af str&oslash;mknapperne p&aring; hver server. </p>
  <ol>
   <li>Tryk og hold p&aring; str&oslash;mknappen p&aring; &eacute;n server (aktiv eller passiv), til den udsender en biplyd.</li>
   <li>N&aring;r en server er helt lukket, skal du vente mindst 30 sekunder (den server, som stadig er online kr&aelig;ver tid til at gemme indstillingerne).</li>
   <li>Tryk og hold p&aring; str&oslash;mknappen p&aring; den anden server, til den udsender en biplyd.</li>
   <li>Vent p&aring;, at serven lukker helt ned.</li>
  </ol>
<div class="section">
<h4>Str&oslash;mf&oslash;ring af servere:</h4>   
<p>N&aring;r du vil t&aelig;nde for serverne igen, skal b&aring;de den aktive og passive server aktiveres p&aring; samme tid (eller inden for fem minutter efter hinanden). Hvis du kun t&aelig;nder for &eacute;n af serverne, vil den fors&oslash;ge at t&aelig;nde for den anden server ved at sende en V&aelig;k p&aring; LAN-meddelelse.</p>
<h4>Unormal lukning:</h4>
<p>N&aring;r en high-availability-klynge oprettes, aktiveres genstart efter str&oslash;msvigt i Kontrolpanel automatisk. Hvis serverne lukkes unormalt p&aring; grund af str&oslash;msvigt, t&aelig;nder de automatisk, n&aring;r str&oslash;mmen genoprettes.</p>
</div>

<h4>S&aring;dan fjerner du en high-availability-klynge:</h4>
 <p>N&aring;r du vil oph&aelig;ve binding af begge servere og fjerne en high-availability-klynge for at binde en anden server, skal du f&oslash;lge disse instruktioner.</p>
  <ol>
   <li>G&aring; til siden <b>Oversigt</b>.</li>
   <li>Klik p&aring; knappen med <b>Administration</b>.</li> 
   <li>V&aelig;lg <b>Fjern HA-klynge</b>.</li>
  </ol>
  <p>Efter bekr&aelig;ftelse vil systemet fjerne high-availability-klyngen. Feltet Status viser status for fjernelsesprocessen. N&aring;r high-availability-klyngen er fjernet korrekt, bliver du henvist til den oprindelige IP-adresse for den aktive server. Status for begge servere vil skifte til <b>Standalone</b>.</li>
  
 <h4>S&aring;dan nulstiller du en fejlet High Availability-klynge:</h4>
  <p>I tilf&aelig;lde af at du ikke kan &aring;bne DSM eller Synology High Availability p&aring; grund af opdelt hjerne-fejl eller anden fejl, kan du fors&oslash;ge at tvinge High Availability-klyngen til at oph&aelig;ve bindingen ved at trykke p&aring; knappen <b>Reset</b>, som findes p&aring; dine servere.</p>
  <ol>
   <li>Tryk og hold p&aring; knappen <b>Reset</b> (findes normalt bag p&aring; serveren), til den udsender en biplyd.
   <li>Systemet vil fjerne High Availability-klyngen, og status for begge servere vil skifte til <b>Standalone</b></li>
   <li>Tryk p&aring; knappen <b>Reset</b> gendanner ogs&aring; nogle indstillinger til standard, f.eks. IP-adresse, DNS og admin-adgangskode udover f&oslash;lgende:</li>
   <ul>
    <li>Admin-adgangskoden nulstilles til tom.</li>
    <li>G&aelig;stekonto er deaktiveret.</li>
    <li>DHCP bliver aktiveret p&aring; IP, DNS, Gateway og andre netv&aelig;rksinterfaces.</li>
    <li>JumboFrames bliver deaktiveret, og MTU bliver angivet til 1500.</li>
    <li>Styringsporten nulstilles til 5000/5001.</li>
    <li>PPPoE nulstilles til standard.</li>
    <li>Automatisk blokering af IP bliver deaktiveret (den blokerede IP-adresse bliver ikke slettet).</li>
    <li>Link Aggregation bliver deaktiveret.</li>
    <li>Firewallregler bliver deaktiveret (reglerne bliver ikke slettet).</li>
   </ul>
  </ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<p>Under fjernelsesprocessen af en High Availability-klynge, kan der v&aelig;re nogle ufuldst&aelig;ndige dataskriveoperationer. For at sikre fuldst&aelig;ndigheden af data, skal du udf&oslash;re datakopiering baseret p&aring; den aktive server, da den passive server m&aring;ske mangler nogle dataopdateringer.</p>
</div>
 </body>
</html>
