<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Salvaguardar os dados no meu PC/Mac utilizando a Cloud Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Salvaguardar os dados no meu PC/Mac utilizando a Cloud Station</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/backup_from_PC/07_1_back_up_your_data_from_pc.png" />
<h2>Vis&atilde;o Geral</h2>
<p>Cloud Station Server &eacute; mais que um software sofisticado de sincroniza&ccedil;&atilde;o entre diversas plataformas, pois os utilizadores podem us&aacute;-lo como uma forma mais inteligente de salvaguardar os seus computadores pessoais. Uma solu&ccedil;a&otilde; de c&oacute;pia de seguran&ccedil;a em tempo real, Cloud Station Backup &eacute; instant&acirc;nea e poupa largura de banda, proporcionando melhor prote&ccedil;&atilde;o at&eacute; 32 vers&otilde;es hist&oacute;ricas de um s&oacute; ficheiro.</p>
<h3 class="list_head">Configurar o Cloud Station Server no Synology NAS</h3>
<ol>

<li>Aceda ao <b>Centro de Pacotes</b>, localize <b>Cloud Station Server</b>, e depois clique em <strong>Instalar</strong>.</li>
 
<li>Inicie o <strong>Cloud Station Server</strong>.</li>
<li>Aceda a <strong>Vis&atilde;o Geral</strong> e clique em <strong>Transferir Agora</strong> em <strong>Cloud Station Backup</strong>. (Tamb&eacute;m pode transferir a Cloud Station Backup a partir do <a href="https://www.synology.com/en-us/support/download" target="_blank">Centro de Transfer&ecirc;ncias da Synology</a>.)</li>
<img src="../../images/Backup/1x/backup_from_PC/download_backup.png" border="1" />
<li>Inicie o instalador no seu computador e siga as instru&ccedil;&otilde;es para instalar a Cloud Station Backup. </li>
<li>Depois da instala&ccedil;&atilde;o, execute a <strong>Cloud Station Backup</strong> no seu computador. Clique em <strong>Come&ccedil;ar Agora</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/start_now.png" border="1" />
<li>Introduza o endere&ccedil;o do Synology NAS que executa o Cloud Station Server (ou QuickConnect ID), nome de utilizador e palavra-passe. (Pode tamb&eacute;m clicar no &iacute;cone de pesquisa &agrave; direita, e Cloud Station Backup ir&aacute; pesquisar automaticamente outro Synology NAS dentro da sua LAN). Clique em <strong>Seguinte</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/enter_credentials.png" border="1" />
<li>Selecione a fonte de c&oacute;pia de seguran&ccedil;a e desmarque quaisquer subpastas que n&atilde;o deseja sincronizar. </li>
<img src="../../images/Backup/1x/backup_from_PC/backup_settings_source.png" border="1" />
<li>Selecione uma pasta no seu Synology NAS clicando em <strong>Selecionar</strong>. Cloud Station Backup ir&aacute; criar uma pasta de c&oacute;pia de seguran&ccedil;a no destino selecionado com o seu nome de computador.</li>
<img src="../../images/Backup/1x/backup_from_PC/backup_destination.png" border="1" />
<li>Clique em <strong>Regras de c&oacute;pia de seguran&ccedil;a</strong> se desejar definir filtros ou regras de sincroniza&ccedil;&atilde;o.</li>

<li>Clique em <strong>Seguinte</strong> para rever as defini&ccedil;&otilde;es de c&oacute;pia de seguran&ccedil;a, e depois clique em <strong>Conclu&iacute;do</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/summary.png" border="1" />
<li>Pode ver o progresso de c&oacute;pia de seguran&ccedil;a na aplica&ccedil;&atilde;o principal.</li>
<img src="../../images/Backup/1x/backup_from_PC/progress.png" border="1" />
</ol>

<h3 class="list_head">Transferir ou restaurar uma vers&atilde;o anterior de um ficheiro sincronizado na Cloud Station Server</h3>
<ol>
  <li>Aceda a <strong>Cloud Station Server</strong> &gt; <strong>Hist&oacute;rico de Vers&otilde;es</strong> e localize o ficheiro ou pasta que deseja restaurar.</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/version_history.png" />
  <li>Selecione o ficheiro que pretende recuperar e clique em <strong>A&ccedil;&atilde;o</strong>. Clique em <strong>Percorrer vers&otilde;es anteriores</strong>. Se um ficheiro tiver sido eliminado ou removido de forma acidental no seu computador, pode clicar em <strong>Restaurar</strong> para o restaurar. </li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions_server.png" />
<li>Selecione a vers&atilde;o do ficheiro que pretende transferir e clique em <strong>Transferir</strong>. Ou, se tiver a certeza de que pretende a vers&atilde;o a selecionada restaurada, clique em <strong>Restaurar</strong> e ir&aacute; sobrepor a sua vers&atilde;o atual.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/previous_versions.png" />

</ol>


  <h3 class="list_head">5. Prote&ccedil;&atilde;o adicional dos seus dados</h3>
  
<p>Para consultar mais formas para proteger e efetuar c&oacute;pia de seguran&ccedil;a dos seus dados, clique <a href="https://www.synology.com/knowledgebase/tutorials#BackupRestore" target="_blank">aqui</a> para aceder aos tutoriais que detalham outros servi&ccedil;os de c&oacute;pia de seguran&ccedil;a disponibilizados no DSM.</p>

</div>
<div class="page-info">
  <ul>
    <li>A seguir neste t&oacute;pico: <a href="backup_backup.html">Salvaguardar dados do seu Synology NAS</a> </li>
  </ul>
</div>
</body>

</html>