<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Introdu&ccedil;&atilde;o &agrave; Audio Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Sincronize ficheiros entre Synology NAS e o seu computador, usando a Cloud Station</h1>
<div class="tutorials_content">

<img src="../../images/BuildCloud/1x/cloud_sync_files/02_1_build_your_private_cloud_CloudStation.png"/>

<h2>Vis&atilde;o Geral</h2>
<p>Cloud Station para Synology NAS &eacute; uma aplica&ccedil;&atilde;o de sincroniza&ccedil;&atilde;o de ficheiros que lhe permite sincronizar facilmente ficheiros na sua Synology NAS com outros dispositivos, como computadores ou dispositivos m&oacute;veis (com DS cloud). Instale o <strong>Cloud Station Server</strong> no seu Synology NAS e <strong>Cloud Station Drive</strong> no seu computador, para sincronizar automaticamente os ficheiros armazenados no seu computador com o seu Synology NAS.</p>
<h3 class="list_head">Configurar a liga&ccedil;&atilde;o entre o seu Synology NAS e o seu computador</h3>
<ol>
<li>Aceda ao <b>Centro de Pacotes</b>, localize <b>Cloud Station Server</b>, e depois clique em <strong>Instalar</strong>.</li>
 
  <li>Inicie o <strong>Cloud Station Server</strong>.</li>
  <li>No separador <strong>Vis&atilde;o Geral</strong>, clique no bot&atilde;o em <strong>Cloud Station Drive</strong> para transferir <strong>Cloud Station Drive </strong>para o seu sistema operativo. (Tamb&eacute;m pode transferir a Cloud Station a partir do <a href="https://www.synology.com/en-us/support/download" target="_blank">Centro de Transfer&ecirc;ncias da Synology</a>.)</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/download_drive.png" />
<li>Abra o instalador no seu computador e siga as instru&ccedil;&otilde;es no ecr&atilde;.</li>
<li>Depois da instala&ccedil;&atilde;o, execute a <strong>Cloud Station</strong> no seu computador. Clique em <strong>Come&ccedil;ar Agora</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/start_now.png" />
<li>Introduza o endere&ccedil;o do Synology NAS que executa a Cloud Station (ou QuickConnect ID), nome de utilizador e palavra-passe. Pode clicar no &iacute;cone de pesquisa &agrave; direita para pesquisar IPs dentro da sua LAN. Clique em <strong>Seguinte</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/enter_credentials.png" />
<li>Selecione as pastas que deseja sincronizadas no seu Synology NAS e no seu computador, clicando nos &iacute;cones <strong>Editar</strong>. Pode depois clicar em <strong>Avan&ccedil;ado</strong> para configurar as defini&ccedil;&otilde;es de sincroniza&ccedil;&atilde;o</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/select_folders.png" />
<li>Desmarque as pastas que n&atilde;o deseja sincronizadas.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/selective_sync_folder.png" />
<li>Configure um tamanho m&aacute;ximo de ficheiro ou nomes de ficheiros da lista exclu&iacute;da, ou tipos de ficheiro a n&atilde;o sincronizar.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/selective_sync_files.png" />
<li>Selecione entre sincronizar bidirecionalmente ou apenas transferir do seu Synology NAS.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/sync_direction.png" />
<li>Clique em <strong>Conclu&iacute;do</strong> para concluir a configura&ccedil;&atilde;o.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/done.png" />

<li>Pode encontrar o &iacute;cone da Cloud Station o tabuleiro de sistema. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/system_tray.png" />
<li>Clique no &iacute;cone do tabuleiro de sistema para abrir o menu do tabuleiro. Aqui pode ver o progresso e estado dos seus ficheiros. Aqui pode ver o progresso e estado dos seus ficheiros. Clique em <strong>Aplica&ccedil;&atilde;o principal</strong> para abrir a Cloud Station. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/15.png" />
<li>Depois da abertura ser-lhe-&atilde;o mostradas algumas sugest&otilde;es sobre como usar a Cloud Station. Clique na seta para a direita para ver mais sugest&otilde;es, ou clique em <strong>Tutoriais online</strong> para mais informa&ccedil;&otilde;es. Caso n&atilde;o precise das sugest&otilde;es, assinale a caixa junto de <strong>N&atilde;o mostrar novamente</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/tutorial.png" />
<li>Agora pode gerir as suas tarefas de sincroniza&ccedil;&atilde;o na <strong>Cloud Station Drive</strong>. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/main_app_manage.png" />
</ol>
<h3 class="list_head">Transferir uma vers&atilde;o anterior de um ficheiro sincronizado</h3>
<ol>
<li>Clique no &iacute;cone da <strong>Cloud Station Drive</strong> no seu tabuleiro de sistema e clique no &iacute;cone da pasta.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/main_app_menu.png" />
<li>Clique com o bot&atilde;o direito do rato no ficheiro selecionado e escolha <strong>Synology Cloud Station</strong> &gt; <strong>Pesquisar vers&otilde;es anteriores</strong>.</li>

<img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions.png" />
<li>Localize a vers&atilde;o que pretende transferir e clique no &iacute;cone de transfer&ecirc;ncia.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/save_previous_versions.png" />
</ol>

<h3 class="list_head">Transferir ou restaurar uma vers&atilde;o anterior de um ficheiro sincronizado na Cloud Station Server</h3>
<ol>
  <li>Aceda a <strong>Cloud Station Server</strong> &gt; <strong>Hist&oacute;rico de Vers&otilde;es</strong> e localize o ficheiro ou pasta que deseja restaurar.</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/version_history.png" />
  <li>Selecione o ficheiro que pretende recuperar e clique em <strong>A&ccedil;&atilde;o</strong> &gt; <strong>Percorrer vers&otilde;es anteriores</strong>.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions_server.png" />
<li>Selecione a vers&atilde;o do ficheiro que pretende transferir e clique em <strong>Transferir</strong>. Ou, se tiver a certeza de que pretende a vers&atilde;o a selecionada restaurada, clique em <strong>Restaurar</strong> e ir&aacute; sobrepor a sua vers&atilde;o atual.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/previous_versions.png" />

</ol>
<h3 class="list_head">Notas importantes</h3>  
  <ol>
<li>Mantenha sempre o hist&oacute;rico das vers&otilde;es, para a eventualidade de um ficheiro ser removido ou sobreposto por acidente.</li>
<li>Em <strong>Defini&ccedil;&otilde;es globais</strong>, pode configurar se um ficheiro ser&aacute; recolhido do seu NAS ou eliminado no seu NAS quando elimina um ficheiro no seu computador.</li>
</ol>

<h3 class="list_head">Sincronizar Dados para os seus Dispositivos M&oacute;veis</h3>
<p>DS cloud est&aacute; dispon&iacute;vel de forma gratuita na <a href="https://itunes.apple.com/us/app/ds-cloud/id590216612?mt=8" target="_blank">App Store da Apple</a> e <a href="https://play.google.com/store/apps/details?id=com.synology.dscloud" target="_blank">Loja Google Play</a>. Pode tamb&eacute;m digitalizar o c&oacute;digo QR abaixo para transferir directamente.</p>
<img src="../../images/BuildCloud/1x/cloud_sync_files/QR_code.png" />
</div>

<div class="page-info">
  <ul>
    <li>A seguir neste t&oacute;pico: <a href="cloud_set_up_quickconnect.html">Aceda ao seu Synology NAS atrav&eacute;s da Internet e partilhe ficheiros</a> </li>
  </ul>
</div>
</body>

</html>
