<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Dela fill&auml;nkar</h2>

<p>Filer eller mappar som lagras p&aring; din DiskStation kan delas snabbt och enkelt. H&ouml;gerklicka helt enkelt p&aring; en mapp och v&auml;lj <strong>Dela fill&auml;nkar</strong>. Detta genererar en l&auml;nk och en QR-kod som kan skickas till v&auml;nner och andra anv&auml;ndare. De kan f&ouml;lja l&auml;nken f&ouml;r att ladda ned den valda filen eller mappen, oavsett om de har ett DSM-konto eller inte.</p>


<h4>F&ouml;r att dela fill&auml;nkar:</h4>
<ol>
<li>V&auml;lj de filer eller mappar som du vill dela.</li>
<li>H&ouml;gerklicka p&aring; en av de valda filerna eller mapparna eller klicka p&aring; menyn <b>&Aring;tg&auml;rd</b>. V&auml;lj sedan <b>Dela fill&auml;nkar</b>.</li>
<li>Delningsl&auml;nkarna och QR-koder finns i f&ouml;nstret som visas.</li>
<li>F&ouml;ljande alternativ kan ocks&aring; &auml;ndras:
<ul>
 <li><strong>Giltighetsperiod</strong>: Du kan anpassa giltiga &aring;tkomstperioder och antal &aring;tkomster f&ouml;r delade l&auml;nkar. 
  <ul>
<li><strong>Anpassa giltighetsperiod</strong>: Du kan best&auml;mma hur l&auml;nge en delad l&auml;nk f&ouml;rblir aktiv efter att den skapats. L&auml;nken kommer att bli ogiltig n&auml;r den specificerade perioden f&ouml;rflutit.</li>
<li><strong>Anpassa antalet giltiga &aring;tkomster</strong>: Du kan best&auml;mma hur m&aring;nga g&aring;nger det g&aring;r att f&aring; &aring;tkomst till en delad l&auml;nk. L&auml;nken blir ogiltig n&auml;r det specificerade antalet g&aring;nger uppn&aring;tts.</li>
</ul>
</li>
<li><strong>Dela med DSM-anv&auml;ndare</strong>: Du kan dela l&auml;nken med DSM-anv&auml;ndare eller grupper genom att v&auml;lja dem fr&aring;n rullgardinsmenyn. V&auml;nligen observera att du inte kan dela med kontot eller anv&auml;ndargruppen g&auml;st.</li>

<li><strong>Dela med andra</strong>: Du kan dela l&ouml;senordsskyddade l&auml;nkar med andra personer, inklusive dem som inte &auml;r anv&auml;ndare i DSM.</li>

</ul>
</li>
</ol>

<h4> F&ouml;r att aktivera l&auml;nkar f&ouml;r gofile.me: </h4> 
<ol>
<li>G&aring; till <strong>Kontrollpanel</strong> &gt; <strong>QuickConnect</strong> och s&auml;kerst&auml;ll att <strong>Aktivera QuickConnect</strong> &auml;r markerad. Om du inte har installerat QuickConnect kan du g&ouml;ra detta p&aring; den h&auml;r sidan.</li>
<li>Klicka d&auml;refter p&aring; <strong>Avancerad</strong> och s&auml;kerst&auml;ll att <strong>Fildelning</strong> &auml;r markerad.</li>
<li>Delade filer kan laddas ned utan DSM-konto genom att anv&auml;nda delningsl&auml;nken f&ouml;r gofile.me.</li> 
</ol>
<h3>Anpassa sida f&ouml;r delad l&auml;nk</h3>
<p>File Station erbjuder olika alternativ f&ouml;r att stilisera sidan f&ouml;r delade l&auml;nk.</p>
<ol>
<li>G&aring; till <strong>File Station</strong> &gt; <strong>Inst&auml;llningar</strong> &gt; <strong>Delade l&auml;nkar</strong> &gt; <strong>Anpassad</strong>.</li>
<li>V&auml;lj <strong>Anpassa sida f&ouml;r delad l&auml;nk</strong> och klicka p&aring; <strong>Anpassade inst&auml;llningar</strong>.</li>
<li>Du kan anpassa sidan p&aring; nedanst&aring;ende s&auml;tt:
  <ul>
<li><strong>Mall</strong>: V&auml;lj valfri standardmall.</li>
<li><strong>Bakgrund</strong>: Klicka p&aring; miniatyrbild eller <strong>+</strong> f&ouml;r att v&auml;lja en standardbakgrundsbild, en bild p&aring; din DiskStation eller en tidigare anv&auml;nd bild.</li>
<li><strong>Logo</strong>: Klicka p&aring; miniatyrbild eller <strong>+</strong> f&ouml;r att v&auml;lja en uppladdad bild (mindre &auml;n 1 MB), en bild p&aring; din DiskStation eller en tidigare anv&auml;nd bild. Logotypen kan placeras i n&aring;got av de fyra h&ouml;rnen.</li>
</ul>
</li>
<li>Klicka p&aring; <strong>F&ouml;rhandsgranskning</strong> f&ouml;r att se om det beh&ouml;vs n&aring;gra justeringar.</li>
<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att anv&auml;nda inst&auml;llningarna.</li>
</ol>

<div class="section">
<h4>Obs:</h4>
<ol>
<li>De anpassade inst&auml;llningar till&auml;mpas p&aring; alla delade l&auml;nkar oavsett den tid de skapats.</li>
<li>Du kan bara anv&auml;nda bilder i de f&ouml;ljande formatet som bakgrundsbild/logotyp: .jpe, jpeg, .jpg, .bmp, .gif, and .png</li></ol>
</div>

<h3>Hantera delade l&auml;nkar</h3>
<p>Befintliga delade l&auml;nkar kan hanteras genom att g&aring; till <strong>Verktyg</strong> &gt; <strong>Hantering av delade l&auml;nkar</strong>. I f&ouml;nstret som visas finns det alternativ att &auml;ndra, dela eller ta bort befintliga delade l&auml;nkar.</p>

<div class="section">
<h4>Obs:</h4>
<ol>
  <li>Du kan skapa upp till 1000 delade l&auml;nkar.</li>
  <li>Avsnittet <strong>Status</strong> f&ouml;r vardera delad l&auml;nk visar en av f&ouml;ljande:
<ul>
<li><b>Giltig</b>: Den delade l&auml;nken fungerar.</li>
<li><b>Har upph&ouml;rt att g&auml;lla</b>: Giltighetsperioden f&ouml;r den delande l&auml;nken har upph&ouml;rt att g&auml;lla.</li>
<li><b>Ogiltig</b>: Den delade filen eller mappen finns inte l&auml;ngre eller s&aring; har du inte r&auml;tt r&auml;ttigheter f&ouml;r &aring;tkomst till fil eller mapp.</li>
<li><b>Inte giltig &auml;nnu</b>: Den delade l&auml;nken har &auml;nnu inte blivit aktiv.</li>
</ul>
</li>
</ol>

</div>
</body>
</html>
