<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Ladda upp filer eller mappar</h2>
<p>Anv&auml;nd n&aring;gon av f&ouml;ljande metoder f&ouml;r att ladda upp filer eller mappar fr&aring;n din dator till DiskStation.</p>
<p>F&ouml;r att f&aring; full &aring;tkomst till uppladdningsmetoderna som visas h&auml;r nedanf&ouml;r, installera senaste versionen av Java Runtime Environment (JRE) och Flash Player f&ouml;rst. </p>


<h4>Metod 1:</h4>
<ol>
<li>
Fr&aring;n den &ouml;vre delen av den v&auml;nstra panelen, v&auml;lj en m&aring;lmapp p&aring; DiskStation. 
</li>
<li>
Klicka p&aring; <b>Ladda upp</b>, v&auml;lj <strong>Ladda upp - Hoppa &ouml;ver</strong> eller <strong>Ladda upp - Skriv &ouml;ver</strong> och v&auml;lj filer eller mappar fr&aring;n din lokala dator. </li>
</ol>
<h4>Metod 2:</h4>
<ol>
	<li>G&aring; till <strong>Inst&auml;llningar</strong>, markera <strong>Bl&auml;ddra bland filer fr&aring;n lokal dator med File </strong>Station och uppdatera webbsidan f&ouml;r att se filer fr&aring;n din lokala dator p&aring; den nedre delen av den v&auml;nstra panelen.</li>
<div class="section">
<h4>Obs!</h4>
<p>Alternativet <strong>Bl&auml;ddra bland filer fr&aring;n lokal dator med File Station</strong> kan bara tr&auml;da i kraft efter att du installerat och aktiverat JRE p&aring; din dator.</p>
</div>
	<li>Fr&aring;n den nedre delen av den v&auml;nstra panelen, v&auml;lj en mapp p&aring; din lokala dator. Huvudavsnittet visar nu inneh&aring;llet i den valda mappen.
	</li>
	<li>V&auml;lj de filer eller mappar du vill ha i huvudavsnittet och klicka sedan p&aring; <b>Ladda upp</b>. 
</li>
	<li>V&auml;lj en m&aring;lmapp p&aring; DiskStation i f&ouml;nstret som visas.
	</li>
	<li>I det &ouml;vre h&ouml;gra h&ouml;rnet av f&ouml;nstret, v&auml;lj <b>Skriv &ouml;ver</b> om du vill skriva &ouml;ver filer eller mappar med samma namn i m&aring;lmappen. I annat fall, v&auml;lj <b>Hoppa &ouml;ver</b>.
</li>
	<li>Klicka p&aring; <b>OK</b> f&ouml;r att starta uppladdning.
</li>
</ol>
<h4>Metod 3:</h4>
<ol>
<li>G&aring; till <strong>Inst&auml;llningar</strong>, markera <strong>Bl&auml;ddra bland filer fr&aring;n lokal dator med File </strong>Station och uppdatera webbsidan f&ouml;r att se filer fr&aring;n din lokala dator p&aring; den nedre delen av den v&auml;nstra panelen.</li>
<li>
I den v&auml;nstra panelen, drag en mapp fr&aring;n din lokala dator (den nedre delen) till n&aring;gon mapp p&aring; DiskStation (den &ouml;vre delen).
</li>
<li>
I pop-up-menyn som visas, v&auml;lj huruvida du vill skriva &ouml;ver eller hoppa &ouml;ver filer/mappar med samma namn i m&aring;lmappen.
</li>
</ol>
<h4>Metod 4:</h4>
<ol>
<li>
Fr&aring;n den &ouml;vre delen av den v&auml;nstra panelen, v&auml;lj en m&aring;lmapp p&aring; DiskStation.
</li>

<li>
V&auml;lj filerna p&aring; din dators skrivbord eller i utforskaren (till exempel Windows Explorer eller Mac Finder) och dra och sl&auml;pp dem i File Station i webbl&auml;saren.
</li>

<li>
I dialogen som visas, v&auml;lj huruvida du vill skriva &ouml;ver eller hoppa &ouml;ver filer med samma namn i m&aring;lmappen.</li>
<div class="section">
<h4>Obs!</h4>
<ul>
<li><b>Metod 4</b> har endast st&ouml;d i specifika webbl&auml;sare: Chrome, Firefox, Safari 5.1 och h&ouml;gre. Det finns dock inte st&ouml;d f&ouml;r Mac n&auml;r <strong>Bl&auml;ddra bland filer fr&aring;n lokal dator med File Station</strong> &auml;r markerad.</li>
<li>
Du kan ocks&aring; dra och sl&auml;ppa mappar eller tomma filer, men endast n&auml;r <strong>Bl&auml;ddra bland filer fr&aring;n lokal dator med File Station</strong> &auml;r markerad i de l&auml;sare som listas h&auml;r ovanf&ouml;r. I annat fall kan du inte ladda upp mappar och tomma filer genom att anv&auml;nda <strong>Metod 4</strong>.</li>
	<li>
Om du anv&auml;nder Chrome f&ouml;r Linux och &auml;r inloggad till DSM via HTTPS-protokollet beh&ouml;ver du importera ett betrott certifikat (i <b>Kontrollpanel</b> &gt; <b>S&auml;kerhet</b> &gt; <strong>Certifikat</strong>) f&ouml;r att kunna ladda upp genom att anv&auml;nda <b>Metod 4</b>.
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Obs!</h4>
<ol>
<li>
Du kan l&auml;gga till upp till 1000 filer i din uppladdningsk&ouml;.
</li>
	<li>
	Du kan ladda upp filer st&ouml;rre &auml;n 4GB om du anv&auml;nder Google Chrome, Firefox, Safari 5.1 eller senare eller n&auml;r <strong>Bl&auml;ddra bland filer fr&aring;n lokal dator med File Station</strong> &auml;r markerad. I annat fall kan endast uppladdning av filer upp till 2GB ske &aring;t g&aring;ngen.</li>
	<li>
I en icke-krypterad delad mapp, ska fil-/mappnamn vara inom 255 tecken (upp till omkring 80 tecken fick icke-latinska spr&aring;k); i en krypterad delad mapp ska det vara inom 143 tecken (upp till omkring 47 tecken f&ouml;r icke-latinska spr&aring;k).
</li>
<li>
Namn p&aring; fil/mapp f&aring;r inte inneh&aring;lla f&ouml;ljande tecken: \ / : * ? &quot; &gt; |.
</li>
<li>
Namn p&aring; fil/mapp kan inte b&ouml;rja med &ldquo;._&rdquo;.
</li>
<li>Du kan ladda upp filer som har en storlek p&aring; 0KB endast om du har installerat JRE.</li>
</ol>
</div>


<div class="section">
<h4>Fels&ouml;kning</h4>
<p>Om du inte kan bl&auml;ddra ordentligt bland dina lokala objekt p&aring; din Mac med Safari, v&auml;nligen g&ouml;r f&ouml;ljande:</p>
<ol>
<li>P&aring; din Mac, &ouml;ppna Safari och v&auml;lj <strong>Inst&auml;llningar</strong> fr&aring;n menyn Safari.</li>
<li>Klicka p&aring; <strong>Hantera webbplatsinst&auml;llningar</strong> p&aring; fliken <strong>S&auml;kerhet</strong>.</li>
<li>Under <strong>Java</strong>, v&auml;lj din DSM-&quot;webbplats&quot; </li>
<li>V&auml;lj <strong>K&ouml;r i os&auml;kert l&auml;ge</strong>.</li>
</ol>
</div>



</body>
</html>
