<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM mobile</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script> <script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>DSM mobile</h1>

<p>DSM mobile s&aelig;tter <b>admin</b> (eller en bruger i gruppen <b>administrators</b>) i stand til at styre DSM-indstillinger og unders&oslash;ge DSM-oplysninger med en iOS<sup>&reg;</sup> - (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup> eller iPod touch<sup>&reg;</sup>) eller Android<sup>&reg;</sup>-enhed. Denne DSM-mobilhj&aelig;lp indeholder f&oslash;lgende emner og ressourcer, som kan hj&aelig;lpe dig med at komme igang.</p>

<h2>Log ind og log ud</h2>

<div name="contents" id="login">
<p>N&aring;r du opretter forbindelse til DSM med webbrowseren p&aring; din iOS- eller Android-enhed, vil du se loginsk&aelig;rmen, hvor du kan indtaste dine DSM-kontooplysninger.</p>

<h4>S&aring;dan logger du ind p&aring; DSM mobile:</h4>
<p>Indtast dine DSM-brugerlegitimationsoplysninger, og tryk p&aring; <b>Log ind</b>. Hvis du vil gemme dine loginoplysninger her og logge ind automatisk n&aelig;ste gang, skal du aktivere <b>Husk mig</b>-omskifteren, f&oslash;r du logger ind.</p>

<h4>S&aring;dan logger du ud af DSM mobile:</h4>
<ol>
  <li>Tryk p&aring; valgknappen nederst til h&oslash;jre p&aring; startsiden (iPhone/iPod touch- eller Android-telefon) eller venstre panel (iPad eller Android-tablet).</li>
  <li>Tryk p&aring; <b>Indstillinger</b> og <b>Log ud</b>.</li>
</ol>
</div>

<h2>Administrer DSM-brugere</h2>

<div name="contents" id="user">
<p>Tryk p&aring; <b>Bruger &amp; gruppe</b> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet) for at se brugerlisten.</p>

<h4>S&aring;dan opretter du en bruger:</h4>
<ol>
  <li>Tryk p&aring; <b>+</b>, og indtast s&aring; brugernavnet, adgangskoden og e-mailadresse for den nye bruger.</li>
  <li>Aktiver <b>Send underretning</b> for at sende en underretningsmail til brugerens e-mailadresse, n&aring;r hans eller hendes DSM-brugerkonti oprettes.<br><span class="note_head">Bem&aelig;rk: </span>F&oslash;r du sender underretningen, skal du s&oslash;rge for, at underretningsindstillinger er udfyldt p&aring; din Synology NAS. Log ind p&aring; skrivebordsudgaven af DSM med computerens webbrowser, og g&aring; til <b>Hovedmenu</b>&gt;<b>Kontrolpanel</b>&gt;<b>Underretning</b>&gt;<b>E-mail</b> for at &aelig;ndre indstillingerne.</li>
  <li>Tryk p&aring; <b>Udf&oslash;r</b> for at bekr&aelig;fte, eller tryk p&aring; venstre pil for at annullere.</li>
</ol>

<h4>S&aring;dan finder du hurtigt en bruger:</h4>
<p>Indtast brugerens navn i s&oslash;gefeltet.</p>

<h4>S&aring;dan &aelig;ndrer du en brugers oplysninger:</h4>
<ol>
  <li>Tryk p&aring; navnet p&aring; brugeren, og g&oslash;r et af f&oslash;lgende:
    <ul>
      <li>Ret brugernavnet eller adgangskoden i feltet <b>Navn</b> eller <b>Adgangskode</b>.</li>
    <li>Klik p&aring; <b>Deaktiver</b> for at deaktivere brugeren. Du kan v&aelig;lge at aktivere brugeren senere uden at miste hans/hendes indstillinger.</li>
    <li>Klik p&aring; <b>Administrator</b> for at tilf&oslash;je brugeren til gruppen <b>admin</b>. Enhver bruger i gruppen <b>admin</b> f&aring;r administrative privilegier til at &aelig;ndre DSM-indstillinger via DSM mobile eller computerens webbrowser.</li>
    </ul>
  </li>
  <li>Under <b>Privilegier</b> skal du g&oslash;re et af f&oslash;lgende og s&aring; trykke p&aring; <b>Tilbage</b>:
    <ul>
      <li>Tryk p&aring; <b>Delt mappe</b>, og tryk p&aring; navnet p&aring; en delt mappe for at &aelig;ndre brugerens adgangsprivilegium: <b> L&aelig;s/skriv</b>: Brugeren kan foretage &aelig;ndringer til filerne og undermapperne i den delte mappe <b>Skrivebeskyttet</b>: Brugeren f&aring;r adgang til filer og undermapper i den delte mappe, men kan ikke foretage &aelig;ndringer til dem <b>Ingen adgang</b>: Brugeren f&aring;r ikke adgang til filerne og undermapperne i den delte mappe.<br><span class="note_head">Bem&aelig;rk: </span>Hvis der opst&aring;r privilegiekonflikter, vil prioriteten v&aelig;re: <span class="note_content">Ingen adgang &gt; L&aelig;s/skriv &gt; Skrivebeskyttet</span>.</li>
      <li>Tryk p&aring; <b>Program</b> for at &aelig;ndre brugerens adgangsprivilegier til DSM-programmer.</li>
    </ul>
  </li>
  <li>Tryk p&aring; <b>Udf&oslash;r</b> for at bekr&aelig;fte, eller tryk p&aring; venstre pil for at annullere.</li>
</ol>
</div>

<h2>Administrer delte mapper</h2>

<div name="contents" id="shared">
<p>Tryk p&aring; <b>Delt mappe</b> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet) for at se listen over delte mapper p&aring; din Synology NAS.</p>

<h4>S&aring;dan opretter du en delt mappe:</h4>
<ol>
  <li>Tryk p&aring; <b>+</b>, og indtast s&aring; navnet p&aring; den nye mappe.</li>
  <li>Tryk p&aring; <b>Udf&oslash;r</b> for at bekr&aelig;fte, eller tryk p&aring; venstre pil for at annullere.</li>
</ol>

<h4>S&aring;dan &aelig;ndrer du en delt mappe:</h4>
<p>Tryk p&aring; navnet p&aring; den delte mappe, og g&oslash;r et af f&oslash;lgende:</p>
<ul>
  <li>Ret navnet p&aring; den delte mappe i feltet <b>Navn</b>.</li>
  <li>Tryk p&aring; <b>Brugertilladelser</b> og s&aring; p&aring; en bruger for at &aelig;ndre hans eller hendes adgangsprivilegier til den delte mappe: <b> L&aelig;s/skriv</b>: Brugeren kan foretage &aelig;ndringer til filerne og undermapperne i den delte mappe <b>Skrivebeskyttet</b>: Brugeren f&aring;r adgang til filer og undermapper i den delte mappe, men kan ikke foretage &aelig;ndringer til dem <b>Ingen adgang</b>: Brugeren f&aring;r ikke adgang til filerne og undermapperne i den delte mappe.<br><span class="note_head">Bem&aelig;rk: </span>Hvis der opst&aring;r privilegiekonflikter, vil prioriteten v&aelig;re: <span class="note_content">Ingen adgang &gt; L&aelig;s/skriv &gt; Skrivebeskyttet</span>.</li>
  <li>Du kan ogs&aring; trykke p&aring; <b>Gruppetilladelser</b> for at konfigurere privilegier til grupper.<br><span class="note_head">Bem&aelig;rk: </span>Gruppetilladelser har h&oslash;jere prioritet end brugertilladelser.</li>
</ul>
</div>

<h2>Aktiver tjenester</h2>

<div name="contents" id="services">
<p>Tryk p&aring; <b>Tjeneste</b> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet) for at aktivere eller deaktivere Synology NAS-tjenester.</p>

<h4>S&aring;dan administrerer du Synology NAS'ens LAN-tjenester:</h4>
<ul>
  <li>Aktiver eller deaktiver en af f&oslash;lgende:
    <ul>
      <li><b>Windows-filservice</b> g&oslash;r det muligt, at din Synology NAS bliver en Windows (CIFS)-filserver p&aring; LAN.</li>
      <li><b>Mac-filservice</b> g&oslash;r det muligt, at din Synology NAS bliver en Mac (AFP)-filserver p&aring; LAN.</li>
      <li><b>NFS-service</b> g&oslash;r det muligt for Linux-klienten p&aring; LAN at f&aring; adgang til Synology NAS-data.</li>
      <li><b>Bonjour-printer</b> g&oslash;r det muligt for Mac-klienter at udskrive til USB-printer(e) tilsluttet din Synology NAS.</li>
      <li><b>Medieserver</b> g&oslash;r det muligt for DLNA/UPnP-hjemmeenheder p&aring; LAN at gennemg&aring; og afspille multimedieindhold p&aring; din Synology NAS.</li>
      <li><b>iTunes</b> g&oslash;r det muligt af iTunes-klienter p&aring; LAN at gennemg&aring; og afspille musik eller videoer p&aring; din Synology NAS.</li>
    </ul>
  </li>
</ul>

<h4>S&aring;dan administrerer du Synology NAS'ens internettjenester:</h4>
<ul>
  <li>Aktiver eller deaktiver en af f&oslash;lgende:
    <ul>
      <li><b>FTP</b> g&oslash;r det muligt for din Synology NAS at blive en FTP-server.</li>
      <li><b>Webtjenester</b> g&oslash;r det muligt for dig at v&aelig;re v&aelig;rt for websteder(med PHP+MySQL-support) p&aring; din Synology NAS.</li>
      <li><b>WebDAV</b> g&oslash;r det muligt for klientprogrammer at styre og redigere Synology NAS-filer via HTTP-protokollen.</li>
      <li><b>WebDAV (HTTPS)</b> g&oslash;r det muligt for klientprogrammer at styre og redigere Synology NAS-filer via HTTPS-protokollen.</li>
      <li><b><a name="filestationservice"></a>File Station</b> er et webbaseret program, der g&oslash;r det muligt at administrere Synology NAS-filer via en tilpasset port uden at logge ind p&aring; DSM.</li>
      <li><b>File Station (HTTPS)</b> g&oslash;r det muligt for dig at oprette forbindelse til File Station via HTTPS-protokollen.</li>
      <li><b>Surveillance Station</b> er et webbaseret program, der kan styre IP-kameraer til sikring af dit hjem eller kontormilj&oslash;.</li>
      <li><b>Audio Station</b> er et webbaseret program, der s&aelig;tter dig i stand il at &aring;bne musikbiblioteket p&aring; din Synology NAS.</li>
      <li><b>Photo Station</b> er et online-billedalbum integreret med en blog gemt p&aring; din Synology NAS.</li>
      <li><b><a name="downloadsationservice"></a>Download Station</b> (BT/HTTP/FTP/NZB/RSS) er et webbaseret program, der hj&aelig;lper dig med at downloade filer fra internettet til din Synology NAS.</li>
      <li><b>eMule</b> aktiverer Download Stations eMule-support.</li>
    </ul>
  </li>
</ul>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<p>Yderligere oplysninger om ovenst&aring;ende tjenester findes under f&oslash;lgende:</p>
	<ul>
		<li><b>DSM - Hj&aelig;lp</b> (findes ved at logge ind p&aring; skrivebordsudgaven af DSM i computerens webbrowser og g&aring; til <b>Hovedmenu</b>&gt;<b>DSM - Hj&aelig;lp</b>)</li>
		<li><b>Brugervejledning til Synology DSM</b> (findes i Synologys <a href="http://www.synology.com/support/download.php" target="_blank"> Downloadcenter</a>)</li>
	</ul>
</div>

<h2>Overv&aring;g systemressourcer</h2>

<div name="contents" id="resourcemonitor">
<p>Tryk p&aring; <b>Ressourceoverv&aring;gning</b> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet) for at overv&aring;ge din Synology NAS CPU- og hukommelsesforbrug.</p>
</div>

<h2>Vis systemoplysninger</h2>

<div name="contents" id="sysinfo">
<p>Tryk p&aring; <b>Systemoplysninger</b> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet) for at se en statusoversigt over din Synology NAS.</p>

<h4>S&aring;dan f&aring;r du vist din Synology NAS systemoplysninger:</h4>
<ol>
  <li>G&oslash;r et af f&oslash;lgende:
    <ul>
      <li>Tryk p&aring; <b>Generelt</b> for at se grundl&aelig;ggende oplysninger om din Synology NAS, herunder serienummer, modelnavn, m&aelig;ngde af fysisk hukommelse, DSM-version samt tidsoplysninger og varmestatus.</li>
      <li>Tryk p&aring; <b>Netv&aelig;rk</b> for at se din Synology NAS-netv&aelig;rkskonfiguration og status for hvert netv&aelig;rksinterface.</li>
      <li>Tryk p&aring; <b>Lager</b> for at se din Synology NAS diskenhedsforbrug.</li>
    </ul>
  </li>
  <li>Tryk p&aring; knappen <b>Opdater</b> &oslash;verst til h&oslash;jre for at holde systemoplysningerne opdaterede.</li>
</ol>
</div>

<h2>Firmware</h2>

<div name="contents" id="firmware">
<p>Tryk p&aring; <b>Firmware</b> for at se og opdatere din DSMversion.</p>

<h4>S&aring;dan konfigurerer du indstillinger for DSM-opgradering:</h4>
<ol>
  <li>Tryk p&aring; <strong>DSM-opgradering</strong>.</li>
  <li>V&aelig;lg et af f&oslash;lgende:
    <ul>
      <li>Kun vigtige opdateringer</li>
      <li>Nyeste DSM og alle opdateringer</li>
    </ul>
  </li>
  <li>Tryk p&aring; <strong>Udf&oslash;rt</strong>.</li>
</ol>

<h4>S&aring;dan downloader du tilg&aelig;ngelige opdateringer:</h4>
<ol>
  <li>Kontroller din DSM-version under <strong>Status</strong>.</li>
  <li>Hvis din DSM-version ikke er opdateret, skal du trykke p&aring; knappen <strong>Download</strong>, som ses under afsnittet <strong>Status</strong> for at opgradere din DSM.</li>
</ol>
</div>

<h2>Administrer IP-blokering</h2>

<div name="contents" id="block">
<p>Tryk p&aring; <b>IP-blokering</b> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet) for at forhindre uautoriseret login.</p>

<h4>S&aring;dan administrerer du IP-blokering:</h4>
<ol>
  <li>Tryk p&aring; konfigurationsknappen &oslash;verst til h&oslash;jre.</li>
  <li>Aktiver <b>Aktiver automatisk blokering</b> for at aktivere IP-blokering.</li>
  <li>Indtast et tal for <b>Loginfors&oslash;g</b> og <b>Inden for (minutter)</b> for at blokere en IP-adresse efter en angivet antal mislykkede loginfors&oslash;g inden for det angivne antal minutter.</li>
  <li>Du kan aktivere <b>Aktiver blokeringsudl&oslash;b</b> og angive <b>Oph&aelig;v blokering efter (dage)</b> for at oph&aelig;ve blokering af en IP-adresse efter et angivet antal dage. Hvis du indtaster &quot;0&quot; her, vil blokeret IP-adresse forblive blokeret uendeligt, til du fjerne den fra blokeringslisten.</li>
  <li>Tap <b>Udf&oslash;r</b>.</li>
</ol>

<h4>S&aring;dan tilf&oslash;jer du IP-adresser til tilladelses-/blokeringsliste:</h4>
<ol>
  <li>Hvis du vil tilf&oslash;je tillad/bloker IP til listen, skal du trykke p&aring; knappen Tilf&oslash;j &oslash;verst til h&oslash;jre og fanen <b>Tilladelsesliste</b> eller <b>Blokeringsliste</b>.</li>
  <li>Efter indtastning af IP-adressen, trykker du p&aring; <b>Udf&oslash;r</b>.</li>
</ol>
</div>

<h2>Administrer pakkecenter</h2>

<div name="contents" id="package">

<p>Synology har integreret tredjeparts- eller Synology-designede programmer i pakker, som kan installeres og nemt aktiveres p&aring; Synology NAS.</p>

<h4>S&aring;dan administrerer du Pakkecenter:</h4>
<p>Tryk p&aring; <strong>Pakkecenter</strong> p&aring; startsiden (iPhone/iPod touch eller Android-telefon) i venstre panel (iPad eller Android tablet) for at se pakkeoplysninger, k&oslash;re eller stoppe pakker eller opdatere til de seneste versioner.</p>


<h4>S&aring;dan k&oslash;rer eller standser du installerede pakker:</h4>
<p>Tryk p&aring; omskifteren ved siden af en pakke for at k&oslash;re eller stoppe den.</p>

<h4>S&aring;dan f&aring;r du vist pakker: </h4>
<p>Tryk p&aring; en pakke for at f&aring; vist dens oplysninger.</p>
     
<h4>S&aring;dan opdaterer du pakker:</h4>
<ol>
	<li>Tryk p&aring; fanen <strong>Opdater</strong> for at se aktuelt tilg&aelig;ngelige opdateringsversioner.</li>
    <li>Tryk p&aring; knappen til h&oslash;jre for en pakke for at opdatere til den seneste version.</li>   
</ol>
</div>    

<h2>Vis logfiler eller aktuelle forbindelser</h2>

<div name="contents" id="log">
<p>Tryk p&aring; <b>Log</b> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet) for at overv&aring;ge aktuelle forbindelser eller se logfilerne for Synology NAS-tjenester.</p>

<h4>S&aring;dan overv&aring;ger du aktuelle forbindelser:</h4>
<ul>
  <li>Tryk p&aring; <b>Seneste [number] logfiler</b> i afsnittet <b>Oversigt</b> for at se listen over brugere, som seneste fik adgang til Synology NAS-tjenester.</li>
</ul>

<h4>S&aring;dan f&aring;r du vist logfiler for bestemt service:</h4>
<ul>
  <li>Tryk p&aring; et emne i afsnittet <b>Begivenhedslogfiler</b> eller <b>Logfiler for filoverf&oslash;rsel</b> for at se listen over relevante logfiler.</li>
</ul>

</div>
<h2>Start mobilprogrammer</h2>
<div name="contents" id="launch">

<p>DSM mobile er et godt sted for dig at starte Synologys mobilprogrammer, der er installeret p&aring; din iOS- eller Android-enhed.</p>

<h4>S&aring;dan starter du Synologys mobilprogrammer p&aring; DSM mobile:</h4>
<p>Tryk p&aring; en af f&oslash;lgende programmer nederst p&aring; startsiden (iPhone/iPod touch- eller Android-telefon) eller venstre panel (iPad eller Android-tablet):</p>
<ul>
  <li><b>DS photo</b>(findes, n&aring;r tjenesten <b>Photo Station</b> er aktiveret)</li>
  <li><b>DS audio</b> (findes, n&aring;r tjenesten <b>Audio Station</b> er aktiveret)</li>
  <li><b>DS cam</b> (findes, n&aring;r tjenesten <b>Surveillance Station</b> er aktiveret)</li>
  <li><b>DS file</b> (findes, n&aring;r tjenesten <b>WebDAV</b> er aktiveret)</li>
</ul>

<div class="section">
<h4>Bem&aelig;rk:</h4>
	<ul>
		<li>Yderligere oplysninger om disse programmer findes i Hj&aelig;lpe-filerne, der leveres med programmer.</li>
     </ul> 
</div>

<h2>S&aelig;t gang i Synology NAS<br> <span style="font-size:80%;">(Genstart, Luk eller Bip)</span> </h2>

<div name="contents" id="restart">
<p>DSM mobile s&aelig;tter dig i stand til at genstarte eller lukke din Synology NAS med din IOS- eller Android-enhed. Hvis der er flere Synology NAS i n&aelig;rheden, kan du ogs&aring; hurtigt identificere din Synology NAS ved at anmode den om at afspille biplyde.</p>

<h4>S&aring;dan s&aelig;tter du gang i din Synology NAS:</h4>
<ol>
  <li>Tryk p&aring; valgknappen nederst til h&oslash;jre p&aring; startsiden (iPhone/iPod touch- eller Android-telefon) eller venstre panel (iPad eller Android-tablet).</li>
  <li>G&oslash;r et af f&oslash;lgende:
    <ul>
      <li>Tryk p&aring; <b>Genstart</b> og s&aring; p&aring; <b>Ja</b> for at genstarte din Synology NAS.</li>
      <li>Tryk p&aring; <b>Luk</b> og s&aring; p&aring; <b>Ja</b> for at lukke din Synology NAS.</li>
      <li>Tryk p&aring; <b>Find mig</b> for at anmode Synology NAS om at afspille biplyde. Tryk p&aring; <b>OK</b> for at standse bippene.</li>
    </ul>
  </li>
</ol>
</div>

<h2>Skift til skrivebordstilstanden af DSM</h2>

<div name="contents" id="desktopedition">

<p>Tryk p&aring; indstillingsikonet, og v&aelig;lg <b>Skrivebordstilstand</b> for at skifte til skrivebordstilstanden af DSM.</p>
</div>



<h2>Udnyt Lagerstyring</h2>
<div name="contents" id="contents12">
<p><strong>Lagerstyring</strong> s&aelig;tter dig i stand til hurtigt at se forbrugs- og sundhedsstatus for systemdiskenheder og diske.</p>

<h4>S&aring;dan f&aring;r du vist diskenhedsoplysninger:</h4>
	<ol>
		<li>Tryk p&aring; <strong>Lagerstyring</strong> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet).</li>
		<li>Tryk p&aring; fanen <strong>Diskenhed</strong>.</li> 
		<li>Tryk p&aring; en diskenhed i listen for at se de detaljerede oplysninger.</li>
	</ol>

<h4>S&aring;dan f&aring;r du vist diskoplysninger:</h4>
	<ol>
		<li>Tryk p&aring; <strong>Lagerstyring</strong> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet).</li>
		<li>Tryk p&aring; fanen <strong>HDD/SDD</strong> tab.</li>
		<li>Tryk p&aring; en disk i listen for at se dens sundheds- og S.M.A.R.T.-oplysninger.</li>
	</ol>

<h4>S&aring;dan starter eller stopper du S.M.A.R.T.-test:</h4>
	<ol>
		<li>Tryk p&aring; <strong>Lagerstyring</strong> p&aring; startsiden (iPhone/iPod touch- eller Android-telefonen) eller i venstre panel (iPad- eller Android-tablet).</li>
		<li>Tryk p&aring; fanen <strong>HDD/SDD</strong> tab.</li>
		<li>Tryk p&aring; en disk i listen for at se dens sideoplysninger.</li>
		<li>Tryk p&aring; <strong>S.M.A.R.T.-test</strong> for at starte en S.M.A.R.T.-test eller <strong>Stop</strong> for at standse den.</li>
     </ol>
     
</div>




<h2>Flere oplysninger</h2>

<div name="contents" id="contents11">
<p>Hvis du har brug for fejlfindingsoplysninger eller vil vide mere om Synology, skal du trykke p&aring; f&oslash;lgende links for at hente Synologys onlineressourcer:</p>
<ul>
  <li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">Ofte stillede sp&oslash;rgsm&aring;l</a>
</li>
  <li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
  <li><a href="http://forum.synology.com" target="_blank">Forum</a></li>
  <li><a href="http://www.synology.com/support/download.php" target="_blank">Downloadcenter</a></li>
  <li><a href="https://account.synology.com/support/support_form.php" target="_blank">Teknisk support</a></li>
</ul>
</div>

</body>
</html>
