<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Nyd multimedieindhold, gemt p&aring; Synology NAS, p&aring; store sk&aelig;rme</title>
</head>

<body class="tutorial-content-box" >

<h1>Nyd multimedieindhold, gemt p&aring; Synology NAS, p&aring; store sk&aelig;rme</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_media_server/enjoy_multimedia_contents_stored_on_synology_nas_with_big_screens.jpg" width="600" height="301" />
<h2>Oversigt</h2>
<p>Synology NAS kan bruges som en multimedieserver p&aring; det lokale netv&aelig;rk, s&aring; hjemmeenheder som f.eks. fjernsyn/stereoanl&aelig;g og Sony PlayStation3/Xbox 360 kan afspille dens multimedieindhold. Disse enheder er DLNA/UPnP-kompatible <b>digitale medieadaptere</b> (DMA). Hvis du vil streame multimedieindhold fra din Synology NAS til DMA-enheder til afspilning, skal du konfigurere medieafspilningsindstillingerne. For eksempel ved at justere indstillinger for gennemgang for mediefiler og forbedre kompatibiliteten for filerne. Denne funktion findes i pakken <strong>Medieserver</strong>.</p>

<h3 class="list_head">1. Installer Medieserver</h3>
<p>Du kan installere Medieserver ved at g&aring; til <b>Pakkecenter</b>, finde <b>Medieserver</b> og klikke p&aring; <b>Installer</b>.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_install_media_server.png" width="640" border="1" />

<h3 class="list_head">2. Upload multimediefiler til din Synology NAS</h3>
<p>De standard delte mapper <b>photo</b>, <b>music</b> og <b>video</b> oprettes automatisk og indekseres efter installation af Medieserver p&aring; din NAS. Du skal blot uploade mediefiler som f.eks. billeder, sange eller videoer til de tilsvarende mapper, hvorefter der er adgang til filerne fra dine DMA-enheder.</p>
<div class="code_div"><b>Bem&aelig;rk:</b> De tilknyttede delte mapper fra fjernservere kan ikke tilf&oslash;jes som indekserede mapper. Du kan tilf&oslash;je op til 100 indekserede mapper p&aring; din Synology NAS.</div>

<h3 class="list_head">3. Konfigurer indstillinger for gennemgang for din medieafspiller</h3>
<p>Du kan bestemme, hvordan mediefiler p&aring; sin Synology NAS gennemg&aring;s af dine DMA-enheder.</p>
<ol>
<li>G&aring; til <b>Hovedmenu &gt; Medieserver</b>.</li>
<li>Klik p&aring; <b>Indstillinger for gennemgang</b> i venstre panel.</li>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_browsing_settings.png" width="640" border="1" />
<li>Klik p&aring; knappen <b>Hj&aelig;lp</b> for yderligere oplysninger i &oslash;verste h&oslash;jre hj&oslash;rne af <b>Medieservers</b> vindue.</li>
</ol>
<h3 class="list_head">4. Forbedr DMA-kompatibilitet</h3>
<p>Hvis dine DLNA/UPnP-fjernsyn eller DMA-enheder ikke kan afspille multimedieindhold, der er gemt p&aring; din NAS, j&aelig;vnt, kan du pr&oslash;ve at konfigurere indstillingerne for <b>DMA-kompatibilitet</b> i Medieserver.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_dma_compatibility.png" width="640" border="1" />
<div class="code_div"><b>Bem&aelig;rk:</b>
<ol>
  <li>Hvis du vil kontrollere, om din DMA-enhed er korrekt installeret, og at den kan findes af din NAS i det lokale netv&aelig;rk, skal du klikke p&aring; <b>Enhedsliste</b>. Der vises en liste over DMA-enheder med oplysninger om enhederne.</li>
  <li>S&oslash;rg for, at du ikke har markeret <b>Begr&aelig;ns adgang til Medieserver for nyregistrerede UPnP/DLNA-enheder</b>. Eller kan Medieserver ikke f&aring; adgang til dine DMA-enheder.</li>
</ol>
</div>
<p>For yderligere oplysninger om teknisk support af multimediefiler i andre formater, skal du klikke p&aring; knappen Hj&aelig;lp i &oslash;verste h&oslash;jre hj&oslash;rne af Medieservers vindue.</p>
<h3 class="list_head">5. Hvis du vil &aring;bne mediefiler gemt p&aring; NAS med DLNA-fjernsyn</h3>
<p>DLNA/UPnP- og DMA-enheder kan nemt sluttes til dit hjemmenetv&aelig;rk. N&aring;r forbindelsen til b&aring;de din Synology NAS og dine DLNA-enheder er oprettet til dit hjemmenetv&aelig;rk, kan du gennemg&aring; udvalgte mapper og lytte til musik eller se videoer fra din NAS p&aring; en stor sk&aelig;rm.</p>
<div class="code_div"><b>Bem&aelig;rk:</b> For en liste over underst&oslash;ttede DLNA/UPnP-fjernsyn og DMA-enheder, som er bekr&aelig;ftet af Synology, skal du se <a href="https://www.synology.com/compatibility?search_by=category&category=dlna_devices&p=1&not_recommend_mode=false" target="_blank">her</a>.</div>
<p>Indstillingsprocessen afh&aelig;nger af dine DLNA-kompatible DMA-enheder. For yderligere oplysninger om adgang til mediefiler, gemt p&aring; din NAS via DLNA, bedes du f&oslash;lge vejledningerne til din klientenheder.</p>
</div>
<div class="page-info">
  <ul>
    <li>Næste i dette emne: <a href="home_theater_videos.html">Kategoriser og afspil videoer med Video Station</a> </li>
  </ul>
</div>
</body>

</html>