<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Organiser og afspil videoer med Video Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Kategoriser og afspil videoer med Video Station</h1>
<div class="tutorials_content">

<img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.jpg"/>


<h2>Oversigt</h2>
<p>Med Video Station kan du nemt organisere og kategorisere dine videosamlinger i forskellige standard eller tilpassede biblioteker, s&aring; det er lettere at finde en bestemt video. Derudover kan du afspille og dele videoer med blot nogle f&aring; klik.</p>

<h3 class="list_head">1. Installer Video Station</h3>
<p>Hvis du vil installere Video Station skal du g&aring; til <b>Pakkecenter</b>, finde <b>Video Station</b> og klikke p&aring; <b>Installer</b>.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/1.png" border="1"/>

<h3 class="list_head">2. Gem og organiser videoer i standard biblioteker</h3>
<p>Video Station har tre standard biblioteker, som vist i venstre panel: <b>Film</b>, <b>Tv-show</b> og <b>Hjemmevideo</b>. For at sikre, at dine videoer indekseres og kategoriseres korrekt, skal du f&oslash;rst tilf&oslash;je videomapper til hvert bibliotek, og derefter gemme dine filer i de tilsvarende videomapper. Som standard er der oprettet tre videomapper under den delte mappe <b>video</b> for de tre standardbiblioteker: <b>Film</b>, <b>Tv-show</b> og <b>Hjemmevideo</b>. Ud over disse tre mapper kan du ogs&aring; g&oslash;re f&oslash;lgende for at tilf&oslash;je flere videomapper til bibliotekerne.</p>

<div class="code_div">
<b>Bem&aelig;rk:</b>
<p>Systemet s&oslash;ger automatisk efter relaterede metadata og andre oplysninger (f.eks. omslagsbillede) p&aring; internettet for to videotyper (film og tv-show). For at sikre, at dine videoer kan parres med de korrekte oplysninger, anbefales det p&aring; det kraftigste, at videoerne matcher den specificerede videotype i de respektive biblioteker.</p>
</div>

<h4>Tilf&oslash;j videomapper til standard biblioteker</h4>
<ol>
<li>G&aring; til <b>Indstillinger</b> &gt; <b>Bibliotek</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/2.png" border="1"/>

<li>Klik p&aring; <b>Opret</b> &gt; <b>Tilf&oslash;j mappe</b> for at v&aelig;lge en mappe fra din Synology NAS og v&aelig;lge destinationsbibliotek. Du kan tilf&oslash;je op til 100 videomapper til et bibliotek, men n&aring;r en mappe f&oslash;rst er oprettet, kan mappen eller og undermapper ikke l&aelig;ngere v&aelig;lges for et andet bibliotek.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/3.png" border="1"/>

<li>Gem videofiler til videomapper for at kategorisere videoerne i tilsvarende biblioteker.</li>
<li>Du kan nu gennemg&aring; og se dine &oslash;nskede videoer fra bibliotekerne!</li>
</ol>

<h3 class="list_head">3. Gem og organiser videoer i tilpassede biblioteker</h3>
<p>Ud over de tre standardbiblioteker, som alle har adgang til som standard, kan du som DSM-<B>admin</B>, s&aring;vel som brugere, der tilh&oslash;rer gruppen <b>administrators</b>, ogs&aring; oprette tilpassede biblioteker og tildele adgangstilladelser til brugere.</p>

<h4>3.1 Opret tilpassede biblioteker</h4>
<ol>
<li>G&aring; til <b>Indstillinger</b> &gt; <b>Bibliotek</b> og klik p&aring; <b>Opret</b> &gt; <b>Opret bibliotek</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/4.png" border="1"/>

<li>Specificer et navn for det nye bibliotek, v&aelig;lg, hvilken type videoer, du vil l&aelig;gge i mappen, og v&aelig;lg derefter <b>Offentlig</b> hvis du &oslash;nsker, at alle skal have adgang til biblioteket, eller v&aelig;lg <b>Privat</b> hvis du vil begr&aelig;nse adgangen til bestemte brugere, der har tilladelse. Bem&aelig;rk, at de videoer, du placerer i mappen, skal matche den type, du valgte her for at sikre, at oplysninger, indsamlet fra internettet, er n&oslash;jagtige.</li>
<li>Hvis du v&aelig;lger <b>Privat</b>, skal du klikke p&aring; <b>Tildel tilladelser</b> og markere afkrydsningsfelterne for at give adgang til brugerne.</li>
</ol>

<h4>3.2 Tilf&oslash;j videomapper til tilpassede biblioteker</h4>
<ol>
<li>G&aring; til <b>Indstillinger</b> &gt; <b>Bibliotek</b>.</li>
<li>Klik p&aring; <b>Opret</b> &gt; <b>Tilf&oslash;j mappe</b> for at v&aelig;lge en mappe fra din Synology NAS og v&aelig;lge destinationsbibliotek. Du kan tilf&oslash;je op til 100 videomapper til et bibliotek, men n&aring;r en mappe f&oslash;rst er oprettet, kan mappen eller og dens undermapper ikke l&aelig;ngere v&aelig;lges for et andet bibliotek.</li>
<li>Gem videofiler til videomapper for at kategorisere videoerne i tilsvarende biblioteker.</li>
<li>Du kan nu gennemg&aring; og se dine &oslash;nskede videoer fra bibliotekerne!</li>
</ol>

<h3 class="list_head">4. Afspil videoer</h3>
<p>N&aring;r du har kategoriseret dine videofiler i forskellige biblioteker, kan du f&oslash;lge nedenst&aring;ende trin for at afspille dine videoer p&aring; Video Station. Det anbefales p&aring; det kraftigste, at du f&oslash;rst installerer <a href="http://www.videolan.org/vlc/" target="_blank">VLC-medieafspiller (Windows, Linux)</a> p&aring; din computer. Ud over at afspille videoer p&aring; din egen computer, kan du ogs&aring; streame dine videoer til DLNA/UPnP-kompatible DMA'er eller AirPlay-kompatible enheder til videoafspilning.</p>

<h4>Afspil videoer med den indbyggede videoafspiller</h4>
<ol>
<li>V&aelig;lg et &oslash;nsket videoklip og klik p&aring; afspilningsikonet p&aring; videobilledet, eller klik p&aring; <b>Handling</b> &gt; <b>Afspil</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/5.png" border="1"/>

<li>Videoen skulle begynde at afspille med det samme. Hvis det ikke sker skal du sikre, at videoformatet er underst&oslash;ttet af din webbrowser, eller at du har installeret plugin'et VLC p&aring; din computer.</li>
<li>Brug knapperne p&aring; sk&aelig;rmen og statuslinjen nederst p&aring; Video Player, hvis det er n&oslash;dvendigt. Du kan ogs&aring; justere lydstyrken, v&aelig;lge kvaliteten af videoafspilningen og lydsporet, sl&aring; undertekster til eller streame videoen til en anden enhed (om relevant).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/6.png" border="1"/>

</ol>


<div class="code_div">
<b>Bem&aelig;rk:</b>
<p>For detaljerede oplysninger om plugin'et VLC og underst&oslash;ttede enheder henvises til <b>DSM - Hj&aelig;lp</b> &gt; <b>Video Station</b> &gt; <b>Videoafspilning</b>.</p>
</div>
 
<h3 class="list_head">5. Del videoer offentligt</h3> 
<p>Med funktionen til deling offentligt kan du nemt dele dine videoer med andre personer vha. Video Station. Der er adgang til alle videoer delt offentligt af hvem som helst med linket, og det kan styres p&aring; siden <b>Samling</b>.</p>

<h4>Del videoer med andre</h4>
<ol>
<li>G&aring; til et videobibliotek og klik p&aring; <b>Alle</b> i &oslash;verste, h&oslash;jre hj&oslash;rne for at vise alle videoerne i dette bibliotek.</li>
<li>Klik p&aring; ikonet <b>Valgtilstand</b> eller tryk og hold ned p&aring; <b>Ctrl</b> eller <b>Shift</b> for at v&aelig;lge flere videoer. Klik derefter p&aring; <b>Handling</b> &gt; <b>Del offentligt</b>.</li>
<ul>
<li>Hvis du kun har valgt en video til deling, tilf&oslash;jes videoen til en delt samling kaldet <b>Delte videoer</b>. Her kan du styre alle videoer, du har delt, den ene efter den anden.</li>
<li>Hvis du har valgt at dele flere videoer, grupperes videoerne i en ny, delt samling.</li>
</ul>
<li>Alternativt kan du ogs&aring; klikke p&aring; <b>Handling</b> &gt; <b>Samling</b> for at tilf&oslash;je de valgte videoer til en eksisterende delt samling (om relevant).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/7.png" border="1"/>

<li>Specificer en gyldighedsperiode, om n&oslash;dvendigt.</li>
<li>Kopier ganske enkelt linket ind i e-mails, onlinemeddelelser og websider for at dele dem med andre.</li>
</ol> 


<h3 class="list_head">6. Organiser og se videoer p&aring; mobilenheder</h3>
<p>Du kan oprette forbindelse til Video Station via mobilenheder ved at downloade DS video til iOS/Android-enheder eller Windows Phone med nedenst&aring;ende QR-kode for at afspille videoer og organisere dine samlinger p&aring; dine mobilenheder eller streame videoer til dine DMA'er eller AirPlay-enheder b&aring;de hjemme og p&aring; farten.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/>

</div>
<div class="page-info">
  <ul>
    <li>Tidligere i dette emne: <a href="home_theater_media_server.html">Nyd multimedieindhold, gemt på Synology NAS, på store skærme</a> </li>
    <li>Næste i dette emne: <a href="home_theater_music.html">Nyd musikken, gemt på din Synology NAS, med Audio Station</a> </li>
  </ul>
</div>
</body>
</html>