<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Opret album for at styre og gennemg&aring; fotos med Photo Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Opret album for at styre og gennemg&aring; fotos med Photo Station</h1>
<div class="tutorials_content">

<img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/>

<h2>Oversigt</h2>
<p>Photo Station er et webbaseret program, der er beregnet til at hj&aelig;lpe dig med at organisere og vise dine fotos, gemt p&aring; din Synology NAS, over internettet. Med dets raffinerede og brugervenlige interface kan du bruge Photo Station til at uploade, gennemg&aring;, styre og dele din fotoalbum med nogle f&aring; klik.</p>

<h3 class="list_head">1. Installer Photo Station</h3>
<p>Hvis du vil installere Photo Station skal du g&aring; til <b>Pakkecenter</b>, finde <b>Photo Station</b> og klikke p&aring; <b>Installer</b>.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/>

<h3 class="list_head">2. Upload billeder</h3>
<p>Inden du kan gennemg&aring; og styre fotos i Photo Station, skal du f&oslash;rst oprette album og uploade fotos med en af de f&oslash;lgende metoder.</p>

<h4>2.1 Upload fotos via Photo Station Uploader (for Windows og Mac)</h4>
<p>Vi anbefaler, at du bruger Photo Station Uploader, da der oprettes miniaturer under uploadprocessen af hvert foto for visning. Upload af filer via Photo Station Uploader bruger computerens ydeevne mere effektivt og g&oslash;r konverteringen hurtigere.</p>
<ol>
<li>Download og installer <b>Photo Station Uploader</b> (tilg&aelig;ngelig i <a href="https://www.synology.com/support/download/DS713+" target="_blank">Synologys downloadcenter</a>).</li>
<li>H&oslash;jreklik p&aring; et foto p&aring; din computer, du vil uploade, og v&aelig;lg <b>Upload til Photo Station</b> &gt; <b>Opret ny profil</b> for at &aring;bne guiden.</li>
<li>Indtast et &oslash;nsket navn og servernavnet/IP-adressen p&aring; destinations-Synology NAS for den nye profil.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/>

<div class="code_div">
<b>Bem&aelig;rk:</b>
<p>De indtastede serveroplysninger og brugerlegitimationsoplysninger gemmes til profilen til fremtidig brug. Du kan konfigurere flere profiler i overensstemmelse med forskellige regler og destinationer. I stedet for at udfylde serveroplysningerne igen, n&aelig;ste gang du bruger Photo Station Uploader, kan du v&aelig;lge en eksisterende profil og bruge dens konfigurationer, konfigureret tidligere, til at uploade fotos til den samme destination.</p>
</div>

<li>V&aelig;lg, om du vil uploade filerne til Photo Station eller personlig Photo Station.</li>

<li>Indtast brugerlegitimationsoplysningerne for destination-Synology NAS.</li>

<li>Klik p&aring; <b>Gennemse</b> for at v&aelig;lge en destinationsmappe eller opret en undermappe under den delte mappe <b>photo</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/>

<li>N&aring;r uploadet er fuldf&oslash;rt, kan du starte Photo Station p&aring; din Synology NAS og vise de uploadede filer i forskellige tilstande, eller redigere andre oplysninger som f.eks. egenskaber for album og adgangsprivilegier.</li>
</ol>


<h4>2.2 Opret album og upload fotos via Photo Station</h4>
<p>Start <b>Photo Station</b> og klik p&aring; <b>Tilf&oslash;j</b> for at oprette et nyt album eller uploade fotos fra din computer eller Synology NAS til eksisterende album.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/>

<div class="code_div">
<b>Bem&aelig;rk:</b>
<p>Hvis du foretr&aelig;kker at uploade fotos via interfacet i Photo Station, anbefales det, at du aktiverer tjenesten QuickConnect. Uanset om du er hjemme eller p&aring; farten, giver QuickConnect dig mulighed for at f&aring; adgang til Synology NAS og Photo Station fra et hvilket som helst sted via internettet med et tilpasset id, og uden besv&aelig;ret med at konfigurere komplicerede netv&aelig;rkskonfigurationer som f.eks. portvideresendelsesregler. For yderligere oplysninger om QuickConnect skal du se <a class="launch-app" href="cloud_set_up_quickconnect.html">dette selvstudium</a>.</p>
</div>

<h3 class="list_head">3. Del fotos</h3>
<p>Delingsfunktionen g&oslash;r det nemt at dele fotos, der er gemt p&aring; Photo Station, med venner, eller at uploade dine fotos til popul&aelig;re sociale netv&aelig;rk som f.eks. Facebook, Picasa og Flickr.</p>

<h4>3.1 Del fotos offentligt</h4>
<ol>
<li>G&aring; til et album og v&aelig;lg de fotos, du vil dele.</li>
<li>Klik p&aring; <b>Del</b> &gt; <b>Del offentligt</b> for at f&aring; linket.</li>
<ul>
<li>Hvis du kun har valgt et foto til deling, tilf&oslash;jes fotoet til et standard, delt album, kaldet <b>Delte fotos</b>. Her kan du styre alle de fotos, du har delt, det ene efter det andet.</li>
<li>Hvis du har valgt at dele flere fotos, grupperes disse fotos i et nyt, delt album.</li>
</ul>
<li>Alternativt kan du ogs&aring; klikke p&aring; <b>Del</b> &gt; <b>Tilf&oslash;j til et delt album</b> for at tilf&oslash;je de valgte fotos til et eksisterende, delt album (om relevant).</li>
<img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/>
<li>Indtast et navn for det nye, delte album, og specificer om n&oslash;dvendigt gyldighedsperioden.</li>
<li>Kopier ganske enkelt linket ind i e-mails, onlinemeddelelser og websider for at dele de valgte fotos med andre.</li>
</ol>

<div class="code_div">
<b>Bem&aelig;rk:</b>
<ul>
<li>Alle de delte fotos er tilg&aelig;ngelige offentligt af hvem som helst med linket.</li>
<li>Du kan specificere, hvilke brugere har privilegiet til at dele emner i Photo Station offentligt, i <b>Indstillinger</b> &gt; <b>Deling</b>.</li>
</ul>
</div>

<h4>3.2 Del fotos med sociale netv&aelig;rk</h4>
<ol>
<li>V&aelig;lg de billeder, du vil uploade, og v&aelig;lg s&aring; <b>Del</b> &gt; <b>Upload til [sociale netv&aelig;rkswebsteder]</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/>

<li>I det vindue, der vises, skal du klikke p&aring; <b>Opret forbindelse til [sociale netv&aelig;rkswebsteder]</b> og autorisere med din sociale netv&aelig;rkskonto. Du kan v&aelig;lge at uploade fotos til et nyt eller et eksisterende album.</li>
</ol>

<h3 class="list_head">4. Organiser og gennemg&aring; fotos p&aring; mobilenheder</h3>
<p>Hvis du vil oprette forbindelse til Photo Station eller uploade fotos via mobilenheder, kan du installere <b>DS photo+</b> p&aring; dine mobilenheder med nedenst&aring;ende QR-koder.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/>


</div>

</body>
</html>