<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Gem filer p&aring; Synology NAS fra en Windows PC i et lokalt netv&aelig;rk</title>
</head>

<body class="tutorial-content-box" >

<h1>Gem filer p&aring; Synology NAS fra en Windows PC i et lokalt netv&aelig;rk</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_windows/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Windows.jpg"/>
<h2>Oversigt</h2>
<p>Synology NAS er designet til at g&oslash;re lagring og deling af filer inden for dit lokale netv&aelig;rk hurtigt og nemt, s&aring; du har direkte adgang til delte mapper og filer p&aring; Synology NAS uden at skulle bekymre dig om at logge p&aring; DSM hver gang. Du vil f.eks. kunne gemme filer p&aring; din Synology NAS med Windows Stifinder, ligesom p&aring; andre netv&aelig;rksenheder.</p>

<h3 class="list_head">Tilknyt med Windows Stifinder</h3>
<ol>
<li>&Aring;bn et Windows Stifinder-vindue og g&aring; til <b>Computer</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image1.png"/>
<li>Klik p&aring; <b>Tilknyt netv&aelig;rksdrev</b>. Denne handling &aring;bner vinduet Tilknyt netv&aelig;rksdrev.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image2.png"/>
<li>I vinduet Tilknyt netv&aelig;rksdrev v&aelig;lger du et drev i rullemenuen <b>Drev</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image3.png"/>
<li>I feltet&nbsp;<b>Mappe</b>&nbsp;indtaster du servernavnet for din Synology NAS og navnet p&aring; den delte mappe, med foranstillet - og separeret med - bagudrettede skr&aring;streger. Hvis f.eks. servernavnet p&aring; din Synology NAS er &quot;DiskStation&quot;, og navnet p&aring; den delte mapper er &quot;Share1&quot;, skal du indtaste &quot;\\DiskStation\Share1&quot;. Klik p&aring; <b>Udf&oslash;r</b> n&aring;r du er klar.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image4.png"/>
<li>Indtast brugernavn og adgangskode for DSM.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image5.png"/>
<div class="code_div"><b>Kan ikke f&aring; adgang til den delte mappe?</b> Brugerkontoen, du logger p&aring;, skal have adgangsprivilegier for den delte mappe, du vil have adgang til.</div>
<li>Derefter &aring;bnes et Windows Stifinder-vindue. Din delte mappe bliver tilknyttet, og der har adgang til den under <b>Computer</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image6.png"/>
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Næste i dette emne: <a href="store_with_mac.html">Gem filer på Synology NAS fra en Mac-computer i et lokalt netværk</a> </li>
  </ul>
</div>
</body>

</html>
