<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Gem filer p&aring; Synology NAS fra en Mac-computer i et lokalt netv&aelig;rk</title>
</head>

<body class="tutorial-content-box" >

<h1>Gem filer p&aring; Synology NAS fra en Mac-computer i et lokalt netv&aelig;rk</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_mac/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Mac.jpg"/>
<h2>Oversigt</h2>
<p>Synology NAS er designet til at g&oslash;re lagring og deling af filer inden for dit lokale netv&aelig;rk hurtigt og nemt, s&aring; du har direkte adgang til delte mapper og filer p&aring; Synology NAS uden at skulle bekymre dig om at logge p&aring; DSM hver gang. Du vil f.eks. kunne gemme filer p&aring; din Synology NAS med Finder, ligesom p&aring; andre netv&aelig;rksenheder.</p>

<h3 class="list_head">F&aring; adgang til delte mapper med Mac OS</h3>
<ol>
<li>&Aring;bn Finder p&aring; din Mac-computer.</li>
<li>Find menulinjen langs med den &oslash;verste del af sk&aelig;rmen.</li>
<li>Klik p&aring; <b>G&aring;</b>, og v&aelig;lg <b>Tilslut til server</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image1.png" border="1"/>
<li>Indtast IP-adressen for din Synology NAS, med &quot;afp://&quot; foranstillet. F.eks. &quot;afp://192.168.59.121&quot;. Klik p&aring; <b>Tilslut</b> for at forts&aelig;tte.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image2.png" border="1">
<div class="code_div"><b>Favoritservere:</b> N&aring;r du trykker p&aring; plustegnet <b>(+)</b>, designeres IP-adresser som favoritservere til fremtidig brug. Du kan ogs&aring; klikke p&aring; urknappen for at se en liste over servere, du oprettede forbindelse til fornylig.</div>
<li>Indtast brugernavn og adgangskode for DSM. Din brugerkonto skal have l&aelig;se/skriveprivilegier for den delte mappe, du vil have adgang til. Klik p&aring; <b>Tilslut</b> for at forts&aelig;tte.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image3.png" border="1"/>
<li>Hvis dine brugerlegitimationsoplysninger er korrekte, skulle du nu se din Synology NAS, anf&oslash;rt under afsnittet <b>Delt</b> i vinduet Finder. Dobbeltklik p&aring; den delte mappe for at udforske indholdet.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image4.png" border="1" />
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Tidligere i dette emne: <a href="store_with_windows.html">Gem filer på Synology NAS fra en Windows PC i et lokalt netværk</a> </li>
  </ul>
</div>
</body>

</html>
