<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Organisere og spille av videoer med Video Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Kategorisere og spille av videoer med Video Station</h1>
<div class="tutorials_content">

<img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.jpg"/>


<h2>Oversikt</h2>
<p>Med Video Station kan du enkelt organisere og kategorisere dine videosamlinger i forskjellige standardbiblioteker eller tilpassede biblioteker, med henblikk p&aring; &aring; finne &oslash;nsket video p&aring; en mer effektiv m&aring;te. I tillegg kan avspilling og deling av videoer v&aelig;re like enkelt og ukomplisert som &aring; gj&oslash;re noen f&aring; enkle klikk.</p>

<h3 class="list_head">1. Installer Video Station</h3>
<p>N&aring;r du skal installere Video Station, g&aring; til <b>Pakkesenter</b>, finn <b>Video Station</b> og klikk p&aring; <b>Installer</b>.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/1.png" border="1"/>

<h3 class="list_head">2. Lagre og kategorisere videoer i standardbiblioteker</h3>
<p>Video Station tilbyr tre standardbiblioteker som vist i venstre panel: <b>Film</b>, <b>TV-program</b> og <b>Hjemmevideo</b>. Hvis du vil ha videoer som er riktig indeksert og kategorisert, m&aring; du legge til videomapper for hvert bibliotek og deretter lagre filene i de tilsvarende videomappene f&oslash;rst. If&oslash;lge standardinnstillingen er tre videomapper opprettet under den delte mappen <b>video</b> for de tre standardbibliotekene: <b>Film</b>, <b>TV-program</b> og <b>Hjemmevideo</b>. I tillegg til disse tre mappene kan du gj&oslash;re f&oslash;lgende for &aring; legge til flere videomapper for bibliotekene.</p>

<div class="code_div">
<b>Merk:</b>
<p>Systemet vil automatisk s&oslash;ke i relaterte metadata og annen informasjon (f.eks. plakatbilde) for to videotyper (film og tv-program) fra Internett. For &aring; sikre at videoene dine kan kombineres med den riktige informasjonen, anbefales det p&aring; det sterkeste at videoene stemmer overens med den angitte videotypen i de aktuelle bibliotekene.</p>
</div>

<h4>Legge til videomapper for standardbiblioteker</h4>
<ol>
<li>G&aring; til <b>Innstillinger</b> &gt; <b>Bibliotek</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/2.png" border="1"/>

<li>Klikk p&aring; <b>Opprett</b> &gt; <b>Legg til mappe</b> for &aring; velge en mappe fra Synology NAS-enheten, og velg m&aring;lbiblioteket. Du kan legge til opptil 100 videomapper fra ett bibliotek, men s&aring; snart en mappe er valgt, kan verken mappen eller dens undermapper velges for et annet bibliotek mer.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/3.png" border="1"/>

<li>Lagre videofiler i videomapper for &aring; kategorisere videoer i tilsvarende biblioteker.</li>
<li>N&aring; kan du bla i og se p&aring; &oslash;nskede videoer fra bibliotekene!</li>
</ol>

<h3 class="list_head">3. Lagre og kategoriser videoer i standardbiblioteker</h3>
<p>I motsetning til de tre systemenes standardbiblioteker som kan &aring;pnes av alle, kan du, i egenskap av DSM-<B>admin</B> eller en bruker som tilh&oslash;rer gruppen <b>administrators</b>, opprette tilpassede biblioteker og tilordne tilgangsrettigheter til brukere.</p>

<h4>3.1 Opprett tilpassede biblioteker</h4>
<ol>
<li>G&aring; til <b>Innstillinger</b> &gt; <b>Bibliotek</b> og klikk p&aring; <b>Opprett</b> &gt; <b>Opprett bibliotek</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/4.png" border="1"/>

<li>Angi et navn p&aring; det nye biblioteket, velg hva slags videoer du vil plassere i mappen, og velg <b>Offentlig</b> hvis du vil at biblioteket skal v&aelig;re tilgjengelig for hvem som helst, eller velg <b>Privat</b> hvis du vil begrense tilgangen til bestemte brukere som har tillatelser. Merk at videoene i mappen m&aring; stemme overens med typen som er valgt her, for &aring; sikre n&oslash;yaktigheten av videoinformasjon som er samlet inn fra Internett.</li>
<li>Hvis du valgte <b>Privat</b>, klikker du p&aring; <b>Tilordne tillatelser</b> og merker av i avmerkingsboksene for &aring; gi tilgang til brukerne.</li>
</ol>

<h4>3.2 Legg til videomapper for tilpassede biblioteker</h4>
<ol>
<li>G&aring; til <b>Innstillinger</b> &gt; <b>Bibliotek</b>.</li>
<li>Klikk p&aring; <b>Opprett</b> &gt; <b>Legg til mappe</b> for &aring; velge en mappe fra Synology NAS-enheten, og velg m&aring;lbiblioteket. Du kan legge til opptil 100 videomapper i ett bibliotek, men s&aring; snart en mappe er valgt, kan verken mappen eller dens undermapper velges for et annet bibliotek mer.</li>
<li>Lagre videofiler i videomapper for &aring; kategorisere videoer i tilsvarende biblioteker.</li>
<li>N&aring; kan du bla i og se p&aring; &oslash;nskede videoer fra bibliotekene!</li>
</ol>

<h3 class="list_head">4. Spille av videoer</h3>
<p>S&aring; snart du har kategorisert videofilene i forskjellige biblioteker, kan du f&oslash;lge trinnene nedenfor for &aring; spille av videoene dine p&aring; Video Station. Det anbefales p&aring; det sterkeste at du installerer <a href="http://www.videolan.org/vlc/" target="_blank">VLC media player (Windows, Linux)</a> p&aring; datamaskinen din f&oslash;rst. I tillegg til &aring; spille av videoer p&aring; din lokale datamaskin, kan du ogs&aring; str&oslash;mme videoer til DLNA/UPnP-kompatible DMA-er&nbsp;eller AirPlay-kompatible enheter for videoavspilling.</p>

<h4>Spille av videoer med den integrerte videospilleren</h4>
<ol>
<li>Velg et videoklipp du vil spille av. Klikk deretter p&aring; avspillingsikonet p&aring; videobildet, eller klikk p&aring; <b>Handling</b> &gt; <b>Spill av</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/5.png" border="1"/>

<li>Videoen begynner avspillingen med det samme. Hvis den ikke gj&oslash;r det, m&aring; du kontrollere at videoens format st&oslash;ttes av nettleseren, eller at du har installert VLC-tilleggsprogrammet p&aring; datamaskinen din.</li>
<li>Bruk skjermknappene og fremdriftslinjen nederst i videospilleren avhengig av behov. Du kan ogs&aring; justere volumet, velge videoavspillingskvalitet og lydspor, sl&aring; p&aring; teksting eller str&oslash;mme videoen til en annen enhet (hvis aktuelt).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/6.png" border="1"/>

</ol>


<div class="code_div">
<b>Merk:</b>
<p>Hvis du vil ha detaljert informasjon om VLC-tilleggsprogrammet og st&oslash;ttede enheter, se <b>DSM Hjelp</b> &gt; <b>Video Station</b> &gt; <b>Videoavspilling</b>.</p>
</div>
 
<h3 class="list_head">5. Del videoer med offentligheten</h3> 
<p>Med den offentlige delingsfunksjonen kan du enkelt dele videoene dine med andre personer ved hjelp av Video Station. Alle de delte videoene er offentlig tilgjengelige for alle som har koblingen, og kan administreres p&aring; <b>Samling</b>-siden.</p>

<h4>Dele videoer med andre</h4>
<ol>
<li>G&aring; til et hvilket som helst videobibliotek, og klikk p&aring; <b>Alle</b> i &oslash;verste h&oslash;yre hj&oslash;rne for &aring; vise hele videoen i dette biblioteket.</li>
<li>Klikk p&aring; <b>Valgmodus</b>-ikonet, og trykk p&aring; og hold <b>Ctrl</b> eller <b>Shift</b> for &aring; velge flere videoer. Klikk deretter p&aring; <b>Handling</b> &gt; <b>Del med offentligheten</b>.</li>
<ul>
<li>Hvis du har valgt bare &eacute;n video du vil dele, vil videoen legges til i en delt samling kalt <b>Delte videoer</b>. Der kan du administrere alle videoene du vil har delt, en for en.</li>
<li>Hvis du har valgt flere videoer du vil dele, vil videoene grupperes i en ny delt samling.</li>
</ul>
<li>Eventuelt kan du ogs&aring; klikke p&aring; <b>Handling</b> &gt; <b>Samling</b> for &aring; legge til de valgte videoene i en eksisterende delt samling (hvis aktuelt).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/7.png" border="1"/>

<li>Angi eventuelt en gyldighetsperiode.</li>
<li>Kopier og lim ganske enkelt inn koblingen i e-postmeldinger, direktemeldinger og websider for &aring; dele videoene med alle.</li>
</ol> 


<h3 class="list_head">6. Organiser og se p&aring; videos p&aring; mobilenheter</h3>
<p>Hvis du vil koble til Video Station gjennom mobile enheter, kan du laste ned DS video med iOS/Android-enheter eller Windows Phone ved hjelp av QR-kodene nedenfor, for &aring; spille av videoer og organisere samlingene dine p&aring; mobilenheter, eller str&oslash;mme videoer til DMA- eller AirPlay-enhetene dine, b&aring;de n&aring;r du er hjemme eller p&aring; farten.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/>

</div>

<div class="page-info">
  <ul>
    <li>Forrige i dette emnet: <a href="home_theater_media_server.html">Oppleve multimedieinnhold lagret p&aring; Synology NAS med store skjermer</a> </li>
    <li>Neste i dette emnet: <a href="home_theater_music.html">Opplev lagret musikken p&aring; Synology NAS-enheten med Audio Station</a> </li>
  </ul>
</div>

</body>
</html>