<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Oppleve multimedieinnhold lagret p&aring; Synology NAS med store skjermer</title>
</head>

<body class="tutorial-content-box" >

<h1>Oppleve multimedieinnhold lagret p&aring; Synology NAS med store skjermer</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_media_server/enjoy_multimedia_contents_stored_on_synology_nas_with_big_screens.jpg" width="600" height="301" />
<h2>Oversikt</h2>
<p>Synology NAS kan fungere som multimedieserver i det lokale nettverket, slik at hjemmeenheter, f.eks. TV-er/stereoanlegg og Sony PlayStation3/Xbox 360, kan spille av multimedieinnholdet p&aring; den. Disse enhetene er DLNA/UPnP-standard <b>digitale medieadaptere</b> (DMA). Hvis du vil str&oslash;mme multimedieinnhold fra Synology NAS til DMA-enheter for avspilling, m&aring; du konfigurere innstillinger for medieavspilling. Du kan for eksempel administrere surfeinnstillinger for mediefiler og forbedre filenes kompatibilitet. Denne funksjonen er tilgjengelig i <strong>Mediaserver</strong>-pakken.</p>

<h3 class="list_head">1. Installer Mediaserver</h3>
<p>N&aring;r du skal installere Mediaserver, g&aring; til <b>Pakkesenter</b>, finn <b>Mediaserver</b> og klikk p&aring; <b>Installer</b>.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_install_media_server.png" width="640" border="1" />

<h3 class="list_head">2. Last opp multimediefiler til Synology NAS</h3>
<p>Standard delte mapper, <b>photo</b>, <b>music</b> og <b>video</b>, blir automatisk opprettet og indeksert etter installeringen av Mediaserver p&aring; NAS-enheten. Det du m&aring; gj&oslash;re er ganske enkelt &aring; laste opp mediefiler, for eksempel bilder, sanger eller videoer til de tilsvarende mappene, s&aring; vil disse filene v&aelig;re tilgjengelige fra DMA-enhetene dine.</p>
<div class="code_div"><b>Merk:</b> De monterte delte mappene fra eksterne servere kan ikke legges til som indekserte mapper. Du kan legge til opptil 100 indekserte mapper p&aring; Synology NAS-enheten.</div>

<h3 class="list_head">3. Konfigurer leserinnstillinger for mediespilleren din</h3>
<p>Du kan angi hvordan mediefilene p&aring; Synology NAS-enheten skal vises p&aring; DMA-enheter.</p>
<ol>
<li>G&aring; til <b>Hovedmeny &gt; Mediaserver</b>.</li>
<li>Klikk p&aring; <b>Leserinnstillinger</b> i venstre panel.</li>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_browsing_settings.png" width="640" border="1" />
<li>Hvis du vil ha mer informasjon, klikker du p&aring; <b>Hjelp</b>-knappen i &oslash;verste h&oslash;yre hj&oslash;rne av <b>Mediaserver</b>-vinduet.</li>
</ol>
<h3 class="list_head">4. Forbedre DMA-kompatibiliteten</h3>
<p>Hvis dine DLNA/UPnP TV-er eller DMA-enheter spiller av det lagrede multimedieinnholdet p&aring; NAS-enheten ujevnt, kan du pr&oslash;ve &aring; konfigurere innstillingene for <b>DMA-kompatibilitet</b> p&aring; Mediaserver.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_dma_compatibility.png" width="640" border="1" />
<div class="code_div"><b>Merk:</b>
<ol>
  <li>Hvis du vil unders&oslash;ke om DMA-enheten er riktig installert og ble oppdaget av NAS-enheten i det lokale nettverket, klikker du p&aring; <b>Enhetsliste</b>. En liste over DMA-enheter vil vises med aktuell enhetsinformasjon.</li>
  <li>Kontroller at du ikke har merket av for <b>Begrens tilgang til mediaserver for nylig oppdagede UPnP/DLNA-enheter</b>. I motsatt fall vil Mediaserver ikke v&aelig;re tilgjengelig for DMA-enhetene dine.</li>
</ol>
</div>
<p>Hvis du vil ha mer informasjon om teknisk st&oslash;tte for multimediefiler med andre formater, klikker du p&aring; Hjelp-knappen i &oslash;verste h&oslash;yre hj&oslash;rne av Mediaserver-vinduet.</p>
<h3 class="list_head">5. Slik f&aring;r du tilgang til lagrede mediefiler p&aring; NAS-enheten med DLNA TV</h3>
<p>DLNA/UPnP- og DMA-enheter kan enkelt koble til hjemmenettverket ditt. S&aring; snart tilkoblingene for dine Synology NAS- og DLNA-enheter i hjemmenettverket er etablert, kan du bla mellom utvalgte mapper og lytte p&aring; musikk eller se p&aring; videoer fra NAS-enheten p&aring; en stor skjerm.</p>
<div class="code_div"><b>Merk:</b> Hvis du vil se en liste over st&oslash;ttede DLNA/UPnP TV-er og DMA-enheter som er bekreftet av Synology, se <a href="https://www.synology.com/compatibility?search_by=category&category=dlna_devices&p=1&not_recommend_mode=false" target="_blank">her</a>.</div>
<p>Innstillingsprosessen avhenger av dine DLNA-standard DMA-enheter. Hvis du vil ha mer informasjon om tilgang til mediefiler som er lagret p&aring; NAS-enheten via DLNA, f&oslash;lger du instruksjonene p&aring; klientenhetene.</p>
</div>
<div class="page-info">
  <ul>
    <li>Neste i dette emnet: <a href="home_theater_videos.html">Kategorisere og spille av videoer med Video Station</a> </li>
  </ul>
</div>

</body>

</html>