<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Opprette album for &aring; administrere og bla i bilder med Photo Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Opprette album for &aring; administrere og bla i bilder med Photo Station</h1>
<div class="tutorials_content">

<img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/>

<h2>Oversikt</h2>
<p>Photo Station er en webbasert applikasjon du bruke til &aring; organisere og vise bilder som er lagret p&aring; Synology NAS via Internett. Med det avanserte og brukervennlige grensesnittet gir Photo Station deg mulighet til &aring; laste opp, bla i, h&aring;ndtere og dele dine fotoalbum med bare noen f&aring; enkle klikk.</p>

<h3 class="list_head">1. Installer Photo&nbsp;Station</h3>
<p>Hvis du vil installere Photo Station, g&aring; til <b>Pakkesenter</b>, finn <b>Photo Station</b> og klikk p&aring; <b>Installer</b>.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/>

<h3 class="list_head">2. Last opp bilder</h3>
<p>F&oslash;r du kan bla i og administrere bilder i Photo Station, m&aring; du opprette album og laste opp bilder med en av f&oslash;lgende metoder f&oslash;rst.</p>

<h4>2.1 Last opp bilder via Photo Station Uploader (for Windows og Mac)</h4>
<p>Vi anbefaler at du bruker Photo Station Uploader. Under opplastingsprosessen vil det nemlig genereres miniatyrer av hvert bilde som skal vises. Opplasting av filer ved hjelp av Photo Station Uploader vil utnytte datamaskinens datakraft for &aring; gj&oslash;re konverteringen raskere.</p>
<ol>
<li>Last ned og installer <b>Photo Station Uploader</b> (tilgjengelig fra <a href="https://www.synology.com/support/download/DS713+" target="_blank">Synologys nedlastingssenter</a>).</li>
<li>P&aring; datamaskinen h&oslash;yreklikker du p&aring; et bilde du vil laste opp, og velger <b>Last opp til Photo Station</b> &gt; <b>Opprett ny profil</b> for &aring; &aring;pne veiviseren.</li>
<li>Skriv inn et selvvalgt navn og servernavnet/IP-adressen til &oslash;nsket Synology NAS-enhet for den nye profilen.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/>

<div class="code_div">
<b>Merk:</b>
<p>Serverinformasjonen og de angitte brukerdetaljene vil lagres i denne profilen for senere bruk. Du kan sette opp flere profiler i henhold til forskjellige regler eller destinasjoner. I stedet for &aring; fylle ut serverinformasjonen igjen neste gang du bruker Photo Station Uploader, kan du velge en eksisterende profil og bruke dens allerede definerte konfigurasjon til &aring; laste opp bilder til samme m&aring;l.</p>
</div>

<li>Velg om du vil laste opp filer til Photo Station eller Personlig Photo Station.</li>

<li>Oppgi brukerdetaljene for &oslash;nsket Synology NAS-enhet.</li>

<li>Klikk p&aring; <b>Bla gjennom</b> for &aring; velge en m&aring;lmappe eller opprette en undermappe under den delte mappen <b>photo</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/>

<li>S&aring; snart opplastingen er fullf&oslash;rt, kan du starte Photo Station p&aring; Synology NAS-enheten og vise de opplastede filene i forskjellige moduser eller redigere annen informasjon, for eksempel albumegenskaper og tilgangsrettigheter.</li>
</ol>


<h4>2.2 Opprett album og last opp bilder via Photo Station</h4>
<p>Start <b>Photo Station</b>, og klikk p&aring; <b>Legg til</b> for &aring; opprette et nytt album eller laste opp bilder fra datamaskinen eller Synology NAS-enheten til eksisterende album.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/>

<div class="code_div">
<b>Merk:</b>
<p>Hvis du foretrekker &aring; laste opp bilder via Photo Station-grensesnittet, anbefales det p&aring; det sterkeste at du aktiverer QuickConnect-tjenesten. Enten du er hjemme eller p&aring; farten gir QuickConnect deg tilgang til Synology NAS og Photo Station fra hvor som helst via Internett med en tilpasset ID, men du sparer bryderiet med &aring; sette opp kompliserte nettverkskonfigurasjoner, for eksempel regler for portvidereformidling. Hvis du vil ha mer informasjon om QuickConnect, se <a class="launch-app" href="cloud_set_up_quickconnect.html">dette oppl&aelig;ringsprogrammet</a>.</p>
</div>

<h3 class="list_head">3. Del bilder</h3>
<p>Med denne delingsfunksjonen kan du enkelt dele lagrede bilder p&aring; Photo Station med venner, eller laste opp bildene til popul&aelig;re sosiale nettverk, for eksempel Facebook, Picasa og Flickr.</p>

<h4>3.1 Del bilder med offentligheten</h4>
<ol>
<li>Bla til et album og velg bildene du vil dele.</li>
<li>Klikk p&aring; <b>Del</b> &gt; <b>Del med offentligheten</b> for &aring; hente koblingen.</li>
<ul>
<li>Hvis du har valgt bare ett bilde du vil dele, vil bildet legges til et standard delt album kalt <b>Delte bilder</b>. Der kan du administrere alle bildene du vil har delt, ett for ett.</li>
<li>Hvis du har valgt flere bilder du vil dele, vil bildene grupperes i et nytt delt album.</li>
</ul>
<li>Eventuelt kan du ogs&aring; klikke p&aring; <b>Del</b> &gt; <b>Legg til i et delt album</b> for &aring; legge til de valgte bildene i et eksisterende delt album (hvis aktuelt).</li>
<img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/>
<li>Skriv inn et navn p&aring; det nye delte albumet. Angi eventuelt en gyldighetsperiode for det.</li>
<li>Kopier og lim inn koblingen i e-postmeldinger, direktemeldinger og websider for &aring; dele de valgte bildene med alle.</li>
</ol>

<div class="code_div">
<b>Merk:</b>
<ul>
<li>Alle de delte bildene er offentlig tilgjengelig for hvem som helst som har koblingen.</li>
<li>Du kan angi hvilke brukere som har lov til &aring; dele Photo Station-elementer med offentligheten p&aring; <b>Innstillinger</b> &gt; <b>Deling</b>.</li>
</ul>
</div>

<h4>3.2 Del bilder med sosiale nettverk</h4>
<ol>
<li>Velg fotografiene du vil laste opp, og velg deretter <b>Dele</b> &gt; <b>Last opp til [nettsteder for sosiale nettverk]</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/>

<li>I vinduet som &aring;pnes, klikker du p&aring; <b>Koble til [nettsteder for sosiale nettverk]</b> og autoriserer med din konto i sosiale nettverk. Du kan velge &aring; laste opp bildene i et nytt eller eksisterende album.</li>
</ol>

<h3 class="list_head">4. Organiser og bla i bilder p&aring; mobilenheter</h3>
<p>Hvis du vil koble til Photo Station eller laste opp bilder via mobilenheter, kan du installere <b>DS photo+</b> p&aring; mobilenheter med QR-kodene nedenfor.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/>


</div>

</body>
</html>