<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Lagre filer p&aring; Synology NAS fra en Windows-PC i det lokale nettverket</title>
</head>

<body class="tutorial-content-box" >

<h1>Lagre filer p&aring; Synology NAS fra en Windows-PC i det lokale nettverket</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_windows/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Windows.jpg"/>
<h2>Oversikt</h2>
<p>Synology NAS er utformet for &aring; forenkle lagring og deling av filer i det lokale nettverket. Hensikten er at prosessen skal g&aring; raskt. Du f&aring;r direkte tilgang til delte mapper og filer p&aring; Synology NAS og slipper &aring; logge p&aring; DSM hver gang. Du kan for eksempel lagre filer p&aring; Synology NAS med Windows Utforsker akkurat som p&aring; andre nettverksenheter.</p>

<h3 class="list_head">Tilordning i Windows Utforsker</h3>
<ol>
<li>&Aring;pne et Windows Utforsker-vindu og g&aring; til <b>Datamaskin</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image1.png"/>
<li>Klikk p&aring; <b>Koble til nettverksstasjon</b>. Denne handlingen gj&oslash;r at vinduet Koble til nettverksstasjon vises.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image2.png"/>
<li>I vinduet Koble til nettverksstasjon velger du en stasjonsbokstav fra rullegardinmenyen <b>Stasjon</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image3.png"/>
<li>I feltet <b>Mappe</b>&nbsp;skriver du inn servernavnet til Synology NAS og det delte mappenavnet med omvendte skr&aring;streker foran og bak. Hvis servernavnet til Synology NAS for eksempel er &quot;DiskStation&quot;, og navnet p&aring; den delte mappen er &quot;Share1&quot;, skriver du inn &quot;\\DiskStation\Share1&quot;. Klikk p&aring; <b>Fullf&oslash;r</b>&nbsp;n&aring;r du er klar.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image4.png"/>
<li>Skriv inn DSM-brukernavnet og -passordet.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image5.png"/>
<div class="code_div"><b>F&aring;r du ikke tilgang til den delte mappen?</b> Brukerkontoen du oppgir her, m&aring; ha tilgangsrettigheter til den delte mappen du &oslash;nsker tilgang til.</div>
<li>Til slutt vises et Windows Utforsker-vindu. Den delte mappen vil n&aring; v&aelig;re tilordnet og tilgjengelig under <b>Datamaskin</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image6.png"/>
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Neste i dette emnet: <a href="store_with_mac.html">Lagre filer p&aring; Synology NAS fra en Mac-datamaskin i det lokale nettverket</a> </li>
  </ul>
</div>
</body>

</html>
