<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Lagre filer p&aring; Synology NAS fra en Mac-datamaskin i det lokale nettverket</title>
</head>

<body class="tutorial-content-box" >

<h1>Lagre filer p&aring; Synology NAS fra en Mac-datamaskin i det lokale nettverket</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_mac/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Mac.jpg"/>
<h2>Oversikt</h2>
<p>Synology NAS er utformet for &aring; forenkle lagring og deling av filer i det lokale nettverket. Hensikten er at prosessen skal g&aring; raskt. Du f&aring;r direkte tilgang til delte mapper og filer p&aring; Synology NAS og slipper &aring; logge p&aring; DSM hver gang. Du kan for eksempel lagre filer p&aring; Synology NAS med Finder akkurat som p&aring; andre nettverksenheter.</p>

<h3 class="list_head">Tilgang til delte mapper med Mac OS</h3>
<ol>
<li>&Aring;pne Finder p&aring; Mac-datamaskinen.</li>
<li>Finn frem til menylinjen langs toppen av skjermen.</li>
<li>Klikk p&aring; <b>G&aring; til</b> og velg <b>Koble til server</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image1.png" border="1"/>
<li>Skriv inn IP-adressen til Synology NAS-enheten, med &quot;afp://&quot; foran, for eksempel &quot;afp://192.168.59.121&quot;. Klikk p&aring; <b>Koble til</b> for &aring; fortsette.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image2.png" border="1">
<div class="code_div"><b>Favorittservere:</b> Trykking p&aring; knappen med plusstegnet <b>(+)</b> angir at IP-adressene er favorittservere for fremtidig bruk. Du kan ogs&aring; klikke p&aring; klokkeknappen for &aring; vise en liste over servere du nylig har v&aelig;rt tilkoblet.</div>
<li>Skriv inn DSM-brukernavnet og -passordet. Brukerkontoen din m&aring; ha de riktige lese/skrive-rettighetene til den delte mappen du vil ha tilgang til. Klikk p&aring; <b>Koble til</b> for &aring; fortsette.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image3.png" border="1"/>
<li>Til slutt, hvis brukeropplysningene dine er riktige, vil du n&aring; se Synology NAS-enheten oppf&oslash;rt under <b>Delt</b> i Finder-vinduet. Dobbeltklikk p&aring; den delte mappen for &aring; utforske innholdet.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image4.png" border="1" />
</ol>
</div>

<div class="page-info">
  <ul>
    <li>Forrige i dette emnet: <a href="store_with_windows.html">Lagre filer p&aring; Synology NAS fra en Windows-PC i det lokale nettverket</a> </li>
  </ul>
</div>
</body>

</html>
