<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>St&oslash;ttetjenester</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>St&oslash;ttetjenester</h2>
<p>
St&oslash;ttetjenester inkluderer b&aring;de fjerntilgang og loggenereringsverkt&oslash;y, slik at v&aring;re st&oslash;tteteknikere raskt kan f&aring; oversikt over, diagnostisere og l&oslash;se tekniske problemer p&aring; din DiskStation fra et Synology-kontor. For &aring; gj&oslash;re dette, g&aring;r du til <b>St&oslash;ttesenter</b> &gt; <b>St&oslash;ttetjenester</b>.
</p>

<h4>Slik aktiverer du fjerntilgang: </h4>
<p>
Aktiver fjerntilgang p&aring; din DiskStation kun n&aring;r du blir bedt om &aring; gj&oslash;re det av en av Synologys st&oslash;tteteknikere.
</p>
<ol>
<li>Merk av for <b>Aktiver fjerntilgang</b> og klikk p&aring; <b>Bruk</b> for &aring; ta i bruk endringene.
</li>
<li>Oppgi admin-passordet ditt og identifikasjonsn&oslash;kkelen for st&oslash;tte til Synologys st&oslash;ttetekniker via e-post.
</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Fjerntilgang deaktiveres automatisk etter 14 dager. Det b&oslash;r ikke deaktiveres manuelt f&oslash;r dette, med mindre en av Synologys st&oslash;tteteknikere ber deg om &aring; gj&oslash;re det.
</li>
<li>Fjern alt innhold som du anser for &aring; v&aelig;re privat fra din DiskStation. 
</li>
<li>Selv om Synology ikke kan garantere at tildeling av fjerntilgang vil l&oslash;se problemet ditt, vil Synology gj&oslash;re en rimelig innsats for &aring; utf&oslash;re st&oslash;ttetjenester p&aring; en profesjonell m&aring;te.
</li>	
</ul>
</div>

<h4>Slik genererer du logger: </h4>
<p>
Generer og oppgi logger kun til Synologys st&oslash;tteteknikere.
</p>
<ol>
<li>Klikk p&aring; <b>Generer logger</b> og vent et par minutter til nedlastingen er fullf&oslash;rt.
</li>
<li>Send loggene til Synologys st&oslash;tteteknikere via e-post.
</li>
</ol>

<div class="section">
<h4>Ting du b&oslash;r vite om v&aring;re st&oslash;ttetjenester</h4>
<ul>
<li>Vi respekterer din DiskStation som om den var v&aring;r egen.</li>
<li>Din DiskStation vil kun bli brukt til systemdiagnostisering. Synology vil ikke aksessere eller avsl&oslash;re personlig informasjon p&aring; din DiskStation. </li> 

</ul>
</div>

</body>
</html>
