<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;o de Indexa&ccedil;&atilde;o Multim&eacute;dia</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Defini&ccedil;&otilde;es de Convers&atilde;o</h2>
<p>Quando carregar fotografias ou v&iacute;deos para utilizar com o Servidor Multim&eacute;dia ou a Photo Station, ser&atilde;o criadas miniaturas para uma melhor experi&ecirc;ncia de navega&ccedil;&atilde;o. Pode definir a qualidade das miniaturas e monitorizar o progresso de convers&atilde;o.</p>
<p>Entretanto, se pretender ver v&iacute;deos na pasta partilhada <strong>photo</strong> da Photo Station nos seus dispositivos m&oacute;veis, pode activar a convers&atilde;o de v&iacute;deo e ver tamb&eacute;m o progresso de convers&atilde;o.</p>
<h4>Para definir a qualidade da miniatura:</h4>
<ol>
<li>
Escolha uma qualidade a partir do menu pendente.
</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>A cria&ccedil;&atilde;o de miniaturas de qualidade alta ir&aacute; demorar mais tempo.</li>
</ul>
</div>
<h4>Para activar a convers&atilde;o de v&iacute;deo para dispositivos m&oacute;veis:</h4>
<ol>
<li>Assinale <strong>Activar convers&atilde;o de v&iacute;deo para dispositivos m&oacute;veis</strong>.</li>
<li>Clique em <strong>Aplicar</strong> e poder&aacute; ver os v&iacute;deos nos seus dispositivos m&oacute;veis em movimento.
</li>
</ol>

<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>Apenas os v&iacute;deos carregados para a pasta partilhada <strong>photo</strong> da Photo Station podem ser convertidos para o formato suportado por dispositivos m&oacute;veis.</li>
<li>Os ficheiros MP4 n&atilde;o ser&atilde;o convertidos.</li>
</ul>
</div>
<h4>Para ver o progresso de convers&atilde;o de fotografia/v&iacute;deo:</h4>
<ol>
<li>Quando as fotografias ou os v&iacute;deos estiverem a ser carregados para DiskStation, clique no &iacute;cone <strong>Progresso de Convers&atilde;o</strong> que aparece no canto superior direito da barra de tarefas. </li>
<li>
Na janela que &eacute; apresentada, proceda de uma das seguintes formas:
</li>
<ul>
<li>
Na sec&ccedil;&atilde;o <b>Progresso de Convers&atilde;o</b>, monitorize o progresso e o estado da cria&ccedil;&atilde;o de miniaturas executado em segundo plano.
</li>
<li>
Fa&ccedil;a o seguinte para colocar em pausa o progresso de convers&atilde;o:
</li>
<ol>
<li>
Escolha <b>Atraso de [n&uacute;mero] hora(s)</b> a partir do menu pendente e clique em <b>Pausa</b> para colocar em pausa o progresso. (Por predefini&ccedil;&atilde;o, &eacute; seleccionado <b>Atraso de 1 hora(s)</b>.)
</li>
<li>O progresso de convers&atilde;o ser&aacute; retomado ap&oacute;s o tempo de atraso definido, ou pode clicar em <b>Continuar</b> para retomar o processo imediatamente.
</li>
</ol>
<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>Uma vez que o progresso de convers&atilde;o exige mais recursos de CPU, colocar o processo em pausa pode poupar recursos de sistema para qualquer outra tarefa em execu&ccedil;&atilde;o.</li>
</ul>
</div>
</ul>
<li>
Ap&oacute;s a conclus&atilde;o do processo de convers&atilde;o, o &iacute;cone na barra de tarefas ir&aacute; desaparecer.
</li>
</ol>

<div class="section">
<span class="note_head">Nota: </span>
<ul>
<li>Como o Photo Station Uploader fornece melhor desempenho para cria&ccedil;&atilde;o de miniaturas, recomendamos utilizar o Photo Station Uploader se pretende carregar uma grande quantidade de fotografias/v&iacute;deos para a sua biblioteca Photo Station.</li>
</ul>
</div>

</body>
</html>