<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Privilégios - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology NAS provides rich applications services which can be accessed by local or domain users. Synology DiskStation Manager (DSM) provides flexible settings for controlling users' application privileges, making it easy to manage users' access to different applications.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Privilégios</h1>
<p>Os privil&eacute;gios de utilizador e de grupo para aplica&ccedil;&otilde;es e servi&ccedil;os individuais podem ser vistos e editados. O DSM proporciona defini&ccedil;&otilde;es flex&iacute;veis para controlar os privil&eacute;gios da aplica&ccedil;&atilde;o, tornando mais f&aacute;cil gerir o acesso dos utilizadores e aos grupos a diferentes aplica&ccedil;&otilde;es.</p>
<h4>Para modificar os privil&eacute;gios da aplica&ccedil;&atilde;o para os utilizadores e grupos:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <b>Privil&eacute;gios</b>.</li>
<li>Selecione a aplica&ccedil;&atilde;o que pretende modificar. Clique em <b>Editar</b>.</li>
<li>Clique em <strong>Utilizador</strong> para ver os privil&eacute;gios individuais ou em <strong>Grupo</strong> para ver os privil&eacute;gios de grupo. </li>
<li>Para cada utilizador ou grupo, marque <strong>Permitir</strong> para permitir o acesso ou <strong>Negar</strong> para negar o acesso para a aplica&ccedil;&atilde;o selecionada. Dependendo da aplica&ccedil;&atilde;o, tamb&eacute;m pode selecionar <strong>Por IP</strong> para permitir/negar o acesso com base no endere&ccedil;o IP.</li>
<li>Clique em <strong>OK</strong> para guardar as suas altera&ccedil;&otilde;es.</li>
</ol>

<h4>Para ver os privil&eacute;gios da aplica&ccedil;&atilde;o para os utilizadores que tenham endere&ccedil;os IP de rede diferentes:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <b>Privil&eacute;gios</b>.</li>
<li> Clique em <strong>Visualizador de permiss&otilde;es</strong>.</li>
<li>Selecione um utilizador a partir de <strong>Nome do utilizador</strong> e introduza o endere&ccedil;o IP para o qual pretende ver as permiss&otilde;es em <strong>Endere&ccedil;o IP</strong>. </li>
</ol>

<h4>Para definir os privil&eacute;gios da aplica&ccedil;&atilde;o predefinidos para todos os utilizadores:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <b>Privil&eacute;gios</b>.</li>
<li>Selecione a aplica&ccedil;&atilde;o que pretende modificar. Clique em <b>Editar</b>.</li>
<li>Clique em  <strong>Privil&eacute;gios predefinidos</strong> e marque <strong>Conceder este privil&eacute;gio a todos</strong>. </li>
<li>Clique em <strong>OK</strong> para guardar as suas altera&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Os privil&eacute;gios das contas <b>admin</b> e <b>guest</b> n&atilde;o podem ser modificados aqui.</li>
<li>Quando ocorrerem conflitos de privil&eacute;gios, a prioridade do privil&eacute;gio &eacute; a seguinte: Negar &gt; Permitir.</li>
<li>Nem todos os pacotes e servi&ccedil;os suportam as defini&ccedil;&otilde;es de privil&eacute;gios de acesso <strong>Por IP</strong>.</li>
</ul>
</div>
</body>
</html>