<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Portal de Aplica&ccedil;&otilde;es</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Portal de Aplica&ccedil;&otilde;es</h1>
<p>Portal de Aplica&ccedil;&otilde;es permite-lhe pode configurar as defini&ccedil;&otilde;es de liga&ccedil;&atilde;o de v&aacute;rias aplica&ccedil;&otilde;es, para que possa aceder e executar diretamente estas aplica&ccedil;&otilde;es (por exemplo, File Station) em janelas ou separadores independentes do navegador.</p>


<div class="section">
<h4>Nota:</h4>
<p>Pode editar as defini&ccedil;&otilde;es de acesso para aplica&ccedil;&otilde;es, tais como a Audio Station, a Download Station, a Surveillance Station, a Video Station, a File Station, assim como muitas outras.</p>
</div>


<h2><a name="session"></a>Personalizar Pseud&oacute;nimos</h2>

<p>Pode atribuir um pseud&oacute;nimo a cada aplica&ccedil;&atilde;o desenvolvida para Synology, como File Station. Com o pseud&oacute;nimo personalizado, pode abrir rapidamente a aplica&ccedil;&atilde;o com um URL especializado.</p>

<h4>Para personalizar pseud&oacute;nimos para aplica&ccedil;&otilde;es:</h4>
<ol>
<li>V&aacute; para <strong>Painel de Controlo</strong> &gt; <strong>Portal de Aplica&ccedil;&otilde;es</strong> &gt; <strong>Aplica&ccedil;&atilde;o</strong>.</li>
<li>Seleccione uma aplica&ccedil;&atilde;o.</li>
<li>Clique em <b>Editar</b> &gt; <strong>Geral</strong>.</li>
<li>Na janela de contexto, selecione <b>Ativar pseud&oacute;nimo personalizado</b> e especifique o pseud&oacute;nimo.</li>
<li>Clique em <strong>OK</strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Algumas aplica&ccedil;&otilde;es t&ecirc;m os seus pseud&oacute;nimos predefinidos: Audio Station (<strong>&aacute;udio</strong>), Download Station (<strong>transferir</strong>), File Station (<strong>ficheiro</strong>), Surveillance Station (<strong>cam</strong>), e Video Station (<strong>v&iacute;deo</strong>).</li>
<li>Os nomes de alias n&atilde;o podem ser iguais aos reservados para o sistema, navegadores ou utilizados por outras aplica&ccedil;&otilde;es e o respectivo n&uacute;mero de carateres tem de ser limitado entre 2 e 20. </li>
<li>Um pseud&oacute;nimo s&oacute; pode ser constitu&iacute;do por letras mai&uacute;sculas e min&uacute;sculas, carateres num&eacute;ricos e dois carateres especiais (-) e (_).</li>
<li>Um pseud&oacute;nimo n&atilde;o pode come&ccedil;ar ou terminar com os carateres especiais (-) ou (_).</li>
</ul>
</div>

<h4>Para aceder a aplica&ccedil;&otilde;es com pseud&oacute;nimos:</h4>
<p>Depois de configurar um pseud&oacute;nimo para uma aplica&ccedil;&atilde;o (por exemplo, File Station), pode abrir rapidamente a aplica&ccedil;&atilde;o introduzindo um URL nos seguintes formatos: <code>http://DS_IP_OR_SERVER_NAME/ALIAS/</code> ou <code>https://DS_IP_OR_SERVER_NAME/ALIAS/</code></p>

<p>Por exemplo, pode aceder facilmente a File Station com os URL: <code>http://192.168.xx.xx/file/</code> ou <code>https://MySynologyNAS/file/</code></p>


<h2><a name="session"></a>Portas HTTP/HTTPS personalizadas</h2>

<p>Pode atribuir uma porta HTTP/HTTPS a cada aplica&ccedil;&atilde;o desenvolvida para Synology, como File Station. Com a porta personalizada, pode abrir rapidamente a aplica&ccedil;&atilde;o com um URL especializado.</p>


<h4>Para personalizar portas HTTP/HTTPS para aplica&ccedil;&otilde;es:</h4>
<ol>
<li>V&aacute; para <strong>Painel de Controlo</strong> &gt; <strong>Portal de Aplica&ccedil;&otilde;es</strong> &gt; <strong>Aplica&ccedil;&atilde;o</strong>.</li>
<li>Seleccione uma aplica&ccedil;&atilde;o.</li>
<li>Clique em <b>Editar</b> &gt; <strong>Geral</strong>.</li>
<li>Na janela de contexto, selecione <b>Ativar porta personalizada (HTTP)</b> ou <b>Ativar porta personalizada (HTTPS)</b>.</li>
<li>Especifique um n&uacute;mero de porta personalizada.</li></ol>
<div class="section">
  <h4>Nota:</h4>
  <ul>
  <li>O n&uacute;mero da porta deve ser entre 1 e 65535.</li>
  <li>As seguintes portas n&atilde;o podem ser utilizadas, pois est&atilde;o reservadas para utiliza&ccedil;&atilde;o pelo sistema:
  <ul>
  <li>20, 21, 22, 23, 25, 80, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002</li>
  <li>Portas predefinidas para eMule: 4662 (TCP), 4672 (UDP)</li>
  <li>Intervalo de portas FTP predefinido: O intervalo efetivo poder&aacute; depender dos diferentes modelos.</li>
  
  </ul>
  </li>
  </ul>
</div>


<h4>Para aceder a aplica&ccedil;&otilde;es com portas HTTP/HTTPS:</h4>

<p>Depois de configurar um pseud&oacute;nimo para uma aplica&ccedil;&atilde;o (por exemplo, File Station), pode abrir rapidamente a aplica&ccedil;&atilde;o introduzindo um URL nos seguintes formatos: <code>http://DS_IP_OR_SERVER_NAME:HTTP_PORT</code> ou <code>https://DS_IP_OR_SERVER_NAME:HTTPS_PORT</code></p>

<p>Por exemplo, pode aceder facilmente a File Station com os URL: <code>http://192.168.xx.xx:7000</code> ou <code>https://MySynologyNAS:7001</code></p>
<h2><a name="session"></a>Personalizar Dom&iacute;nios</h2>

<p>Pode fazer corresponder um nome de dom&iacute;nio com uma aplica&ccedil;&atilde;o desenvolvida para Synology, como File Station. Com o dom&iacute;nio personalizado, pode abrir rapidamente a aplica&ccedil;&atilde;o com um URL especializado.</p>

<h4>Para personalizar dom&iacute;nios para aplica&ccedil;&otilde;es:</h4>
<ol>
<li>V&aacute; para <strong>Painel de Controlo</strong> &gt; <strong>Portal de Aplica&ccedil;&otilde;es</strong> &gt; <strong>Aplica&ccedil;&atilde;o</strong>.</li>
<li>Seleccione uma aplica&ccedil;&atilde;o.</li>
<li>Clique em <b>Editar</b> &gt; <strong>Geral</strong>.</li>
<li>Na janela de contexto, selecione <b>Ativar dom&iacute;nio personalizado</b>.</li>
<li>Especifique um dom&iacute;nio personalizado.</li>
<li>Para defini&ccedil;&otilde;es adicionais, pode selecionar <strong>Ativar HSTS</strong> ou <strong>Ativar HTTP/2</strong> consoante as suas necessidades.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Antes de configurar esta funcionalidade, deve solicitar nomes de dom&iacute;nios dos fornecedores de dom&iacute;nios para que os utilizadores consigam aceder ao servidor da Internet.</li>
<li>Para aplica&ccedil;&otilde;es (por exemplo, File Station) associadas a carregamento/transfer&ecirc;ncia de ficheiros, sugerimos que n&atilde;o selecione <strong>Ativar HTTP/2</strong> porque as velocidades de carregamento e de transfer&ecirc;ncia dessas aplica&ccedil;&otilde;es podem ser baixas.</li>
<li>Cada nome de dom&iacute;nio pode ser usado apenas para uma aplica&ccedil;&atilde;o em separado no seu DiskStation.</li>
<li>Se o nome de dom&iacute;nio n&atilde;o exceder os 15 caracteres de comprimento, e cumprir as <a href="https://support.microsoft.com/kb/909264" target="_blank">conven&ccedil;&otilde;es de nome NetBIOS</a>, o sistema ir&aacute; registar e transmitir o nome de dom&iacute;nio automaticamente.</li>
<li>Quando acede a aplica&ccedil;&otilde;es atrav&eacute;s de URLs que utiliza nomes de dom&iacute;nio, ir&aacute; percorrer a porta HTTP padr&atilde;o (80) ou a porta HTTPS padr&atilde;o (443).</li>
</ul>

</div>


<h4>Para aceder a aplica&ccedil;&otilde;es atrav&eacute;s de dom&iacute;nios:</h4>
<p>Depois de configurar um dom&iacute;nio (por exemploi, ficheiro.exemplo.com) para uma aplica&ccedil;&atilde;o (por exemplo, File Station), pode abrir rapidamente a aplica&ccedil;&atilde;o introduzindo um URL nos seguintes formatos: <code>http://APP_DOMAIN</code> ou <code>https://APP_DOMAIN</code></p>

<p>Por exemplo, pode aceder facilmente a File Station com os URL: <code>http://file.example.com</code> ou <code>https://file.example.com</code></p>

<p>Se o nome de dom&iacute;nio (por ex., FileFile) para uma aplica&ccedil;&atilde;o (por ex., File Station) obedecer &agrave;s conven&ccedil;&otilde;es de nome NetBIOS, os utilizadores Windows podem aceder ao mesmo num Synology NAS na mesma rede local com um URL parecido: <code>http://FileFile</code> ou <code>https://FileFile</code></p>


<h2>Personalizar regras de proxy inverso</h2>
<p>O seu DiskStation pode servir como servidor de proxy inverso que transfere pedidos da Internet para dispositivos na rede local. As regras de proxy inverso podem ajud&aacute;-lo a ocultar portas sens&iacute;veis de potenciais amea&ccedil;as como nos dois seguintes cen&aacute;rios:</p>

<p>Cen&aacute;rio 1 Suponha que a porta sens&iacute;vel &eacute; 80, que n&atilde;o deve autorizar acesso externo de acordo com as regras da firewall. Pode configurar uma regra de proxy inverso para autorizar utilizadores de confian&ccedil;a na Internet a utilizar a porta sens&iacute;vel 80 atrav&eacute;s de outra porta aberta (por exemplo, 81). Deste modo, os utilizadores de confian&ccedil;a podem entrar na firewall e ainda conseguir aceder &agrave; porta 80.</p>

<p>Cen&aacute;rio 2 Suponha que a porta sens&iacute;vel &eacute; 80, que n&atilde;o deve autorizar acesso externo exceto atrav&eacute;s de um dispositivo espec&iacute;fico (por exemplo, um servidor chamado &quot;MyTrustee&quot;). Com as regras de proxy inverso, pode autorizar que apenas o tr&aacute;fego de MyTrustee utilize a porta 80 enquanto que os restantes dispositivos n&atilde;o o poder&atilde;o fazer.</p>

<h4>Para configurar regras de proxy inverso:</h4>

<ol>
<li>V&aacute; para <strong>Painel de Controlo</strong> &gt; <strong>Portal de Aplica&ccedil;&otilde;es</strong> &gt; <strong>Proxy Inverso</strong>.</li>
<li>Clique em <strong>Criar</strong> e configure as seguintes defini&ccedil;&otilde;es:
<ul>
<li><strong>Descri&ccedil;&atilde;o</strong>: Especifique um nome que o ajude a identificar a fun&ccedil;&atilde;o da regra.</li>
<li>Especifique as regras da <strong>Origem</strong> (o dispositivo que envia pedidos da Internet) e do <strong>Destino</strong> (o dispositivo na rede local):
  <ul>
<li><strong>Protocolo</strong>: Os protocolos de <strong>HTTP</strong> ou de <strong>HTTPS</strong> utilizados pela origem/destino</li>

<li><strong>Nome do anfitri&atilde;o</strong>: O nome do dispositivo de origem/destino:</li>
<li><strong>Porta</strong>: A porta utilizada pelo dispositivo de origem/destino:</li>
<li><strong>Ativar HSTS</strong> e <strong>Ativar HTTP/2</strong> (apenas para a origem)</li>
</ul>
 </li>
</ul>
</li>
<li>Clique em <strong>OK</strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<p>Se introduzir <strong>*</strong> como nome de anfitri&atilde;o de origem ou deixar em branco, a regra aplica-se a todas as origens.</p>
</div>


</body> </html>
