<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;o de Indexa&ccedil;&atilde;o Multim&eacute;dia</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Pasta indexada</h2>

<p>
Por predefini&ccedil;&atilde;o, os ficheiros multim&eacute;dia nas pastas partilhadas <b>photo</b>, <b>video</b> e <b>music</b> s&atilde;o indexados pelo Servi&ccedil;o de Indexa&ccedil;&atilde;o Multim&eacute;dia. Se deseja que dispositivos DMA e aplica&ccedil;&otilde;es DSM de foto, v&iacute;deo ou m&uacute;sica acedam a mais ficheiros na sua DiskStation, pode adicionar aqui mais pastas indexadas.
</p>

<h4><a name="add"></a>Para adicionar uma pasta indexada:</h4>
<ol>
<li>
Clique em <b>Criar</b>.
</li>
<li>
Na janela que aparece, atribua um nome &agrave; pasta que ser&aacute; visualizado nos dispositivos DMA e aplica&ccedil;&otilde;es DSM no campo <b>Nome</b>.
</li>
<li>
Clique em <b>Seleccionar</b>, navegue at&eacute; uma pasta que pretenda indexar e de seguida clique em <b>OK</b>.
</li>
<li>
Na sec&ccedil;&atilde;o <b>Tipo de Ficheiro</b>, assinale as caixas de verifica&ccedil;&atilde;o para especificar quais os tipos de ficheiros multim&eacute;dia que ser&atilde;o indexados. Os dispositivos DMA e aplica&ccedil;&otilde;es DSM apenas podem procurar e reproduzir ficheiros multim&eacute;dia que coincidam com os tipos de ficheiros multim&eacute;dia especificados.
</li>
<li>
Clique em <b>OK</b> e de seguida clique em <b>Guardar</b>.
</li>
</ol>
<div class="section">
<ul>
<span class="note_head">Nota: </span> 
<li>
Pastas remotas montadas usando a File Station n&atilde;o podem ser adicionadas como pastas indexadas.
</li>

<li>
Pode adicionar at&eacute; 100 pastas indexadas &agrave; sua DiskStation.
</li>
</ul>
</div>
<h4>Para editar uma pasta indexada:</h4>
<ol>
<li>
Seleccione a pasta na lista de pastas e de seguida clique em <b>Editar</b>.
</li>
<li>
Efectuar altera&ccedil;&otilde;es nas defini&ccedil;&otilde;es. (consulte <a href="#add">Para adicionar uma pasta indexada</a> para obter informa&ccedil;&otilde;es detalhadas.)
</li>
<li>
Clique em <b>OK</b> e de seguida clique em <b>Guardar</b>.
</li>
</ol>
<h4>Para remover pasta(s) da lista de pastas indexadas:</h4>
<ol>
<li>
Seleccione a(s) pasta(s) na lista de pastas e de seguida clique em <b>Eliminar</b>. (Prima e segure a tecla Shift ou Ctrl enquanto efectua selec&ccedil;&otilde;es m&uacute;ltiplas.)
</li>
<li>
Clique em <b>Sim</b> e de seguida clique em <b>Guardar</b>.
</li>
</ol>
<div class="section">
<ul>
<span class="note_head">Nota: </span>
<li>
Eliminar as pastas n&atilde;o as remove da sua DiskStation. Apenas evita que os dispositivos DMA e aplica&ccedil;&otilde;es DSM as pesquisem e reproduzam o seu conte&uacute;do.
</li>
</ul>
</div>
</body>
</html>
