
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless"></a>Associar Rede Sem Fios*</h2>

<p>Pode ligar o dispositivo DiskStation a uma rede sem fios quando um dongle sem fios estiver ligado na respetiva porta USB. Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Sem fios</strong> &gt; <strong>Configura&ccedil;&atilde;o do Mapa de Rede</strong> e escolha <strong>Associar Rede Sem Fios</strong>.</p>


<div class="section">
<h4>Nota:</h4>
<p>Para um lista completa dos dongles sem fios compat&iacute;veis, visite <a href="https://www.synology.com/compatibility?search_by=category&category=usb_wifi_dongles&p=1&not_recommend_mode=false" target=_blank>www.synology.com</a>.</p>
</div>

<h4>Para configurar uma rede sem fios:</h4>
<p>Aceda ao separador <strong>Wi-Fi</strong>. Clique em <b>Configurar uma rede sem fios</b> e selecione uma das seguintes op&ccedil;&otilde;es (se j&aacute; estiver ligado a uma rede sem fios, primeiro clique em <b>Desligar</b>).</p>
<ul>
<li><b>Associar-se a uma rede sem fios</b>: O assistente ir&aacute; pesquisar os pontos de acesso sem fios ou redes Ad-Hoc existentes com a sua for&ccedil;a do sinal e estado de seguran&ccedil;a. Se o ponto de acesso a que pretende aceder estiver bloqueado com prote&ccedil;&atilde;o por palavra-passe, o assistente ir&aacute; pedir-lhe que introduza a palavra-passe.</li>
<li><b>Ligar a uma rede sem fios oculta</b>: Se o ponto de acesso n&atilde;o emitir o seu SSID (Nome de Rede) por quest&otilde;es de privacidade, n&atilde;o ser&aacute; descoberto durante a pesquisa. Pode ligar manualmente a estes pontos de acesso ocultos introduzindo manualmente a informa&ccedil;&atilde;o necess&aacute;ria.</li>
<li><b>Criar uma rede Ad-Hoc</b>: Para al&eacute;m da rede por infraestrutura, na qual um ponto de acesso (AP) faz a liga&ccedil;&atilde;o entre a rede sem fios e a rede com fios Ethernet, as redes ad-Hoc s&atilde;o tamb&eacute;m amplamente utilizadas. Numa rede ad-Hoc, todos os dispositivos sem fios ao alcance uns dos outros podem comunicar de uma forma ponto a ponto sem um ponto de acesso central. Para configurar uma rede ad-hoc, todos os dispositivos sem fios devem ser configurados para o modo ad-hoc e n&atilde;o no modo de infraestrutura .</li>
</ul>
<p>_____ <br> * Apenas dispon&iacute;vel em modelos espec&iacute;ficos. <br></body>
</html>
