
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Controlo de Tr&aacute;fego do Router</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name=""></a>Controlo de Tr&aacute;fego do Router</h2>
<p>
O controlo de tr&aacute;fego do router est&aacute; activo quando DiskStation est&aacute; no modo router. O Controlo de tr&aacute;fego do router (em <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Controlo de Tr&aacute;fego do Router</strong>) gere o tr&aacute;fego de carregamento e transfer&ecirc;ncia em execu&ccedil;&atilde;o na sua rede privada DiskStation. Quando criar regras, necessita de especificar a <strong>Largura de Banda Garantida</strong> e a <b>Largura de Banda M&aacute;xima</b> para limitar o tr&aacute;fego de carregamento e transfer&ecirc;ncia.</p>


<div class="section">
<h4>Explica&ccedil;&atilde;o dos Termos</h4>
<ul>
<li><b>Largura de Banda Garantida</b>: Define o tr&aacute;fego de sa&iacute;da que este servi&ccedil;o garante quando toda a largura de banda do sistema for suficiente.</li>
<li><b>Largura de Banda M&aacute;xima</b>: Define o tr&aacute;fego de sa&iacute;da que este servi&ccedil;o pode utilizar quando toda a largura de banda do sistema for suficiente e existir <b>Largura de Banda Restante do Sistema</b>. Sugerimos que calcule primeiro a <b>Largura de Banda de Sa&iacute;da do Sistema</b>. Em seguida, certifique-se de que a soma da <b>Largura de Banda Garantida</b> de cada servi&ccedil;o n&atilde;o &eacute; maior que a <b>Largura de Banda de Sa&iacute;da do Sistema</b> ou a defini&ccedil;&atilde;o poder&aacute; n&atilde;o funcionar corretamente.</li>
</ul>
</div>
<div class="section">
<h4>F&oacute;rmula de Defini&ccedil;&atilde;o</h4>
<ul>
<li><b>Largura de Banda de Sa&iacute;da do Sistema</b> = Total <b>Largura de Banda Garantida</b> de todos os servi&ccedil;os + <b>Largura de Banda Restante do Sistema</b></li>
<li><b>Largura de Banda Garantida</b> para cada servi&ccedil;o ≤ <b>Largura de Banda M&aacute;xima</b> para cada servi&ccedil;o
</li>
</ul>
</div>

<div class="section">
<h4>Nota:</h4>
<p>Se os pacotes de sa&iacute;da n&atilde;o corresponderem a qualquer regra de controlo de tr&aacute;fego do router, o comportamento predefinido ser&aacute; sem limite. Pode adicionar a sua pr&oacute;pria regra de controlo de tr&aacute;fego do router predefinida no fim de todas as regras escolhendo <b>Todas</b> as portas e especifique <b>Largura de Banda Garantida</b> e <b>Largura de Banda M&aacute;xima</b>.</p>
</div>


<h4>Para criar uma regra de controlo de tr&aacute;fego do router:</h4>
<ol>

<li>Selecione uma interface de rede no menu pendente, no canto superior direito.</li>

<li>Clique em <b>Criar</b>.</li>
<li>Na sec&ccedil;&atilde;o <b>Portas</b>, selecione uma das seguintes op&ccedil;&otilde;es:
	<ul>
		<li>Escolha <b>Tudo</b> para aplicar a regra a todas as portas.</li>
		<li>Escolha <b>Personalizar</b> e clique em <b>Personalizar</b>. Introduza at&eacute; 15 portas separadas por v&iacute;rgulas ou especifique um intervalo de portas para aplicar esta regra.</li>
		<li class="no">Tamb&eacute;m pode especificar o protocolo.</li>
	</ul>
</li>
<li>Na sec&ccedil;&atilde;o <b>IP de origem</b>, selecione uma das seguintes op&ccedil;&otilde;es:
	<ul>
		<li>Selecione <b>Tudo</b> para aplicar esta regra a todos os endere&ccedil;os IP.</li>
		<li>Escolha <b>IP Espec&iacute;fico</b> e clique em <strong>Selecionar</strong>. Pode especificar um endere&ccedil;o IP ou um intervalo de IP para aplicar esta regra.</li>
	</ul>
</li>
</ol>
<p>
Agora pode ver a regra de controlo de tr&aacute;fego do router criada na lista de regras. </p>
<h4>Para eliminar as regras de controlo de tr&aacute;fego do router, proceda de uma das seguintes formas:</h4>
<ul>
<li>Desmarque a caixa de verifica&ccedil;&atilde;o da regra na coluna <b>Ativado</b> da lista.</li>
<li>Elimine a regra de controlo de tr&aacute;fego do router.</li>
</ul>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Pode criar at&eacute; 100 regras para cada interface de rede. </li>
<li>Recorra &agrave; fun&ccedil;&atilde;o arrastar e largar para reorganizar as regras na lista.</li>
<li>As regras s&atilde;o priorizadas de acordo com a sua posi&ccedil;&atilde;o na lista.</li>
<li>As portas especificadas referem-se aos n&uacute;meros das portas dos servi&ccedil;os de Internet externos &agrave; rede local.</li>
<li>Os IPs de origem referem-se aos endere&ccedil;os IP dos dispositivos que utilizam o Synology NAS como router.</li>
</ul>
</div>
</body>
</html>
