<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DDNS</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>DDNS</h2>
<p>DDNS (Servi&ccedil;o de Nome de Dom&iacute;nio Din&acirc;mico) simplifica a liga&ccedil;&atilde;o da sua DiskStation pela Internet atribuindo um nome de anfitri&atilde;o ao respectivo endere&ccedil;o IP.Por exemplo, DDNS permite-lhe aceder &agrave; sua DiskStation usando um nome de dom&iacute;nio (por exemplo <i>www.john.synology.me</i>), sem ter de memorizar um endere&ccedil;o IP (por exemplo <i>172.16.254.1</i>).</p>

<h3>Configurar DDNS</h3>
<p>Pode indicar um nome de anfitri&atilde;o existente para o endere&ccedil;o IP da sua DiskStation, ou registar um novo fornecido pela Synology ou v&aacute;rios outros fornecedores DDNS.Consulte cada fornecedor para obter mais detalhes relativamente ao registo de nome de anfitri&atilde;o.
</p>



<h4>Para configurar um nome de anfitri&atilde;o DDNS:</h4>
<ol>
<li>Clique no bot&atilde;o <b>Adicionar</b>.</li>
<li>Aparece uma janela a pedir que edite as seguintes defini&ccedil;&otilde;es:
  <ul>
<li><strong>Fornecedor do servi&ccedil;o:</strong> Seleccione um fornecedor de servi&ccedil;o.Para registar um nome de anfitri&atilde;o gratuito, fornecido pela Synology, escolha <b>Synology</b> do menu de selec&ccedil;&atilde;o, clique em <b>Registar Agora</b>, e introduza os detalhes como indicado.</li>
<li><strong>Nome do anfitri&atilde;o:</strong> Introduza um nome anfitri&atilde;o DDNS registado, como <i>john.synology.me</i>.</li>
<li><strong>Nome do utilizador:</strong> Introduza o nome de utilizador para o seu fornecedor DDNS.</li>
<li><strong>Palavra-passe:</strong> Introduza a palavra-passe para o seu fornecedor DDNS.</li>
<li><strong>Endere&ccedil;o externo:</strong> Introduza o endere&ccedil;o IP externo da DiskStation que utilizar&aacute; o nome de anfitri&atilde;o.</li>
<li><strong>Heartbeat:</strong> Active esta op&ccedil;&atilde;o para receber alertas relativamente ao estado do nome de anfitri&atilde;o atribu&iacute;do (apenas nomes de anfitri&atilde;o fornecidos pela Synology).</li>
</ul>
</li>
<li>Clique em <strong>Testar Liga&ccedil;&atilde;o</strong> para ver se as defini&ccedil;&otilde;es est&atilde;o correctas.</li>
<li>Clique em <strong>OK</strong> para guardar e terminar.</li>
</ol>

<p>Depois de conclu&iacute;da a configura&ccedil;&atilde;o, pode aceder &agrave; sua DiskStation pela Internet introduzindo o nome de anfitri&atilde;o DDNS num navegador web.</p>
<div class="section">
<h4>Requisitos e Limita&ccedil;&otilde;es</h4>
<ul> 
<li>Os servidores do fornecedor de servi&ccedil;o DDNS est&atilde;o a funcionar.</li>
<li>DiskStation consegue ligar-se &agrave; Internet.</li>
<li>DDNS apenas funciona num ambiente de rede onde n&atilde;o &eacute; necess&aacute;rio servidor proxy.</li>
<li>Apenas pode introduzir um nome de anfitri&atilde;o para cada fornecedor de DDNS.</li>

</ul>
</div>

<h3>Gerir Nomes de Anfitri&atilde;o</h3>
<p>Use os seguintes bot&otilde;es para gerir entradas existentes de nome de anfitri&atilde;o:</p>
<ul>
<li><strong>Eliminar:</strong> Remove o nome de anfitri&atilde;o seleccionado da lista.</li>
<li><strong>Editar:</strong> Altera as defini&ccedil;&otilde;es do nome de anfitri&atilde;o seleccionado.</li>
<li><strong>Actualizar Agora:</strong> Actualiza o estado de todos os nomes de anfitri&atilde;o que t&ecirc;m o servi&ccedil;o DDNS activado.</li></ul>

<h3>Configurar um Fornecedor DDNS Personalizado</h3>
<p>Pode adicionar um fornecedor DDNS personalizado caso o seu fornecedor n&atilde;o apare&ccedil;a j&aacute; na lista dos fornecedores de servi&ccedil;o.</p>
<h4>Para configurar um fornecedor DDNS personalizado:</h4>
<ol>
<li>Clique em <b>Personalizar</b>.</li>
<li>Aparece uma janela a pedir que introduza as seguintes defini&ccedil;&otilde;es:
<ul>
<li><strong>Fornecedor do servi&ccedil;o:</strong> Introduza o nome do fornecedor de servi&ccedil;o personalizado.</li>
<li><strong>Query URL:</strong> Introduza o URL do fornecedor de servi&ccedil;o personalizado.</li>
  </ul>
</li>
<li>Clique em <strong>Guardar</strong> para adicionar o fornecedor de servi&ccedil;o personalizado &agrave; lista de fornecedores de servi&ccedil;o DDNS.</li>
</ol>
<div class="section">
<h4>Requisitos e Limita&ccedil;&otilde;es</h4>
<ul>
<li>O query URL tem de aderir ao protocolo especificado pelo seu fornecedor de servi&ccedil;o.Este URL &eacute; usado para actualizar informa&ccedil;&otilde;es de IP ao servidor DDNS do seu fornecedor.</li>
<li>Um query URL normalmente cont&eacute;m os quatro par&acirc;metros abaixo.Quando introduz o query URL, substitua os seguintes par&acirc;metros com a vari&aacute;vel correspondente.</li>
  <ul>
<li>Nome do utilizador:__USERNAME__</li>
<li>Palavra-passe:__PASSWORD__</li>
<li>Nome do anfitri&atilde;o:__HOSTNAME__</li>
<li>Endere&ccedil;o externo:__MYIP__</li>
  </ul>
<li>O query URL n&atilde;o pode conter espa&ccedil;os nem pontos e v&iacute;rgulas.</li>
</ul>
</div>
</body>
</html>
