
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Geral</h2>

<p>As op&ccedil;&otilde;es gen&eacute;ricas de rede, como gateway predefinido, DNS server, proxy e IPv6 tunneling est&atilde;o dispon&iacute;veis em <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Geral</strong>.</p>


<h3>Renomear o Dispositivo DiskStation</h3>
<p>Para renomear o seu dispositivo DiskStation, introduza o novo nome do servidor e clique em <b>Aplicar</b>.</p>
<p>O nome do servidor &eacute; sens&iacute;vel a mai&uacute;sculas e min&uacute;sculas e pode incluir de 1 a 15 caracteres, que podem ser letras, n&uacute;meros, sinais de sublinhado e de subtra&ccedil;&atilde;o. O primeiro caractere do nome deve ser uma letra.</p>


<h3>Especifica&ccedil;&atilde;o do Gateway Predefinido</h3>
<p>Basta introduzir o endere&ccedil;o IP para o gateway predefinido e clicar em <b>Aplicar</b> para guardar a defini&ccedil;&atilde;o.</p>


<h3>Especifica&ccedil;&atilde;o do Endere&ccedil;o IP do DNS Server</h3>
<p>Pode optar por configurar manualmente o endere&ccedil;o IP do seu servidor DNS. Neste caso, o endere&ccedil;o IP do seu servidor DNS preferido tem de ser introduzido. Pode tamb&eacute;m ser introduzido um endere&ccedil;o IP de servidor DNS alternativo, para salvaguarda caso o servidor DNS tenha problemas. Depois de configurados os endere&ccedil;os IP do servidor DNS como desejado, clique em <strong>Aplicar</strong> para guardar as suas defini&ccedil;&otilde;es.</p>


<div class="section">
<h4>Nota:</h4>
<p>Os campos Servidor DNS e gateway predefinido ser&atilde;o configurados automaticamente e n&atilde;o podem ser alterados se todos as interfaces da sua rede forem configuradas automaticamente ou caso utilize uma liga&ccedil;&atilde;o PPPoE.</p>
</div>



<h3><a name="proxy"></a>Liga&ccedil;&atilde;o via Servidor Proxy</h3>
<p>Para permitir que o seu dispositivo DiskStation seja ligado atrav&eacute;s de um servidor proxy, assinale <b>Ligar via servidor proxy</b>, introduza o <b>Endere&ccedil;o</b> e a <b>Porta</b> e depois clique em <b>Aplicar</b>.</p>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Clique em <strong>Defini&ccedil;&otilde;es avan&ccedil;adas</strong> para configurar o proxy HTTP, o proxy HTTPS e a informa&ccedil;&atilde;o de autentica&ccedil;&atilde;o.<li>Por predefini&ccedil;&atilde;o, as defini&ccedil;&otilde;es do proxy HTTPS s&atilde;o iguais &agrave;s defini&ccedil;&otilde;es do proxy HTTP.</li>
<li>Se estiver assinalada a op&ccedil;&atilde;o <b>Ligar via servidor proxy</b>, a Atualiza&ccedil;&atilde;o DSM e o Centro de Pacotes ligam-se sempre &agrave; Internet atrav&eacute;s de um proxy.</li>
<li>Se estiver assinalada a op&ccedil;&atilde;o <b>Contornar servidor de proxy para endere&ccedil;os locais</b>, certifique-se de que o servidor DNS utilizado pelo DiskStation pode resolver os pedidos de dispositivos na rede local.</li>
</ul>
</div>


<h3>Ativa&ccedil;&atilde;o de IPv6 Tunneling</h3>
<p>Enquanto o IPv6 n&atilde;o substituir completamente o IPv4, o IPv6 tunneling &eacute; necess&aacute;rio para permitir aos anfitri&otilde;es com endere&ccedil;os IPv6 acederem aos servi&ccedil;os de IPv4. Esta t&eacute;cnica proporciona uma forma de encaminhar o tr&aacute;fego do IPv6 nas redes IPv4 existentes.<br> Se n&atilde;o tiver a certeza acerca da configura&ccedil;&atilde;o do IPv6 ou encontrar alguns problemas de liga&ccedil;&atilde;o, contacte o seu Fornecedor do Servi&ccedil;o de Internet.</p>
<h4>Para ativar um Tunnel IPv6:</h4>
<ol>
<li>Assinale a caixa de verifica&ccedil;&atilde;o <b>Ativar tunnel</b> para ativar o suporte de tunnel.</li>

<li>Em <b>Endere&ccedil;o do Servidor</b>, introduza o nome do anfitri&atilde;o ou o endere&ccedil;o IP do fornecedor do servi&ccedil;o de tunnel, por exemplo: anonymous.freenet6.net.</li>

<li>Selecione se pretende <b>Ligar anonimamente</b> ou <b>Ligar com uma conta existente</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<p>O seu endere&ccedil;o IPv6 externo pode ser atualizado automaticamente pelo fornecedor do servi&ccedil;o. No entanto, o dispositivo DiskStation n&atilde;o ir&aacute; remover o endere&ccedil;o IPv6 antigo imediatamente.</p>
</div>



</body>
</html>
