
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>M&oacute;vel</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2><a name="usbmodem"></a>M&oacute;vel*</h2>

<p>Quando est&aacute; equipado com um dongle de banda larga m&oacute;vel, o DiskStation pode estabelecer liga&ccedil;&atilde;o &agrave; Internet atrav&eacute;s de uma rede 3G/LTE sem fios. As defini&ccedil;&otilde;es em <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de Rede</strong> &gt; <strong>M&oacute;vel</strong> ir&atilde;o ajud&aacute;-lo a estabelecer e modificar uma liga&ccedil;&atilde;o sem fios &agrave; Internet atrav&eacute;s do seu dongle de banda larga m&oacute;vel.</p>

<div class="section">
<h4>Nota:</h4>
<p>Para obter uma lista completa de dongles de banda larga m&oacute;vel suportados por produtos Synology, visite <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</p>
</div>

<h4>Para configurar uma rede m&oacute;vel:</h4>
<p>Quando um dongle de banda larga m&oacute;vel estiver ligado a uma das portas USB no DiskStation, o DiskStation ir&aacute; tentar estabelecer liga&ccedil;&atilde;o automaticamente. Se n&atilde;o for poss&iacute;vel estabelecer uma liga&ccedil;&atilde;o automaticamente ou pretender modificar as defini&ccedil;&otilde;es de liga&ccedil;&atilde;o, consulte o seguinte: </p>

<ul>
<li><b>Defini&ccedil;&otilde;es/Desbloqueio de SIM:</b> Se o cart&atilde;o SIM estiver protegido por PIN, tem de ser desbloqueado para permitir que DiskStation estabele&ccedil;a liga&ccedil;&atilde;o &agrave; rede. Ap&oacute;s o desbloqueio, esta sec&ccedil;&atilde;o fornece op&ccedil;&otilde;es para modificar as defini&ccedil;&otilde;es de PIN.</li>

<li><b>Editar:</b> Pode configurar manualmente a liga&ccedil;&atilde;o ou escolher de acordo com a localiza&ccedil;&atilde;o e operadora. A configura&ccedil;&atilde;o manual da liga&ccedil;&atilde;o requer a introdu&ccedil;&atilde;o de APN, n&uacute;mero de telefone, nome de utilizador e palavra-passe. Se n&atilde;o souber estas informa&ccedil;&otilde;es, contacte a sua operadora de telem&oacute;vel para obter suporte.</li>

<li><b>Ligar/Desligar:</b> Estes bot&otilde;es permitem ligar ou desligar o DiskStation da rede 3G/LTE.</li>
<li><b>Op&ccedil;&otilde;es:</b> Esta sec&ccedil;&atilde;o inclui uma op&ccedil;&atilde;o para definir a interface do dongle de banda larga m&oacute;vel como gateway predefinido para DiskStation. Quando configurar a rede m&oacute;vel como gateway predefinido, o tr&aacute;fego de Internet de DiskStation passar&aacute; atrav&eacute;s da rede m&oacute;vel em vez da rede com fios. </li>
</ul>
<div class="section">
<h4>Nota:</h4>
<ol>
<li>Quando ligados &agrave; Internet, alguns dongles de banda larga m&oacute;vel n&atilde;o exibem a for&ccedil;a do sinal se n&atilde;o suportarem esta funcionalidade.</li>
<li>Para alguns dongles de banda larga m&oacute;vel, n&atilde;o &eacute; poss&iacute;vel alterar as defini&ccedil;&otilde;es do SIM quando est&atilde;o ligados &agrave; Internet.</li>
</ol>
</div>
<p>____<br> <strong>*</strong>Apenas dispon&iacute;vel em modelos espec&iacute;ficos. </p>


</body>
</html>
