<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Esta p&aacute;gina apresenta op&ccedil;&otilde;es para gerir adaptadores Bluetooth e ligar dispositivos Bluetooth &agrave; sua DiskStation. Uma vez ligados, alguns dispositivos Bluetooth como altifalantes ou auscultadores podem ser seleccionados como a sa&iacute;da &aacute;udio para a Audio Station, permitindo-lhe ouvir facilmente a m&uacute;sica armazenada na sua DiskStation.</p>
<h2>Iniciar</h2>
<p>Ligue um adaptador USB Bluetooth a uma porta USB na sua DiskStation. &Eacute; exibida no lado esquerdo da p&aacute;gina principal de Bluetooth uma lista dos adaptadores Bluetooth. A informa&ccedil;&atilde;o e op&ccedil;&otilde;es relativos a dispositivos Bluetoot s&atilde;o apresentados &agrave; direita.</p>
<h4>Para activar ou desactivar adaptadores Bluetooth:</h4>
<ol>
<li>Seleccione um adaptador Bluetooth.</li>
<li>Clique em <strong>Defini&ccedil;&otilde;es avan&ccedil;adas</strong>.</li>
<li>Assinale a caixa <strong>Activar Bluetooth</strong>.</li>
<li>Clique em <strong>OK</strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>
<h2>Gerir Dispositivos Bluetooth</h2>
<p>Quando liga a um novo dispositivo Bluetooth, certifique-se que o mesmo est&aacute; vis&iacute;vel, a menos de 10 metros de DiskStation, e que utiliza A2DP (Perfil Avan&ccedil;ado de Distribui&ccedil;&atilde;o &Aacute;udio). Consulte o manual do utilizador do dispositivo Bluetooth para mais detalhes relativamente &agrave; configura&ccedil;&atilde;o.</p>
<h4>Para ligar a um dispositivo Bluetooth:</h4>
<ol>
<li>Na p&aacute;gina principal de <strong>Bluetooth</strong>, seleccione o dispositivo Bluetooth que deseja ligar a DiskStation. Se o dispositivo n&atilde;o aparecer, tente clicar em <strong>Actualizar</strong> para pesquisar dispositivos por perto.</li>
<li>Seleccione o dispositivo quando aparecer.</li>
<li>Clique em <strong>Ligar</strong>.</li>
<li>Introduza o PIN para o seu dispositivo, se necess&aacute;rio.</li>
</ol>
<h4>Para ver as informa&ccedil;&otilde;es do dispositivo Bluetooth:</h4>
<ol>
<li>Seleccione um dispositivo Bluetooth ligado.</li>
<li>Clique em <strong>Informa&ccedil;&atilde;o</strong>.</li>
<li>Aparece uma janela com as informa&ccedil;&otilde;es, como endere&ccedil;o Bluetooth, nome, tipo e estado.</li>
</ol>
<h4>Para remover um dispositivo Bluetooth:</h4>
<ol>
<li>Seleccione um dispositivo Bluetooth que j&aacute; n&atilde;o deseja usar com a sua DiskStation.</li>
<li>Clique em <strong>Remover</strong>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Quando reproduz m&uacute;sica por altifalantes ou auscultadores Bluetooth, podem ocorrer problemas de reprodu&ccedil;&atilde;o se as defini&ccedil;&otilde;es do adaptador Bluetooth forem modificadas ou se ligar demasiados dispositivos Bluetooth ao mesmo tempo.</li>
<li>Dependendo do dispositivo, se um par de altifalantes Bluetooth que foram ligados ao seu DiskStation forem mais tarde ligados a outro DiskStation (ou leitor de m&uacute;sica Bluetooth), os altifalantes podem esquecer o seu DiskStation. Neste caso, ir&aacute; ocorrer um erro ao tentar reproduzir m&uacute;sica com os altifalantes. Para solucionar este problema, remova os altifalantes e tente a eles ligar novamente.</li>
</ul>

</div>
</body>
</html>
