<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bloqueio Autom&aacute;tico - Ajuda do Synology DSM</title> 
<meta name="author" content="Synology Inc.">
<meta name="description" content="The auto block feature helps improve the security of your DiskStation by blocking the IP addresses of clients with too many failed login attempts.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Bloqueio Autom&aacute;tico</h2>

<p>A funcionalidade de bloqueio autom&aacute;tico ajuda a melhorar a seguran&ccedil;a do seu DiskStation, bloqueando os endere&ccedil;os IP de clientes com demasiadas tentativas falhadas de in&iacute;cio de sess&atilde;o. Isto ajuda a reduzir o risco de contas serem assaltadas atrav&eacute;s de ataques violentos.</p>

<p>Tamb&eacute;m pode criar e gerir uma lista autorizada para adicionar endere&ccedil;os IP nos quais confia ou uma lista de bloqueio para impedir sempre que determinados endere&ccedil;os IP iniciem sess&atilde;o.</p>

<div class="section">
<h4>Nota:</h4>
<p>V&aacute;rios servi&ccedil;os e pacotes suportam o bloqueio autom&aacute;tico, como os seguintes: DSM, SSH, Telnet, rsync, c&oacute;pia de seguran&ccedil;a de rede, sincroniza&ccedil;&atilde;o de pasta partilhada, FTP, WebDAV, File Station, Photo Station, Audio Station, Video Station, Download Station, Mail Server, Mail Station, Time Backup, VPN Server, Cloud Station e aplica&ccedil;&otilde;es m&oacute;veis da Synology.</p>
</div>

<h4>Para ativar o bloqueio autom&aacute;tico:</h4>
<ol>

<li>Abra <strong>Painel de Controlo</strong> e aceda a <strong>Seguran&ccedil;a</strong> &gt; <strong>Bloqueio Autom&aacute;tico</strong>.</li>
<li>Assinale a caixa de verifica&ccedil;&atilde;o <b>Ativar bloqueio autom&aacute;tico</b>.</li>

<li>Introduza um n&uacute;mero de tentativas falhadas de in&iacute;cio de sess&atilde;o no campo <b>Tentativas de in&iacute;cio de sess&atilde;o</b> e um n&uacute;mero de minutos no campo <b>No espa&ccedil;o de (minutos)</b>. Um endere&ccedil;o IP ser&aacute; bloqueado quando exceder o n&uacute;mero de tentativas falhadas de in&iacute;cio de sess&atilde;o no n&uacute;mero de minutos especificado.</li>
<li>Assinale a caixa de verifica&ccedil;&atilde;o <b>Ativar validade do bloqueio</b> e introduza um n&uacute;mero para remover um endere&ccedil;o IP bloqueado ap&oacute;s o n&uacute;mero especificado de dias.</li>

<li>Clique em <b>Aplicar.</b></li>
</ol>


<h3>Gerir Lista de Bloqueio</h3>
<p>Clique em <strong>Lista Autorizada/de Bloqueio</strong> e v&aacute; para o separador <strong>Lista de Bloqueio</strong>. </p>

<h4>Para adicionar endere&ccedil;os IP:</h4>
<p>Escolha qualquer uma das seguintes op&ccedil;&otilde;es a partir do menu pendente <strong>Criar</strong>:</p>
<ul>
<li><strong>Adicionar endere&ccedil;o IP</strong><br> Introduza um endere&ccedil;o IP e defina a hora de expira&ccedil;&atilde;o.</li>
<li><strong>Importar lista de endere&ccedil;os IP</strong><br> Importe um ficheiro de texto que liste os endere&ccedil;os IP para adicionar um n&uacute;mero de endere&ccedil;os IP e defina a hora de expira&ccedil;&atilde;o ao mesmo tempo. Assinale a caixa de verifica&ccedil;&atilde;o se pretender substituir endere&ccedil;os IP existentes. Se esta op&ccedil;&atilde;o n&atilde;o estiver seleccionada, ser&atilde;o ignorados os endere&ccedil;os IP duplicados.<br> Se o ficheiro selecionado tiver um formato correto, ver&aacute; todos os endere&ccedil;os IP na &aacute;rea de pr&eacute;-visualiza&ccedil;&atilde;o. Clique em <strong>OK</strong> para importar.</li>

<div class="section">
<h4>Nota:</h4>
<p>Para importar um ficheiro, este dever&aacute; cumprir os seguintes crit&eacute;rios:</p>
<ul>
<li>O ficheiro dever&aacute; ser um ficheiro de texto simples.</li>
<li>Cada linha do ficheiro pode apenas conter um endere&ccedil;o IP.</li>
<li>As linhas de coment&aacute;rios come&ccedil;am com um # (cardinal).</li>
</ul>
</div>
</ul>

<h4>Para remover endere&ccedil;os IP bloqueados:</h4>
<p>Selecione os endere&ccedil;os IP que pretende remover da lista e clique em <b>Remover</b>.</p>


<h3>Gerir Lista Autorizada</h3>

<p>Clique em <strong>Lista Autorizada/de Bloqueio</strong> e v&aacute; para o separador <strong>Lista Autorizada</strong>. </p>

<h4>Para adicionar endere&ccedil;os IP:</h4>
<p>Escolha qualquer uma das seguintes op&ccedil;&otilde;es a partir do menu pendente <strong>Criar</strong>:</p>
<ul>
<li><strong>Adicionar endere&ccedil;o IP</strong><br> Introduza um endere&ccedil;o IP.</li>
<li><strong>Importar lista de endere&ccedil;os IP</strong><br> Importe um ficheiro de texto que liste os endere&ccedil;os IP para adicionar um n&uacute;mero de endere&ccedil;os IP ao mesmo tempo. Assinale a caixa de verifica&ccedil;&atilde;o se pretender substituir endere&ccedil;os IP existentes. Se esta op&ccedil;&atilde;o n&atilde;o estiver seleccionada, ser&atilde;o ignorados os endere&ccedil;os IP duplicados.<br> Se o ficheiro selecionado tiver um formato correto, ver&aacute; todos os endere&ccedil;os IP na &aacute;rea de pr&eacute;-visualiza&ccedil;&atilde;o. Clique em <strong>OK</strong> para importar.</li>
</ul>

<div class="section"><h4>Nota:</h4>
<p>Para importar um ficheiro, este dever&aacute; cumprir os seguintes crit&eacute;rios:</p>
<ul>
<li>O ficheiro dever&aacute; ser um ficheiro de texto simples.</li>
<li>Cada linha do ficheiro pode apenas conter um endere&ccedil;o IP.</li>
<li>As linhas de coment&aacute;rios come&ccedil;am com um # (cardinal).</li>
</ul>
</div>

<h4>Para remover endere&ccedil;os IP:</h4>
<p>Selecione os endere&ccedil;os IP que pretende remover da lista e clique em <b>Remover</b>.</p>

<div class="section"><h4>Nota:</h4>
<p>Se o seu dispositivo DiskStation estiver atr&aacute;s de um servidor proxy inverso, adicione o endere&ccedil;o IP desse servidor proxy inverso &agrave; lista autorizada.</p>
</div>

</body>
</html>
