<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Firewall</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_firewall"></a>Autorizar / Recusar</h2>
<p>
A firewall integrada pode evitar in&iacute;cios de sess&atilde;o n&atilde;o autorizados e controlar o acesso a servi&ccedil;os. Para al&eacute;m disso, pode optar por permitir ou negar o acesso a determinadas portas de rede com origem em endere&ccedil;os IP espec&iacute;ficos.</p>
<h4>Para criar uma regra da firewall:</h4>
<ol>
<li>Aceder a <b>Painel de Controlo</b> &gt; <b>Firewall</b> e seleccione a interface de rede da coluna da esquerda de acordo com o tipo da sua liga&ccedil;&atilde;o de rede.</li>
<li>Clique em <b>Criar</b>.</li>
<li>Na sec&ccedil;&atilde;o <b>Portas</b>, seleccione uma das seguintes regras:</li>
<ul>
<li>Seleccione <b>Tudo</b> para aplicar as regras a todas as portas.</li>
<li>Escolha <b>Seleccione numa lista de aplica&ccedil;&otilde;es integradas</b>.</li>
<li>Seleccione <b>Personalizar</b> e clique em <b>Personalizar</b>, de seguida introduza at&eacute; 15 portas separadas por v&iacute;rgulas ou especifique uma s&eacute;rie da porta.</li>
<li class="no">
Tamb&eacute;m pode especificar os protocolos.
</li>
</ul>
<li>Na sec&ccedil;&atilde;o <b>IP de Origem</b>, seleccione uma das seguintes regras:</li>
<ul>
<li>Seleccione <b>Tudo</b> para permitir ou negar todos os endere&ccedil;os IP.</li>
<li>Introduza um <b>Anfitri&atilde;o &Uacute;nico Endere&ccedil;o IP</b>.</li>
<li>Introduza uma <b>Subnet</b>. </li>
</ul>
<li>Na sec&ccedil;&atilde;o <b>Ac&ccedil;&atilde;o</b>, seleccione uma das seguintes regras:</li>
<ul>
<li>Seleccione <b>Permitir</b> para permitir o acesso &agrave;s portas e as defini&ccedil;&otilde;es do IP de origem acima.</li>
<li>Seleccione <b>Negar</b> para negar o acesso &agrave;s portas e as defini&ccedil;&otilde;es do IP de origem acima.</li>
</ul>
</ol>
<p>
Agora pode visualizar a regra da firewall criada na lista de regras.
</p>
<h4>Para eliminar as regras da firewall, proceda de uma das formas seguintes:</h4>
<ul>
<li>Desmarque a caixa de verifica&ccedil;&atilde;o da regra na coluna <b>Activado</b> da lista</li>
<li>Eliminar a regra da firewall</li>
</ul>
<p>
Pode tamb&eacute;m optar por <b>Permitir acesso</b> ou <b>Negar acesso</b> na parte inferior da lista de regras para permitir ou negar acessos que n&atilde;o cumpram regras.
</p>
<ol>
<span class="note_head">Nota:</span>
<li>Pode criar at&eacute; 100 regras para uma interface de rede e pode reorganizar as regras da lista arrastando e soltando.</li>
<li>As regras s&atilde;o priorizadas de acordo com a sua posi&ccedil;&atilde;o na lista.</li>
<li>Se o seu sistema possuir m&uacute;ltiplas portas de rede ligadas &agrave; mesma subrede, as regras da firewall podem n&atilde;o funcionar adequadamente.* </li>
<li>Quando combinar m&uacute;ltiplas portas LAN com link aggregation, a firewall aplicar&aacute; as regras da primeira interface de rede e reserva as regras da segunda interface de rede.</li>
</ol>
<p>____<br> * Aplica-se apenas a modelos espec&iacute;ficos.</p>
</body>
</html>
