<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Prote&ccedil;&atilde;o</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Prote&ccedil;&atilde;o</h2>
<p><strong>Painel de Controlo</strong> &gt; <strong>Seguran&ccedil;a</strong> &gt; <strong>Prote&ccedil;&atilde;o</strong> fornece op&ccedil;&otilde;es para melhorar a seguran&ccedil;a de rede para cada interface de rede.</p>

<h3>Prote&ccedil;&atilde;o DoS</h3>
<p>A prote&ccedil;&atilde;o Denial-of-service (DoS) ajuda a evitar ataques maliciosos pela internet.</p>
<h4>Para ativar a prote&ccedil;&atilde;o DoS:</h4>
<ol>
<li>Marque a caixa <strong>Ativar prote&ccedil;&atilde;o DoS</strong>.</li>
<li>Clique em <strong>Aplicar</strong>.</li>
</ol>
<h3>VPN Pass-through*</h3>

<p>Quando o DiskStation funciona como router, o VPN pass-through permite que os clientes passem atrav&eacute;s de DiskStation NAT e estabele&ccedil;am liga&ccedil;&otilde;es VPN de sa&iacute;da ou entrada. Se a sua configura&ccedil;&atilde;o interna incluir um servidor VPN, v&aacute; para <strong>Painel de Controlo</strong> &gt; <strong>Acesso Externo</strong> &gt; <strong>Configura&ccedil;&atilde;o do Router</strong> para configurar as regras de reencaminhamento de portas e permitir que o servidor VPN estabele&ccedil;a liga&ccedil;&otilde;es VPN.</p>

<h4>Para editar as defini&ccedil;&otilde;es de VPN pass-through:</h4>
<ol>
<li>As seguintes defini&ccedil;&otilde;es podem ser ativadas ou desativadas aqui:</li>
<ul>
<li><strong>PPTP Pass-through:</strong> Permite que o tr&aacute;fego PPTP (Point-to-Point Tunneling Protocol) passe e estabele&ccedil;a liga&ccedil;&otilde;es.</li>
<li><strong>IPSec Pass-through:</strong> Permite que o tr&aacute;fego IPSec (Protocolo de Seguran&ccedil;a IP) passe e estabele&ccedil;a liga&ccedil;&otilde;es.</li>
<li><strong>L2TP Pass-through:</strong> Permite que o tr&aacute;fego L2TP (Protocolo de T&uacute;nel Layer 2) passe e estabele&ccedil;a liga&ccedil;&otilde;es.</li>
</ul>
<li>Depois de modificar as defini&ccedil;&otilde;es, clique em <strong>Aplicar</strong>.</li>
</ol>


<div class="section">
<h4>Nota:</h4>
<p>Se o seu dispositivo DiskStation estiver ligado &agrave; Internet atrav&eacute;s do PPPoE, as respetivas regras de prote&ccedil;&atilde;o DoS ou VPN pass-through devem ser configuradas na correspondente interface do PPPoE.</p>
</div>


<p>____<br>* Apenas dispon&iacute;vel em alguns modelos.</p>
</body>
</html>
