<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Defini&ccedil;&otilde;es do DSM</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="https"></a>Encaminhamento de rede</h2>
<p>O DSM disponibiliza diversas op&ccedil;&otilde;es de encaminhamento de rede para v&aacute;rios requisitos de configura&ccedil;&atilde;o de rede.</p>
<h4>Para separar o fluxo de rede das interfaces de rede na mesma LAN:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Avan&ccedil;adas</strong>.</li>
<li>Em <strong>Geral</strong>, assinale <strong>Responder a pedidos ARP se o endere&ccedil;o IP alvo for o endere&ccedil;o local configurado na interface de entrada</strong>.<li>Clique em <strong>Aplicar</strong> para guardar as suas defini&ccedil;&otilde;es.</ol>
<p>Desta forma fica estabelecida a regra de encaminhamento predefinida para cada interface de rede, o que ir&aacute; provocar que os pacotes de rede de cada interface sejam transmitidos da sua pr&oacute;pria interface de rede f&iacute;sica correspondente.</p>
<p>Al&eacute;m disso, se tiver mais do que duas interfaces de rede na mesma LAN, a ativa&ccedil;&atilde;o desta op&ccedil;&atilde;o d&aacute; origem a que o fluxo de rede de cada interface seja transportado separadamente. Pode, ent&atilde;o, aplicar regras de firewall separadas para cada interface.</p>


<h4>Para encaminhar cada interface de rede atrav&eacute;s das respetivas gateways:</h4>
<ol>
  <li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong>.</li>
  <li>Em <strong>Geral</strong>, assinale <strong>Ativar m&uacute;ltiplas gateways</strong>.<li>Clique em <strong>Aplicar</strong> para guardar as suas defini&ccedil;&otilde;es.</ol>
<p>Isto origina que o encaminhamento de cada interface de rede na sua rede passe atrav&eacute;s das respetivas gateways. </p>


<h4>Para alterar a gateway predefinida:</h4>
<ol>
  <li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong>.</li>
  <li>Em <strong>Interface de Rede</strong>, clique em <strong>Ordem de Servi&ccedil;o</strong>.<li>Reorganize as suas gateways selecionando a gateway e clicando em <strong>Para Cima</strong> ou <strong>Para Baixo</strong>.<li>Clique em <strong>OK</strong>.</ol>
<p>A gateway no topo da ordem ir&aacute; funcionar como a gateway predefinida para a sua LAN.</p> 


<h4>Para configurar o encaminhamento est&aacute;tico:</h4>
<ol>
  <li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong>.</li>
  <li>Em <strong>Rota Est&aacute;tica</strong>, clique em <strong>Criar</strong>.<li>Em <strong>Rede de Destino</strong>, introduza o endere&ccedil;o IP do seu destino.<li>Em <strong>M&aacute;scara de Rede</strong>, introduza a m&aacute;scara de rede do seu destino.<li>Em <strong>Gateway</strong>, introduza o endere&ccedil;o da sua gateway de destino.<li>Em <strong>Interface</strong>, selecione a sua interface de destino<li>Clique em <strong>OK</strong>.</ol>

<h4>Para visualizar o quadro de encaminhamento de IP:</h4>
<ol>
  <li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong>.</li>
  <li>Em <strong>Rota Est&aacute;tica</strong>, clique em <strong>Tabela de Encaminhamento IP</strong>.<li>Selecione uma interface de rede para visualizar a respetiva Tabela de encaminhamento IP na lista pendente no canto superior esquerdo.</ol>

</body>
</html>

