<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Configura&ccedil;&atilde;o do Router</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="router"></a>Configura&ccedil;&atilde;o do Router</h2>
<p>Se o seu DiskStation estiver numa rede de &aacute;rea local, outros dispositivos na Internet n&atilde;o se podem ligar ao mesmo.Pode configurar as regras de reencaminhamento de portas em <strong>Painel de Controlo</strong> &gt; <strong>Acesso Externo</strong> &gt; <strong>Configura&ccedil;&atilde;o do Router</strong> para tornar o seu dispositivo DiskStation acess&iacute;vel atrav&eacute;s da Internet.</p>



<h3><a name="leaf_routerconf"></a>Configurar o Router</h3>

<p>
Antes de adicionar as regras de reencaminhamento de portas, &eacute; necess&aacute;rio configurar uma liga&ccedil;&atilde;o entre o seu dispositivo DiskStation e o router.
</p>

<div class="section">
<h4>Nota:</h4>
<ol>
<li>
Para configurar regras de reencaminhamento de portas e atribuir um endere&ccedil;o IP est&aacute;tico, precisar&aacute; de privil&eacute;gios de administrador para aceder ao router.
</li>
<li>
Antes de configurar a liga&ccedil;&atilde;o do dispositivo DiskStation a um router UPnP, certifique-se de que o DSM recuperou com &ecirc;xito o endere&ccedil;o IP externo do seu DiskStation (em <b>Painel de Controlo</b> &gt; <b>Acesso Externo</b> &gt; <strong>DDNS</strong>).Caso contr&aacute;rio, verifique as configura&ccedil;&otilde;es de rede e da firewall do seu dispositivo DiskStation e do router UPnP.
</li>
</ol>
</div>

<p>Para configurar a liga&ccedil;&atilde;o do dispositivo DiskStation ao router:
<ol>
  <li>
Clique em <b>Configurar router</b> para iniciar o assistente de configura&ccedil;&atilde;o.O DSM vai come&ccedil;ar por testar os seguintes componentes de rede/defini&ccedil;&otilde;es antes de prosseguir para o passo seguinte.
    <ul>
<li>Interface de rede</li>
<li>Liga&ccedil;&atilde;o Gateway</li>
<li>Liga&ccedil;&atilde;o &agrave; Internet</li>
<li>Reencaminhamento de porta</li>
<li>DNS</li>
  </ul>
  </li>
<li>Dependendo do tipo de router que estiver a utilizar, proceda de uma das seguintes formas:
</li>
<ul>
<li>
Caso o seu router n&atilde;o suporte UPnP, consulte o passo 3.
</li>
<li>
Se o router UPnP tiver sido testado e considerado compat&iacute;vel com o dispositivo DiskStation, clique em <b>Aplicar</b> quando visualizar um resumo das informa&ccedil;&otilde;es do router.A liga&ccedil;&atilde;o do seu dispositivo DiskStation ao router foi configurada com &ecirc;xito.
</li>
<li>
Se o seu router UPnP n&atilde;o tiver sido considerado compat&iacute;vel com o dispositivo DiskStation, proceda de uma das seguintes formas:</li>

<ul>
<li>
Se pretende configurar automaticamente a liga&ccedil;&atilde;o ao router, escolha <b>Autom&aacute;tico</b> e clique em <b>Seguinte</b> para que o sistema execute um teste de compatibilidade:</li>
<ul>
<li>
Se o router tiver sido testado e considerado compat&iacute;vel com o servi&ccedil;o de configura&ccedil;&atilde;o do router do dispositivo DiskStation, assinale a caixa de verifica&ccedil;&atilde;o para enviar o relat&oacute;rio de teste para ajudar a Synology a atualizar a base de dados de compatibilidade do router e, em seguida, clique em <b>Aplicar</b>.A liga&ccedil;&atilde;o do seu dispositivo DiskStation ao router foi configurada com &ecirc;xito.
</li>
<li>
Se o router tiver sido testado e considerado incompat&iacute;vel com o servi&ccedil;o de configura&ccedil;&atilde;o do router do dispositivo DiskStation, assinale a caixa de verifica&ccedil;&atilde;o para enviar o relat&oacute;rio de teste para ajudar a Synology a atualizar a base de dados de compatibilidade do router e, em seguida, clique em <b>Fechar</b> para sair do assistente de configura&ccedil;&atilde;o.
</li>
<div class="section">
<h4>Nota:</h4>
<p>Se o router for testado e considerado incompat&iacute;vel aqui, poder&aacute; continuar a configurar as regras de reencaminhamento de portas na interface de utilizador do router.Para obter mais informa&ccedil;&otilde;es, consulte <a href="http://www.synology.com/tutorials/how_to_internet.php?#t3.10" target="_blank">aqui</a>.</a></p> 
</div>
</ul>

<li>
Se pretende configurar manualmente a liga&ccedil;&atilde;o ao router, escolha <b>Manual</b>, clique em <b>Seguinte</b> e consulte o passo 3.
</li>
</ul>

</ul>

<li>
Se for necess&aacute;rio configurar manualmente a liga&ccedil;&atilde;o do dispositivo DiskStation ao router, proceda da seguinte forma:
</li>
<ol>
<li>
Escolha o seu router no menu pendente <b>Router</b>.
</li>
<div class="section">
<h4>Nota:</h4>
<p>Se n&atilde;o encontrar o seu router aqui, clique em <b>Atualizar Lista</b> para obter a lista mais recente da Synology.</p>
</div>

<li>Configure o protocolo e a porta do seu router.O protocolo e a porta variam consoante o modelo do seu router.Se n&atilde;o conseguir ligar utilizando o <b>Protocolo</b> (HTTP) e a <b>Porta</b> (80), consulte a documenta&ccedil;&atilde;o fornecida com o seu router para obter as defini&ccedil;&otilde;es corretas.</li>
<li>Se o seu router necessitar de uma conta personalizada, marque <b>Utilizar conta personalizada</b> e preencha os campos <b>Conta</b> e <b>Palavra-passe</b>.
</li>
<li>
Clique em <b>Aplicar</b> para concluir.
</li>
</ol>
</ol>




<h3>Gerir Regras de Reencaminhamento de Portas</h3>
<p>As regras de reencaminhamento de portas podem especificar as portas de destino do DiskStation que ir&atilde;o receber os pacotes de portas espec&iacute;ficas do router.</p>
<p>Se o DiskStation estabelecer liga&ccedil;&atilde;o &agrave; Internet atrav&eacute;s de um router, clique em <b>Criar</b> para abrir o assistente de configura&ccedil;&atilde;o do reencaminhamento de portas.</p>
<p>Existem duas formas de adicionar regras de reencaminhamento de portas:</p>
<ul>
<li>Se pretende criar regras de reencaminhamento de portas para servi&ccedil;os de sistema (por exemplo, FTP, Web Station, etc.), selecione <b>Aplica&ccedil;&atilde;o integrada</b>.</li>
<li>Se pretende criar regras de reencaminhamento de portas para outros servi&ccedil;os, selecione <b>Personalizar porta</b>.</li>
</ul>
<p>Pode utilizar a sintaxe seguinte para especificar os n&uacute;meros e intervalos de portas:</p>
<ul>
<li>Utilize &ldquo;-&rdquo; para descrever um intervalo de portas, por exemplo: 6881-6890.</li>
<li>Utilize &ldquo;,&rdquo; para separar portas, por exemplo: &ldquo;21,22&rdquo;, &ldquo;21,55536-55663&rdquo;.</li>
</ul>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Cada porta do gateway do router pode ser utilizada apenas para uma regra de reencaminhamento.A utiliza&ccedil;&atilde;o de uma porta do router para duas ou mais regras ir&aacute; provocar conflitos e aparecer&aacute; uma mensagem de aviso no ecr&atilde;.&Eacute; necess&aacute;rio definir outra porta na regra para evitar conflitos.</li>
<li>Alguns routers n&atilde;o permitem a utiliza&ccedil;&atilde;o de portas personalizadas para o reencaminhamento de servi&ccedil;os do sistema. </li>
</ul>
</div>

<h4>Para guardar regras:</h4>
<p>Clique em <b>Guardar</b> depois de criar as regras.Se n&atilde;o o fizer, as regras n&atilde;o ser&atilde;o aplicadas.</p>
<p>
Depois de guardar as regras, pode ser necess&aacute;rio aguardar alguns minutos antes de as regras come&ccedil;arem a funcionar, dependendo do modelo do seu router.
</p>
<h4>Para testar se as suas regras est&atilde;o ou n&atilde;o a funcionar:</h4>
<p>Escolha as regras que pretende testar e clique em <b>Testar Liga&ccedil;&atilde;o</b>.O resultado ser&aacute; exibido na coluna <b>Resultado da Liga&ccedil;&atilde;o de Teste</b>.</p>
<h3>Para Configura&ccedil;&otilde;es do Router Sem Fios*</h3>
<p>Quando o seu DiskStation funciona como router sem fios, as regras de reencaminhamento de portas ser&atilde;o diretamente aplicadas pelo DiskStation.</p>
<h4>Para adicionar regras de reencaminhamento de portas:</h4>
<ol>
<li>Clique em <b>Criar</b> para abrir a janela de configura&ccedil;&atilde;o. </p>
<li>Especifique o nome do <strong>Servi&ccedil;o</strong>, o <strong>Protocolo</strong> (TCP ou UDP), o <strong>Endere&ccedil;o IP Privado</strong>, a <strong>Porta Privada</strong> e a <strong>Porta P&uacute;blica</strong>.Pode utilizar a sintaxe seguinte para especificar os n&uacute;meros e intervalos de portas:
<ul>
<li>Utilize &ldquo;-&rdquo; para descrever um intervalo de portas, por exemplo: 6881-6890.</li>
<li>Utilize &ldquo;,&rdquo; para separar portas, por exemplo: &ldquo;21,22&rdquo;, &ldquo;21,55536-55663&rdquo;.</li>
</ul>
<li>Clique em <strong>Criar</strong> na parte inferior para concluir as defini&ccedil;&otilde;es.
</ol>

<div class="section">
<h4>Nota:</h4>
<p>A maioria dos routers permitem portas da m&aacute;quina local e portas do router serem diferentes quando configura regras de reencaminhamento de portas.Se o seu router suporta esta funcionalidade:</p>
<ul>
<li>Quando guarda uma regra, se uma porta do router j&aacute; estiver em utiliza&ccedil;&atilde;o por uma regra existente, ser&aacute; atribu&iacute;da uma nova porta de router.</li>
<li>Quando adiciona ou edita regras, pode especificar directamente o n&uacute;mero de porta do router.</li>
</ul>
</div>
<h3>DMZ*</h3>
<p>Pode ativar o DMZ no seu DiskStation quando a Configura&ccedil;&atilde;o do Mapa de Rede for Router Sem Fios.Um anfitri&atilde;o no DMZ pode ligar diretamente &agrave; rede externa, sem a limita&ccedil;&atilde;o e prote&ccedil;&atilde;o da firewall.&Eacute; normalmente utilizado para configurar servidores.</p>
<h4>Para ativar o DMZ:</h4>
<ol>
<li>Clique em <strong>Defini&ccedil;&otilde;es do DMZ</strong> para abrir a janela de configura&ccedil;&atilde;o.</li>
<li>Assinale a caixa de verifica&ccedil;&atilde;o <strong>Ativar DMZ</strong>.</li>
<li>Introduza o seu endere&ccedil;o DMZ Host IP.</li>
<li>Clique em <strong>Aplicar</strong>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<p>A partir da rede externa, ser&aacute; necess&aacute;rio um endere&ccedil;o IP externo obtido por DiskStation para ligar a um anfitri&atilde;o no DMZ.</p>
</div>


<p>____<br> * Dispon&iacute;vel apenas em determinados modelos ou consoante o seu ambiente.
</p>


</body>
</html>
