
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>LAN / LAN Sem Fios</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="lan"></a>LAN/Internet</h2>
<p>Dependendo do seu modelo de DiskStation e das defini&ccedil;&otilde;es de rede, pode configurar as defini&ccedil;&otilde;es DHCP para LAN ou Internet em <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de rede</strong>. DHCP &eacute; um protocolo de rede para configura&ccedil;&atilde;o autom&aacute;tica de IP. Para permitir ao DHCP atribuir um IP para o sistema, clique em <strong>Editar</strong> e escolha <b>Obter a configura&ccedil;&atilde;o da rede automaticamente (DHCP)</b> no separador <strong>IPv4</strong>.</p>
<p>Se estiver a utilizar um endere&ccedil;o IP do seu fornecedor de servi&ccedil;o de rede, escolha <b>Utilizar a configura&ccedil;&atilde;o manual</b> e introduza manualmente o endere&ccedil;o IP e a m&aacute;scara de sub-rede. Se n&atilde;o existir um servidor DNS ou gateway predefinido dispon&iacute;vel, deixe o campo em branco.</p>

<div class="section">
<h4>Nota:</h4>
<ol>
<li>Para garantir que as notifica&ccedil;&otilde;es por e-mail s&atilde;o entregues corretamente atrav&eacute;s do servidor SMTP, deve ser introduzido um IP do servidor DNS v&aacute;lido.</li>
<li>Os Jumbo Frames s&atilde;o frames Ethernet com n&atilde;o mais do que os 1500 bytes padr&atilde;o de Unidade M&aacute;xima de Transmiss&atilde;o (MTU), que permitem que a transmiss&atilde;o por Ethernet de ficheiros grandes seja mais eficiente. S&oacute; pode estar ativado em ambiente de redes Gigabit.  Para garantir que o Jumbo Frame funciona corretamente, todos os computadores e dispositivos na rede a aceder &agrave; sua DiskStation devem suportar e utilizar o mesmo valor MTU.</li>
</ol>
</div>

<h3><a name="vlan"></a>VLAN</h3>
<p>Quando o ambiente de rede requer defini&ccedil;&otilde;es VLAN, pode ativar a op&ccedil;&atilde;o VLAN e introduzir um ID VLAN para o ambiente de rede no separador <strong>IPv4</strong>, na janela de Edi&ccedil;&atilde;o.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Certifique-se de que o switch de rede est&aacute; devidamente configurado, caso contr&aacute;rio o servi&ccedil;o da DiskStation poder&aacute; ficar inacess&iacute;vel.</li>
<li>Se n&atilde;o conseguir ligar ao DiskStation depois de modificar as defini&ccedil;&otilde;es acima, prima o bot&atilde;o RESET localizado no DiskStation para restaurar as predefini&ccedil;&otilde;es.</li>
</ul>
</div>


<h3><a name="ipv6"></a>Configura&ccedil;&atilde;o do IPv6</h3>
<p>Os dispositivos DiskStation suportam o esquema de conjuga&ccedil;&atilde;o dupla IPv4/IPv6. Isto significa que o IPv4 e o IPv6 podem funcionar simultaneamente no seu DiskStation. A defini&ccedil;&atilde;o predefinida para o IPv6 &eacute; <b>Autom&aacute;tico</b>. Selecione uma interface de rede existente, clique no bot&atilde;o <b>Editar</b> e aceda ao separador <b>IPv6</b> para alterar as defini&ccedil;&otilde;es.</p>

<h4>Para configurar as defini&ccedil;&otilde;es de IPv6:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de rede</strong>.</li>
<li>Selecione uma interface de rede existente e clique em <strong>Editar</strong>.</li>
<li>No separador <strong>IPv6</strong>, selecione um tipo de configura&ccedil;&atilde;o em <strong>Configura&ccedil;&atilde;o do IPv6</strong>:<ul>
    <li><b>Autom&aacute;tico</b>: O seu DiskStation gera automaticamente um endere&ccedil;o IPv6, dependendo do An&uacute;ncio do router (RA, Router Advertisement) da LAN.</li>
	<ul>
	  <li><strong>Modo sem monitoriza&ccedil;&atilde;o de estado</strong>: Permite que os dispositivos ligados ao router configurem automaticamente um endere&ccedil;o IPv6 sem definir o servidor DNS de IPv6.</li>
      <li><strong>Modo sem monitoriza&ccedil;&atilde;o de estado de DHCPv6</strong>: Permite que os dispositivos ligados ao router configurem automaticamente um endere&ccedil;o IPv6 e obtenham informa&ccedil;&otilde;es de DNS atrav&eacute;s de DHCPv6.</li>
      <li><strong>Modo de monitoriza&ccedil;&atilde;o de estado</strong>: Permite que os dispositivos ligados ao router obtenham um endere&ccedil;o IPv6 e informa&ccedil;&otilde;es de DNS atrav&eacute;s de DHCPv6. Neste modo, tem de ativar o servidor DHCPv6 e definir o <strong>Endereço IP inicial</strong> e o <strong>Endere&ccedil;o IP final</strong> do servidor DHCPv6.</li>
	</ul>
<li><b>Manual</b>: Configure o IPv6 manualmente introduzindo as informa&ccedil;&otilde;es em <b>endere&ccedil;o de IPv6</b>, <b>Comprimento do prefixo</b> e <b>Gateway predefinido</b>.</li>
<li><b>Desligar</b>: Desativar o suporte IPv6.</li>
  </ul>
</ol>
<p>Enquanto o IPv6 n&atilde;o substituir completamente o IPv4, os mecanismos de transi&ccedil;&atilde;o de IPv6 s&atilde;o necess&aacute;rios para permitir aos anfitri&otilde;es com endere&ccedil;os IPv4 acederem aos servi&ccedil;os de IPv6. Escolha entre os diferentes mecanismos de transi&ccedil;&atilde;o do IPv6:</p>
<ul>
  <li><b>6em4</b>: Estabele&ccedil;a liga&ccedil;&atilde;o &agrave; rede IPv6 atrav&eacute;s de um mediador de tunnel. Tem de preencher em <b>Endere&ccedil;o de IPv6</b>, <b>Comprimento do prefixo</b>, <b>Prefixo</b> e <b>Endere&ccedil;o de IPv4 de mediador de tunnel</b>. Para isso, &eacute; necess&aacute;rio um endere&ccedil;o p&uacute;blico de IPv4.</li>
<li><b>6para4</b>: Estabele&ccedil;a liga&ccedil;&atilde;o &agrave; rede IPv6 atrav&eacute;s de um mediador de tunnel, utilizando anycast. Para isso, &eacute; necess&aacute;rio um endere&ccedil;o p&uacute;blico de IPv4.</li>
<li><b>DHCP-PD</b>: Obtenha um prefixo de IPv6 do DHCP Server atrav&eacute;s de delega&ccedil;&atilde;o de prefixo na LAN. Para isso, &eacute; necess&aacute;rio suporte de ISP e s&oacute; funciona no modo de router.</li>
<li><b>Tunneling de IPv6 (TSP)</b>: Aceda a <strong>Painel de controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Geral</strong> para configurar esta op&ccedil;&atilde;o.</li>
</ul>

<h3>802.1X</h3>
<p>802.1X &eacute; uma norma de autentica&ccedil;&atilde;o desenvolvido pela IEEE para redes de liga&ccedil;&atilde;o de utilizadores. 802.1X pode ser usado em redes para autenticar o cliente, impedindo que clientes que n&atilde;o tenham passado com &ecirc;xito a autentica&ccedil;&atilde;o acedam &agrave; rede protegida. </p>
<p>Pode permitir que o seu Synology NAS se ligue &agrave; rede protegida por autentica&ccedil;&atilde;o 802.1X.</p>

<h4>Para ativar a autentica&ccedil;&atilde;o 802.1X:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de rede</strong>. </li>
<li>Selecione uma interface de rede com fios (por exemplo, LAN) e clique em <strong>Editar</strong>. </li>
<li>Aceda ao separador <strong>802.1X</strong> e assinale <strong>Ativar autentica&ccedil;&atilde;o 802.1X</strong>. </li>
<li>Selecione um dos seguintes protocolos do menu pendente <strong>Autentica&ccedil;&atilde;o</strong>. Se n&atilde;o tiver a certeza do protocolo mais adequado, selecione <strong>Auto</strong>. &Acirc;&nbsp;&Acirc;&nbsp;&Acirc;&nbsp;&Acirc;&nbsp;<ul>
<li><strong>Protected EAP (PEAP)</strong>: Use um certificado CA (opcional) para estabelecer uma liga&ccedil;&atilde;o protegida. Esta liga&ccedil;&atilde;o protegida ser&aacute; usada pela autentica&ccedil;&atilde;o interna.</li>
<li><strong>Tunneled TLS (TTLS)</strong>: Use um certificado CA (opcional) para estabelecer uma liga&ccedil;&atilde;o protegida. Esta liga&ccedil;&atilde;o protegida ser&aacute; usada pela autentica&ccedil;&atilde;o interna.</li>
<li><strong>TLS</strong>: usar TLS (Transport Layer Security) para autenticar.</li> </ul> </li>
<li>Se escolher <strong>TTLS</strong> ou <strong>PEAP</strong>, seleciona um dos protocolos de autentica&ccedil;&atilde;o internos do menu de contexto.
<ul>
<li><strong>MS CHAP v2</strong>: A informa&ccedil;&atilde;o de autentica&ccedil;&atilde;o ser&aacute; encriptada com Microsoft CHAP v2.</li>
<li><strong>GTC</strong>: A informa&ccedil;&atilde;o de autentiva&ccedil;&atilde;o usar&aacute; GTC (Generic Token Card) para encripta&ccedil;&atilde;o.</li>
</ul></li>
<li>Introduza o seu nome de utilizador e palavra-passe.</li>
<li>Se necess&aacute;rio, clique em <strong>Importar</strong>, depois <strong>Percorrer</strong> para encontrar e importar um certificado exportado do servidor Radius (Por exemplo ca.crt).</li>
<li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para configurar a autentica&ccedil;&atilde;o 802.1X para redes sem fios, aceda ao <strong>Painel de Controlo</strong> &gt; <strong>Sem fios</strong> &gt; <strong>Wi-Fi</strong>.</li>
<li>As defini&ccedil;&otilde;es de autentica&ccedil;&atilde;o t&ecirc;m de ser as mesmas que o Radius Server definido. Para mais informa&ccedil;&otilde;es, contacte o administrador do Radius Server.</li>
</ul>
</div>


<h2>LAN Sem Fios*</h2>
<p>Quando o DiskStation funciona como router sem fios, pode configurar as seguintes defini&ccedil;&otilde;es para LAN Sem fios, em <strong>Painel de controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de rede</strong>.</p>
<h3>Defini&ccedil;&otilde;es de IPv4</h3>

<h4>Endere&ccedil;o IP e m&aacute;scara de sub-rede</h4> 
<p>Pode definir o endere&ccedil;o IP e a m&aacute;scara de sub-rede do seu DiskStation aqui.</p>
<h4>DHCP Server</h4>
<p>Marque a op&ccedil;&atilde;o <strong>Ativar DHCP Server</strong> para permitir que o seu DiskStation atribua endere&ccedil;os IP a dispositivos cliente que estabelecem liga&ccedil;&atilde;o &agrave; rede local fornecida pelo seu DiskStation.</p>
<h4>Retransmiss&atilde;o de PPPoE</h4>
<p>Ative <strong>Retransmiss&atilde;o de PPPoE</strong> para permitir que os dispositivos que est&atilde;o ligados a DiskStation estabele&ccedil;am liga&ccedil;&atilde;o &agrave; Internet atrav&eacute;s da liga&ccedil;&atilde;o PPPoE.</p>

<h4>Configurar como Gateway para a Internet UPnP</h4>
<p>Ative o servi&ccedil;o <strong>UPnP</strong> para permitir que DiskStation se torne num dispositivo UPnP de Gateway para a Internet, de modo a que os dispositivos que est&atilde;o ligados &agrave; rede local do seu DiskStation possam configurar as defini&ccedil;&otilde;es de reencaminhamento de portas com UPnP.</p>

<h3>Defini&ccedil;&otilde;es de IPv6</h3>
<p>Pode obter um endere&ccedil;o e um prefixo de IPv6 na <strong>LAN/Internet</strong> com 6em4, 6para4 ou DHCP-PD. Com estas informa&ccedil;&otilde;es, pode configurar as op&ccedil;&otilde;es de encaminhamento de IPv6 para o seu DiskStation aqui.</p>
<ul>
<li><strong>Endere&ccedil;o de IPv6</strong>: Insira o endere&ccedil;o de IPv6 obtido a partir de <strong>LAN/Internet</strong>.</li>
<li><strong>Comprimento do prefixo</strong>: Insira o comprimento do prefixo do endere&ccedil;o de IPv6 obtido a partir de <strong>LAN/Internet</strong>, normalmente 64.</li>
<li><strong>DNS prim&aacute;rio</strong>: O servidor DNS prim&aacute;rio para os dispositivos ligados ao router. N&atilde;o precisa de ser definido no <strong>Modo sem monitoriza&ccedil;&atilde;o de estado</strong>.</li>
<li><strong>DNS secund&aacute;rio</strong>: O servidor DNS secund&aacute;rio para os dispositivos ligados ao router. N&atilde;o precisa de ser definido no <strong>Modo sem monitoriza&ccedil;&atilde;o de estado</strong>.</li>
</ul>
<p>Existem tr&ecirc;s modos de An&uacute;ncio do router (RA, Router Advertisement) a selecionar de:</p>
<ul>
<li><strong>Modo sem monitoriza&ccedil;&atilde;o de estado</strong>: Permite que os dispositivos ligados ao router configurem automaticamente um endere&ccedil;o IPv6 sem definir o servidor DNS de IPv6.</li>
<li><strong>Modo sem monitoriza&ccedil;&atilde;o de estado de DHCPv6</strong>: Permite que os dispositivos ligados ao router configurem automaticamente um endere&ccedil;o IPv6 e obtenham informa&ccedil;&otilde;es de DNS atrav&eacute;s de DHCPv6.</li>
<li><strong>Modo de monitoriza&ccedil;&atilde;o de estado</strong>: Permite que os dispositivos ligados ao router obtenham um endere&ccedil;o IPv6 e informa&ccedil;&otilde;es de DNS atrav&eacute;s de DHCPv6. Neste modo, tem de ativar o servidor DHCPv6 e definir o <strong>Endereço IP inicial</strong> e o <strong>Endere&ccedil;o IP final</strong> do servidor DHCPv6.</li>
</ul>

<h3>Clientes DHCP</h3>
<p>Aqui, pode ver uma lista de clientes de DHCP e as respetivas configura&ccedil;&otilde;es de rede (como endere&ccedil;o MAC, endere&ccedil;o IP, nome de anfitri&atilde;o e quanto tempo resta at&eacute; expirar a concess&atilde;o DHCP).</p>
<p>Pode filtrar a lista pendente de clientes IPv4/IPv6  para que mostre clientes que est&atilde;o a utilizar IPv4 e IPv6, respetivamente. Escolha um cliente e clique <strong>Adicionar a reserva de endere&ccedil;o</strong> para adicionar o cliente &agrave; lista de reservas de endere&ccedil;o.</p>

<h3>Reserva DHCP</h3>
<p>Se pretende que um cliente receba sempre o mesmo endere&ccedil;o IP durante a renova&ccedil;&atilde;o da concess&atilde;o DHCP, pode adicionar o cliente &agrave; lista de reservas de endere&ccedil;os.</p>
<p>Pode filtrar a lista pendente de reservas de endere&ccedil;os de IPv4/IPv6. Os endere&ccedil;os de IPv4 identificam-se pelo endere&ccedil;o MAC, enquanto os endere&ccedil;os de IPv6 s&atilde;o identificados por DUID.</p>
<h4>Para adicionar um cliente &agrave; lista de reserva de endere&ccedil;os:</h4>
<ul>
<li>Selecione um cliente e clique em <b>Adicionar</b>.</li>
<li>Especifique o endere&ccedil;o MAC ou DUID do cliente, o endere&ccedil;o IPv4/IPv6 que pretende atribuir ao cliente e o nome de anfitri&atilde;o do cliente. </li>
<li>Clique em <b>OK</b> para guardar as defini&ccedil;&otilde;es.</li>
</ul>
<p><b>_____</b> <br> * Dispon&iacute;vel apenas em modelos espec&iacute;ficos ou em conformidade com o seu ambiente.</p>
</body>
</html>
