<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="link_aggr"></a>Link Aggregation*</h2>
<p>DiskStation &eacute; compat&iacute;vel com multi-LAN, permitindo-lhe unificar essas interfaces LAN usando a tecnologia Link Aggregation (Agrega&ccedil;&atilde;o de liga&ccedil;&otilde;es). Link Aggregation aumenta a largura de banda do seu DiskStation agregando m&uacute;ltiplas interfaces de rede e proporciona transfer&ecirc;ncia de tr&aacute;fego para manter a liga&ccedil;&atilde;o de rede caso a liga&ccedil;&atilde;o n&atilde;o esteja a funcionar.</p>
<p>Depois de unificadas as suas interfaces LAN ver&aacute; uma nova interface com o nome <b>Bond</b> no <b>Painel de Controlo</b> &gt; <b>Rede</b> &gt; <b>Interface de rede</b>, que pode ser configurada tal como outras interfaces (como LAN ou PPPoE).</p>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Com Link Aggregation activado, o tr&aacute;fego de rede ser&aacute; automaticamente ajustado e equilibrado para cada dispositivo ligado.</li>
<li>Se as interfaces de rede estiverem ligadas a m&uacute;ltiplos switches, certifique-se que as portas do switch se encontram na mesma LAN ou VLAN.</li>
</ul>
</div>


<h4>Para unificar v&aacute;rias interfaces LAN com o Link Aggregation:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de rede</strong>. Clique em <strong>Criar</strong> &gt; <strong>Criar Bond</strong>.</li>

<img src="about:blank" class="help_image"/>


<li>Seleccione o modo que deseja.

<div class="section">
<h4>Descri&ccedil;&otilde;es do modo:</h4>
<ul>
<li><strong>Adaptive Load Balancing</strong>: Este modo optimiza o tr&aacute;fego de rede recebido e enviado pela sua DiskStation quer o switch suporte ou n&atilde;o Link Aggregation. Para evitar erros inesperados, n&atilde;o active Link Aggregation no switch mesmo quando seja suportado.</li>
<li><strong>Link Aggregation Din&acirc;mica IEEE 802.3ad</strong>: Este modo optimiza o tr&aacute;fego de rede recebido e enviado pela sua DiskStation, e requer que IEEE 802.3ad (Dynamic) Link Aggregation (LACP, 802.1AX) esteja activado no(s) switch(es). Se forem usados m&uacute;ltiplos switches, estes t&ecirc;m de ser empilh&aacute;veis e estar devidamente configurados.</li>
<li><strong>Equil&iacute;brio XOR</strong>: Este modo equilibra o tr&aacute;fego de rede recebido e enviado pela sua DiskStation, e requer que Static Link Aggregation esteja activado no(s) switch(es). Se forem usados m&uacute;ltiplos switches, estes t&ecirc;m de ser empilh&aacute;veis e estar devidamente configurados. Se Link Aggregation n&atilde;o fo suportado pelo switch, o tr&aacute;fego enviado pela sua DiskStation pode ainda ser equilibrado. Com este modo, as liga&ccedil;&otilde;es perdidas podem ser detectadas mas n&atilde;o a causa (por ex., quando os cabos Ethernet s&atilde;o desligados ou o sitch est&aacute; mal configurado).</li>
<li><strong>Activo/Em espera</strong>: Este modo proporciona &agrave; sua DiskStation toler&acirc;ncia de falhas de rede. Ou seja, quando a interface de rede activa avaria, uma das outras portas LAN assume o controlo para manter a liga&ccedil;&atilde;o de rede. Pode escolher este modo sem configurar o switch ou com um switch que suporte IEEE 802.3ad Link Aggregation.</li>
</ul>
</div>
</li>

<img src="about:blank" class="help_image"/>

<li>Seleccione as interfaces para criar o Link Aggregation.</li>

<img src="about:blank" class="help_image"/>

<li>Configure as defini&ccedil;&otilde;es IP. Pode tamb&eacute;m activar VLAN se necess&aacute;rio. Clique em <b>Aplicar</b> para concluir a configura&ccedil;&atilde;o.</li>

<img src="about:blank" class="help_image"/>

<li>Assim que terminar, pode ver a nova interface com o nome <b>Bond 1</b> na lista <b>Interfaces de rede</b>.</li>

<img src="about:blank" class="help_image"/>

</ol>

<h4>Para editar as defini&ccedil;&otilde;es de Link Aggregation:</h4>
<ol>
<li>Para alterar o modo Link Aggregation ou visualizar as informa&ccedil;&otilde;es dos dispositivos f&iacute;sicos, aceda ao <b>Painel de Controlo</b> &gt; <b>Rede</b> &gt; <b>Interface de Rede</b>. </li>
<li>Seleccione a interface <b>Bond 1</b>, e clique no bot&atilde;o <b>Editar</b>.</li>

<img src="about:blank" class="help_image"/>

<li>Aceda aos separadores correspondentes para modificar as defini&ccedil;&otilde;es desejadas.</li>
</ol>

<h4>Para remover o Link Aggregation:</h4>
<ol>
<li>Aceda a <b>Painel de Controlo</b> &gt; <b>Rede</b> &gt; <b>Interface de rede</b>.</li>
<li>Seleccione a interface <b>Bond 1</b>, e clique no bot&atilde;o <b>Eliminar</b>.</li>

<img src="about:blank" class="help_image"/>

<li>Uma vez terminado, ver&aacute; que <b>Bond 1</b> ser&aacute; agora substitu&iacute;do por duas interfaces LAN.</li>

<img src="about:blank" class="help_image"/>

</ol>

<p>____<br> * Apenas dispon&iacute;vel em modelos espec&iacute;ficos.</p>

</body>
</html>

