
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="pppoe"></a>PPPoE</h2>
<p>Se utiliza um modem DSL ou de cabo para ligar &agrave; Internet e o seu Fornecedor de servi&ccedil;os Internet (Internet Service Provider - ISP) utiliza o PPPoE (Point to Point Protocol over Ethernet - Protocolo Ponto a Ponto na Ethernet), pode ativar o PPPoE em <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de Rede</strong> e aceder &agrave; informa&ccedil;&atilde;o da conta para ligar diretamente &agrave; Internet sem o router.</p>
<p>Para obter mais informa&ccedil;&atilde;o sobre o PPPoE, contacte o seu ISP ou administrador da rede.</p>

<h3><a name="ipv6"></a>Configura&ccedil;&atilde;o do IPv6</h3>
<p>Os dispositivos DiskStation suportam o esquema de conjuga&ccedil;&atilde;o dupla IPv4/IPv6. Isto significa que o IPv4 e o IPv6 podem funcionar simultaneamente no seu DiskStation. A defini&ccedil;&atilde;o predefinida para o IPv6 &eacute; <b>Autom&aacute;tico</b>. Selecione uma interface de rede existente, clique no bot&atilde;o <b>Editar</b> e aceda ao separador <b>IPv6</b> para alterar as defini&ccedil;&otilde;es.</p>
<p>Enquanto o IPv6 n&atilde;o substituir completamente o IPv4, os mecanismos de transi&ccedil;&atilde;o de IPv6 s&atilde;o necess&aacute;rios para permitir aos anfitri&otilde;es com endere&ccedil;os IPv4 acederem aos servi&ccedil;os de IPv6. Escolha entre os diferentes mecanismos de transi&ccedil;&atilde;o do IPv6:</p>
<ul>
  <li><b>6em4</b>: Estabele&ccedil;a liga&ccedil;&atilde;o &agrave; rede IPv6 atrav&eacute;s de um mediador de tunnel. Tem de preencher em <b>Endere&ccedil;o de IPv6</b>, <b>Comprimento do prefixo</b>, <b>Prefixo</b> e <b>Endere&ccedil;o de IPv4 de mediador de tunnel</b>. Para isso, &eacute; necess&aacute;rio um endere&ccedil;o p&uacute;blico de IPv4.</li><li><b>6para4</b>: Estabele&ccedil;a liga&ccedil;&atilde;o &agrave; rede IPv6 atrav&eacute;s de um mediador de tunnel, utilizando anycast. Para isso, &eacute; necess&aacute;rio um endere&ccedil;o p&uacute;blico de IPv4.</li>
  <li><b>DHCP-PD</b>: Obtenha um prefixo de IPv6 do DHCP Server atrav&eacute;s de delega&ccedil;&atilde;o de prefixo na LAN. Para isso, &eacute; necess&aacute;rio suporte de ISP e s&oacute; funciona no modo de router.</li>
</ul>
</body>
</html>
