<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>FTP</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Geral</h2>

<p>Em <strong>Painel de Controlo</strong> &gt; <strong>Servi&ccedil;os de Ficheiros</strong> &gt; <strong>FTP</strong>, pode ativar o limite de velocidade, o registo da transfer&ecirc;ncia de ficheiros, as defini&ccedil;&otilde;es de seguran&ccedil;a e outras defini&ccedil;&otilde;es avan&ccedil;adas na sec&ccedil;&atilde;o <strong>Geral</strong>.</p>


<h3>Ativa&ccedil;&atilde;o do Registo da Transfer&ecirc;ncia de Ficheiros FTP</h3>
<p>Clique em <strong>Defini&ccedil;&otilde;es Avan&ccedil;adas</strong> para ativar esta fun&ccedil;&atilde;o e registar os registos dos ficheiros transferidos ou carregados.</p>
<div class="section">
<h4>Nota:</h4>
<p>Ativar o registo da transfer&ecirc;ncia do ficheiro FTP poder&aacute; afetar o desempenho do sistema.</p>
</div>
<h3>Altera&ccedil;&atilde;o dos diret&oacute;rios raiz do utilizador</h3>
<p>Clique em <strong>Defini&ccedil;&otilde;es Avan&ccedil;adas</strong> e selecione <strong>Alterar diret&oacute;rios raiz do utilizador</strong>. Deste modo, os utilizadores selecionados s&oacute; podem aceder &agrave;s pastas especificadas quando iniciarem sess&atilde;o no DSM atrav&eacute;s de FTP. </p>
<h4>Para criar uma regra de altera&ccedil;&atilde;o do diret&oacute;rio raiz:</h4>
<ol>
  <li>Em <strong>Defini&ccedil;&otilde;es Avan&ccedil;adas</strong> assinale <strong>Selecionar Utilizador</strong>.</li>
  <li>Clique em <strong>Adicionar</strong>.</li>
  <li>Em <strong>Utilizador ou grupo</strong>, selecione a quem esta regra ser&aacute; aplicada.</li>
  <li>Selecione qual o diret&oacute;rio raiz que estar&aacute; dispon&iacute;vel quando o utilizador iniciar sess&atilde;o. Escolha entre:
	<ul>
		<li><strong>Home do utilizador:</strong> Os utilizadores acedem ao seu diret&oacute;rio home depois de iniciarem sess&atilde;o.</li>
		<li><strong>Outro diret&oacute;rio:</strong> Escolha uma pasta partilhada como diret&oacute;rio raiz e clique em <strong>Selecionar</strong>. Note que as permiss&otilde;es de pasta para o utilizador ou grupo devem ser verificadas em primeiro lugar. Um utilizador ou grupo com permiss&otilde;es de pasta insuficientes n&atilde;o poder&aacute; iniciar sess&atilde;o.</li>
	</ul>
  </li>
  <li>Clique em <strong>OK</strong>.</li>
  <li>Depois de todas as regras adicionadas, clique em <strong>Aplicar</strong> para guardar as regras.</li>
</ol>
<div class="section">
  <h4>Nota:</h4>
  <ul>
    <li>As regras s&atilde;o priorizadas de acordo com a sua posi&ccedil;&atilde;o na lista.</li>
    <li>Recorra &agrave; fun&ccedil;&atilde;o arrastar e largar para reorganizar as regras na lista.</li>
  </ul>
</div>
<h3>Ativar o FTP An&oacute;nimo</h3>
<p>Clique em <strong>Defini&ccedil;&otilde;es Avan&ccedil;adas</strong> e assinale a op&ccedil;&atilde;o para permitir que qualquer pessoa inicie sess&atilde;o no servi&ccedil;o FTP do dispositivo DiskStation (com a conta <b>an&oacute;nimo</b> ou <b>ftp</b>).</p>

<h3>Alterar root An&oacute;nimo</h3>
<p>Clique em <strong>Defini&ccedil;&otilde;es Avan&ccedil;adas</strong> e assinale a op&ccedil;&atilde;o para alterar o diret&oacute;rio de in&iacute;cio de sess&atilde;o do utilizador do FTP an&oacute;nimo. Selecione uma pasta partilhada no menu pendente.</p>

<h3>Aplicar Permiss&otilde;es UNIX Predefinidas</h3>
<p>Clique em <strong>Defini&ccedil;&otilde;es Avan&ccedil;adas</strong> e assinale a op&ccedil;&atilde;o para aplicar as permiss&otilde;es UNIX predefinidas quando carregar ou criar ficheiros e pastas. As permiss&otilde;es aplicadas s&atilde;o as mesmas permiss&otilde;es aplicadas pelo comando UNIX <strong>umask</strong>. Quando esta op&ccedil;&atilde;o estiver ativada, as permiss&otilde;es UNIX s&atilde;o 644 para ficheiros e 755 para pastas. Quando esta op&ccedil;&atilde;o estiver desativada, as permiss&otilde;es UNIX s&atilde;o 666 para ficheiros e 777 para pastas. O valor umask predefinido &eacute; 022.</p>
<div class="section">
<h4>Nota:</h4>
<ul>
  <li>Para pastas partilhadas com ativa&ccedil;&atilde;o ACL do Windows (todas as partilhas, excluindo &quot;photo&quot; e partilhas em discos externos) execute o comando <strong>chmod</strong> no seu Linux ou cliente FTP para alterar os tipos de permiss&atilde;o de pasta e ficheiro do ACL do Windows para UNIX.</li>
  <li>Ativar esta op&ccedil;&atilde;o pode provocar quest&otilde;es de inconsist&ecirc;ncia de permiss&otilde;es entre diferentes protocolos. Para evitar inconsist&ecirc;ncias, sugerimos que deixe esta op&ccedil;&atilde;o desativada.</li>
</ul>
</div>

<h3>Ativa&ccedil;&atilde;o do Limite de Velocidade</h3>
<p>Ativar um limite de velocidade para controlar a largura de banda m&aacute;xima utiliz&aacute;vel para utilizadores e grupos que transferem dados atrav&eacute;s de FTP.</p>


<h4>Para activar o limite de velocidade:</h4>
<ol>
  <li>Selecione a caixa marcada <b>Ativar limite de velocidade</b> ou <strong>Ativar limite de velocidade de acordo com um agendamento</strong> se pretender implementar um limite de velocidade apenas em horas espec&iacute;ficas. Esta &eacute; uma defini&ccedil;&atilde;o ao n&iacute;vel do servidor e ir&aacute; substituir as defini&ccedil;&otilde;es de grupos e utilizadores individuais. A escolha de <strong>Sem limite de velocidade</strong> desativa as defini&ccedil;&otilde;es do limite de velocidade de todos os utilizadores e grupos.</li>
  <li>Clique em <strong>Defini&ccedil;&otilde;es de Limite de Velocidade</strong> para modificar as defini&ccedil;&otilde;es de grupos ou utilizadores individuais. Para cada utilizador e grupo, pode selecionar uma das seguintes op&ccedil;&otilde;es:
    <ul>
      <li><strong>Aplicar Defini&ccedil;&otilde;es de Grupo:</strong> As defini&ccedil;&otilde;es do limite de velocidade ser&atilde;o iguais &agrave;s defini&ccedil;&otilde;es do grupo ao qual pertence o utilizador. </li>
      <li class="disable-eds14"><strong>Nenhum:</strong> N&atilde;o ser&aacute; aplicado qualquer limite de velocidade quando os membros do grupo transferirem ficheiros com o servi&ccedil;o.</li>
      <li><strong>Constante:</strong> Ser&aacute; aplicado um limite de velocidade fixo e constante ao utilizador ou membros do grupo. Os limites de velocidade de carregamento e transfer&ecirc;ncia podem ser especificados nos campos &agrave; esquerda.</li>
      <li><strong>Personalizado:</strong> &Eacute; poss&iacute;vel especificar e aplicar dois limites de velocidade diferentes aos membros do grupo ou utilizadores de acordo com um agendamento. Clique no bot&atilde;o <strong>Personalizar</strong> para modificar as defini&ccedil;&otilde;es do limite de velocidade e definir um agendamento.</li>
    </ul>
  </li>
  <li>Clique em <b>Aplicar</b>.</li>
</ol>
<div class="section">
  <h4>Nota:</h4>
  <ul>
    <li>Para obter mais detalhes sobre a din&acirc;mica do limite de velocidade de grupos, consulte <a href="file_group_edit.html">aqui</a>.</li>
    <li>Quando definir o limite de velocidade para um utilizador, a sec&ccedil;&atilde;o <strong>Resultado</strong> apresenta o limite de velocidade real do utilizador de acordo com as defini&ccedil;&otilde;es de grupo e individuais. Por exemplo, se um utilizador &quot;Achilles&quot; tiver um limite de transfer&ecirc;ncia individual de 100 KB/s, mas pertencer a um grupo de utilizadores com um limite de transfer&ecirc;ncia de 500 KB/s, a sec&ccedil;&atilde;o <strong>Resultados</strong> apresenta &quot;0/500&quot;.</li>
  </ul>
</div>



</body>
</html>
