<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Pasta partilhada</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Editar Pasta Encriptada</h2>
<p>Ap&oacute;s a pasta ser encriptada, pode utilizar o menu pendente <b>Encripta&ccedil;&atilde;o</b> para editar a pasta.</p>
<h4>Os itens mostrados no menu dependem do estado da pasta partilhada seleccionada:</h4>
<ul>
<li>Se seleccionar uma pasta partilhada n&atilde;o encriptada, o menu pendente <b>Encripta&ccedil;&atilde;o</b> ser&aacute; desactivado.</li>
<li>Se seleccionar uma pasta partilhada encriptada que esteja montada, pode seleccionar <b>Desmontar</b> a partir do menu pendente <b>Encripta&ccedil;&atilde;o</b> para desmontar a pasta, ou <b>Exportar chave</b> para guardar a chave de encripta&ccedil;&atilde;o.</li>
<li>Se seleccionar uma pasta partilhada encriptada que esteja desmontada, pode escolher <b>Montar</b> a partir do menu pendente <b>Encripta&ccedil;&atilde;o</b> e de seguida introduzir ou importar a chave de encripta&ccedil;&atilde;o para montar a pasta para acesso.</li>
</ul>
<ol>
<span class="note_head">Nota:</span>
<li><span  class="note_content">&Eacute; muito importante lembrar-se da chave de encripta&ccedil;&atilde;o.</span> &Eacute; fortemente recomendado que exporte e guarde a chave de encripta&ccedil;&atilde;o. Se n&atilde;o se lembrar ou perder a chave, n&atilde;o existe forma de recuperar os dados encriptados.</li>
<li>Se uma pasta encriptada estiver montada, n&atilde;o pode renomear ou alterar a sua localiza&ccedil;&atilde;o no volume. S&oacute; poder&aacute; realizar altera&ccedil;&otilde;es ap&oacute;s ser desmontada.</li></ol>
</body>
</html>
