<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Pasta Partilhada</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Gerir permiss&otilde;es avan&ccedil;adas de pasta partilhada</h2>

<p>A p&aacute;gina em <strong>Painel de Controlo</strong> &gt; <strong>Pasta Partilhada</strong> &gt; <strong>Editar</strong> &gt; <strong>Avan&ccedil;ado</strong> inclui as op&ccedil;&otilde;es seguintes para permitir definir mais detalhadamente as permiss&otilde;es de acesso de uma pasta partilhada.</p>

<h3>Permiss&otilde;es de Partilha avan&ccedil;adas</h3>
<p>As permiss&otilde;es de partilha avan&ccedil;adas proporcionam um patamar adicional de controlo para gerir as permiss&otilde;es de acesso de pastas partilhadas. Quando activada, os utilizadores podem visualizar ou modificar o conte&uacute;do de uma pasta partilhada apenas se tiverem sido concedidas ao utilizador ou grupo as permiss&otilde;es de partilha avan&ccedil;adas <em>e</em> as permiss&otilde;es Windows ACL (localizadas em <strong>Pasta Partilhada</strong> &gt; <strong>Editar</strong> &gt; <strong>Permiss&otilde;es</strong>).</p>

<h4>Para activar as permiss&otilde;es de partilha avan&ccedil;adas:</h4>

<ol>
<li>Assinale a caixa <strong>Activar permiss&otilde;es de partilha avan&ccedil;adas</strong>.</li>
<li>Clique em <strong>Permiss&otilde;es de Partilha Avan&ccedil;adas</strong> para modificar as permiss&otilde;es de partilha avan&ccedil;adas para a pasta partilhada. </li>
</ol>

<div class="section">
  <h4>Nota:</h4>
<ul>
<li>As permiss&otilde;es de partilha avan&ccedil;adas s&atilde;o aplicadas quando um utilizador acede a uma pasta partilhada atrav&eacute;s dos seguintes servi&ccedil;os: Windows File Sharing, Apple File Sharing, File Station, FTP e WebDAV.</li>
</ul>
</div>

<h3>Defini&ccedil;&otilde;es Avan&ccedil;adas</h3>

<p>Se necess&aacute;rio, pode aplicar mais restri&ccedil;&otilde;es a utilizadores quando acedem a uma pasta partilhada atrav&eacute;s da File Station, FTP ou WebDAV.</p>
	<ul>
    <li><strong>Desactivar pesquisa de direct&oacute;rios:</strong> A activa&ccedil;&atilde;o desta op&ccedil;&atilde;o restringe os utilizadores de visualizarem o conte&uacute;do da pasta partilhada.</li>
    <li><strong>Desactivar modifica&ccedil;&atilde;o de ficheiros existentes:</strong> A activa&ccedil;&atilde;o desta op&ccedil;&atilde;o restringe os utilizadores de moverem, eliminarem ou modificarem os ficheiros na pasta partilhada. Tenha em aten&ccedil;&atilde;o que os utilizadores ainda conseguir&atilde;o visualizar, transferir/carregar, copiar ou descompactar o conte&uacute;do da pasta partilhada.</li>
    <li><strong>Desactivar transfer&ecirc;ncia de ficheiros:</strong> A activa&ccedil;&atilde;o desta op&ccedil;&atilde;o restringe os utilizadores de transferirem o conte&uacute;do da pasta partilhada.</li>
    </ul>

<div class="section">
<h4>Nota:</h4>
<p>As restri&ccedil;&otilde;es anteriores n&atilde;o se aplicam aos utilizadores que pertencem ao grupo <strong>administrators</strong>.</p>
</div>
</body>
</html>
