<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>FTP/FTPS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>FTP/FTPS</h2>

<p>Em <strong>Painel de Controlo</strong> &gt; <strong>Servi&ccedil;os de Ficheiros</strong> &gt; <strong>FTP</strong>, pode ativar os servi&ccedil;os FTP para permitir que os clientes acedam a pastas e dados do sistema. Antes de ativar o FTP, certifique-se de que as seguintes portas TCP do router est&atilde;o a ser reencaminhadas para o dispositivo DiskStation: 21 (liga&ccedil;&atilde;o de controlo predefinida), 20 (liga&ccedil;&atilde;o de dados para o modo ativo) e 55536-55567 (liga&ccedil;&atilde;o de dados para o modo passivo).</p>

<h4>Para ativar o servi&ccedil;o FTP:</h4>
<ol>
<li>Ative um dos seguintes:
	<ul>
		<li><b>Ativar servi&ccedil;o FTP (Sem encripta&ccedil;&atilde;o):</b> Isto &eacute; o protocolo de rede padr&atilde;o utilizado para transferir ficheiros. O FTP n&atilde;o fornece qualquer tipo de encripta&ccedil;&atilde;o para proteger as informa&ccedil;&otilde;es durante sess&otilde;es de transfer&ecirc;ncia, como palavras-passe, nomes de utilizador ou ficheiros. No entanto, as velocidades de transfer&ecirc;ncia s&atilde;o mais r&aacute;pidas e requerem menos recursos de sistema.</li>
		<li><b>Ativar servi&ccedil;o de encripta&ccedil;&atilde;o FTP SSL/TLS (FTPS):</b> Uma s&eacute;rie de protocolos criptogr&aacute;ficos FTP padr&atilde;o com suporte adicional para Transport Layer Security (TLS) e Secure Sockets Layer (SSL), que protege informa&ccedil;&atilde;o durante sess&otilde;es de transfer&ecirc;ncia, como palavras-passe, nomes de utilizador ou ficheiros. No entanto, as velocidades de transfer&ecirc;ncia s&atilde;o menores e consomem mais recursos de sistema devido a encripta&ccedil;&atilde;o.</li>
	</ul>
</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>


<h3>Tempo Limite</h3>
<p>O servidor FTP desliga os utilizadores inativos ap&oacute;s um per&iacute;odo de tempo especificado.</p>


<h3>Defini&ccedil;&atilde;o de N&uacute;mero da Porta do Servi&ccedil;o FTP</h3>
<p>Esta sec&ccedil;&atilde;o permite especificar a porta utilizada do canal de controlo FTP.</p>
<div class="section">
<h4>Nota:</h4>
<p>O n&uacute;mero da porta predefinida para o canal de controlo FTP &eacute; 21. Pode ser definida de 1 a 65535, excluindo os seguintes n&uacute;meros: 20, 22, 23, 25, 80, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002 e portas predefinidas do eMule: 4662 (TCP), 4672 (UDP).</p>
</div>


<h3>Intervalo de Portas de FTP Passivo</h3>
<p>Esta sec&ccedil;&atilde;o permite especificar o intervalo de portas utilizado para liga&ccedil;&otilde;es de FTP Passivo. Pode utilizar o intervalo de portas predefinido ou especificar um intervalo personalizado. O intervalo de portas pode ser definido de 1025 a 65535 e pode conter at&eacute; 128 portas.</li>
</p>


<h3>Comunicar o IP Externo em Modo PASV</h3>
<p>Ao ativar esta op&ccedil;&atilde;o, o servidor ir&aacute; comunicar o respetivo endere&ccedil;o IP externo aos clientes FTP. O endere&ccedil;o IP comunicado ser&aacute; apresentado no registo de liga&ccedil;&atilde;o do cliente FTP. Ap&oacute;s a ativa&ccedil;&atilde;o, pode escolher o endere&ccedil;o IP externo detetado automaticamente ou introduzir manualmente o endere&ccedil;o IP externo de DiskStation.</p>
<p>Esta op&ccedil;&atilde;o apenas funciona quando DiskStation estiver atr&aacute;s de um NAT e os clientes FTP pertencerem a uma sub-rede diferente da que &eacute; utilizada por DiskStation. Na maior parte dos casos, esta op&ccedil;&atilde;o n&atilde;o &eacute; necess&aacute;ria mas se os clientes FTP falharem na liga&ccedil;&atilde;o a DiskStation, pode ativar esta op&ccedil;&atilde;o e tentar novamente.</p>
<h3>Ativar o FXP</h3>
<p>FXP significa File eXchange Protocol. Se ativar esta op&ccedil;&atilde;o, o servi&ccedil;o FTP suporta a fun&ccedil;&atilde;o de transfer&ecirc;ncia de ficheiros servidor a servidor.</p>

<h3>Ativa&ccedil;&atilde;o do M&oacute;dulo Criptogr&aacute;fico FIPS</h3>
<p>O FIPS &eacute; suportado pelo servi&ccedil;o FTPS que utiliza o m&oacute;dulo de criptografia validado por OpenSSL FIPS 140-2 (Certificado #1747). Se ativar esta op&ccedil;&atilde;o, ser&atilde;o utilizados algoritmos adicionais de criptografia segura pelo servi&ccedil;o FTPS para garantir sess&otilde;es mais seguras.</p>


<h3>Suportar o Modo de Transfer&ecirc;ncia ASCII </h3>
<p>Ative esta op&ccedil;&atilde;o para suportar o modo de transfer&ecirc;ncia ASCII, permitindo que DiskStation transfira de modo adequado os ficheiros de texto simples formatados em ASCII atrav&eacute;s de FTP.</p>


<h3>Codifica&ccedil;&atilde;o UTF-8</h3>
<p>Esta op&ccedil;&atilde;o pode ser usada para ajudar clientes FTP a mostrar e gerir correctamente ficheiros com nomes multilingues. Para ir de encontro &agrave;s necessidades dos v&aacute;rios clientes FTP, s&atilde;o disponibilizadas as tr&ecirc;s seguintes op&ccedil;&otilde;es:
<ul>
<li><strong>Desativar</strong>: A codifica&ccedil;&atilde;o UTF-8 n&atilde;o ser&aacute; usada. Esta op&ccedil;&atilde;o est&aacute; direccionada a clientes com o Explorador de Ficheiros do Windows como cliente FTP para carregar/transferir ficheiros com nomes multilingue. N&atilde;o se recomenda para utiliza&ccedil;&atilde;o normal.</li>
<li><strong>Autom&aacute;tico</strong>: Deixar que o DSM determine automaticamente como gerir a codifica&ccedil;&atilde;o UTF-8. Esta op&ccedil;&atilde;o &eacute; recomendada para utiliza&ccedil;&atilde;o normal.</li>
<li><strong>For&ccedil;ar</strong>: For&ccedil;ar a utiliza&ccedil;&atilde;o da codifica&ccedil;&atilde;o UTF-8. Se tiver ativado UTF-8 no seu cliente de FTP e se ainda assim n&atilde;o exibir corretamente os nomes dos ficheiros nem gerir ficheiros com nomes multilingue, selecione esta op&ccedil;&atilde;o.</li>
</ul>

<h3>Restri&ccedil;&atilde;o de Liga&ccedil;&atilde;o</h3>
<p>Esta sec&ccedil;&atilde;o inclui as seguintes op&ccedil;&otilde;es.</p>

<ul>
<li><strong>Limitar liga&ccedil;&otilde;es por IP:</strong> Quando esta fun&ccedil;&atilde;o est&aacute; activada, o servidor limita o n&uacute;mero m&aacute;ximo de liga&ccedil;&otilde;es por IP. Ative esta fun&ccedil;&atilde;o e a <b>restri&ccedil;&atilde;o de largura de banda de FTP</b>, para uma gest&atilde;o mais eficaz da largura de banda.</li>
<li><strong>Ativar restri&ccedil;&atilde;o de largura de banda de FTP:</strong> Active esta op&ccedil;&atilde;o para restringir a largura de banda da liga&ccedil;&atilde;o &uacute;nica de FTP.</li>
</ul>

<div class="section">

<h4>Nota:</h4>
<ul>
<li>A conta &quot;guest&quot; n&atilde;o pode iniciar sess&atilde;o no servidor atrav&eacute;s do FTP.</li>
<li>A configura&ccedil;&atilde;o da p&aacute;gina de c&oacute;digo no computador do cliente de FTP deve ser a mesma do DiskStation, para poder aceder correctamente aos dados.</li>
<li>Em alguns modelos espec&iacute;ficos, o servi&ccedil;o FTP suporta a liga&ccedil;&atilde;o com SSL ou TLS.</li>
<li>As defini&ccedil;&otilde;es de firewall do seu cliente FTP e dos dois servidores FTP devem ser configuradas corretamente ou a fun&ccedil;&atilde;o FXP poder&aacute; n&atilde;o funcionar adequadamente.</li>
<li>Alguns clientes FTP, tais como os que utilizam o Internet Explorer 8/9, t&ecirc;m de iniciar sess&atilde;o com o nome de utilizador e a palavra-passe. Por exemplo: <i>ftp://nomedeutilizador:palavra-passe@oseu.ftp.com</i>.</li>
</ul>
</div>




</body>
</html>
