<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Atribuir permiss&otilde;es de pasta partilhada - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="You can specify which users or groups can access, view, or modify a shared folder and its contents. This article shows you how to assign and customize shared folder permissions in DSM.">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>




<h2>Atribuir permiss&otilde;es de pasta partilhada</h2>

<p>Pode especificar quais os utilizadores ou grupos podem aceder, visualizar ou modificar uma pasta partilhada e o respetivo conte&uacute;do. As permiss&otilde;es de acesso a pastas partilhadas, tal como para ficheiros individuais e subpastas, podem ser personalizadas para cada utilizador ou grupo.</p>

<div class="section disable-eds14">
<h4>Windows ACL:</h4>

<p>No DSM 5.0 ou vers&otilde;es posteriores, as permiss&otilde;es de acesso a pastas partilhadas s&atilde;o baseadas no Windows ACL por predefini&ccedil;&atilde;o. As pastas partilhadas recentemente criadas implementam as defini&ccedil;&otilde;es de permiss&otilde;es do Windows ACL, que tamb&eacute;m permite a personaliza&ccedil;&atilde;o de permiss&otilde;es de ficheiros individuais e subpastas. Al&eacute;m disso, as permiss&otilde;es podem ser personalizadas atrav&eacute;s da File Station ou Explorador de Ficheiros no Windows.</p>
<p>As seguintes pastas partilhadas n&atilde;o podem utilizar o sistema de gest&atilde;o de permiss&otilde;es do Windows ACL: <strong>photo</strong>, <strong>satashare</strong>, <strong>sdshare</strong>, <strong>surveillance</strong>, <strong>usbshare</strong>.</p>
</div>
<div class="section disable-eds14">
<h4>Nota:</h4>  
<p>As pastas pessoais <strong>home</strong> dos utilizadores encontram-se na pasta <strong>homes</strong>. Dado que o ACL funciona numa base de heran&ccedil;a de permiss&atilde;o, se definir a permiss&atilde;o NA para um utilizador/grupo em <strong>homes</strong>, os utilizadores n&atilde;o ter&atilde;o acesso &agrave; respetiva pasta pessoal <strong>home</strong>. </p>
</div>
<h4>Para editar permiss&otilde;es de uma pasta partilhada:</h4>

<ol>

<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Pasta Partilhada</strong>.</li>
<img src="about:blank" class="help_image"/>
<li>Selecione a pasta partilhada cujas permiss&otilde;es deseja editar. Clique em <b>Editar</b>.</li>
<img src="about:blank" class="help_image"/>
<li> Aceda ao separador <strong>Permiss&otilde;es</strong>.</li>
<img src="about:blank" class="help_image"/>
<li>Selecione uma das seguintes op&ccedil;&otilde;es no menu pendente:

<ul>
<li><b>Utilizador interno do sistema:</b> Atribui permiss&otilde;es aos utilizadores do sistema predefinidos, tais como, o utilizador Anonymous FTP/WebDAV. Antes de permitir o acesso de utilizadores an&oacute;nimos de FTP a uma pasta partilhada, &eacute; necess&aacute;rio atribuir permiss&otilde;es de acesso a este utilizador.</li>
<li><b>Utilizadores locais:</b> Atribui permiss&otilde;es para utilizadores locais (incluindo <b>guest</b>).</li>
<li><b>Grupos locais:</b> Atribui permiss&otilde;es para grupos locais.</li>
</ul>
</li>
<img src="about:blank" class="help_image"/>
<li>Marque ou desmarque as caixas adequadas de cada utilizador ou grupo para personalizar as respetivas permiss&otilde;es de acesso &agrave; pasta partilhada:

  <ul>
<li><b>Leitura/Escrita</b>: O utilizador ou grupo pode aceder e efetuar altera&ccedil;&otilde;es nos ficheiros e subpastas na pasta partilhada.</li>
<li><b>S&oacute; de leitura</b>: O utilizador ou grupo pode aceder aos ficheiros e subpastas na pasta partilhada.</li>
<li><b>Sem acesso</b>: O utilizador ou grupo n&atilde;o pode aceder aos ficheiros ou subpastas na pasta partilhada.</li>
</ul>
</li>
<img src="about:blank" class="help_image"/>
<li>Clique em <b>OK</b> para terminar.</li>
</ol>

<div class="section">
<h4>Nota:</h4>

<ul>
<li>Quando ocorrerem conflitos de permiss&otilde;es, a prioridade das permiss&otilde;es &eacute; a seguinte: Sem acesso &gt; Leitura/Escrita &gt; S&oacute; de leitura.</li>
<li>Quando criar uma nova pasta partilhada, se as permiss&otilde;es de acesso para os utilizadores pertencentes ao grupo <strong>administrators</strong> estiverem definidas para <b>Sem acesso</b>, estes utilizadores apenas podem visualizar a pasta partilhada em <strong>Painel de Controlo</strong> &gt; <strong>Pasta Partilhada</strong>.</li>
</ul>
</div>

<h3 class="disable-eds14">Personaliza&ccedil;&atilde;o das permiss&otilde;es do Windows ACL</h3>

<p class="disable-eds14">Como complemento das defini&ccedil;&otilde;es anteriormente descritas, pode personalizar mais permiss&otilde;es seguindo os passos seguintes. </p>

<div class="section disable-eds14">
<h4>Nota:</h4>
<p>As defini&ccedil;&otilde;es que se seguem n&atilde;o podem ser utilizadas com as seguintes pastas partilhadas: <strong>photo</strong>, <strong>satashare</strong>, <strong>sdshare</strong>, <strong>surveillance</strong>, <strong>usbshare</strong>.</p>
</div>

<h4 class="disable-eds14">Para personalizar permiss&otilde;es:</h4>
<ol class="disable-eds14">
  <li>No separador <strong>Permiss&otilde;es</strong>, selecione o utilizador cujas permiss&otilde;es pretende personalizar. Clique em qualquer ponto da coluna <strong>Personalizar</strong>.</li>
  <img src="about:blank" class="help_image"/>
  <li>Proceda de qualquer uma das formas seguintes na janela <b>Editor de Permiss&otilde;es</b> para gerir as permiss&otilde;es ACL para o ficheiro ou pasta:
      <ol>
        <li><b>Utilizador ou grupo:</b> Especifique o utilizador ou grupo cujas permiss&otilde;es deseja personalizar.</li>
        <img src="about:blank" class="help_image"/>
        <li><b>Herdado de:</b> Apenas para visualiza&ccedil;&atilde;o. Veja aqui as informa&ccedil;&otilde;es para verificar se a permiss&atilde;o &eacute; herdada (de uma pasta superior) ou expl&iacute;cita (mostrada como <b>Nenhuma</b>). </li>
        <img src="about:blank" class="help_image"/>
        <li><b>Tipo:</b> Escolha <b>Permitir</b> ou <b>Negar</b> para conceder ou negar a permiss&atilde;o para o utilizador ou grupo.</li>
        <img src="about:blank" class="help_image"/>
        <li><b>Aplicar a:</b> Se estiver a criar uma entrada de permiss&atilde;o para uma pasta, assinale as caixas de verifica&ccedil;&atilde;o a aplicar a entrada nesta pasta, nas pastas (ou <b>Pastas Inferiores</b>) ou ficheiros (ou <b>Ficheiros Inferiores</b>) nesta pasta, ou todos os ficheiros e pastas contidos nesta pasta (ou <b>Todos os descendentes</b>). </li>
        <img src="about:blank" class="help_image"/>
        <li><b>Administra&ccedil;&atilde;o:</b> Assinale <b>Ler permiss&otilde;es</b>, <b>Alterar permiss&otilde;es</b> ou <b>Assumir propriedade</b> para especificar o privil&eacute;gio de acesso do utilziador ou grupo relativo &agrave; entrada de permiss&atilde;o. </li>
        <li><b>Leitura</b> ou <b>Escrita</b>: Assinale as caixas de verifica&ccedil;&atilde;o nestas sec&ccedil;&otilde;es para modificar as defini&ccedil;&otilde;es de permiss&atilde;o do utilizador ou grupo para o ficheiro ou pasta. </li>
      </ol>    
  <li> Clique em <b>OK</b>.</li>
</ol>
<div class="section disable-eds14">
  <h4>As permiss&otilde;es ACL podem ser categorizadas da seguinte forma:</h4>
  <ul>
    <li><b>Administra&ccedil;&atilde;o:</b>
    <ul>
      <li><b>Alterar permiss&otilde;es</b>: Controla se um utilizador pode alterar as permiss&otilde;es do ficheiro ou pasta.</li>
      <li><b>Assumir propriedade</b>: Controla se um utilizador pode ser propriet&aacute;rio do ficheiro ou pasta.</li>
    </ul></li>
    <li><b>Ler:</b>
    <ul>
      <li><b>Atravessar pastas/Executar ficheiros</b>: Controla se um utilizador pode executar um ficheiro de programa.</li>
      <li><b>Listar pastas/Ler dados</b>: Controla se um utilizador pode ler dados num ficheiro.</li>
      <li><b>Ler atributos</b>: Controla se um utilizador pode visualizar os atributos de um ficheiro.</li>
      <li><b>Ler atributos expandidos</b>: Controla se um utilizador pode visualizar os atributos expandidos de um ficheiro.</li>
      <li><b>Ler permiss&otilde;es</b>: Controla se um utilizador pode ler as permiss&otilde;es do ficheiro ou pasta.</li>
    </ul></li>
    <li><b>Escrever:</b>
    <ul>
      <li><b>Criar ficheiros/Escrever dados</b>: Controla se um utilizador pode alterar o conte&uacute;do de um ficheiro.</li>
      <li><b>Criar pastas/Anexar dados</b>: Controla se um utilizador pode adicionar dados ao final de um ficheiro.</li>
      <li><b>Escrever atributos</b>: Controla se um utilizador pode alterar os atributos de um ficheiro.</li>
      <li><b>Escrever atributos expandidos</b>:  Controla se um utilizador pode alterar os atributos expandidos de um ficheiro.</li>
      <li><b>Eliminar subpastas e ficheiros</b>: Controla se um utilizador pode eliminar uma pasta.</li>
      <li><b>Eliminar</b>: Controla se um utilizador pode eliminar um ficheiro.</li>
    </ul></li>
  </ul>
  <h4>Acerca da heran&ccedil;a de permiss&otilde;es:</h4>
  <p> As permiss&otilde;es ACL s&atilde;o herdadas de objetos superiores para objetos inferiores. Por exemplo, se uma entrada ACL da pasta &quot;sales&quot; atribuir permiss&otilde;es de &quot;Leitura&quot; &agrave; utilizadora &quot;Amy&quot;, a entrada ACL ser&aacute; aplicada a todos os ficheiros dentro da pasta &quot;sales&quot; (como &quot;annual report.xls&quot;), permitindo &agrave; utilizadora abrir os ficheiros. Permiss&otilde;es herdadas ser&atilde;o apresentadas a cinzento, enquanto que as permiss&otilde;es do pr&oacute;prio objeto (ou permiss&otilde;es &quot;expl&iacute;citas&quot;) ser&atilde;o apresentadas a preto. </p>
</div>
<div class="section disable-eds14">
  <h4>Nota:</h4>
  <ul>
    <li>Apenas pode adicionar at&eacute; 200 entradas ACL expl&iacute;citas para um ficheiro ou pasta.</li>
    <li>O Windows ACL apenas &eacute; suportado no sistema de ficheiros ext4<span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64">/Btrfs</span>. Para utilizadores anteriores da DSM 2.3, ir&aacute; necessitar de criar pelo menos um volume ext4<span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64">/Btrfs</span> para utilizar as permiss&otilde;es do Windows ACL. Isto significa que tem de formatar pelo menos uma unidade e recriar um volume. Formatar o DiskStation ir&aacute; resultar em eliminar todos os dados e defini&ccedil;&otilde;es guardados. Certifique-se de que efetua uma c&oacute;pia de seguran&ccedil;a de todos os seus dados antes de processar.</li>
    <li>Para definir novas permiss&otilde;es para utilizadores de dom&iacute;nio, certifique-se de que os clientes do Windows e da DSM est&atilde;o no mesmo dom&iacute;nio.</li>
    <li>Quando modificar permiss&otilde;es com o Explorador de Ficheiros do Windows, as regras <strong>Negar</strong> aplicadas ao grupo <strong>Admins do Dom&iacute;nio</strong> ser&atilde;o ignoradas.</li>
  </ul>
</div>


</body>
</html>
