<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;os Web</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="webdav"></a>WebDAV</h2>
<p>WebDAV &eacute; uma extens&atilde;o de HTTP concebida para que utilizadores editem e efetuem a gest&atilde;o dos ficheiros armazenados em servidores remotos. Quando o servi&ccedil;o WebDAV &eacute; ativado, os programas cliente que suportam WebDAV, tais como determinadas aplica&ccedil;&otilde;es do Windows, Mac OS Finder, Linux File Browser, poder&atilde;o aceder remotamente ao DiskStation tal como acedem a uma unidade de rede local.</p>

<h4>Para ativar a WebDAV:</h4>
<ol>
<li>Marque a caixa marcada <strong>Ativar WebDAV</strong> ou <strong>Ativar liga&ccedil;&atilde;o WebDAV HTTPS</strong> se pretender ativar liga&ccedil;&otilde;es WebDAV atrav&eacute;s de HTTPS. A porta predefinida para WebDAV &eacute; 5005 e WebDAV HTTPS &eacute; 5006.</li>
<li>Clique em <strong>Aplicar</strong></li>
</ol>

<h3>Limite de Velocidade</h3>
<p>A ativa&ccedil;&atilde;o do limite de velocidade permite-lhe controlar a largura de banda m&aacute;xima utiliz&aacute;vel para utilizadores ou grupos espec&iacute;ficos quando transfere ficheiros atrav&eacute;s de WebDAV.</p>

<h4>Para activar o limite de velocidade:</h4>
<ol>
  <li>Selecione a caixa marcada <b>Ativar limite de velocidade</b> ou <strong>Ativar limite de velocidade de acordo com um agendamento</strong> se pretender implementar um limite de velocidade apenas em horas espec&iacute;ficas. Esta &eacute; uma defini&ccedil;&atilde;o ao n&iacute;vel do servidor e ir&aacute; substituir as defini&ccedil;&otilde;es de grupos e utilizadores individuais. A escolha de <strong>Sem limite de velocidade</strong> desativa as defini&ccedil;&otilde;es do limite de velocidade de todos os utilizadores e grupos.</li>
  <li>Clique em <strong>Defini&ccedil;&otilde;es de Limite de Velocidade</strong> para modificar as defini&ccedil;&otilde;es de grupos ou utilizadores individuais. Para cada utilizador e grupo, pode selecionar uma das seguintes op&ccedil;&otilde;es:
    <ul>
      <li><strong>Aplicar Defini&ccedil;&otilde;es de Grupo:</strong> As defini&ccedil;&otilde;es do limite de velocidade ser&atilde;o iguais &agrave;s defini&ccedil;&otilde;es do grupo ao qual pertence o utilizador. </li>
      <li><strong>Nenhum:</strong> N&atilde;o ser&aacute; aplicado qualquer limite de velocidade quando os membros do grupo transferirem ficheiros com o servi&ccedil;o.</li>
      <li><strong>Constante:</strong> Ser&aacute; aplicado um limite de velocidade fixo e constante ao utilizador ou membros do grupo. Os limites de velocidade de carregamento e transfer&ecirc;ncia podem ser especificados nos campos &agrave; esquerda.</li>
      <li><strong>Vari&aacute;vel:</strong> &Eacute; poss&iacute;vel especificar e aplicar dois limites de velocidade diferentes aos membros do grupo ou utilizadores de acordo com um agendamento. Clique no bot&atilde;o <strong>Personalizar</strong> para modificar as defini&ccedil;&otilde;es do limite de velocidade e definir um agendamento.</li>
    </ul>
  </li>
  <li>Clique em <b>Aplicar</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para obter mais detalhes sobre a din&acirc;mica do limite de velocidade de grupos, consulte <a href="file_group_edit.html">aqui</a>.</li>
<li>Quando definir o limite de velocidade para um utilizador, a sec&ccedil;&atilde;o <strong>Resultado</strong> apresenta o limite de velocidade real do utilizador de acordo com as defini&ccedil;&otilde;es de grupo e individuais. Por exemplo, se um utilizador &quot;Achilles&quot; tiver um limite de transfer&ecirc;ncia individual de 100 KB/s, mas pertencer a um grupo de utilizadores com um limite de transfer&ecirc;ncia de 500 KB/s, a sec&ccedil;&atilde;o <strong>Resultados</strong> apresenta &quot;0/500&quot;.</li>
</ul>
</div>

<h3>Defini&ccedil;&otilde;es avan&ccedil;adas</h3>
<p>Clicar nos bot&otilde;es <strong>Defini&ccedil;&otilde;es Avan&ccedil;adas</strong> permite-lhe modificar as seguintes op&ccedil;&otilde;es:</p>
<ul>
<li><strong>Ativar Anonymous WebDAV:</strong> Permite aos clientes acederem a pastas partilhadas utilizando o nome de utilizador &quot;anonymous&quot; quando estabelecem liga&ccedil;&atilde;o atrav&eacute;s de WebDAV. Certifique-se de que foram atribu&iacute;dos ao utilizador &ldquo;FTP/WebDAV an&oacute;nimo&rdquo; os privil&eacute;gios de acesso adequados na p&aacute;gina <strong>Pasta Partilhada</strong>.</li>
<li><strong>Ativar DavDepthInfinity:</strong> Ao utilizar uma ferramenta de cliente, tal permite aos utilizadores acederem ou eliminarem os ficheiros sem restri&ccedil;&otilde;es de comprimento de caminho dos ficheiros. </li>
<li><strong>Ativar registo WebDAV:</strong> Esta op&ccedil;&atilde;o regista eventos relacionados com WebDAV. Clique em <strong>Visualizar Registos</strong> e ver&aacute; os registos na janela de pop-up.</li>
</ul>

<h2><a name="use"></a>Utilizar WebDAV com diferentes sistemas operativos</h2>
<p>Ap&oacute;s a activa&ccedil;&atilde;o de WebDAV no seu DiskStation, siga as instru&ccedil;&otilde;es abaixo para come&ccedil;ar a aceder a ficheiros com o Windows, Mac, dispositivos Linux ou determinadas aplica&ccedil;&otilde;es smartphone Synology.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Quando liga a servi&ccedil;os WebDAV, sugerimos que utilize um cliente WebDAV com suporte UTF-8 para evitar erros de codifica&ccedil;&atilde;o. </li>
</ul>
</div>

<h3>Para Windows</h3>

<p>Para utilizadores Windows que pretendam utilizar o protocolo WebDAV para aceder a ficheiros em produtos Synology, sugerimos que utilizem o BitKinex, uma aplica&ccedil;&atilde;o de mapeamento de unidades, de utiliza&ccedil;&atilde;o gratuita para fins n&atilde;o comerciais. Como alternativa, h&aacute; muitas outras aplica&ccedil;&otilde;es cliente WebDAV dispon&iacute;veis na Internet.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se pretender utilizar <strong>Mapear Unidade de Rede</strong> do Windows para aceder a ficheiros no seu DiskStation atrav&eacute;s de WebDAV, obtenha um certificado SSL v&aacute;lido e aceda ao seu DiskStation atrav&eacute;s de uma liga&ccedil;&atilde;o HTTPS. Quando utilizar o servi&ccedil;o WebDAV no ambiente Windows, se pretender alterar para outra conta de utilizador, necessita primeiro de terminar sess&atilde;o no sistema Windows.</li>
</ul>
</div>

<h3>Para Mac</h3>

<p>Para utilizadores Mac, pode ligar a DiskStation atrav&eacute;s de WebDAV utilizando o Finder.</p>

<h4>Para utilizar a WebDAV em Mac:</h4>
<ol>
<li>No computador Mac, v&aacute; para <b>Finder</b> &gt; <b>Ligar ao Servidor</b>.</li>
<li>No campo <strong>Endere&ccedil;o do Servidor</strong>, introduza o endere&ccedil;o IP de DiskStation ou nome de dom&iacute;nio precedido de &quot;http://&quot; e seguido de &quot;:5005&quot; (ou o n&uacute;mero de porta especificado quando ativou o servi&ccedil;o WebDAV). Por exemplo: <strong>http://pm.synology.com:5005/</strong>.</li>
<li>Introduza o seu nome de utilizador e palavra-passe DSM.</li>
<li>Clique em <b>Ligar</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>A WebDAV suporta a emiss&atilde;o Bonjour.</li>
</ul>
</div>

<h3>Para Linux</h3>

<p>Para utilizadores Ubuntu ou outros utilizadores Linux, siga as instru&ccedil;&otilde;es abaixo para aceder a ficheiros no seu DiskStation atrav&eacute;s de WebDAV.</p>

<h4>Para utilizar a WebDAV em Ubuntu:</h4>
<ol>
<li>Clique em <b>Locais</b> &gt; <b>Ligar ao servidor</b>.</li>
<li>Selecione <b>WebDAV (HTTP)</b> ou <b>WebDAV (HTTPS)</b> a partir do menu pendente.</li>
<li>Introduza as informa&ccedil;&otilde;es necess&aacute;rias, incluindo a localiza&ccedil;&atilde;o do servidor, porta, pasta e conta do utilizador. Clique em <b>Ligar</b> para continuar.</li>
<li>Introduza a palavra-passe e clique em <b>Ligar</b>.</li>
</ol>
<h4>Para utilizar a WebDAV atrav&eacute;s de uma linha de comandos em Linux:</h4>
<p>Se pretender utilizar a linha de comandos, pode utilizar o <b>cadaver</b>, um software cliente WebDAV de linha de comandos para configurar o acesso.</p>






<h2>Subscrever Calend&aacute;rios com Clientes CalDAV</h2>
<p>
Pode utilizar clientes CalDAV no seu computador ou dispositivo m&oacute;vel para subscrever calend&aacute;rios armazenados em DiskStation e, em seguida, gerir os eventos do calend&aacute;rio, notas ou tarefas a fazer. Os exemplos de clientes de calend&aacute;rio incluem <a href="http://www.mozilla.org/projects/calendar/sunbird/" target="_blank">Sunbird</a> (Windows, Mac, Linux), <a href="http://blog.chandlerproject.org/" target="_blank">Chandler</a> (Windows, Mac, Linux), Evolution (Linux) ou iCal (Mac, dispositivo iOS).</p>

<h4>Para ativar o CalDAV:</h4>
<ol>
<li>Ative primeiro a liga&ccedil;&atilde;o WebDAV ou WebDAV HTTPS.</li>
<li>
  Assinale <b>Ativar CalDAV</b>.
</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>

<h4>Para gerir a lista de calend&aacute;rios:</h4>
<ol>
<li>
Clique em <b>Visualizar lista de calend&aacute;rios</b>.
</li>
<li>Na janela que &eacute; apresentada, proceda de uma das seguintes formas:
	<ul>
		<li>Se pretender criar um novo calend&aacute;rio, clique em <b>Adicionar</b>, atribua um nome ao novo calend&aacute;rio (por exemplo, &quot;cal1&quot;) e especifique o destino para guardar o calend&aacute;rio (por exemplo, a pasta partilhada &quot;calendar&quot;) e, em seguida, clique em <b>OK</b>.</li>
		<li>Se pretender alterar o nome do calend&aacute;rio e o destino, selecione o calend&aacute;rio na lista de calend&aacute;rios, clique em <b>Editar</b> para efetuar as altera&ccedil;&otilde;es e, em seguida, clique em <b>OK</b>.</li>
		<li>Se pretender eliminar o calend&aacute;rio de DiskStation, selecione-o a partir da lista de calend&aacute;rios e, em seguida, clique em <b>Eliminar</b>.</li>
	</ul>
</li>
<li>Clique em <b>Fechar</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Os calend&aacute;rios armazenados em DiskStation ser&atilde;o apresentados como uma pasta em DiskStation.</li>
</ul>
</div>

<h4>Para subscrever o seu calend&aacute;rio com uma aplica&ccedil;&atilde;o cliente (utilizando o Sunbird por exemplo):</h4>
<ol>
<li>
<a href="http://www.mozilla.org/projects/calendar/sunbird/" target="_blank">Transfira</a> e instale o Sunbird no computador.
</li>
<li>
Aceda a <b>Ficheiro</b> &gt; <b>Subscrever o Calend&aacute;rio Remoto</b>.
</li>
<li>
Na janela exibida, escolha <b>Na rede</b> e clique em <b>Seguinte</b>.
</li>
<li>
Escolha <b>CalDAV</b>, introduza <b>http://DiskStation_DDNS_Hostname:WebDAV_Port_Number/Calendar_Location/Calendar_Name</b> no campo <b>Localiza&ccedil;&atilde;o</b> (por exemplo, &quot;http://demo.no-ip.info:5005/calendar/cal1&quot;) e, em seguida, clique em <b>Seguinte</b>.
</li>
<li>
Atribua um nome ao seu calend&aacute;rio e clique em <b>Seguinte</b>.
</li>
<li>
Introduza o seu nome de utilizador e a palavra-passe do DSM para autentica&ccedil;&atilde;o, clique em <b>OK</b> e de seguida clique em <b>Conclu&iacute;do</b>.
</li>
</ol>
<h4>Para subscrever o calend&aacute;rio com o dispositivo m&oacute;vel (utilizando, por exemplo, um dispositivo iOS):</h4>
<ol>
<li>
No dispositivo iOS, aceda a <b>Defini&ccedil;&otilde;es</b> &gt; <b>Correio, Contactos, Calend&aacute;rios</b>.
</li>
<li>
Em <b>Contas</b>, aceda a <b>Adicionar conta</b> &gt; <b>Outra</b> e, em seguida, clique em <b>Adicionar conta CalDAV</b>.
</li>
<li>
Nos campos, introduza o endere&ccedil;o IP de DiskStation (ou nome de dom&iacute;nio) e as credenciais de utilizador e, em seguida, toque em <b>Seguinte</b>. Se aparecer uma mensagem, clique em <b>Continuar</b>.
</li>
<li>
Toque em <b>Defini&ccedil;&otilde;es avan&ccedil;adas</b> e proceda da seguinte forma:
	<ol>
		<li>Introduza <b>5005</b> (ou qualquer outro n&uacute;mero de porta que tiver especificado ao ativar a WebDAV) no campo <b>Porta</b>.</li>
		<li>Modifique o URL no campo <b>URL da Conta</b> para <b>http://DiskStation_DDNS_Hostname:WebDAV_Port_Number/Calendar_Location/Calendar_Name</b> (por exemplo, &quot;http://demo.no-ip.info:5005/calendar/cal1&quot;).</li>
		<li>Toque em <b>CalDAV</b>.</li>
	</ol>
</li>
<li>
Toque em <b>Seguinte</b> para verificar as informa&ccedil;&otilde;es sobre a conta e toque em <b>Guardar</b> para concluir a configura&ccedil;&atilde;o da conta.
</li>
<li>
Volte ao ecr&atilde; Home do seu dispositivo iOS e abra o <b>Calend&aacute;rio</b> para gerir o seu calend&aacute;rio.
</li>
</ol>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para obter mais informa&ccedil;&otilde;es sobre como gerir os eventos do calend&aacute;rio, notas ou tarefas a fazer, consulte os documentos de ajuda para cada uma das aplica&ccedil;&otilde;es cliente.</li>
</ul>
</div>

 

</body>
</html>
