<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Win/Mac/NFS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>




<h2>Servi&ccedil;o NFS</h2>
<p>O servi&ccedil;o NFS permite que os clientes Linux acedam aos dados neste dispositivo DiskStation.</p>
<h4>Para ativar o servi&ccedil;o NFS:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Servi&ccedil;os de Ficheiros</strong> &gt; <strong>Win/Mac/NFS</strong> e marque <b>Ativar NFS</b>.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>


<div class="section">
  <h4>Nota:</h4>
<ul>
<li> O DiskStation suporta atualmente NFSv2, NFSv3 e NFSv4.</li>
<li>Durante a montagem, os par&acirc;metros <strong>-o vers=2</strong>, <strong>-o vers=3</strong> ou <strong>-o vers=4</strong> podem ser adicionados aos comandos de montagem para especificar qual a vers&atilde;o NFS que deve ser utilizada.</li>
</ul>
</div>


<h4>Para configurar os privil&eacute;gios de acesso de clientes Linux a pastas partilhadas:</h4>
<p>Aceda a <b>Painel de Controlo</b> &gt; <b>Pasta Partilhada</b>. Selecione uma pasta partilhada e clique em <strong>Editar</strong> para gerir as regras de NFS e regular o direito de acesso a esta pasta partilhada para clientes Linux.</p>


<h3>Defini&ccedil;&atilde;o do Suporte NFSv4</h3>
<p>&Eacute; poss&iacute;vel determinar se o servidor NFS suporta NFSv4. Quando esta op&ccedil;&atilde;o est&aacute; ativada, o servidor NFS suporta NFSv2, NFSv3 e NFSv4; caso contr&aacute;rio, apenas o NFSv2 e NFSv3 ser&atilde;o suportados.</p>

<h4>Para ativar o suporte NFSv4:</h4>
<ol>
<li>Marque <b>Ativar o suporte NFSv4</b>.
</li>
<li>
No campo <b>Dom&iacute;nio NFSv4</b>, introduza o nome do dom&iacute;nio NFSv4 que pretende utilizar. Este campo &eacute; opcional e pode ser deixado em branco.</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<p>Quando utiliza o NFSv4 para montar a pasta partilhada, tenha em aten&ccedil;&atilde;o o seguinte. Caso contr&aacute;rio, ocorrer&aacute; uma falha nas opera&ccedil;&otilde;es de ficheiros associadas ao nome de utilizador.</p>
<ul>
<li>O cliente NFS tem de ativar o idmapd.</li>
<li>As defini&ccedil;&otilde;es de dom&iacute;nio do NFSv4 no ficheiro idmapd.conf no cliente NFS t&ecirc;m de ser consistentes com o campo <b>Dom&iacute;nio NFSv4</b> no DiskStation.</li>
</ul>

</div>

<h3>Definições avançadas</h3>

<h4>Aplicar Permiss&otilde;es UNIX Predefinidas</h4>
<p> Quando <strong>Aplicar permiss&otilde;es de UNIX predefinidas</strong> est&aacute; marcado, as permiss&otilde;es UNIX predefinidas definidas no cliente Linux s&atilde;o aplicadas em vez das permiss&otilde;es ACL do Windows quando carrega ou cria ficheiros e pastas. As permiss&otilde;es aplicadas s&atilde;o as mesmas permiss&otilde;es aplicadas pelo comando UNIX <strong>umask</strong>. Quando esta op&ccedil;&atilde;o estiver ativada, as permiss&otilde;es UNIX s&atilde;o 644 para ficheiros e 755 para pastas. Quando esta op&ccedil;&atilde;o estiver desativada, as permiss&otilde;es UNIX s&atilde;o 666 para ficheiros e 777 para pastas. O valor umask predefinido &eacute; 022.</p><div class="section">
<h4>Nota :</h4>
<ul>
  <li>Para pastas partilhadas com ativa&ccedil;&atilde;o ACL do Windows (todas as partilhas, excluindo fotografia e partilhas em discos externos) execute o comando <strong>chmod</strong> no seu Linux ou cliente FTP para alterar os tipos de permiss&atilde;o de pasta e ficheiro do ACL do Windows para UNIX.</li>
  <li>Ativar esta op&ccedil;&atilde;o pode provocar quest&otilde;es de inconsist&ecirc;ncia de permiss&otilde;es entre diferentes protocolos. Para evitar inconsist&ecirc;ncias, sugerimos que deixe esta op&ccedil;&atilde;o desativada.</li>
</ul>
</div>

<h4>Personalizar porta</h4>
<p>Pode personalizar n&uacute;meros da porta para servi&ccedil;os statd e nlockmgr.</p>

<ol>
<li>Selecione <strong>Portas personalizadas</strong>.</li>
<li>Introduza os n&uacute;meros da porta em <strong>porta statd </strong>e<strong> porta nlockmgr</strong>.</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>

<div class="section">
<h4>Nota :</h4>
<ul>
<li>Se pretender utilizar os servi&ccedil;os NFSv3, aceda a <strong>Painel de Controlo</strong> &gt; <strong>Seguran&ccedil;a</strong> &gt; <strong>Firewall</strong> e crie uma regra de firewall que ative o &quot;Servidor de ficheiros Mac/Linux&quot; da lista de aplica&ccedil;&otilde;es integradas.</li>
</ul>
</div>
<h4>Defini&ccedil;&atilde;o do tamanho do pacote de leitura/escrita</h4>
<p>Quando o tamanho do pacote de leitura/escrita n&atilde;o pode ser definido no cliente NFS, pode especificar o valor predefinido neste campo.</p>

<ol>
<li>Selecione o tamanho do pacote pretendido a partir dos campos <strong>Tamanho do pacote de leitura</strong> e <strong>Tamanho do pacote de escrita</strong>.</li>
<li>
Clique em <b>Aplicar</b>.
</li>
<li>
Voltar a montar a partilha.
</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Depois de alterar o tamanho do pacote de leitura/escrita, tem de voltar a montar a pasta partilhada antes de as novas defini&ccedil;&otilde;es entrarem em vigor.</li>
<li>Estas defini&ccedil;&otilde;es s&oacute; afetam os clientes NFS que estabelecem liga&ccedil;&atilde;o atrav&eacute;s de UDP (User Datagram Protocol).</li>
</ul>
</div>




<h3>Defini&ccedil;&otilde;es Kerberos*</h3>
<p>Kerberos &eacute; um protocolo de autentica&ccedil;&atilde;o de rede. Permite que os clientes e servidores que comunicam numa rede n&atilde;o protegida autentiquem e provem as respetivas identidades entre si de uma forma segura. O DiskStation fornece op&ccedil;&otilde;es para importar uma chave Kerberos existente. Depois de uma importa&ccedil;&atilde;o efetuada com &ecirc;xito, os clientes NFS podem utilizar o protocolo de autentica&ccedil;&atilde;o Kerberos para estabelecer liga&ccedil;&atilde;o a DiskStation.</p>

<h4> Para importar uma chave Kerberos: </h4>
<ol>
<li>Clique em <strong>Defini&ccedil;&otilde;es Kerberos</strong>.</li>
<li>Clique no bot&atilde;o <b>Importar</b>.</li>
<li>Escolha a chave Kerberos que pretende importar.</li>
<li>Clique em <b>OK</b>.</li>
</ol>

<h3><a name="idmap"></a>Mapeamento de ID de Kerberos</h3>
<p>Pode mapear principais Kerberos individuais para contas de utilizador DSM locais.</p>
<h4> Para mapear principais Kerberos e contas de utilizador locais: </h4>
<ol>
<li>Clique em <strong>Defini&ccedil;&otilde;es Kerberos</strong>.</li>
<li>Dirija-se ao separador <strong>Mapeamento de ID</strong>.</li>
<li> Clique no bot&atilde;o <b>Adicionar</b>. Selecione um dos seguintes.</li>
<ul>
<li><strong>Mapeamento de ID:</strong> Introduza o principal Kerberos e a conta de utilizador local para a qual deve ser mapeado.</li>
<li><strong>Lista de Mapeamento Sugerida:</strong> Esta op&ccedil;&atilde;o apresenta uma lista de op&ccedil;&otilde;es sugeridas de mapeamento de principal Kerberos/utilizador local geradas pelo sistema.</li>
</ul>
</ol>
<div class="section disable-eds14">
  <h4> Nota: </h4>
<ul>
<li>Se pretende mapear um cliente NFS que estabelece liga&ccedil;&atilde;o atrav&eacute;s de Kerberos a uma conta de utilizador de Dom&iacute;nio/LDAP existente, certifique-se de que aderiu ao servi&ccedil;o de diret&oacute;rio. Al&eacute;m disso, o directory server (servidor de diret&oacute;rio) tem de ter um atributo que inclua o principal Kerberos correspondente.</li>
<ul>
<li><strong>Utilizador do Dom&iacute;nio:</strong> O formato do atributo correspondente deve ser <strong>userPrincipalName</strong>.</li>
<li><strong>Utilizador LDAP:</strong> O formato do atributo correspondente deve ser <strong>GSSAuthName</strong>.</li>
</ul>
<li>Se n&atilde;o for poss&iacute;vel mapear o utilizador com &ecirc;xito para um utilizador local ou utilizador de dom&iacute;nio/LDAP, o utilizador deve ser mapeado para &ldquo;guest&rdquo;.
<li>A prioridade de mapeamento &eacute; a seguinte: Utilizador local &gt; Utilizador de dom&iacute;nio/LDAP &gt; Guest. </li>
<li>Se pretender modificar as permiss&otilde;es de acesso dos clientes NFS, utilize a Lista de Controlo de Acesso (ACL) do Windows. As op&ccedil;&otilde;es de privil&eacute;gios localizadas em <strong>Painel de Controlo</strong> &gt; <strong>Utilizador</strong> n&atilde;o s&atilde;o aplic&aacute;veis a clientes NFS.</li>
</ul>
</div>
<p>
<br>____<br> * Apenas dispon&iacute;vel em alguns modelos.

</p>



</body>
</html>