<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Grupo</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Editar um Grupo</h2>
<p>
Pode editar as informa&ccedil;&otilde;es do grupo e os privil&eacute;gios de acesso &agrave;s pastas partilhadas.
</p>
<h4>Para editar as informa&ccedil;&otilde;es do grupo:</h4>
<ol>
<li>Selecione o grupo que pretende editar.</li>
<li>Clique em <b>Editar</b> e edite as informa&ccedil;&otilde;es do grupo.</li>
<li>Clique em <b>OK</b> para terminar.</li>
</ol>
<h4>Para editar os privil&eacute;gios de acesso de um grupo &agrave;s pastas partilhadas:</h4>
<ol>
<li>Selecione o grupo que pretende editar.</li>
<li>Clique em <b>Editar</b> e <b>Permiss&otilde;es</b>.</li>
<li>
Assinale ou desmarque os privil&eacute;gios seguintes para atribuir os privil&eacute;gios de acesso ao grupo:
</li>
<ol>
<li>
<b>Leitura/Escrita</b>: O grupo pode aceder e efetuar altera&ccedil;&otilde;es &agrave; pasta partilhada.
</li>
<li>
<b>S&oacute; de leitura</b>: O grupo pode aceder &agrave; pasta partilhada mas n&atilde;o pode efetuar altera&ccedil;&otilde;es.
</li>
<li><b>Sem acesso</b>: O grupo n&atilde;o pode aceder &agrave; pasta partilhada.
</li>
</ol>
<li>Clique em <b>OK</b> para terminar.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<p>Quando ocorrerem conflitos de privil&eacute;gios, a prioridade do privil&eacute;gio &eacute; a seguinte: Sem acesso &gt; Leitura/Escrita &gt; S&oacute; de leitura.</p>
</div>


<h4 class="disable-dockerx64">Para editar a quota de utiliza&ccedil;&atilde;o de um grupo:</h4>
<ol class="disable-dockerx64">
<li class="disable-dockerx64">Selecione o grupo que pretende editar.</li>
<li class="disable-dockerx64">Clique em <strong>Editar</strong> e v&aacute; para o separador <strong>Quota</strong>.</li>
<li class="disable-dockerx64">Para cada volume<span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64">/pasta partilhada</span>, assinale a caixa de verifica&ccedil;&atilde;o abaixo de <strong>Ativar quota</strong>. Depois, introduza uma quota de utiliza&ccedil;&atilde;o no campo <strong>Quota</strong> (por exemplo, 10 GB).</li>
</ol>
<div class="section disable-eds14 disable-dockerx64">
<h4>Nota:</h4>
<ul>
<li>Cada membro do grupo herda a quota de utiliza&ccedil;&atilde;o especificada para o grupo. A quota de utiliza&ccedil;&atilde;o do grupo n&atilde;o &eacute; partilhada entre cada membro do grupo.</li>
<li>A quota m&aacute;xima de utiliza&ccedil;&atilde;o para armazenamento que pode ser introduzida para cada grupo &eacute; de, aproximadamente, 4 TB (4095 GB).</li>
</ul>
</div>


<h4>Para editar os privil&eacute;gios de acesso de um grupo &agrave;s aplica&ccedil;&otilde;es:</h4>
<ol>
<li>Selecione o grupo que pretende editar.</li>
<li>Clique em <b>Editar</b> e v&aacute; para o separador <strong>Aplica&ccedil;&otilde;es</strong>.</li>
<li>Para cada servi&ccedil;o, pode escolher uma das seguintes op&ccedil;&otilde;es:
  <ul>
<li><strong>Permitir:</strong> O grupo pode aceder &agrave; aplica&ccedil;&atilde;o.</li>
<li><strong>Negar:</strong> O grupo n&atilde;o pode aceder &agrave; aplica&ccedil;&atilde;o.</li>
<li><strong>Personalizar:</strong> Gerir os privil&eacute;gios de acesso por endere&ccedil;o IP.</li>
</ul>
</li>
<li>Clique em <b>OK</b> para terminar.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Quando ocorrerem conflitos de privil&eacute;gios, a prioridade do privil&eacute;gio &eacute; a seguinte: Negar &gt; Permitir.</li>
<li>Nem todos os pacotes e servi&ccedil;os suportam as defini&ccedil;&otilde;es de privil&eacute;gios de acesso <strong>Por IP</strong>.</li>
</ul>
</div>

<h4>Para editar o limite de velocidade do grupo:</h4>
<p>Pode ativar um limite de velocidade do grupo para diferentes servi&ccedil;os (por exemplo, File Station, FTP, etc) de modo a restringir a quantidade de largura de banda consumida pelos membros do grupo que transferem ficheiros atrav&eacute;s de cada servi&ccedil;o. Os limites de velocidade do grupo s&atilde;o partilhados por todos os membros do grupo.</p>
<ol>
<li>Selecione o grupo que pretende editar.</li>
<li>Clique em <b>Editar</b> e v&aacute; para o separador <strong>Limite de velocidade</strong>.</li>
<li>Para cada servi&ccedil;o, pode escolher uma das seguintes op&ccedil;&otilde;es:
<ul>
<li><strong>Nenhum:</strong> N&atilde;o ser&aacute; aplicado qualquer limite de velocidade quando os membros do grupo utilizarem o servi&ccedil;o.</li>
<li><strong>Constante:</strong> Ser&aacute; aplicado um limite de velocidade fixo e constante aos membros do grupo. Especifique os limites de velocidade de carregamento e transfer&ecirc;ncia nos campos &agrave; esquerda.</li>
<li><strong>Vari&aacute;vel:</strong> &Eacute; poss&iacute;vel especificar e aplicar dois limites de velocidade diferentes aos membros do grupo de acordo com um agendamento. Clique no bot&atilde;o <strong>Personalizar</strong> para modificar as defini&ccedil;&otilde;es do limite de velocidade e o agendamento.</li>
</ul>
</li>
<li>Clique em <b>OK</b> para terminar.</li>
</ol>

<div class="section">
<h4>Limite de Velocidade para Utilizadores Pertencentes a V&aacute;rios Grupos</h4>

<p>Quando um utilizador pertence a v&aacute;rios grupos, o limite de velocidade &eacute; decidido com base no grupo com a maior largura de banda dispon&iacute;vel no momento da transfer&ecirc;ncia de ficheiros. Uma vez que a largura de banda &eacute; dividida de forma igual pelos utilizadores que est&atilde;o a transferir ficheiros, a largura de banda dispon&iacute;vel muda consoante o n&uacute;mero de utilizadores a consumir a largura de banda partilhada pelo grupo.</p>

<p>Por exemplo, um utilizador &quot;Jo&atilde;o&quot; pertence ao &quot;Grupo 1&quot; (limite de velocidade 500KB/s; total de cinco utilizadores) e &quot;Grupo 2&quot; (limite de velocidade 400KB/s; total de dois utilizadores).</p>
<ul>
<li>Se os utilizadores do Grupo 1 e Grupo 2 estiverem todos a transferir ficheiros ao mesmo tempo, o limite de velocidade de Jo&atilde;o ser&aacute; 200KB/s e o consumo que faz contar&aacute; relativamente &agrave; quota de largura de banda partilhada do Grupo 2.</li>
<li>Quando os outros utilizadores do Grupo 1 terminarem de transferir ficheiros, ent&atilde;o o limite de velocidade de Jo&atilde;o mudar&aacute; imediatamente para 500KB/s e o consumo que faz contar&aacute; relativamente &agrave; quota de largura de banda partilhada do Grupo 1.</li>
</ul>
</div>


</body>
</html>
