<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Utilizador</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Home do utilizador</h2>
<p>Activar a home do utilizador para criar uma pasta <b>home</b> pessoal para cada utilizador, excepto para o <b>guest</b>. Todos os utilizadores podem aceder &agrave; sua pasta home atrav&eacute;s de CIFS, AFP, FTP ou da File Station.</p>
<p>O administrador pode aceder a todas as pastas pessoais localizadas na pasta partilhada predefinida <b>homes</b>. O nome da pasta home &eacute; o mesmo da conta do utilizador.</p>
<h4>Para activar o servi&ccedil;o home do utilizador:</h4>
<ol>
<li>Clique em <b>Home do utilizador</b>.</li>
<li>Marque <b>Activar o servi&ccedil;o home do utilizador</b>.</li>
<li>Se existir mais do que um volume no Synology DiskStation, seleccione onde pretende que seja guardada a pasta <b>homes</b>.</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<p><span class="note_head">Nota:</span> Assim que o servi&ccedil;o home do utilizador for desactivado, o servi&ccedil;o home do utilizador no dom&iacute;nio ser&aacute; tamb&eacute;m desactivado.</p>
<h4>Para desactivar o servi&ccedil;o home do utilizador:</h4>
<ol>
<li>Clique em <b>Home do utilizador</b>.</li>
<li>Desmarque a caixa de verifica&ccedil;&atilde;o <b>Activar o servi&ccedil;o home do utilizador</b>.</li>
</ol>
<p>Depois de desactivar o servi&ccedil;o home do utilizador, a pasta partilhada <b>homes</b> ser&aacute; preservada para acesso do admin.  Os utilizadores ter&atilde;o novamente acesso &agrave;s respectivas pastas home, quando o servi&ccedil;o home do utilizador for novamente activado.</p>
<ol>
<span class="note_head">Nota:</span>
<li>Para eliminar a pasta partilhada <b>homes</b> o servi&ccedil;o home do utilizador deve ser desactivado em primeiro lugar.</li>
<li>O servi&ccedil;o home do utilizador do dom&iacute;nio ser&aacute; desactivado se o servi&ccedil;o home do utilizador local estiver desactivado.</li> 
</ol> 
</body>	
</html> 
