<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;o de Diret&oacute;rio</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Utilizadores ou Grupos de Dom&iacute;nio/LDAP</h2>
<p>Se a sua DiskStation aderir a um servi&ccedil;o direct&oacute;rio como um Dom&iacute;nio Windows ou cliente LDAP, pode configurar e modificar a permiss&atilde;o de acesso dos utilizadores ou grupos de dom&iacute;nio/LDAP &agrave;s pastas partilhadas de DiskStation e aplica&ccedil;&otilde;es DSM, e ativar o servi&ccedil;o principal para todos os utilizadores de dom&iacute;nio/LDAP.</p>
<h3>Utilizador de dom&iacute;nio/LDAP</h3>
<p class="disable-dockerx64">Consoante o tipo de servi&ccedil;o direct&oacute;rio a que adere, clique no separador <strong>Utilizadores de dom&iacute;nio</strong> ou <strong>Utilizador LDAP</strong> para configurar as permiss&otilde;es de pasta partilhada e aplica&ccedil;&atilde;o, e a quota de capacidade de disco de cada utilizador.</p>
<p class="enable-dockerx64">Consoante o tipo de servi&ccedil;o direct&oacute;rio a que adere, clique no separador <strong>Utilizadores de dom&iacute;nio</strong> ou <strong>Utilizador LDAP</strong> para configurar as permiss&otilde;es de pasta partilhada e aplica&ccedil;&atilde;o de cada utilizador.</p>
<h4>As regras das defini&ccedil;&otilde;es de privil&eacute;gios incluem as seguintes:</h4>
<ul>
<li>Em caso de conflitos de privil&eacute;gio, a prioridade do privil&eacute;gio ser&aacute;: NA &gt; RW &gt; RO.</li>
<li>Pr&eacute;-visualiza&ccedil;&atilde;o de permiss&otilde;es: O privil&eacute;gio do utilizador ser&aacute; exibido aqui e &eacute; decidido com base na configura&ccedil;&atilde;o dos privil&eacute;gios do utilizador e dos grupos aos quais o utilizador pertence.</li>
<li>Privil&eacute;gios do grupo: Atribuir privil&eacute;gios aos grupos para acederem &agrave;s pastas partilhadas.</li>
</ul>
<h3>Home do Utilizador</h3>
<p>Tal como os utilizadores locais, todos os utilizadores do dom&iacute;nio/LDAP podem aceder &agrave; sua pasta <b>home</b> atrav&eacute;s de CIFS, AFP, FTP ou da File Station. </p>
<p>
Utilizadores com privil&eacute;gios de administrador podem aceder a todas as pastas pessoais localizadas na pasta partilhada predefinida <b>homes</b>. As pastas home de todos os utilizadores do dom&iacute;nio est&atilde;o situadas numa das sub-pastas de uma pasta chamada &quot;<b>@DH-nome de dom&iacute;nio</b>&quot; (para utilizadores de dom&iacute;nio) ou &quot;<b>@LH-nome FQDN</b>&quot; (para utilizadores LDAP). O nome da pasta home do utilizador &eacute; a conta do utilizador mais um n&uacute;mero exclusivo.</p>
<ol>
<span class="note_head">Nota: </span>
<li>Para eliminar a pasta partilhada <span class="bold_general">homes</span>, o servi&ccedil;o home do utilizador deve ser desativado primeiro.</li>
<li>Ativar o servi&ccedil;o home para utilizadores de dom&iacute;nio/LDAP ir&aacute; tamb&eacute;m ativar o servi&ccedil;o home para utilizadores locais, caso ainda n&atilde;o esteja ativo.
</li>
</ol> 
<h3>Grupo de dom&iacute;nio/LDAP</h3> 
<p>Dependendo do tipo de servi&ccedil;o direct&oacute;rio a que est&aacute; a aderir, clique no separador <b>Grupo de dom&iacute;nio</b> ou <b>Grupo LDAP</b> para configurar os privil&eacute;gios de acesso de grupos de dom&iacute;nio/LDAP a pastas partilhadas. A prioridade dos privil&eacute;gios &eacute;: NA &gt; RW &gt; RO.</p> 
</body> </html> 
