<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Utilizador</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Defini&ccedil;&otilde;es da Palavra-passe</h2>
<p>Clique no bot&atilde;o <strong>Defini&ccedil;&otilde;es da Palavra-passe</strong> para ver e modificar as defini&ccedil;&otilde;es descritas abaixo.</p>

<h3>Repor Palavras-passe Esquecidas</h3>
<p>Esta sec&ccedil;&atilde;o inclui uma op&ccedil;&atilde;o marcada <strong>Permitir que os utilizadores que n&atilde;o s&atilde;o administradores reponham palavras-passe esquecidas atrav&eacute;s de correio electr&oacute;nico</strong>. Quando esta op&ccedil;&atilde;o estiver activada, ser&aacute; apresentada uma liga&ccedil;&atilde;o marcada <strong>Esqueceu-se da sua palavra-passe?</strong> na p&aacute;gina de in&iacute;cio de sess&atilde;o do DSM. Se um utilizador esquecer a palavra-passe, pode clicar nesta liga&ccedil;&atilde;o e introduzir o nome de utilizador. Neste caso, o sistema envia uma mensagem ao utilizador com uma liga&ccedil;&atilde;o para repor a palavra-passe esquecida. </p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Antes de activar esta op&ccedil;&atilde;o, certifique-se de que j&aacute; activou as notifica&ccedil;&otilde;es por e-mail de SMTP. Para o fazer, v&aacute; para <strong>Painel de Controlo</strong> &gt; <strong>Notifica&ccedil;&atilde;o</strong> &gt; <strong>Geral</strong>. Se as notifica&ccedil;&otilde;es n&atilde;o estiverem activadas, o sistema n&atilde;o conseguir&aacute; enviar mensagens aos utilizadores que pretendem repor as palavras-passe.</li>
<li>Para receber as mensagens do sistema, os utilizadores t&ecirc;m de fornecer um endere&ccedil;o de e-mail na sec&ccedil;&atilde;o de informa&ccedil;&otilde;es do utilizador das respectivas contas.</li>
<li>Os utilizadores que pertencem ao grupo <strong>administrators</strong> n&atilde;o podem repor as palavras-passe com esta op&ccedil;&atilde;o.</li>
<li>Os utilizadores do dom&iacute;nio n&atilde;o podem repor as palavras-passe com esta op&ccedil;&atilde;o.</li>
<li>Os utilizadores LDAP podem repor as palavras-passe com esta op&ccedil;&atilde;o, desde que DiskStation funcione como directory server LDAP.</li>

</ul>
</div>


<h3>For&ccedil;a da Palavra-passe</h3>
<p>Pode configurar regras da for&ccedil;a da palavra-passe para os utilizadores no DiskStation.</p>

<div class="section">
<h4>Nota:</h4>
<p>As regras da for&ccedil;a da palavra-passe s&oacute; se aplicam a novas palavras-passe. Por exemplo, as regras da for&ccedil;a da nova palavra-passe s&oacute; s&atilde;o aplicadas quando criar uma nova conta de utilizador ou quando um utilizador existente alterar a respectiva palavra-passe. As palavras-passe existentes e as palavras-passe que pertencem a contas de utilizador importadas s&atilde;o exclu&iacute;das das regras da nova palavra-passe.</p>
</div>
<h4>Para activar regras de for&ccedil;a da palavra-passe:</h4>
<ol>
<li>Marque a caixa de verifica&ccedil;&atilde;o <b>Aplicar regras de for&ccedil;a da palavra-passe</b> para activar as restri&ccedil;&otilde;es da palavra-passe.</li>
<li>Seleccione mais do que uma das restri&ccedil;&otilde;es de palavra-passe das regras abaixo:</li>
<ul>
<li><b>Excluir o nome e descri&ccedil;&atilde;o do utilizador da palavra-passe</b>: A palavra-passe n&atilde;o deve conter o nome do utilizador ou a descri&ccedil;&atilde;o do utilizador. Excluem-se caracteres codificados em UTF-8.</li>
<li><b>Permitir mistura de mai&uacute;sculas e min&uacute;sculas</b>: &Eacute; permitida uma mistura de mai&uacute;sculas e min&uacute;sculas na palavra-passe.</li>
<li><b>Incluir car&aacute;cter num&eacute;rico</b>: A palavra-passe deve conter, pelo menos, um car&aacute;cter num&eacute;rico (0~9).</li>
<li><b>Incluir caracteres especiais</b>: A palavra-passe tem de conter, pelo menos, um car&aacute;cter especial ASCII (por exemplo, ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Comprimento m&iacute;nimo da palavra-passe</b>: A palavra-passe tem de ter, pelo menos, o valor especificado no campo de texto. O comprimento dever&aacute; estar entre 6 e 127.</li>
</ul>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>
 
</body>
</html>

