<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Pasta Partilhada</h2>
<p>As pastas partilhadas s&atilde;o os diret&oacute;rios b&aacute;sicos onde pode armazenar ficheiros e pastas em DiskStation. Antes de armazenar ficheiros no seu DiskStation, &eacute; necess&aacute;rio criar, pelo menos, uma pasta partilhada no DSM. Os dados armazenados em pastas partilhadas podem ser mantidos como privados ou partilhados com utilizadores ou grupos de utilizadores espec&iacute;ficos de acordo com as permiss&otilde;es de acesso personaliz&aacute;veis.</p>



<p>Em baixo est&aacute; uma lista de pastas partilhadas predefinidas que foram criadas automaticamente quando determinados servi&ccedil;os, aplica&ccedil;&otilde;es ou pacotes foram instalados ou ativados.</p> 
<table>
<tr>
<th>Nome</th>
<th>Descri&ccedil;&atilde;o</th>
</tr>
<tr>
<th>public</th>
<td>A pasta <strong>public</strong> foi criada automaticamente ap&oacute;s a configura&ccedil;&atilde;o pela primeira vez de DiskStation.*</td>
</tr>
<tr>
<th>web</th>
<td>A pasta <strong>web</strong> &eacute; a localiza&ccedil;&atilde;o de armazenamento predefinida para o conte&uacute;do de um website alojado em DiskStation. &Eacute; criada automaticamente quando a <strong>Web Station</strong> for ativada.</td>
</tr>
<tr>
<th>photo</th>
<td>A pasta <strong>photo</strong> &eacute; utilizada para armazenar as fotografias e os v&iacute;deos que pretende partilhar com a Photo Station. &Eacute; criada automaticamente quando a <strong>Photo Station</strong> ou <strong>Servidor Multim&eacute;dia DLNA/UPnP</strong> for ativado.</td>
</tr>
<tr>
<th>music</th>
<td>A pasta <strong>music</strong> &eacute; utilizada para armazenar a m&uacute;sica que pretende ouvir com a Audio Station. &Eacute; criada automaticamente quando a <strong>Audio Station</strong> ou <b>Servidor Multim&eacute;dia DLNA/UPnP</b> for ativado.</td>
</tr>
<tr>
<th>video</th>
<td>A pasta <strong>video</strong> &eacute; utilizada para armazenar os ficheiros de v&iacute;deo que pretende pesquisar atrav&eacute;s dos dispositivos DLNA/UPnP. &Eacute; criada automaticamente quando a <b>Video Station</b> ou <strong>Servidor Multim&eacute;dia DLNA/UPnP</strong> for ativado.</td>
</tr>
<tr>
<th>surveillance</th>
<td>A pasta <strong>surveillance</strong> &eacute; utilizada para armazenar as grava&ccedil;&otilde;es da Surveillance Station. &Eacute; criada automaticamente quando a <strong>Surveillance Station</strong> for ativada. &Eacute; apenas de leitura e s&oacute; pode ser acedida pelo administrador do sistema.</td>
</tr>
<tr>
<th>home</th>
<td>As pastas <strong>home</strong> fornecem espa&ccedil;os privados para que cada utilizador armazene dados que s&oacute; podem ser acedidos por esse utilizador. &Eacute; criada automaticamente quando a funcionalidade <strong>Home do Utilizador</strong> for ativada.</td>
</tr>
<tr>
<th>homes</th>
<td>A pasta <strong>homes</strong> cont&eacute;m as pastas home de todos os utilizadores. &Eacute; criada automaticamente quando a funcionalidade <strong>Home do Utilizador</strong> for ativada. Apenas o administrador do sistema pode aceder e gerir as pastas home de todos os utilizadores.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>A pasta <strong>NetBackup</strong> &eacute; criada automaticamente quando a <strong>C&oacute;pia de Seguran&ccedil;a de Rede</strong> for ativada.</td>
</tr>
<tr>
<th>usbshare</th>
<td>A pasta <strong>usbshare[n&uacute;mero]</strong> &eacute; criada automaticamente quando liga um dispositivo de unidade externa USB &agrave; porta USB de DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>A pasta <strong>satashare</strong> &eacute; criada automaticamente quando liga um dispositivo de unidade externa eSATA &agrave; porta eSATA de DiskStation.*</td>
</tr>
</table>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Apenas pode editar as permiss&otilde;es de pasta partilhada de utilizadores no modo simples. Se pretender criar grupos de utilizadores ou gerir os privil&eacute;gios de acesso dos grupos a pastas partilhadas, aceda a <b>Painel de Controlo (Modo Avan&ccedil;ado)</b> &gt; <b>Grupo</b>.</li>
</ul>
</div>

<h4>Para criar uma pasta partilhada:</h4>
<ol>
<li>Aceda a <b>Painel de Controlo (Modo Simples)</b> &gt; <b>Pasta Partilhada</b> e clique no &iacute;cone <b>+</b> no painel esquerdo.</li>
<li>Especifique um nome e selecione um volume para criar a pasta partilhada.</li>
<li>Marque <b>Ativar Reciclagem</b> se necess&aacute;rio. Se esta op&ccedil;&atilde;o estiver ativada, quando os ficheiros da pasta partilhada forem eliminados, ser&atilde;o movidos para uma pasta com o nome <b>#recycle</b>. O acesso &agrave; reciclagem pode estar limitado aos utilizadores pertencentes ao grupo <b>administrators</b>.</li>
<li>Marque ou desmarque as caixas adequadas de cada utilizador para personalizar as respetivas permiss&otilde;es de acesso &agrave; pasta partilhada:</li>
<ul>
<li><b>Leitura/Escrita:</b> O utilizador pode aceder e efetuar altera&ccedil;&otilde;es aos ficheiros e subpastas na pasta partilhada.</li>
<li><b>S&oacute; de leitura:</b> O utilizador pode aceder aos ficheiros e subpastas na pasta partilhada.</li>
<li><b>Sem acesso:</b> O utilizador n&atilde;o pode aceder aos ficheiros ou subpastas na pasta partilhada.</li>
</ul>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Os nomes das pastas partilhadas n&atilde;o s&atilde;o sens&iacute;veis a mai&uacute;sculas e min&uacute;sculas e podem incluir 1 a 32 caracteres. Os nomes n&atilde;o podem incluir os seguintes caracteres:<br> <strong>! &quot; # $ % &amp; &apos; ( ) * + , / : ; <= > ? @ [ ] \ ^ ` { } | ~</strong></li>
<li>Os seguintes nomes est&atilde;o reservados para utiliza&ccedil;&atilde;o do sistema:<br> <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong></li>
<li>O primeiro caractere do nome de uma pasta partilhada n&atilde;o pode ser um sinal de subtra&ccedil;&atilde;o ou um espa&ccedil;o e o &uacute;ltimo caractere n&atilde;o pode ser um espa&ccedil;o.</li>
<li>Quando ocorrerem conflitos de permiss&otilde;es, a prioridade das permiss&otilde;es &eacute; a seguinte: <b>Sem acesso</b> &gt; <b>Leitura/Escrita</b> &gt; <b>S&oacute; de leitura</b>.</li>
<li>Quando criar uma nova pasta partilhada, se as permiss&otilde;es de acesso para os utilizadores pertencentes ao grupo <b>administrators</b> estiverem definidas para <b>Sem acesso</b>, estes utilizadores apenas podem visualizar a pasta partilhada em <b>Painel de Controlo</b> &gt; <b>Pasta Partilhada</b>.</li>
<li> Pode configurar as defini&ccedil;&otilde;es de privil&eacute;gios da pasta Reciclagem em File Station clicando com o bot&atilde;o direito na pasta <b>#recycle</b>. Escolha <b>Propriedades</b> e clique no separador <b>Permiss&otilde;es</b>.</li>
</ul>
</div>

<h4>Para editar uma pasta partilhada:</h4>
<ol>
<li>Aceda a <b>Painel de Controlo (Modo Simples)</b> &gt; <b>Pasta Partilhada</b>.</li>
<li>Selecione a pasta partilhada pretendida no painel esquerdo.</li>
<li>Edite as informa&ccedil;&otilde;es gerais da pasta partilhada, como o nome, a localiza&ccedil;&atilde;o e as permiss&otilde;es de utilizador.</li>
<li>Se a op&ccedil;&atilde;o <b>Ativar Reciclagem</b> j&aacute; estiver marcada, pode clicar em <b>Esvaziar Reciglagem</b> para remover permanentemente todos os ficheiros eliminados que se encontrem na reciclagem.</li>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<h4>Para eliminar uma pasta partilhada:</h4>
<ol>
<li>Aceda a <b>Painel de Controlo (Modo Simples)</b> &gt; <b>Pasta Partilhada</b>.</li>
<li>Selecione a pasta partilhada pretendida no painel esquerdo.</li>
<li>Clique no &iacute;cone <b>Lixo</b> no painel esquerdo para eliminar a pasta partilhada selecionada.</li>

</ol>


<p>____<br>* Apenas dispon&iacute;vel em alguns modelos.</p>
</body>
</html>