<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Vis&atilde;o Geral</h2>
<p><b>Painel de Controlo (Modo Simples)</b> &gt; <b>Vis&atilde;o Geral</b> &eacute; uma gateway r&aacute;pida e centralizada que lhe permite gerir v&aacute;rias defini&ccedil;&otilde;es b&aacute;sicas e monitorizar recursos do sistema do seu DiskStation.</p>


<h3>Sa&uacute;de do sistema</h3>
<p>Esta sec&ccedil;&atilde;o apresenta o estado geral do seu sistema. Se tiver ocorrido um erro ou se os seus espa&ccedil;os de armazenamento estiverem avariados ou degradados, pode passar o cursor do rato nesta sec&ccedil;&atilde;o e clicar no &iacute;cone <b>Mais</b>, no canto superior direito, para abrir as p&aacute;ginas correspondentes para repara&ccedil;&atilde;o ou gest&atilde;o.</p>

<h3>Vers&atilde;o do DSM</h3>
<p>A vers&atilde;o do DSM atual e o estado ser&atilde;o exibidos nesta sec&ccedil;&atilde;o. Quando um novo DSM estiver dispon&iacute;vel para transfer&ecirc;ncia, pode atualizar para a vers&atilde;o mais recente diretamente a partir daqui.</p>

<h3>QuickConnect ID</h3>
<p>Pode visualizar o seu QuickConnect ID aqui. Para gest&atilde;o e mais defini&ccedil;&otilde;es avan&ccedil;adas, passe o cursor do rato nesta sec&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b>, no canto superior direito, para abrir a p&aacute;gina <b>QuickConnect</b>.</p>
<h3>Armazenamento</h3>
<p>Esta sec&ccedil;&atilde;o apresenta a informa&ccedil;&atilde;o de hardware e o estado dos seus espa&ccedil;os de armazenamento, como a utiliza&ccedil;&atilde;o do disco r&iacute;gido e a capacidade/utiliza&ccedil;&atilde;o do volume. Pode verificar quantos discos r&iacute;gidos est&atilde;o a ser utilizados e por quais espa&ccedil;os de armazenamento. Para gest&atilde;o e mais defini&ccedil;&otilde;es avan&ccedil;adas, passe o cursor do rato nesta sec&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b>, no canto superior direito, para abrir o <b>Gestor de Armazenamento</b>.</p>

<h3>Monitoriza&ccedil;&atilde;o de Recursos</h3>
<p>Pode monitorizar a percentagem da utiliza&ccedil;&atilde;o geral da CPU, a utiliza&ccedil;&atilde;o da mem&oacute;ria e a velocidade dos dados recebidos e enviados, em KB por segundo. Se estiver a ser utilizada mais de uma LAN, clique no &iacute;cone da seta no gr&aacute;fico de fluxo da rede para comutar. Para gest&atilde;o e mais defini&ccedil;&otilde;es avan&ccedil;adas, passe o cursor do rato nesta sec&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b>, no canto superior direito, para abrir a <b>Monitoriza&ccedil;&atilde;o de Recursos</b>.</p>

<h3>Utilizadores Ligados</h3>
<p>Aqui, pode visualizar e gerir os clientes que est&atilde;o atualmente ligados ao sistema e a aceder a recursos. Esta sec&ccedil;&atilde;o exibe clientes que estejam ligados atrav&eacute;s de HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP e NFS. Para gest&atilde;o e mais defini&ccedil;&otilde;es avan&ccedil;adas, passe o cursor do rato nesta sec&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b>, no canto superior direito, para abrir a <b>Monitoriza&ccedil;&atilde;o de Recursos</b>.</p>

<h4>Para terminar liga&ccedil;&otilde;es atuais:</h4>
<p>Clique no &iacute;cone <b>Terminar liga&ccedil;&atilde;o</b>, junto ao utilizador desejado, para parar o acesso do utilizador aos recursos. O utilizador desligado tem de ser novamente autorizado para aceder aos recursos.</p>

</body>
</html>