<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Utilizador</h2>
<p>Com as op&ccedil;&otilde;es flex&iacute;veis de gest&atilde;o de utilizador, pode criar contas de utilizador para membros individuais ou para a sua fam&iacute;lia ou neg&oacute;cio e definir as permiss&otilde;es de acesso de cada pessoa &agrave;s pastas partilhadas.</p>

<h4>Para criar um utilizador:</h4>
<ol>
<li>Aceda a <b>Painel de Controlo (Modo Simples)</b> &gt; <b>Utilizador</b> e clique no &iacute;cone <b>+</b> no painel esquerdo.</li>
<li>Especifique um nome e uma palavra-passe para o utilizador.</li>
<li>Especifique os grupos a que o novo utilizador deve pertencer.</li>
<li>Atribua as adequadas permiss&otilde;es de pasta partilhada para o novo utilizador. Quando ocorrerem conflitos de permiss&otilde;es, a prioridade das permiss&otilde;es &eacute; a seguinte: <b>Sem acesso</b> &gt; <b>Leitura/Escrita</b> &gt; <b>S&oacute; de leitura</b>.</li>
<ul>
<li><b>Pr&eacute;-visualizar:</b> Esta coluna apresenta os privil&eacute;gios atuais do utilizador de acesso de pasta partilhada, de acordo com as defini&ccedil;&otilde;es e grupos atuais aos quais o utilizador pertence.</li>
<li><b>Leitura/Escrita:</b> O utilizador pode aceder e efetuar altera&ccedil;&otilde;es aos ficheiros e subpastas na pasta partilhada correspondente.</li>
<li><b>S&oacute; de leitura:</b> O utilizador pode aceder aos ficheiros e subpastas na pasta partilhada correspondente.</li>
<li><b>Sem acesso:</b> O utilizador n&atilde;o pode aceder aos ficheiros ou subpastas na pasta partilhada correspondente.</li>
</ul>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>

<div class="section">
<h4>Limita&ccedil;&atilde;o do nome de utilizador:</h4>
<ul>
<li>O nome de utilizador n&atilde;o &eacute; sens&iacute;vel a mai&uacute;sculas e min&uacute;sculas e pode ter entre 1 e 64 caracteres Unicode, mas n&atilde;o pode conter os seguintes s&iacute;mbolos:<br> <b>! &quot; # $ % &amp; &apos; ( ) * + , / : ; < = > ? @ [ ] \ ^ ` { } | ~</b></li>
<li>O primeiro caractere n&atilde;o pode ser um sinal de subtra&ccedil;&atilde;o ou um espa&ccedil;o e o &uacute;ltimo caractere n&atilde;o pode ser um espa&ccedil;o.</li>
<li>Os seguintes nomes de utilizador est&atilde;o reservados para utiliza&ccedil;&atilde;o do sistema:<br> <b>mailer-daemon</b>, <b>postmaster</b></li>
</ul>
<h4>Limita&ccedil;&atilde;o da palavra-passe:</h4>
<ul>
<li>A palavra-passe &eacute; sens&iacute;vel a mai&uacute;sculas e min&uacute;sculas e est&aacute; limitada a 127 caracteres apresent&aacute;veis, incluindo letras, n&uacute;meros, sinais e espa&ccedil;os.</li>
</ul>
</div>

</ol>
<h4>Para editar um utilizador:</h4>
<ol>
<li>Aceda a <b>Painel de Controlo (Modo Simples)</b> &gt; <b>Utilizador</b>.</li>
<li>Selecione o utilizador pretendido no painel esquerdo.</li>
<li>Edite as informa&ccedil;&otilde;es gerais do utilizador, como o nome, a palavra-passe, o grupo e as permiss&otilde;es de pasta partilhada.</li>
<li>Marque <b>Desativar esta conta</b> se pretende terminar o funcionamento da conta.</li>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<h4>Para remover um utilizador:</h4>
<ol>
<li>Aceda a <b>Painel de Controlo (Modo Simples)</b> &gt; <b>Utilizador</b>.</li>
<li>Selecione o utilizador pretendido no painel esquerdo.</li>
<li>Clique no &iacute;cone <b>Lixo</b> no painel esquerdo para eliminar o utilizador selecionado.</li>
</ol>
</body>
</html>