
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>E-mail - Ajuda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Enabling email notifications allows your DiskStation to send messages to your email when specified events occur.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>E-mail</h2>
<p class="disable-eds14">A ativa&ccedil;&atilde;o de notifica&ccedil;&otilde;es por e-mail permite que o DiskStation envie mensagens para o seu e-mail quando ocorrerem eventos especificados, como erros de sistema, perda da liga&ccedil;&atilde;o de rede, comportamento das ventoinhas, falha de corrente ou falha na tarefa de execu&ccedil;&atilde;o de c&oacute;pia de seguran&ccedil;a.</p>

<p class="enable-eds14">A ativa&ccedil;&atilde;o de notifica&ccedil;&otilde;es por e-mail permite que o DiskStation envie mensagens para o seu e-mail quando ocorrerem eventos especificados, como erros de sistema, perda da liga&ccedil;&atilde;o de rede, falha de corrente ou falha na tarefa de execu&ccedil;&atilde;o de c&oacute;pia de seguran&ccedil;a.</p>


<h4>Para activar notifica&ccedil;&otilde;es por e-mail:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Notifica&ccedil;&atilde;o</strong> &gt; <strong>E-mail</strong>.</li>
<li>Assinale a op&ccedil;&atilde;o <strong>Activar Notifica&ccedil;&otilde;es por e-mail</strong>.</li>
<li>Introduza um ou mais endere&ccedil;os de e-mail no campo <strong>Destinat&aacute;rios</strong>. As notifica&ccedil;&otilde;es do sistema ser&atilde;o enviadas para os endere&ccedil;os aqui introduzidos. S&atilde;o permitidos dois endere&ccedil;os. Pode separar os v&aacute;rios endere&ccedil;os com um sinal de ponto e v&iacute;rgula (;).</li>
<li>Se necess&aacute;rio, adicione um prefixo do assunto no campo <strong>Prefixo do assunto</strong>. Este prefixo ser&aacute; adicionado ao assunto de cada mensagem enviada pelo DiskStation, ajudando-o a identificar e a filtrar mensagens.</li>
<li>Se pretender utilizar um servidor de e-mail terceiro (por exemplo, Gmail, Outlook, Yahoo!) para reencaminhar mensagens, consulte a sec&ccedil;&atilde;o seguinte &quot;servi&ccedil;o de e-mail de terceiros&quot;. Se pretender utilizar um servidor personalizado, consulte a sec&ccedil;&atilde;o &quot;servidor SMTP personalizado&quot;. </li>
</ol>




<h4>Para utilizar um servi&ccedil;o de e-mail de terceiros:</h4>
<ol>


<li>No menu <strong>Fornecedor de servi&ccedil;o</strong>, escolha o servi&ccedil;o de e-mail de terceiros, como o Gmail, Yahoo ou Outlook.</li>
<li>Introduza o seu nome de utilizador e palavra-passe para o servi&ccedil;o de e-mail selecionado.</li>
<li>Clique em <strong>Aplicar</strong> para guardar as defini&ccedil;&otilde;es.</li>
<li>Pode clicar em <strong>Enviar um e-mail de teste</strong> para verificar se as suas defini&ccedil;&otilde;es est&atilde;o corretas.</li>
</ol>

<h4>Para utilizar um servidor SMTP personalizado:</h4>
<ol>


<li>No menu <strong>Fornecedor de servi&ccedil;o</strong>, selecione <strong>Servidor SMTP personalizado</strong>.</li>
<li>Introduza o nome do servidor SMTP ou endere&ccedil;o de IP no campo <strong>Servidor SMTP</strong>. </li>
<li>Introduza o n&uacute;mero da porta SMTP no campo <strong>Porta SMTP</strong>. (Se tiver especificado uma porta SMTP diferente na configura&ccedil;&atilde;o das regras de reencaminhamento da porta, introduza esse n&uacute;mero.)</li>
<li>Se o seu servidor SMTP necessitar de autentica&ccedil;&atilde;o, assinale <strong>Autentica&ccedil;&atilde;o necess&aacute;ria</strong>, introduza o seu <strong>Nome de utilizador</strong> e a <strong>Palavra-passe</strong> para o servidor de e-mail. </li>
<li>Se o seu servidor SMTP requerer liga&ccedil;&atilde;o SSL/TLS, assinale a caixa <strong>&Eacute; necess&aacute;ria uma liga&ccedil;&atilde;o segura (SSL/TLS)</strong>.
<li>Se pretender personalizar o nome do remetente que aparece nas mensagens de e-mail enviadas pelo DiskStation, introduza o nome no campo <strong>Nome do remetente</strong>. Se pretender personalizar o endere&ccedil;o de e-mail do remetente, introduza o endere&ccedil;o de e-mail no campo <strong>E-mail do remetente</strong>. Se o campo estiver vazio, ser&aacute; utilizado o primeiro endere&ccedil;o de e-mail em <strong>Destinat&aacute;rios</strong>.</li>
<li>Clique em <strong>Aplicar</strong> para guardar as defini&ccedil;&otilde;es.</li>
<li>Pode clicar em <strong>Enviar um e-mail de teste</strong> para verificar se as suas defini&ccedil;&otilde;es est&atilde;o corretas.</li>
</ol>






<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se pretender enviar uma mensagem de boas-vindas para cada uma das contas de utilizadores recentemente criadas, assinale a op&ccedil;&atilde;o <strong>Enviar uma mensagem de boas-vindas para os novos utilizadores</strong> e cada um dos utilizadores ir&aacute; receber uma mensagem de boas-vindas quando criar a respetiva conta.</li>
<li>O idioma das notifica&ccedil;&otilde;es por e-mail pode ser definido em <strong>Idioma de Notifica&ccedil;&atilde;o</strong>. Para alterar o idioma da notifica&ccedil;&atilde;o por e-mail, aceda a <strong>Menu Principal</strong> &gt; <strong>Painel de Controlo</strong> &gt; <strong>Op&ccedil;&otilde;es Regionais</strong>, clique no separador <strong>Idioma</strong> e escolha o seu idioma preferido no menu pendente na sec&ccedil;&atilde;o <strong>Idioma de Notifica&ccedil;&atilde;o</strong>.</li>
<li>Se estiver a utilizar o servidor SMTP do Gmail e tiver a verifica&ccedil;&atilde;o de dois passos ativada, lembre-se de utilizar a sua &quot;palavra-passe espec&iacute;fica da aplica&ccedil;&atilde;o&quot; disponibilizada pela Google para a autentica&ccedil;&atilde;o SMTP.</li>
</ul>
</div>

<div class="section">
<h4>Nome do Dom&iacute;nio do Servidor SMTP:</h4>
<p>O servidor SMTP pode ser um endere&ccedil;o IP ou o nome de um dom&iacute;nio. Se for o nome de um dom&iacute;nio, certifique-se de que &eacute; introduzido um IP do DNS server v&aacute;lido em <b>Menu Principal</b> &gt; <b>Painel de Controlo</b> &gt; <b>Rede</b> e assegure-se de que o servidor est&aacute; na Internet. </p>


</div>
</body>
</html>
