<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Atualiza&ccedil;&atilde;o do DSM</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Atualiza&ccedil;&atilde;o do DSM</h1>
<p>Periodicamente, a Synology lan&ccedil;a atualiza&ccedil;&otilde;es gratuitas para o DSM. As atualiza&ccedil;&otilde;es podem incluir novas funcionalidades, melhoramentos de fun&ccedil;&otilde;es e aperfei&ccedil;oamentos de desempenho.</p>
<p><span class="note_head">Importante:</span> Normalmente, a atualiza&ccedil;&atilde;o do DSM n&atilde;o afeta os dados na DiskStation. No entanto, para garantir a seguran&ccedil;a dos dados, recomendamos que fa&ccedil;a uma c&oacute;pia de seguran&ccedil;a dos mesmos antes de come&ccedil;ar.</p>

<h2>Executar a Atualiza&ccedil;&atilde;o Manual do DSM</h2>
<p>Pode transferir o ficheiro de atualiza&ccedil;&atilde;o .pat do <a href="http://www.synology.com/support/download.php" target="_blank">Centro de Transfer&ecirc;ncias</a> da Synology e executar a atualiza&ccedil;&atilde;o manual do DSM.</p>
<h4>Para executar a atualiza&ccedil;&atilde;o manual do DSM:</h4>

<ol>
<li>Visite <a href="http://www.synology.com" target="_blank">www.synology.com</a> para transferir a atualiza&ccedil;&atilde;o mais recente do DSM para o seu computador local. Descompacte o ficheiro para obter um ficheiro de atualiza&ccedil;&atilde;o .pat.</li>
<li>Clique em <b>Atualiza&ccedil;&atilde;o Manual do DSM</b> para entrar na P&aacute;gina de Atualiza&ccedil;&atilde;o Manual do DSM</li>
<li>Clique em <b>Pesquisar</b> para selecionar o ficheiro de atualiza&ccedil;&atilde;o.</li>
<li>Clique em <b>Aplicar</b> para come&ccedil;ar a atualizar o seu DSM. O sistema reiniciar-se-&aacute; automaticamente quando a atualiza&ccedil;&atilde;o terminar.</li>
</ol>
<div class="section">
<h4>Resolu&ccedil;&atilde;o de problemas:</h4>
<p>Se n&atilde;o conseguir atualizar o DSM, as seguintes sugest&otilde;es podem ajud&aacute;-lo a resolver o problema:</p>
<ul>
<li>Verifique se o processo de atualiza&ccedil;&atilde;o foi interrompido por utilizadores ou outros eventos inesperados, tais como falha de energia.</li>
<li>Verifique a vers&atilde;o do DSM. S&oacute; pode atualizar o sistema com uma vers&atilde;o de DSM mais recente.</li>
<li>Fa&ccedil;a a transfer&ecirc;ncia da atualiza&ccedil;&atilde;o do DSM novamente, pois o ficheiro de atualiza&ccedil;&atilde;o pode estar corrompido.</li>
</ul>
<p>Se o problema persistir, contacte o <a href="https://account.synology.com/support/support_form.php" target="_blank">Suporte T&eacute;cnico</a> da Synology.</p>
</div>

<h2>Executar a Atualiza&ccedil;&atilde;o Autom&aacute;tica do DSM</h2>
<p>Al&eacute;m da atualiza&ccedil;&atilde;o manual, sempre que acede &agrave; <b>Atualiza&ccedil;&atilde;o do DSM</b>, o sistema ir&aacute; verificar na Synology se existe alguma atualiza&ccedil;&atilde;o do DSM dispon&iacute;vel para transfer&ecirc;ncia e, de seguida, exibe o resultado em texto vermelho ou verde. Se o resultado lhe indicar que est&aacute; dispon&iacute;vel para transferir a vers&atilde;o mais recente do DSM, o sistema pode transferir o DSM mais recente para si e de seguida executar a atualiza&ccedil;&atilde;o.</p>
<h4>Para que o sistema transfira o DSM mais recente e execute a atualiza&ccedil;&atilde;o:</h4>
<ol>
<li>Se o DSM mais recente estiver pronto para transfer&ecirc;ncia, clique no link <b>Transferir</b> para o sistema transferir o DSM mais recente.</li>
<li>O sistema ir&aacute; exibir uma das seguintes notifica&ccedil;&otilde;es no ambiente de trabalho para o informar se a transfer&ecirc;ncia foi ou n&atilde;o conclu&iacute;da com sucesso: <b>Transfer&ecirc;ncia do DSM Conclu&iacute;da</b> ou <b>Transfer&ecirc;ncia do DSM Falhou</b>.</li>
<li>Clique na janela de notifica&ccedil;&atilde;o no ambiente de trabalho para aceder a <b>Atualiza&ccedil;&atilde;o do DSM</b>.</li>
<li>Execute qualquer dos seguintes procedimentos:<ul>
<li>Se a transfer&ecirc;ncia do DSM estiver conclu&iacute;da, clique em <b>Atualizar agora</b> para come&ccedil;ar a atualizar o DSM imediatamente.</li>
<li>Se a transfer&ecirc;ncia do DSM tiver falhado, clique em <b>Repetir</b> para o sistema transferir novamente o DSM mais recente da Synology.</li>
</ul>
</li>
</ol>
<h4>Para verificar as atualiza&ccedil;&otilde;es regularmente:</h4>
<ol>
<li>Assinale <b>Verificar atualiza&ccedil;&otilde;es do DSM regularmente</b>.</li>
<li>Selecione um plano de atualiza&ccedil;&atilde;o e configure o <b>Agendamento da Instala&ccedil;&atilde;o</b>.</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<p>Ser&aacute; exibida uma notifica&ccedil;&atilde;o no ambiente de trabalho quando for transferida uma atualiza&ccedil;&atilde;o do DSM e estiver pronta para ser instalada. Para parar a atualiza&ccedil;&atilde;o autom&aacute;tica do DSM, pode cancel&aacute;-la na notifica&ccedil;&atilde;o no ambiente de trabalho ou alterando as <strong>Defini&ccedil;&otilde;es de atualiza&ccedil;&atilde;o</strong>. As atualiza&ccedil;&otilde;es do DSM ser&atilde;o instaladas antes do encerramento agendado, se a op&ccedil;&atilde;o tiver sido ativada em <strong>Encerrar</strong> em <strong>Agendamento de Energia</strong>.</p>

<div class="section">
<h4>Resolu&ccedil;&atilde;o de problemas:</h4>
<p>Se visualizar mensagens de erro (em texto vermelho) durante a verifica&ccedil;&atilde;o ou transfer&ecirc;ncia do DSM mais recente, as seguintes sugest&otilde;es podem ajudar a resolver o seu problema:</p>
<ul>
<li>Certifique-se de que a sua DiskStation est&aacute; ligada &agrave; Internet.</li>
<li>O servidor de transfer&ecirc;ncias da Synology pode estar ocupado no momento. Tentar transferir novamente mais tarde pode resolver o problema.</li>
</ul>
<p>Se o problema persistir, contacte o <a href="https://account.synology.com/support/support_form.php" target="_blank">Suporte T&eacute;cnico</a> da Synology.</p>
</div>

</body>
</html>
