<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="login"></a>Estilo de In&iacute;cio de Sess&atilde;o</h2>

<p>Pode personalizar o aspeto do ecr&atilde; de in&iacute;cio de sess&atilde;o do DSM escolhendo a partir de uma variedade de modelos, alterando imagem de fundo ou adicionando um log&oacute;tipo. Para isso, aceda a <strong>Painel de Controlo</strong> &gt; <strong>Estilo de In&iacute;cio de Sess&atilde;o</strong>.</p>

<h4>Para personalizar o ecr&atilde; de in&iacute;cio de sess&atilde;o do DSM:</h4>
<p>S&atilde;o apresentadas as seguintes op&ccedil;&otilde;es na p&aacute;gina <strong>Estilo de In&iacute;cio de Sess&atilde;o</strong>:</p>
<ul>
<li><strong>T&iacute;tulo de P&aacute;gina de In&iacute;cio de Sess&atilde;o:</strong> O texto aqui inserido &eacute; apresentado no ecr&atilde; de in&iacute;cio de sess&atilde;o.</li>
<li><strong>Informa&ccedil;&atilde;o da hora:</strong> Escolha mostrar ou ocultar a informa&ccedil;&atilde;o da hora local no ecr&atilde; de in&iacute;cio de sess&atilde;o.</li>
<li><strong>Modelo:</strong> Selecione um esquema de cores e uma imagem de fundo predefinida. O modelo escolhido produz efeitos na pr&oacute;xima vez que iniciar sess&atilde;o em DiskStation.</li>
<li><strong>Fundo:</strong> Para mudar a imagem de fundo que &eacute; apresentada no ecr&atilde; de in&iacute;cio de sess&atilde;o, clique na imagem existente ou no sinal de adi&ccedil;&atilde;o (<strong>+</strong>) se n&atilde;o for selecionada qualquer imagem. Pode escolher entre as imagens de fundo predefinidas, imagens guardadas em DiskStation ou imagens utilizadas anteriormente. Apenas s&atilde;o suportadas imagens nos formatos de ficheiro JPE, JPEG, JPG, BMP, GIF ou PNG.</li>
<li><strong>Log&oacute;tipo:</strong> Para adicionar um log&oacute;tipo ao ecr&atilde; de in&iacute;cio de sess&atilde;o, clique no log&oacute;tipo existente ou no sinal de adi&ccedil;&atilde;o (<strong>+</strong>) se n&atilde;o for selecionada qualquer imagem. Pode carregar uma imagem inferior a 1 MB, escolher imagens guardadas em DiskStation ou imagens utilizadas anteriormente.</li>
</ul>

</body>
</html>

