<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Notifica&ccedil;&atilde;o</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Avan&ccedil;adas</h2>
<p>Pode selecionar os tipos de eventos que obrigam o sistema a enviar mensagens de notifica&ccedil;&atilde;o bem como o suporte (e-mail, SMS, m&oacute;vel, e programas de mensagens instant&acirc;neas) que recebem as mensagens. </p>
<p>Cada um dos eventos tem a sua pr&oacute;pria mensagem predefinida de notifica&ccedil;&atilde;o, mas tamb&eacute;m lhe &eacute; dada a op&ccedil;&atilde;o de personalizar o seu conte&uacute;do de notifica&ccedil;&atilde;o editando a mensagem de notifica&ccedil;&atilde;o. A mensagem predefinida pode ser restaurada caso decida mais tarde descartar as suas defini&ccedil;&otilde;es personalizadas.</p>

<ul class="disable-eds14">
<li><strong>Todas as notifica&ccedil;&otilde;es</strong>: Como o nome indica, inclui todos os tipos de eventos de notifica&ccedil;&atilde;o.</li>
<li><b>Por prioridade:</b> Dependendo da import&acirc;ncia dos eventos de notifica&ccedil;&atilde;o, s&atilde;o filtrados em dois grupos: <strong>Cr&iacute;tico</strong> e <strong>Informativo</strong>.</li>
<ul>
<li><b>Cr&iacute;tico</b>: Eventos que requerem que tome medidas corretivas imediatas pertencentes a este grupo.</li>
<li><strong>Informativo</strong>: Eventos que n&atilde;o requerem qualquer medida corretiva tendo apenas como objetivo informar da altera&ccedil;&atilde;o de estado do sistema pertencente a este grupo.</li>
</ul>
<li><b>Por categoria</b>: Dependendo da natureza dos eventos de notifica&ccedil;&atilde;o, s&atilde;o filtrados em seis grupos: <strong>Sistema</strong>, <strong>Armazenamento interno</strong>, <strong>C&oacute;pia de seguran&ccedil;a e restauro</strong>, <strong>Fonte de alimenta&ccedil;&atilde;o</strong>, <strong>USBCopy</strong>, <strong>CMS</strong> e <strong>Armazenamento externo</strong>.</li>
<ul>
<li><b>Sistema</b>: Eventos relevantes para erros ou altera&ccedil;&otilde;es de sistema pertencem a este grupo.</li>
<li><strong>Armazenamento interno</strong>: Eventos relativos ao armazenamento interno pertencem a este grupo.</li>
<li><strong>C&oacute;pia de seguran&ccedil;a e restauro</strong>: Eventos relevantes para as tarefas de c&oacute;pia de seguran&ccedil;a e restauro pertencem a este grupo.</li>
<li><strong>Fonte de alimenta&ccedil;&atilde;o</strong>: Eventos relativos &agrave; fonte de alimenta&ccedil;&atilde;o pertencem a este grupo. </li>
<li><strong>USBCopy</strong>: Eventos relativos a USBCopy pertencem a este grupo.</li>
<li><strong>CMS</strong>: Eventos relevantes para ligar/desligar com o anfitri&atilde;o CMS pertencem a este grupo.</li>
<li><strong>Armazenamento externo</strong>: Eventos relevantes para o armazenamento externo pertencem a este grupo.</li>
</ul>
</ul>

<ul class="enable-eds14">
<li><strong>Todas as notifica&ccedil;&otilde;es</strong>: Como o nome indica, inclui todos os tipos de eventos de notifica&ccedil;&atilde;o.</li>
<li><b>Por prioridade:</b> Dependendo da import&acirc;ncia dos eventos de notifica&ccedil;&atilde;o, s&atilde;o filtrados em dois grupos: <strong>Cr&iacute;tico</strong> e <strong>Informativo</strong>.</li>
<ul>
<li><b>Cr&iacute;tico</b>: Eventos que requerem que tome medidas corretivas imediatas pertencentes a este grupo.</li>
<li><strong>Informativo</strong>: Eventos que n&atilde;o requerem qualquer medida corretiva tendo apenas como objetivo informar da altera&ccedil;&atilde;o de estado do sistema pertencente a este grupo.</li>
</ul>
<li><b>Por categoria</b>: Dependendo da natureza dos eventos de notifica&ccedil;&atilde;o, s&atilde;o filtrados em seis grupos: <strong>Sistema</strong>, <strong>Armazenamento interno</strong>, <strong>C&oacute;pia de seguran&ccedil;a e restauro</strong>, <strong>Fonte de alimenta&ccedil;&atilde;o</strong> e <strong>Armazenamento externo</strong>.</li>
<ul>
<li><b>Sistema</b>: Eventos relevantes para erros ou altera&ccedil;&otilde;es de sistema pertencem a este grupo.</li>
<li><strong>C&oacute;pia de seguran&ccedil;a e restauro</strong>: Eventos relevantes para as tarefas de c&oacute;pia de seguran&ccedil;a e restauro pertencem a este grupo.</li>
<li><strong>Fonte de alimenta&ccedil;&atilde;o</strong>: Eventos relativos &agrave; fonte de alimenta&ccedil;&atilde;o pertencem a este grupo. </li>
<li><strong>CMS</strong>: Eventos relevantes para ligar/desligar com o anfitri&atilde;o CMS pertencem a este grupo.</li>
<li><strong>Armazenamento externo</strong>: Eventos relevantes para o armazenamento externo pertencem a este grupo.</li>
</ul>
</ul>



<h4>Para selecionar os tipos e meios dos eventos de notifica&ccedil;&atilde;o:</h4>
<ol>
<li>Selecione um grupo de eventos a partir do menu pendente nos separadores. Ser&atilde;o mostrados os eventos do grupo selecionado.</li>
<li>Assinale a(s) caixa(s) de verifica&ccedil;&atilde;o para cada evento individual para selecionar o suporte de notifica&ccedil;&atilde;o preferido.</li>
<li>Clique em <b>Guardar</b> para aplicar as defini&ccedil;&otilde;es.</li>
</ol>
<h4>Para editar a mensagem de notifica&ccedil;&atilde;o:</h4>
<ol>
<li>Selecione um evento cuja mensagem de notifica&ccedil;&atilde;o pretenda editar da lista de eventos e clique em <b>Editar Mensagem</b>.</li>
<li>Na janela que aparece, indique o assunto e o conte&uacute;do do texto para personalizar a mensagem de notifica&ccedil;&atilde;o e depois clique em <strong>Guardar</strong> para aplicar as altera&ccedil;&otilde;es.</li>
<li>Se desejar restaurar a mensagem predefinida de uma notifica&ccedil;&atilde;o depois de guardadas as altera&ccedil;&otilde;es, fa&ccedil;a o seguinte:</li>
<ol>
<li>Selecione um evento cuja mensagem de notifica&ccedil;&atilde;o deseja restaurar para os valores predefinidos da lista de eventos e depois clique em <b>Editar Mensagem</b>.</li>
<li>Na janela que aparece, clique em  <b>Restaurar predefini&ccedil;&otilde;es</b> e depois em <strong>Sim</strong> no pedido de confirma&ccedil;&atilde;o.</li>
</ol>
</ol>

<p><span class="note_head">Nota:</span> Sugerimos que reserve os segmentos contendo &apos;%&apos; na linha do assunto e no conte&uacute;do do texto. Ser&atilde;o substitu&iacute;dos por informa&ccedil;&otilde;es efetivas do sistema quando &eacute; enviada uma notifica&ccedil;&atilde;o.</p>
</body>
</html>
