<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Energia</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Hiberna&ccedil;&atilde;o da Unidade de Disco R&iacute;gido (HDD)</h2>
<p class="disable-eds14">Pode especificar o per&iacute;odo de tempo que os discos r&iacute;gidos permanecem inativos antes de entrarem no modo de hiberna&ccedil;&atilde;o de HDD. Durante a hiberna&ccedil;&atilde;o de HDD, os discos r&iacute;gidos param de rodar, reduzindo o consumo de energia e prolongando a durabilidade dos mesmos. Pode especificar diferentes per&iacute;odos de tempo para discos internos e discos eSATA/USB externos.</p>
<p class="enable-eds14">Pode especificar o per&iacute;odo de tempo que os discos r&iacute;gidos permanecem inativos antes de entrarem no modo de hiberna&ccedil;&atilde;o de HDD. Durante a hiberna&ccedil;&atilde;o de HDD, os discos r&iacute;gidos param de rodar, reduzindo o consumo de energia e prolongando a durabilidade dos mesmos. Pode especificar diferentes per&iacute;odos de tempo para os seus discos r&iacute;gidos externos USB.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>A hiberna&ccedil;&atilde;o de HDD termina ap&oacute;s o acesso.</li>
<li>Apenas certos dispositivos de armazenamento USB externo suportam hiberna&ccedil;&atilde;o de HDD.</li>
</ul>
</div>

<div class="section">
<h4>Porque &eacute; que o meu DiskStation n&atilde;o hiberna?</h4>

<p>Aten&ccedil;&atilde;o que os seguintes servi&ccedil;os ir&atilde;o evitar que o DiskStation entre no modo de hiberna&ccedil;&atilde;o. Para al&eacute;m disso, o sistema ir&aacute; sair do modo de hiberna&ccedil;&atilde;o dois minutos antes de qualquer tarefa agendada.</p>

<p><strong>Pacotes:</strong></p>
<ul>
  <li>Download Station: DiskStation n&atilde;o pode hibernar se a Download Station estiver com eMule em execu&ccedil;&atilde;o, transfer&ecirc;ncia RSS agendada ou tarefas ativas.</li>
  <li>Mail Station: DiskStation n&atilde;o pode hibernar se a Mail Station estiver a obter dados de POP3.</li>
  <li>Surveillance Station: DiskStation n&atilde;o pode hibernar se a Surveillance Station estiver a gravar.</li>
  <li>Servidor multim&eacute;dia: DiskStation n&atilde;o pode hibernar se o registo DMA estiver ativo nas defini&ccedil;&otilde;es do Servidor Multim&eacute;dia (Aceda a <strong>Menu Principal</strong> &gt; <strong>Servidor Multim&eacute;dia</strong> &gt; <strong>Servidor Multim&eacute;dia</strong> &gt; <strong>Diagnosticar</strong>).</li>
  <li>Directory Server</li>
  <li>Webalizer</li>
  <li>Logitech<sup>&reg;</sup> Media Server</li>
  <li>Plex Media Server</li>
  <li>Outro software de terceiros ou optware como SABnzbd</li>
</ul>
<p><strong>Processos:</strong></p>
<ul>
  <li>Miniaturas e indexa&ccedil;&atilde;o: DiskStation n&atilde;o pode hibernar enquanto gera miniaturas ou reindexa ficheiros multim&eacute;dia ap&oacute;s atualiza&ccedil;&atilde;o. Durante este tempo, o processo &quot;synoindexd&quot; ser&aacute; listado como &quot;Em execu&ccedil;&atilde;o&quot; (Aceda a <strong>Menu Principal</strong> &gt; <strong>Monitor de Recursos</strong> &gt; <strong>Processo</strong>).</li>
  <li>Local Master Browser: DiskStation n&atilde;o pode hibernar se Local Master Browser estiver ativo (Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Win/Mac/NFS</strong> &gt; <strong>Servi&ccedil;o de Ficheiros do Windows</strong> &gt; <strong>Ativar Local Master Browser</strong>).</li>
  <li>Windows Media Player: DiskStation n&atilde;o pode hibernar se o Servi&ccedil;o de Partilha de Rede do Windows Media Player estiver ativo na LAN.</li>
  <li>DiskStation n&atilde;o pode hibernar se um n&uacute;mero de processos em simult&acirc;neo requerer troca, onde a capacidade RAM foi ultrapassada e os HDDs s&atilde;o usados temporariamente para opera&ccedil;&otilde;es de leitura/escrita.</li>
</ul>
<p><strong>Outros</strong></p>
<ul>
  <li>Dispositivos USB: DiskStation n&atilde;o pode entrar em Hiberna&ccedil;&atilde;o de Sistema se algum dispositivo USB estiver ligado &agrave; unidade. </li>
</ul>

</div>

<h2 class="disable-eds14">Suspens&atilde;o Total</h2>
<p class="disable-eds14">Sono profundo para unidades de expans&atilde;o pode ser ativado atrav&eacute;s da interface DiskStation emparelhada. Pode configurar a unidade de expans&atilde;o e o DiskStation emparelhado para inatividade por diferentes per&iacute;odos de tempo. Por isso, pode configurar a unidade de expans&atilde;o para entrar em sono profundo enquanto o DiskStation emparelhado permanece online.</p>
<p class="disable-eds14">Durante o modo sono profundo:</p>
<ul class="disable-eds14">
  <li>Todos os LEDs da unidade de expans&atilde;o estar&atilde;o desligados.</li>
<li>A energia dos discos r&iacute;gidos da unidade de expans&atilde;o desliga-se.</li>
<li>A ventoinha na unidade de expans&atilde;o p&aacute;ra.</li>
</ul>

<div class="section disable-eds14">
<h4>Nota:</h4>
<ul>
<li>Sono profundo termina ap&oacute;s o acesso.</li>
<li>Para garantir o normal funcionamento quando utiliza a fun&ccedil;&atilde;o sono profundo numa unidade de expans&atilde;o, deslize o comutador <b>Auto/Manual</b>, no painel traseiro, para <b>Auto</b>.</li>
</ul>
</div>

<h2>Desligar Autom&aacute;tico</h2>
<p>Pode especificar a dura&ccedil;&atilde;o do per&iacute;odo de tempo em que o disco interno se mant&eacute;m em hiberna&ccedil;&atilde;o antes do seu DiskStation se desligar automaticamente.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Deve ativar primeiro a hiberna&ccedil;&atilde;o da unidade de disco r&iacute;gido (HDD) interno.</li>
<li>Deve ativar primeiro o servi&ccedil;o WOL para poder ligar remotamente o seu DiskStation.</li>
</ul>
</div>

</body>
</html>

