<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>C&oacute;pia de Seguran&ccedil;a de Configura&ccedil;&atilde;o</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>

<body>
<h2>C&oacute;pia de Seguran&ccedil;a de Configura&ccedil;&atilde;o</h2>
<p>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Atualizar e Restaurar</strong> para efetuar imediatamente uma c&oacute;pia de seguran&ccedil;a das configura&ccedil;&otilde;es do sistema para um computador local. Isto permite guardar v&aacute;rias defini&ccedil;&otilde;es (por exemplo, defini&ccedil;&otilde;es de utilizadores, grupos, servi&ccedil;o de ficheiros, etc.) e restaurar as defini&ccedil;&otilde;es mais tarde. As configura&ccedil;&otilde;es do sistema s&atilde;o guardadas como um ficheiro de formato .dss.</p>

<h4>Para efetuar a c&oacute;pia de seguran&ccedil;a das configura&ccedil;&otilde;es do sistema:</h4>
<ol>
<li>Clique em <b>C&oacute;pia de seguran&ccedil;a da configura&ccedil;&atilde;o</b>. </li>
<img src="about:blank" class="help_image"/>
<li>Ser&aacute; transferido um ficheiro de configura&ccedil;&atilde;o para o computador (com o nome <b>[Nome DiskStation]_[Data de Cria&ccedil;&atilde;o].dss</b>).</li>
</ol>

<h4>Para restaurar as configura&ccedil;&otilde;es do sistema:</h4>
<ol>
<li>Clique em <b>Restaurar configura&ccedil;&atilde;o</b>.</li>
<img src="about:blank" class="help_image"/>
<li>Clique em <b>Percorrer</b> e seleccione o ficheiro de configura&ccedil;&atilde;o armazenado no computador.</li>
<li>Assinale as caixas de verifica&ccedil;&atilde;o de configura&ccedil;&otilde;es a restaurar e depois clique em <strong>OK</strong>. Pode tamb&eacute;m assinalar a op&ccedil;&atilde;o <strong>Substituir defini&ccedil;&otilde;es em conflito</strong> para substituir as defini&ccedil;&otilde;es actuais por qualquer selec&ccedil;&atilde;o de utilizadores, grupos, pastas partilhadas e servi&ccedil;os existentes.</li>
<img src="about:blank" class="help_image"/>
<li>Aparece uma mensagem de aviso. Clique em <strong>Sim</strong> para continuar.</li>
<img src="about:blank" class="help_image"/>
<li>Depois de conclu&iacute;da a fun&ccedil;&atilde;o de restauro, aparece uma mensagem. Clique em <strong>OK</strong> para terminar.</li>
<img src="about:blank" class="help_image"/>
</ol>

<div class="section">
<h4>Ser&aacute; efetuada uma c&oacute;pia de seguran&ccedil;a das seguintes configura&ccedil;&otilde;es:</h4>
<ul class="disable-eds14">
<li>Utilizadores, grupos e pastas partilhadas</li>
<li>Grupo de trabalho, dom&iacute;nio e LDAP</li>
<li>Partilha de ficheiros (por ex. Servi&ccedil;o de Ficheiros do Windows, Servi&ccedil;o de Ficheiros Mac, Servi&ccedil;o NFS, FTP, WebDAV e rsync) e Servi&ccedil;o de C&oacute;pia de Seguran&ccedil;a</li>
<li>Outros (por ex., User Home, Defini&ccedil;&otilde;es de Palavra-Passe, e Agendamento de Tarefas)</li>
</ul>

<ul class="enable-eds14">
<li>Utilizadores, grupos e pastas partilhadas</li>
<li>Partilha de ficheiros (por ex. Servi&ccedil;o de Ficheiros do Windows, Servi&ccedil;o de Ficheiros Mac, Servi&ccedil;o NFS, FTP, WebDAV)</li>
<li>Outros (por ex., User Home, Defini&ccedil;&otilde;es de Palavra-Passe, e Agendamento de Tarefas)</li>
</ul>

<h4>Nota:</h4>
<ul class="disable-eds14">
<li><strong>Servi&ccedil;o de c&oacute;pia de seguran&ccedil;a</strong> inclui defini&ccedil;&otilde;es b&aacute;sicas de servi&ccedil;o mas n&atilde;o informa&ccedil;&otilde;es sobre tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>A <strong>Home do Utilizador </strong> inclui defini&ccedil;&otilde;es de servi&ccedil;o b&aacute;sicas e exclui a pasta partilhada <b>homes</b>. Aceda a <b>Hyper Backup</b> para efetuar uma c&oacute;pia de seguran&ccedil;a e restaurar a pasta partilhada <b>homes</b> e os respetivos dados.</li>
<li>O <b>Agendamento de Tarefas</b> inclui tarefas que podem ser criadas no <b>Agendamento de Tarefas</b> e exclui tarefas produzidas por outras aplica&ccedil;&otilde;es (por exemplo, <b>Hyper Backup</b> e <b>Relat&oacute;rio de Utiliza&ccedil;&atilde;o de Disco</b>, et&ccedil;.)</li>
<li>Se os nomes dos utilizadores ou grupos restaurados estiverem reservados apenas para utiliza&ccedil;&atilde;o do sistema, ser&atilde;o restaurados com outros nomes.</li>
</ul>

<ul class="enable-eds14">
<li>A <strong>Home do Utilizador </strong> inclui defini&ccedil;&otilde;es de servi&ccedil;o b&aacute;sicas e exclui a pasta partilhada <b>homes</b>. Aceda a <b>Hyper Backup</b> para efetuar uma c&oacute;pia de seguran&ccedil;a e restaurar a pasta partilhada <b>homes</b> e os respetivos dados.</li>
<li>O <b>Agendamento de Tarefas</b> inclui tarefas que podem ser criadas no <b>Agendamento de Tarefas</b> e exclui tarefas produzidas por outras aplica&ccedil;&otilde;es (por exemplo, <b>Hyper Backup</b> e <b>Relat&oacute;rio de Utiliza&ccedil;&atilde;o de Disco</b>, et&ccedil;.)</li>
<li>Se os nomes dos utilizadores ou grupos restaurados estiverem reservados apenas para utiliza&ccedil;&atilde;o do sistema, ser&atilde;o restaurados com outros nomes.</li>
</ul>

</div>

</body>
</html>
