<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SNMP</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SNMP</h2>

<p>O servi&ccedil;o SNMP (em <strong>Painel de Controlo</strong> &gt; <strong>Terminal e SNMP</strong> &gt; <strong>SNMP</strong>) permite que os utilizadores monitorizem o DiskStation com o software de gest&atilde;o de rede. Atualmente, s&atilde;o suportados os protocolos SNMPv1, SNMPv2c e SNMPv3. </p>


<h3>Ativar o Servi&ccedil;o SNMP</h3>

<p>Assinale <b>Ativar servi&ccedil;o SNMP</b> e siga os passos em baixo.</p>
<h4>Para ativar o servi&ccedil;o SNMPv1, SNMPv2c:</h4>
<ol>
<li>Assinale o <b>Servi&ccedil;o SNMPv1, SNMPv2c</b>.<li>Introduza um nome da <b>Comunidade</b>.<li>Clique em <b>Aplicar.</b></ol>
<h4>Para ativar o servi&ccedil;o SNMPv3:</h4>
<ol>
<li>Assinale o <b>Servi&ccedil;o SNMPv3</b>.<li>Introduza um <b>Nome de Utilizador</b> e uma <b>Palavra-passe</b>. Introduza a sua palavra-passe novamente para <b>Confirmar palavra-passe</b>.<li>Clique em <b>Aplicar</b>.</ol>
<p>Al&eacute;m disso, introduzir <b>Nome</b>, <b>Localiza&ccedil;&atilde;o</b> e <b>Contacto</b> ajud&aacute;-lo-&aacute; a identificar o seu DiskStation. Estes campos s&atilde;o opcionais.</p>


<div class="section">
<h4>Nota:</h4>
<ol>
<li>IPv4 e IPv6 s&atilde;o suportados pelo servi&ccedil;o SNMP. </li>
<li>O servi&ccedil;o SNMP suporta SNMPv1, SNMPv2c e SNMPv3 simultaneamente. </li>
</ol>
</div>


<div class="section">
<h4>Limite de comunidade SNMPv1, SNMPv2c:</h4>
<p>O nome da comunidade deve conter entre 1 e 64 caracteres visualiz&aacute;veis. Os seguintes n&atilde;o s&atilde;o permitidos: <br>&quot; &apos; \ e espa&ccedil;o.</p>
<h4>Limite de nome de utilizador SNMPv3:</h4>
<p>O nome de utilizador deve conter entre 1 e 64 caracteres visualiz&aacute;veis. Os seguintes n&atilde;o s&atilde;o permitidos: <br>&quot; &apos; \ e espa&ccedil;o.</p>
<h4>Limite de palavra-passe SNMPv3:</h4>
<p>A palavra-passe &eacute; sens&iacute;vel a mai&uacute;sculas e min&uacute;sculas e deve conter entre 8 e 127 caracteres visualiz&aacute;veis, incluindo letras, n&uacute;meros e sinais. Os seguintes n&atilde;o s&atilde;o permitidos: <br>&quot; &apos; \ e espa&ccedil;o.</p>
<p>&nbsp;</p>
</div>
<h3>Transferir Ficheiros Synology MIB</h3>
<p class="disable-eds14">A Synology permite monitorizar o DiskStation atrav&eacute;s de sistemas de gest&atilde;o de rede, incluindo sistema, disco e o estado de volumes RAID.</p>

<p class="enable-eds14">A Synology permite monitorizar o DiskStation atrav&eacute;s de sistemas de gest&atilde;o de rede, incluindo sistema, disco e o estado de volumes.</p>

<p>Visite o <a href="http://www.synology.com/support/snmp_mib" target="_blank">website da Synology</a> para obter mais informa&ccedil;&otilde;es e para transferir ficheiros associados.</p>

<div class="section">
<h4>Nota:</h4>
<p>Os sistemas de gest&atilde;o de rede baseiam-se em ficheiros MIB para defini&ccedil;&otilde;es dos dispositivos monitorizados. Para mais informa&ccedil;&otilde;es, visite: <a href="http://en.wikipedia.org/wiki/Management_information_base" target="_blank">aqui</a>.</p>
</div>

</body>
</html>
