<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Dispositivos Externos</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>USBCopy</h2>

<p>Pode selecionar uma pasta de destino para a fun&ccedil;&atilde;o USBCopy, acedendo a <strong>Painel de Controlo</strong> &gt; <strong>Dispositivos Externos</strong> &gt; <strong>USBCopy/SDCopy</strong>.</p>

<h4>Para ativar a USBCopy:</h4>
<ol>
<li>
Assinale a caixa de verifica&ccedil;&atilde;o <b>Ativar USBCopy</b>.
</li>
<li>
Selecione uma pasta partilhada de destino no menu pendente.
</li>
</ol>

<p>Quando liga um dispositivo USB (por exemplo, uma c&acirc;mara digital) &agrave; porta USB no painel frontal do produto Synology, pode premir o bot&atilde;o (Copy) Copiar no painel frontal para copiar os dados do dispositivo USB para a pasta partilhada de destino atribu&iacute;da aqui. Se a pasta de destino USBCopy for apagada, o sistema ir&aacute; substitu&iacute;-la automaticamente pela pasta partilhada p&uacute;blica.</p>

<div class="section">
<h4>Restri&ccedil;&otilde;es</h4>
<ol>

<li>Apenas s&atilde;o suportados dispositivos USB nos formatos FAT, NTFS, ext3 e ext4.</li>

<li>Os dispositivos USB devem ser ligados &agrave; porta USB no painel frontal do dispositivo DiskStation.</li>
<li>Apenas o <strong>admin</strong> ou utilizadores no grupo <strong>administrators</strong> disp&otilde;em dos privil&eacute;gios de acesso adequados para realizarem tarefas de c&oacute;pia de seguran&ccedil;a para dispositivos USB.</li>
<li>O espa&ccedil;o dispon&iacute;vel na pasta partilhada de destino deve ser superior ao espa&ccedil;o utilizado do dispositivo USB.</li></ol>
</div>

<h2>SDCopy*</h2>

<p>Pode selecionar uma pasta de destino para a fun&ccedil;&atilde;o SDCopy, acedendo a <strong>Painel de Controlo</strong> &gt; <strong>Dispositivos Externos</strong> &gt; <strong>USBCopy/SDCopy</strong>.</p>


<h4>Para ativar a SDCopy:</h4>
<ol>
	<li>
	Assinale a caixa de verifica&ccedil;&atilde;o <b>Ativar SDCopy</b>.
	</li>
	<li>
	Selecione uma pasta partilhada de destino no menu pendente.
	</li>
</ol>

<p>Quando liga um dispositivo SD na ranhura SD do painel frontal do produto Synology, pode premir o bot&atilde;o Copy (Copiar) no painel frontal para copiar os dados no dispositivo SD para a pasta partilhada de destino designada aqui. Se a pasta de destino SDCopy for apagada, o sistema ir&aacute; substitu&iacute;-la automaticamente pela pasta partilhada p&uacute;blica.</p>

<div class="section">
<h4>Restri&ccedil;&otilde;es</h4>
<ol>

	<li>Apenas s&atilde;o suportados dispositivos SD nos formatos FAT, NTFS, ext3 e ext4.</li>

	<li>Os dispositivos SD devem ser encaixados na ranhura SD no painel frontal do produto Synology.</li>
    <li> Apenas o <strong>admin</strong> ou utilizadores no grupo <strong>administrators</strong> disp&otilde;em dos privil&eacute;gios de acesso adequados para realizarem tarefas de c&oacute;pia de seguran&ccedil;a para dispositivos SD.</li>
	<li>O espa&ccedil;o dispon&iacute;vel na pasta partilhada de destino deve ser superior ao espa&ccedil;o utilizado do dispositivo SD.</li></ol>
</div>

<p>____<br> * Apenas dispon&iacute;vel em modelos espec&iacute;ficos. </p>
</body>
</html>
