<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Agendamento de Tarefas</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Agendamento de Tarefas</h1>
<p>O Agendamento de Tarefas permite-lhe agendar e executar servi&ccedil;os ou scripts a horas predefinidas.</p>
<h2>Tarefas suportadas</h2>
<p>As tarefas podem ser criadas para fazer o seguinte:</p>
<ul class="disable-eds14">
<li><strong>Script definido pelo utilizador:</strong> Execute scripts ou comandos definidos pelo utilizador.</li>
<li><strong>Reciclagem:</strong> Esvazie a Reciclagem de pastas partilhadas espec&iacute;ficas. Al&eacute;m disso, as defini&ccedil;&otilde;es de <strong>Pol&iacute;tica de Reten&ccedil;&atilde;o</strong> permitem controlar quais os ficheiros que s&atilde;o eliminados de forma permanente quando esvazia a Reciclagem. Por exemplo, os ficheiros podem ser eliminados ou mantidos de acordo com o tamanho, a hora da elimina&ccedil;&atilde;o ou o formato do ficheiro.</li>
<li><strong>Controlo de Sinal Sonoro:</strong> DiskStation emite um sinal sonoro.</li> 
<li><strong>Servi&ccedil;o:</strong> Inicia ou p&aacute;ra os servi&ccedil;os de rede, tais como, Servi&ccedil;o de Ficheiros Windows, FTP, Bloqueio Autom&aacute;tico, etc.</li>
</ul>


<ul class="enable-eds14">
<li><strong>Script definido pelo utilizador:</strong> Execute scripts ou comandos definidos pelo utilizador.</li>
<li><strong>Reciclagem:</strong> Esvazie a Reciclagem de pastas partilhadas espec&iacute;ficas. Al&eacute;m disso, as defini&ccedil;&otilde;es de <strong>Pol&iacute;tica de Reten&ccedil;&atilde;o</strong> permitem controlar quais os ficheiros que s&atilde;o eliminados de forma permanente quando esvazia a Reciclagem. Por exemplo, os ficheiros podem ser eliminados ou mantidos de acordo com o tamanho, a hora da elimina&ccedil;&atilde;o ou o formato do ficheiro.</li>
<li><strong>Servi&ccedil;o:</strong> Inicia ou p&aacute;ra os servi&ccedil;os de rede, tais como, Servi&ccedil;o de Ficheiros Windows, FTP, Bloqueio Autom&aacute;tico, etc.</li>
</ul>


<h2>Gerir Tarefas</h2>
<p>A p&aacute;gina principal do Agendamento de Tarefas apresenta todas as tarefas existentes e op&ccedil;&otilde;es para criar, editar ou executar tarefas.</p>

<h4>Para criar uma tarefa agendada:</h4>
<p>Tarefas agendadas s&atilde;o tarefas que s&atilde;o executadas numa data, hora ou intervalo espec&iacute;ficos.</p>

<ol>
<li>Aceda ao <strong>Painel de Controlo</strong> &gt; <strong>Agendamento de Tarefas</strong>, clique em <strong>Criar</strong>, e selecione <strong>Tarefa agendada</strong>.</li>
<li>Selecione o tipo desejado das tarefas a agendar: <strong>Script definido pelo utilizador</strong>, <strong>Reciclagem</strong>, <strong>Controlo de Aviso Sonoro</strong>, ou <strong>Servi&ccedil;o</strong>.</li>
<li>Quando &eacute; exibida a janela <strong>Criar tarefa</strong>, clique em <strong>Geral</strong> e modifique as seguintes defini&ccedil;&otilde;es:
<ul>
<li><strong>Defini&ccedil;&otilde;es Gerais:</strong> Introduza um nome de tarefa, selecione um utilizador para quem ser&aacute; executada a tarefa, e ative ou desative a tarefa. </li>
</ul>
</li>
<li>Clique em <strong>Agendamento</strong>, e modifique as seguintes defini&ccedil;&otilde;es:
<ul>
<li><strong>Data:</strong> Especifique quando executar a tarefa. As tarefas podem ser agendadas para execu&ccedil;&atilde;o em determinados dias da semana (por exemplo, diariamente, aos fins-de-semana ou a cada Domingo, etc.) ou em datas espec&iacute;ficas (por exemplo, 21/10/2015).</li>
<li><strong>Vezes:</strong> Especifique quantas vezes a tarefa &eacute; executada cada dia, bem como a primeira e &uacute;ltima execu&ccedil;&atilde;o.</li>
</ul>
</li>
<li>Clique em <strong>Defini&ccedil;&otilde;es de Tarefa</strong> para ordenar defini&ccedil;&otilde;es espec&iacute;ficas de tarefas (apenas para certas tarefas).
<ul>
<li>Para receber detalhes de execu&ccedil;&atilde;o da tarefa, selecione <strong>Enviar detalhes de execu&ccedil;&atilde;o por email</strong>.</li>
<li>Para ser apenas notificado quando ocorrerem anormalidades, selecione <strong>Enviar detalhes de execu&ccedil;&atilde;o apenas quando o script terminar de forma anormal</strong>.</li>
<li>Para personalizar o conte&uacute;do da tarefa, entre no script em <strong>Script definido pelo utilizador</strong>.</li>
<li>Se tiver selecionado <strong>Reciclagem</strong> ou <strong>Servi&ccedil;o</strong> no Passo 2, pode decidir como e quando a Reciclagem &eacute; limpa, ou que servi&ccedil;o iniciar/interromper.</li>
</ul>
</li>
<li>Clique em <strong>OK</strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>



<h4>Para criar uma tarefa acionada:</h4>
<p>Tarefas acionadas s&atilde;o tarefas que s&atilde;o executadas antes/depois da conclus&atilde;o de eventos espec&iacute;ficos.</p>

<ol>
<li>Aceda ao <strong>Painel de Controlo</strong> &gt; <strong>Agendamento de Tarefas</strong>, clique em <strong>Criar</strong>, e selecione <strong>Tarefa Acionada</strong>.</li>
<li>Selecione <strong>Script definido pelo utilizador</strong>.</li>
<li>Quando &eacute; exibida a janela <strong>Criar tarefa</strong>, clique em <strong>Geral</strong> e modifique as seguintes defini&ccedil;&otilde;es:
<ul>
<li><strong>Defini&ccedil;&otilde;es Gerais:</strong> Introduza um nome de tarefa, selecione um utilizador para quem ser&aacute; executada a tarefa, selecione um evento/pr&eacute;-tarefa que aciona a tarefa, e ative ou desative a tarefa. </li>
</ul>
</li>
<li>Clique em <strong>Defini&ccedil;&otilde;es de Tarefa</strong> para ordenar defini&ccedil;&otilde;es espec&iacute;ficas de tarefas (apenas para certas tarefas).
<ul>
<li>Para receber detalhes de execu&ccedil;&atilde;o da tarefa, selecione <strong>Enviar detalhes de execu&ccedil;&atilde;o por email</strong>.</li>
<li>Para ser apenas notificado quando ocorrerem anormalidades, selecione <strong>Enviar detalhes de execu&ccedil;&atilde;o apenas quando o script terminar de forma anormal</strong>.</li>
<li>Para personalizar o conte&uacute;do da tarefa, entre no script em <strong>Script definido pelo utilizador</strong>.</li>
</ul>
</li>
<li>Clique em <strong>OK</strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Quando criar uma tarefa acionada, poder&aacute; ter de especificar a(s) pr&eacute;-tarefa(s). A tarefa criada apenas ser&aacute; executada depois de conclu&iacute;da a pr&eacute;-tarefa.</li>
<li>Depois de ativar <strong>Enviar detalhes de execu&ccedil;&atilde;o apenas quando o script termina anormalmente</strong>, o sistema n&atilde;o ir&aacute; apresentar detalhes se terminar com 0.</li>
</ul>
</div>

<h4>Para editar as defini&ccedil;&otilde;es de tarefa:</h4>
<ol>
<li>Selecione uma tarefa existente.</li>
<li>Clique em <strong>Editar</strong>.</li>
<li>Aparece uma janela onde pode modificar as defini&ccedil;&otilde;es da tarefa.</li>
</ol>
<h4>Para eliminar uma tarefa:</h4>
<ol>
<li>Selecione uma tarefa existente.</li>
<li>Clique em <strong>A&ccedil;&atilde;o</strong> &gt; <strong>Eliminar</strong>.</li>
</ol>

<h4>Para ativar ou desativar uma tarefa:</h4>
<ol>
<li>Na p&aacute;gina principal do <strong>Agendamento de Tarefas</strong>, assinale ou desmarque a caixa de verifica&ccedil;&atilde;o adequada em <strong>Ativado</strong> para ativar ou desativar uma tarefa.</li>
<li>Clique em <strong>Guardar</strong>.</li>
</ol>


<h4>Para executar manualmente uma tarefa:</h4>
<ol>
<li>Selecione uma ou mais tarefas existentes.</li>
<li>Clique em <strong>Executar</strong>.</li>
</ol>

<div class="section">
<h4>Limita&ccedil;&otilde;es do Agendamento de Tarefas:</h4>
<ul class="disable-eds14">
<li>Os nomes de tarefas podem incluir 512 caracteres vis&iacute;veis.</li>
<li>N&uacute;mero m&aacute;ximo de tarefas: 1024.</li>
<li>Comprimento m&aacute;ximo do caminho do script ou da linha de comandos: 4095.</li>
<li>A dura&ccedil;&atilde;o do sinal sonoro pode ser de 1 a 600 segundos.</li>
</ul>


<ul class="enable-eds14">
<li>Os nomes de tarefas podem incluir 512 caracteres vis&iacute;veis.</li>
<li>N&uacute;mero m&aacute;ximo de tarefas: 1024.</li>
<li>Comprimento m&aacute;ximo do caminho do script ou da linha de comandos: 4095.</li>
</ul>

</div>

</body> </html>
