<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Energia</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>



<h2>UPS</h2>

<p class="disable-eds14">Uma UPS (Fonte de Alimenta&ccedil;&atilde;o Ininterrupta) &eacute; um dispositivo de energia de recurso que permite &agrave; DiskStation continuar a funcionar por mais algum tempo caso ocorra uma falha de energia. Esta fun&ccedil;&atilde;o, em <strong>Painel de Controlo</strong> &gt; <strong>Hardware e Energia</strong> &gt; <strong>UPS</strong>, ajuda a evitar perdas de dados, dando ao DiskStation tempo suficiente para poupar dados e desmontar volumes antes de perder energia e encerrar.</p>

<p class="enable-eds14">Uma UPS (Fonte de Alimenta&ccedil;&atilde;o Ininterrupta) &eacute; um dispositivo de energia de recurso que permite &agrave; DiskStation continuar a funcionar por mais algum tempo caso ocorra uma falha de energia. Esta fun&ccedil;&atilde;o, em <strong>Painel de Controlo</strong> &gt; <strong>Hardware e Energia</strong> &gt; <strong>UPS</strong>, ajuda a evitar perdas de dados, dando ao DiskStation tempo suficiente para poupar dados e desmontar volumes antes de perder energia e desligar.</p>

<div class="section">
<h4>Modo de Seguran&ccedil;a</h4>
<p class="disable-eds14">Quando o DiskStation entra no Modo de Seguran&ccedil;a, p&aacute;ra todos os servi&ccedil;os e desmonta volumes para evitar perda de dados e encerrar com seguran&ccedil;a quando o dispositivo UPS fica sem energia. Por predefini&ccedil;&atilde;o, o sistema entra no Modo de Seguran&ccedil;a quando o dispositivo UPS come&ccedil;a a ficar sem energia. Pode tamb&eacute;m especificar o tempo at&eacute; o DiskStation entrar no Modo de Seguran&ccedil;a quando ocorre uma falha de energia. No entanto, se o dispositivo UPS ficar com bateria fraca antes do tempo especificado, o sistema entra de imediato no Modo de Seguran&ccedil;a.</p>

<p class="enable-eds14">Quando o DiskStation entra no Modo de Seguran&ccedil;a, p&aacute;ra todos os servi&ccedil;os e desmonta volumes para evitar perda de dados e desliga com seguran&ccedil;a quando o dispositivo UPS fica sem energia. Por predefini&ccedil;&atilde;o, o sistema entra no Modo de Seguran&ccedil;a quando o dispositivo UPS come&ccedil;a a ficar sem energia. Pode tamb&eacute;m especificar o tempo at&eacute; o DiskStation entrar no Modo de Seguran&ccedil;a quando ocorre uma falha de energia. No entanto, se o dispositivo UPS ficar com bateria fraca antes do tempo especificado, o sistema entra de imediato no Modo de Seguran&ccedil;a.</p>


<p></p>
<p class="disable-eds14">Em situa&ccedil;&otilde;es em que o DiskStation &eacute; encerrado durante o Modo de Seguran&ccedil;a, ser&aacute; ligado automaticamente quando a energia &eacute; restaurada se tiver ativado a op&ccedil;&atilde;o <strong>Reiniciar automaticamente ap&oacute;s uma quebra de energia</strong> (localizada em <strong>Painel de Controlo</strong> &gt; <strong>Hardware e Energia</strong> &gt; <strong>Geral</strong>).</p>

<p></p>
</div>




<h3>Suporte UPS Local</h3>

<p>Para detalhes referentes &agrave; instala&ccedil;&atilde;o do hardware, consulte o manual de utilizador do seu dispositivo UPS. Uma vez conclu&iacute;da a instala&ccedil;&atilde;o e ligado o DiskStation ao dispositivo UPS, pode seguir os passos abaixo para ativar o suporte UPS.</p>
<h4>Para ativar o suporte UPS local:</h4>
<OL>
<li>Ligue o dispositivo UPS a uma porta USB no DiskStation.</li>
<LI>No separador <strong>UPS</strong>, assinale a caixa de verifica&ccedil;&atilde;o <b>Ativar o suporte UPS</b>.</LI>
<LI>Selecione quando o DiskStation dever&aacute; entrar no Modo de Seguran&ccedil;a quando ocorre uma falha de energia.</LI>
<LI>Escolha entre enviar ou n&atilde;o um sinal para encerrar para a UPS quando o sistema entrar em Modo de Seguran&ccedil;a. Quase todos os dispositivos UPS podem ser ligados automaticamente quando &eacute; reposta a energia.</LI>
<LI>Clique em <b>Aplicar</b>.</LI>
</OL>

<h3>Suporte UPS SNMP</h3>

<p>O seu DiskStation suporta tamb&eacute;m a liga&ccedil;&atilde;o a dispositivos UPS SNMP (Protocolo de Gest&atilde;o de Rede Simples). Para detalhes referentes &agrave; instala&ccedil;&atilde;o do hardware, consulte o manual de utilizador do seu dispositivo UPS SNMP. Uma vez conclu&iacute;da a instala&ccedil;&atilde;o e ligado o DiskStation ao dispositivo e &agrave; mesma rede, pode seguir os passos abaixo para ativar o suporte UPS.</p>
<h4>Para ativar o suporte UPS SNMP:</h4>
<ol>
<LI>No separador <strong>UPS</strong>, assinale a caixa de verifica&ccedil;&atilde;o <b>Ativar o suporte UPS</b>.</LI>
<li>Selecione <strong>UPS SNMP</strong> no menu pendente <strong>Tipo de UPS de rede</strong>.</li>
<li>No campo <strong>Endere&ccedil;o IP de UPS SNMP</strong>, introduza o endere&ccedil;o IP do dispositivo UPS SNMP.</li>
<LI>Selecione quando o DiskStation dever&aacute; entrar no Modo de Seguran&ccedil;a quando ocorre uma falha de energia.</LI>
<li>Introduza a linha de comunidade para o dispositivo UPS SNMP no campo <strong>Comunidade SNMP</strong>.</li>
<LI>Clique em <b>Aplicar</b>.</LI>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Recomendamos vivamente que use <b>SNMP UPS</b> para implementa&ccedil;&otilde;es Synology High Availability (SHA).</li>
<li>O DiskStation suporta dispositivos UPS SNMPv1 e SNMPv2c.</li>
</ul>
</div>


<h3>Suporte UPS de Rede</h3>

<p>Se existirem dois produtos Synology a utilizar um dispositivo UPS com uma s&oacute; porta USB, ent&atilde;o apenas uma DiskStation pode obter informa&ccedil;&otilde;es relativamente ao estado do dispositivo UPS. Neste caso, um DiskStation pode funcionar como &quot;servidor UPS de rede&quot; e ligar ao dispositivo UPS por USB ou rede (dependendo do dispositivo). O servidor UPS de rede obt&eacute;m informa&ccedil;&otilde;es UPS e transmite-as para o outro DiskStation &quot;cliente&quot;.</p>
<h4>Para ativar o suporte UPS de rede:</h4>
<OL>
<li>Inicie a sess&atilde;o no DiskStation que est&aacute; ligado ao dispositivo UPS (atrav&eacute;s de USB ou rede). Se o suporte UPS local ainda n&atilde;o estiver ativado neste DiskStation, veja a sec&ccedil;&atilde;o acima.</li>
<LI>No separador <strong>UPS</strong>, assinale a caixa <strong>Ativar servidor UPS de rede</strong> para permitir ao DiskStation transmitir informa&ccedil;&otilde;es UPS para o DiskStation cliente.</li>
<li>Clique no bot&atilde;o <strong>Dispositivos DiskStation permitidos</strong>.</li>
<li>Na janela que aparece, introduza os endere&ccedil;os IP do outro DiskStation que est&aacute; a utilizar o dispositivo UPS, mas n&atilde;o est&aacute; ligado por USB ou rede. Clique em <strong>OK</strong>.</li>
<li>Clique em <strong>Aplicar</strong> para guardar as defini&ccedil;&otilde;es.</li>
</OL>
<p>Agora o servidor UPS de rede pode obter informa&ccedil;&otilde;es UPS e transmiti-las para o outro DiskStation que est&aacute; a utilizar o dispositivo UPS. Consulte as instru&ccedil;&otilde;es abaixo para ativar o suporte UPS no outro DiskStation.</p>
<h4>Para ativar o suporte UPS no DiskStation cliente:</h4>
<ol>
<li>Inicie sess&atilde;o no outro DiskStation que est&aacute; a utilizar o dispositivo UPS mas n&atilde;o est&aacute; ligado atrav&eacute;s de USB ou rede.</li>
<li>No separador <strong>UPS</strong>, assinale a caixa <strong>Ativar o suporte UPS</strong>.</li>
<li>Selecione <strong>Servidor UPS Synology</strong> no menu pendente <strong>Tipo de UPS de rede</strong>.</li>
<li>Introduza o endere&ccedil;o IP do servidor UPS de rede (ou seja, o DiskStation ligado ao dispositivo UPS) no campo <strong>IP de servidor UPS de Rede</strong>.</li>
<LI>Selecione quando o DiskStation dever&aacute; entrar no Modo de Seguran&ccedil;a quando ocorre uma falha de energia. Para simplificar as defini&ccedil;&otilde;es do Modo de Seguran&ccedil;a, pode selecionar <strong>Como o servidor</strong>.</LI>
<LI>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</LI>
</OL>
<div class="section">
<h4>Requisitos de UPS de Rede:</h4>
<UL>
<LI>Para retransmitir as informa&ccedil;&otilde;es do dispositivo UPS, cada DiskStation dever&aacute; estar ligado &agrave; mesma rede.</LI>
<LI>O dispositivo de rede (por exemplo, um switch ou hub) ao qual cada DiskStation est&aacute; ligado, dever&aacute; estar ligado ao mesmo dispositivo UPS. Caso contr&aacute;rio, o DiskStation n&atilde;o conseguir&aacute; retransmitir informa&ccedil;&otilde;es do dispositivo UPS quando ocorre uma falha de energia.</LI>
</UL>
</div>
</body>
</html>
