<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Energia</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Geral</h2>

<p>
<strong>Painel de Controlo</strong> &gt; <strong>Hardware e Energia</strong> &gt; <strong>Geral</strong> fornecem op&ccedil;&otilde;es para activar a recupera&ccedil;&atilde;o de energia, Reactiva&ccedil;&atilde;o por LAN (WOL) e Compress&atilde;o de Mem&oacute;ria. Pode tamb&eacute;m modificar o controlo de sinal sonoro e o modo de velocidade da ventoinha aqui.
</p>

<h3>
Recupera&ccedil;&atilde;o de Energia
</h3>
<p>Se o sistema for encerrado devido a uma falha inesperada de energia, a fun&ccedil;&atilde;o de recupera&ccedil;&atilde;o de energia permite que o sistema arranque automaticamente assim que for restaurada a energia.</p>
<h3>Reactiva&ccedil;&atilde;o por LAN*</h3>
<p>A activa&ccedil;&atilde;o de Reactiva&ccedil;&atilde;o por LAN (WOL) permite que ligue DiskStation na rede de &aacute;rea local ou na Internet introduzindo o endere&ccedil;o IP (ou nome de anfitri&atilde;o DDNS) e o endere&ccedil;o MAC de DiskStation utilizando uma aplica&ccedil;&atilde;o WOL, como o Synology Assistant, DS finder ou quaisquer outras aplica&ccedil;&otilde;es WOL.</p>
<p>A Reactiva&ccedil;&atilde;o por LAN funciona apenas ap&oacute;s o encerramento correcto de DiskStation premindo o bot&atilde;o f&iacute;sico <b>Energia</b> ou clicando em <b>Encerrar</b> na interface do DSM. Mantenha o cabo de alimenta&ccedil;&atilde;o ligado a uma tomada de corrente que funcione ap&oacute;s o encerramento.</p>
<div class="section">
	<h4>Nota:</h4>
	<p class="disable-rc18015xsp">A funcionalidade WOL n&atilde;o &eacute; suportada em portas LAN de 10GbE (caso estejam dispon&iacute;veis no seu DiskStation).</p>
	<ul class="enable-rc18015xsp">
		<li>A funcionalidade WOL n&atilde;o &eacute; suportada em portas LAN de 10GbE (caso estejam dispon&iacute;veis no seu DiskStation).</li>
		<li>A funcionalidade WOL est&aacute; activada por predefini&ccedil;&atilde;o nas portas 1GbE para DiskStation, e n&atilde;o pode ser desactivada.</li>
	</ul>
</div>
<h3>Modo da Velocidade da Ventoinha*</h3>
<p>Encontram-se dispon&iacute;veis as seguintes op&ccedil;&otilde;es de velocidade da ventoinha:</p>
<ul>
<li><strong>Modo Frio:</strong> A ventoinha funciona a elevada velocidade, mantendo mais fresco o DiskStation, mas produzindo mais ru&iacute;do.</li>
<li><strong>Modo Silencioso:</strong> A ventoinha funciona a uma velocidade inferior, produzindo menos ru&iacute;do, mas DiskStation poder&aacute; ficar mais quente.</li>
<li><strong>Baixo consumo:</strong> A ventoinha funciona a uma velocidade inferior, produzindo menos ru&iacute;do, mas DiskStation poder&aacute; ficar mais quente. Para al&eacute;m disso, quando DiskStation est&aacute; fresco, a ventoinha p&aacute;ra, para poupar energia. O modo de baixo consumo est&aacute; apenas dispon&iacute;vel em determinados modelos.</li>
</ul>
<h3>Controlo de Sinal Sonoro</h3>
<p>O DiskStation pode emitir um sinal sonoro quando ocorrerem determinados eventos ou erros. Clique nas caixas de verifica&ccedil;&atilde;o dos eventos listados para permitir que DiskStation avise o utilizador quando ocorrerem erros.</p>

<h4>Para parar o sinal sonoro:</h4>
<ul>
<li>Se o DiskStation estiver a emitir um sinal sonoro, clique no bot&atilde;o <strong>Desligar sinal sonoro</strong> para desactiv&aacute;-lo. </li>
</ul>



<h3>Compress&atilde;o de Mem&oacute;ria*</h3>
<p>Pode activar a Compress&atilde;o de Mem&oacute;ria para melhorar a capacidade de resposta geral do sistema com carga atrav&eacute;s da compress&atilde;o dos dados menos utilizados recentemente na mem&oacute;ria.</p>
<p>Quando tem v&aacute;rias aplica&ccedil;&otilde;es em execu&ccedil;&atilde;o e a mem&oacute;ria come&ccedil;a a ficar cheia, a Compress&atilde;o de Mem&oacute;ria din&acirc;mica reduz o tamanho de itens pouco utilizados na mem&oacute;ria, minimizando a utiliza&ccedil;&atilde;o da mem&oacute;ria. Quando &eacute; necess&aacute;rio utilizar novamente os itens, estes podem ser descomprimidos de imediato. Isto reduz a necessidade de ler e escrever ficheiros de troca da mem&oacute;ria no disco, melhorando a efici&ecirc;ncia e a capacidade de resposta.</p>
<p>Para activar a Compress&atilde;o de Mem&oacute;ria, basta assinalar a caixa de verifica&ccedil;&atilde;o.</p>

<h3>LED*</h3>

<p>Em <strong>Painel de Controlo</strong> > <strong>Hardware & Energia</strong> > <strong>Geral</strong> > <strong>Controlo de luminosidade LED</strong>, pode ajustar o luminosidade dos indicadores LED do seu DiskStation.</p>

<div class="section">
<h4>Nota:</h4>
<p>As definições de luminosidade são aplicadas a todos os indicadores LED no seu DiskStation (ou sejam energia, ESTADO, LAN, estado da unidade e por aí adiante).</p>
</div>


<h4>Para ajustar a luminosidade da LED:</h4>
<p>Há quatro níveis de luminosidade agora disponível para indicadores LED no seu DiskStation.</p>
<ol>
<li>Clique e arraste o ponteiro da escala de luminosidade em qualquer direção:
  <ul>
<li>Para a direita: Aumenta a luminosidade da LED.</li>
<li>Para a esquerda: Reduz a luminosidade da LED.</li>
</ul>
</li>
<li>Clique em <strong>Aplicar</strong> para guardar as definições.</li>
</ol>



<h4>Para ajustar a luminosidade da LED por agendamento:</h4>
<p>Os indicadores LED podem alterar o seu nível de luminosidade à hora agendada.</p>

<ol>
<li>Clique em <strong>Definir agendamento</strong>.</li>
<li>Clique em qualquer tipo de luminosidade em baixo:
<ul>
<li><strong>Luminosidade predefinida</strong>: A luminosidade máxima</li>
<li><strong>Luminosidade ajustada</strong>: O nível de luminosidade especificado na escala de luminosidade</li>
</ul>
</li>
<li>Clique nos períodos pretendidos para personalizar o seu agendamento de luminosidade.</li>
<li>Clique em <strong>OK</strong> e <strong>Aplicar</strong> para guardar as definições.</li>
</ol>



<p>____<br> * Apenas dispon&iacute;vel em modelos espec&iacute;ficos. </p>
</body>
</html>
