<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2>Configurar o Centro de Pacotes</h2>
<h4>Para gerir quais os pacotes com permiss&atilde;o para serem instalados:</h4>
<ol>
<li>No separador <strong>Geral</strong>, escolha entre as seguintes op&ccedil;&otilde;es para definir o seu <strong>N&iacute;vel de Confian&ccedil;a</strong> desejado:</li>
<ul>
<li><strong>Synology Inc.</strong>: Permitir apenas a instala&ccedil;&atilde;o de pacotes publicados pela Synology Inc.</li>
<li><strong>Synology Inc. e editores de confian&ccedil;a</strong>: Permitir apenas a instala&ccedil;&atilde;o de pacotes publicados pela Synology Inc. e editores de confian&ccedil;a. Editores de confian&ccedil;a s&atilde;o os editores que obtiveram a confian&ccedil;a de comunidades terceiras atrav&eacute;s da adi&ccedil;&atilde;o de origens de pacotes ou que disp&otilde;em da confian&ccedil;a do utilizador atrav&eacute;s da importa&ccedil;&atilde;o do certificado do editor.</li>
<li><strong>Qualquer editor</strong>: Permitir a instala&ccedil;&atilde;o de qualquer pacote, independentemente da integridade e do editor.</li>
</ul>
<li>Clique em <strong>OK</strong>.</li>
</ol>

<h4>Para importar o certificado de um editor de confian&ccedil;a:</h4>
<ol>
<li>No separador <strong>Certificado</strong>, clique em <b>Importar</b>. </li>
<li>Clique em <strong>Pesquisar</strong> e selecione o certificado do editor de confian&ccedil;a.</li>
<li>Clique em <strong>OK</strong>. </li>
</ol>

<h4>Para atualizar o certificado da Synology Inc.:</h4>
<p>Quando estiver ligado &agrave; Internet, o certificado da Synology Inc. ser&aacute; automaticamente atualizado durante o processo de instala&ccedil;&atilde;o do pacote. Para atualizar manualmente:</p>
<ol>
<li>No separador <strong>Certificado</strong>, clique em <b>Importar</b>. </li>
<li>Clique em <strong>Pesquisar</strong> e selecione o certificado da Synology Inc., que pode ser transferido atrav&eacute;s do <a href="http://www.synology.com/support/download" target="_blank">website da Synology</a>.</li>
<li>Clique em <strong>OK</strong>. </li>
</ol>
<h4>Para ativar as notifica&ccedil;&otilde;es acerca das atualiza&ccedil;&otilde;es do pacote:</h4>
<ol>
<li>Clique no separador <b>Notifica&ccedil;&atilde;o</b> e depois marque <b>Ativar notifica&ccedil;&atilde;o por e-mail</b> e/ou <b>Ativar notifica&ccedil;&otilde;es no ambiente de trabalho</b>. A primeira op&ccedil;&atilde;o permite que o DSM lhe envie e-mails quando estiverem dispon&iacute;veis novas atualiza&ccedil;&otilde;es e a segunda permite que o DSM exiba uma mensagem de notifica&ccedil;&atilde;o no canto superior direito do ambiente de trabalho do seu DSM.</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<p>Para que as notifica&ccedil;&otilde;es por e-mail produzam efeito, configure primeiro as defini&ccedil;&otilde;es de notifica&ccedil;&atilde;o por e-mail do seu DSM (em <b>Menu Principal</b> &gt; <b>Painel de Controlo</b> &gt; <b>Notifica&ccedil;&atilde;o</b>).</p></div>

<h4>Para adicionar um recurso de pacote fornecido por uma comunidade terceira:</h4>
<ol>
<li>Clique no separador <b>Origens de Pacotes</b>, clique em <strong>Adicionar</strong> e introduza o nome e localiza&ccedil;&atilde;o das origens dos pacotes. <br>A localiza&ccedil;&atilde;o pode ser um URL que encontrou na Internet fornecido por um autor/editor ou uma comunidade terceira.</li>
<li>Clique em <b>OK</b>. Quando a origem do pacote for adicionada com &ecirc;xito, ver&aacute; uma lista dos pacotes no separador <strong>Comunidade</strong>. </li>
</ol>

</body>
</html>
