<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Instala&ccedil;&atilde;o ou Compra de Pacotes - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Package Center lets you download, install, and launch packages on your DiskStation with a few simple clicks.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Instalar ou comprar pacotes</h2>

<p>A Central de Pacotes oferece uma rica variedade de aplicativos web que podem expandir a funcionalidade de seu DiskStation. Com a Central de Pacotes, voc&ecirc; pode baixar, instalar e iniciar pacotes com apenas alguns cliques.</p>
<p>O artigo abaixo explica como instalar pacotes em seu DiskStation usando a Central de Pacotes. Para obter informa&ccedil;&otilde;es sobre pacotes individuais, consulte <a href="http://www.synology.com/en-global/dsm/app_packages" target="_blank">aqui</a>.</p>

<h4>Para instalar ou comprar pacotes:</h4>

<ol>

<li>Abra a <strong>Central de Pacotes</strong>.</li>
<img src="about:blank" class="help_image"/>

<li>V&aacute; para a p&aacute;gina <strong>Todos</strong> para ver todos os pacotes dispon&iacute;veis.</li>
<img src="about:blank" class="help_image"/>
<div class="section">
<h4>Nota:</h4>
<ul>
	<li>Se voc&ecirc; n&atilde;o conseguir encontrar o pacote que est&aacute; procurando, pode ser necess&aacute;ria uma vers&atilde;o mais recente do DSM ou ele est&aacute; dispon&iacute;vel apenas para modelos com requisitos de hardware espec&iacute;ficos. Entre em contato com o desenvolvedor desse pacote para obter mais informa&ccedil;&otilde;es.</li>

</ul>
</div>
<li>Encontre o pacote que deseja instalar e clique em <strong>Instalar</strong>. (Para pacotes pagos, clique em <strong>Comprar</strong> ou <strong>Experimentar</strong> para conectar-se &agrave; conta Synology e comprar com PayPal ou usar a vers&atilde;o de avalia&ccedil;&atilde;o).</li>
<img src="about:blank" class="help_image"/>

<li>Quando o pacote for instalado com &ecirc;xito, ele ir&aacute; aparecer no <strong>Menu Principal.</strong></li>
<img src="about:blank" class="help_image"/>

</ol>

<div class="section">
<h4>Compra de Pacotes:</h4>
<p>Antes de comprar qualquer pacote, consulte as observa&ccedil;&otilde;es a seguir.</p>

<ul>
	<li>Registre uma conta na <a href="https://account.synology.com/register" target="_blank">Conta Synology</a> para ter acesso a mais recursos, como informa&ccedil;&otilde;es de faturamentos anteriores e hist&oacute;rico de compras. As informa&ccedil;&otilde;es compartilhadas s&oacute; s&atilde;o usadas para fornecer servi&ccedil;os de melhor qualidade no futuro.</li>
<li>A Central de Pacotes atualmente aceita apenas pagamentos on-line oferecidos pelo PayPal. Se desejar solicitar um reembolso, acesse o site oficial do PayPal. </li>
<li>Os pacotes atualmente s&atilde;o cobrados em d&oacute;lares americanos.</li>
</ul>
</div>

<div class="section">
<h4>Isen&ccedil;&atilde;o de Responsabilidade da Convers&atilde;o de Moedas</h4>
<p>No caso de transa&ccedil;&otilde;es que incluem convers&atilde;o de moedas, o emissor de seu cart&atilde;o de cr&eacute;dito/d&eacute;bito pode adicionar taxas extras n&atilde;o s&atilde;o refletidas no pre&ccedil;o exibido. Qualquer compra pode estar sujeita a taxas de c&acirc;mbio ou transnacionais pelo emissor do cart&atilde;o. O emissor do seu cart&atilde;o avaliar&aacute; todas as taxas aplicadas, para as quais a Synology n&atilde;o fornece reembolso. Entre em contato com o emissor de seu cart&atilde;o de cr&eacute;dito/d&eacute;bito para obter mais informa&ccedil;&otilde;es.
</p></div>


<h4>Para instalar pacotes manualmente:</h4>
<ol>
<li>Se desejar instalar um pacote fazendo upload do arquivo .spk (dispon&iacute;vel no <a href="http://www.synology.com/support/download.php" target="_blank">Centro de Downloads</a> da Synology ou em sites de terceiros), clique em <b>Instala&ccedil;&atilde;o Manual</b> e siga o assistente para instalar o novo pacote.</li>
<img src="about:blank" class="help_image"/>

</ol>


<h4>Para pesquisar um pacote:</h4>
<ol>
<li>Digite uma palavra-chave na barra de pesquisa no canto superior esquerdo e pressione Enter para come&ccedil;ar a pesquisar. </li>
</ol>


<h4>Para selecionar como os pacotes s&atilde;o classificados:</h4>
<p>Voc&ecirc; pode alterar a ordem dos pacotes exibidos no Centro de pacotes. Selecione uma categoria, clique no &iacute;cone da lista no canto superior direito e selecione para classificar pacotes por uma das seguintes op&ccedil;&otilde;es:</p>
<ul>
<li><strong>Classificar por nome</strong>: Clique para classificar os pacotes em ordem alfab&eacute;tica.</li>
<li><strong>Classificar por popularidade recente</strong>: Clique para classificar pacotes por contagem de instala&ccedil;&atilde;o recente com os mais populares na frente.</li>
</ul>


<h4>Para ocultar pacotes instalados:</h4>
<p>Selecione qualquer categoria, clique no &iacute;cone da lista no canto superior direito e selecione <strong>N&atilde;o mostrar pacotes instalados</strong>. Isso ocultar&aacute; os pacotes que j&aacute; foram instalados e mostrar&aacute; aqueles que ainda ser&atilde;o instalados, atualizados ou reparados.</p>

</body>
</html>
