<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Omezen&iacute; a&nbsp;požadavky na syst&eacute;m&nbsp;&ndash; N&aacute;pověda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article explains the limitations of the Synology High Availability package.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 </head>
 <body>
 
 
<h2>Omezen&iacute; a&nbsp;požadavky na syst&eacute;m</h2>

 <p>Implementace technologie Synology High&nbsp;Availability vyžaduje dva stejn&eacute; servery Synology, kter&eacute; budou plnit funkci aktivn&iacute;ho a&nbsp;pasivn&iacute;ho serveru. Před vytvořen&iacute;m clusteru high-availability, kter&yacute; sest&aacute;v&aacute; ze dvou serverů, provede syst&eacute;m n&aacute;sleduj&iacute;c&iacute; kontrolu omezen&iacute; hardwarov&eacute;ho a&nbsp;softwarov&eacute;ho vybaven&iacute;. Tato kontrola je podm&iacute;nkou &uacute;spě&scaron;n&eacute;ho vytvořen&iacute; clusteru high-availability.</p>
 
  
 <h3>Syst&eacute;mov&eacute; požadavky</h3>
 
  <p>Přečtěte si n&aacute;sleduj&iacute;c&iacute; pokyny t&yacute;kaj&iacute;c&iacute; se softwarov&eacute;ho a&nbsp;hardwarov&eacute;ho vybaven&iacute;:</p>
  <ul>
   <li><b>Synology Server:</b> V&nbsp;př&iacute;padě aktivn&iacute;ch a&nbsp;pasivn&iacute;ch serverů se mus&iacute; jednat o&nbsp;shodn&eacute; modely.</li>
   <li><b>Roz&scaron;iřovac&iacute; jednotky:</b> Aktivn&iacute; i&nbsp;pasivn&iacute; server mus&iacute; b&yacute;t spr&aacute;vně připojeny ke stejn&yacute;m roz&scaron;iřovac&iacute;m jednotk&aacute;m.</li>
   <li><b>Počet a&nbsp;typ disků:</b> Typ disku mus&iacute; b&yacute;t pouze SAS. Před instalac&iacute; DSM mus&iacute;te na roz&scaron;iřovac&iacute; jednotky nainstalovat nejm&eacute;ně 3 disky.</li>
   <li><b>Extern&iacute; USB zař&iacute;zen&iacute;:</b> Podporov&aacute;no je pouze USB &uacute;loži&scaron;tě. Ostatn&iacute; extern&iacute; USB zař&iacute;zen&iacute; (např. UPS, Wi-Fi kl&iacute;č, reproduktor, tisk&aacute;rna, Bluetooth hardwarov&yacute; kl&iacute;č a DVB hardwarov&yacute; kl&iacute;č) nejsou podporov&aacute;na. USB &uacute;loži&scaron;tě lze využ&iacute;t pouze jako aktivn&iacute; server a nelze je přepnout do role pasivn&iacute;ho serveru.</li>

  </ul>

  <h3>S&iacute;ťov&eacute; prostřed&iacute;</h3>
  <p>Pročtěte si n&aacute;sleduj&iacute;c&iacute; pokyny t&yacute;kaj&iacute;c&iacute; se s&iacute;ťov&yacute;ch nastaven&iacute; při pokusu o&nbsp;vytvořen&iacute; clusteru high-availability.</p>
  <ul>
    <li><b>S&iacute;ťov&aacute; nastaven&iacute;:</b> Připojen&iacute; Heartbeat mezi dvěma servery mus&iacute; b&yacute;t spr&aacute;vně nastaveno. Oba servery mus&iacute; b&yacute;t zapojeny do stejn&eacute; pods&iacute;tě a po instalaci je nutn&eacute; nastavit jim statick&eacute; IP adresy.</li>
    <li><b>Počet portů m&iacute;stn&iacute; s&iacute;tě&nbsp;LAN:</b> Oba servery mus&iacute; m&iacute;t stejn&yacute; počet portů m&iacute;stn&iacute; s&iacute;tě&nbsp;LAN. Pokud je někter&yacute; z va&scaron;ich modelů DiskStation vybaven př&iacute;davn&yacute;mi kartami s&iacute;ťov&eacute;ho rozhran&iacute;, mus&iacute; b&yacute;t i ten druh&yacute; vybaven stejn&yacute;mi kartami s&iacute;ťov&eacute;ho rozhran&iacute;. </li>
    <li><b>Omezen&iacute; připojen&iacute;:</b> Wi-Fi s&iacute;ť nen&iacute; v high-availability clusteru podporov&aacute;na.</li>

  </ul>
  <div class="section">
    <h4>Pozn&aacute;mka:</h4>
    <ul>
      <li>Na aktivn&iacute;m serveru bude automaticky aktivov&aacute;n NTP server.</li>
    </ul>
  </div>

<h3>Omezen&iacute; bal&iacute;čků a&nbsp;softwaru</h3> 

<p>N&iacute;že najdete přehled omezen&iacute; vztahuj&iacute;c&iacute;ch se k&nbsp;bal&iacute;čkům a&nbsp;softwaru:</p>
	<ul>
	<li>High-availability cluster nepodporuje n&aacute;sleduj&iacute;c&iacute; bal&iacute;čky a funkce:<ul><li>DVBLink Server</li>
		<li>Tato funkce restartuje/vypne cluster high-availability v&nbsp;syst&eacute;mu CMS</li>
		<li>Time Backup</li>
		</ul>
	</li>
	<li>HIgh-availability cluster se sd&iacute;len&yacute;m &uacute;loži&scaron;těm nelze nastavit a použ&iacute;vat v kombinaci s high-availability clusterem využ&iacute;vaj&iacute;c&iacute;m replikaci.</li>
    </ul>

<h3>Zvl&aacute;&scaron;tn&iacute; roz&scaron;iřovac&iacute; jednotky</h3>
  <p>Aktivn&iacute; i&nbsp;pasivn&iacute; server mus&iacute; b&yacute;t připojeny ke zvl&aacute;&scaron;tn&iacute;m roz&scaron;iřovac&iacute;m jednotk&aacute;m. Každ&aacute; roz&scaron;iřovac&iacute; jednotka obsahuje dva moduly.</p>
  <h4>Postup nastaven&iacute;/přid&aacute;v&aacute;n&iacute; roz&scaron;iřovac&iacute;ch jednotek:</h4>
  <ul>
    <li>Modul obsahuje dva porty; vstupn&iacute; port je na lev&eacute; straně, v&yacute;stupn&iacute; port na prav&eacute; straně. Připojte SAS kabel od v&yacute;stupn&iacute;ho portu modulu ke vstupn&iacute;mu portu modulu dal&scaron;&iacute; roz&scaron;iřovac&iacute; jednotky.</li>
	<li>Roz&scaron;iřovac&iacute; jednotky mus&iacute; b&yacute;t zapojeny s&eacute;riově s moduly na př&iacute;slu&scaron;n&yacute;ch stran&aacute;ch pro každ&yacute; server.</li>
    <li>Aktivn&iacute; i&nbsp;pasivn&iacute; server mus&iacute; b&yacute;t připojeny k sd&iacute;len&yacute;m roz&scaron;iřovac&iacute;m jednotk&aacute;m ve stejn&eacute;m pořad&iacute;.</li>
  </ul>


<div class="section">
<h4>Pozn&aacute;mky:</h4>
<p>Podrobněj&scaron;&iacute; informace t&yacute;kaj&iacute;c&iacute; se instalace roz&scaron;iřovac&iacute;ch jednotek najdete ve&nbsp;Stručn&eacute; instalačn&iacute; př&iacute;ručce k va&scaron;im serverům a roz&scaron;iřovac&iacute;m jednotk&aacute;m.</p>
</div>

   
 </body>
</html>
