<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 <meta charset="utf-8">
</head>
 <body>
<h2>Split brain</h2>

<p>Pokud cluster high-availability funguje spr&aacute;vně, může &uacute;lohu aktivn&iacute;ho serveru plnit pouze jeden ze člensk&yacute;ch serverů. V takov&eacute;m př&iacute;padě pasivn&iacute; server zjist&iacute; př&iacute;tomnost aktivn&iacute;ho serveru prostřednictv&iacute;m připojen&iacute; Heartbeat a datov&eacute;ho připojen&iacute; se sd&iacute;len&yacute;mi roz&scaron;iřovac&iacute;mi jednotkami, takže k přepnut&iacute; nedojde. Pasivn&iacute; server d&aacute;le zjist&iacute; stav sd&iacute;len&eacute;ho &uacute;loži&scaron;tě, aby nedo&scaron;lo k nespr&aacute;vn&eacute;mu převzet&iacute; &uacute;lohy aktivn&iacute;ho serveru v době, kdy st&aacute;vaj&iacute;c&iacute; aktivn&iacute; server je&scaron;tě pracuje se sd&iacute;len&yacute;mi roz&scaron;iřovac&iacute;mi jednotkami.</p>

<p>Po ztr&aacute;tě připojen&iacute; Heartbeat a v&scaron;ech datov&yacute;ch připojen&iacute; nebo v př&iacute;padě nestabiln&iacute;ho stavu sd&iacute;len&eacute;ho &uacute;loži&scaron;tě a syst&eacute;mu může kter&yacute;koli z obou serverů vystupovat jako aktivn&iacute; server. Tato situace se označuje jako chyba &bdquo;split brain&ldquo;. V takov&eacute;m př&iacute;padě se doporučuje, aby jeden server pokračoval v poskytov&aacute;n&iacute; služeb, zat&iacute;mco u druh&eacute;ho se provede restart s požadavkem na n&aacute;slednou kontrolu spojen&iacute;, aby nedo&scaron;lo k po&scaron;kozen&iacute; dat v důsledku souběžn&eacute;ho př&iacute;stupu z obou serverů. Za t&eacute;to situace mohou b&yacute;t připojen&iacute; klientsk&yacute;ch uživatelů po určitou dobu nestabiln&iacute;.</p>
        
 </body>
</html>
