<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Imagem Instant&acirc;nea e Duplica&ccedil;&atilde;o</h1>

<p>Imagem Instant&acirc;nea e replica&ccedil;&atilde;o &eacute; perito em c&oacute;pia de seguran&ccedil;a e recupera&ccedil;&atilde;o de dados. As empresas necessitam de protec&ccedil;&atilde;o de dados para evitar a perda dos mesmos em casos de elimina&ccedil;&atilde;o acidental, bloqueios em aplica&ccedil;&otilde;es, corrup&ccedil;&atilde;o de dados e v&iacute;rus.</p>

<p>O &ldquo;<strong>instant&acirc;neo</strong>&rdquo; &eacute; uma c&oacute;pia de um dado momento armazenada no mesmo volume usado para gravar o estado de todos os dados no momento em que &eacute; tirada. Os instant&acirc;neos usam apenas um pequeno montante de espa&ccedil;o adicional de armazenamento, e n&atilde;o t&ecirc;m impacto no desempenho. </p>

<p>Com os instant&acirc;neos, caso um utilizador modifique acidentalmente ou elimine dados num volume com instant&acirc;neos, poder&aacute; rapidamente recuperar os dados ao momento anterior, quando foi tirado o instant&acirc;neo. Para al&eacute;m disso, permite aos utilizadores recuperar os seus pr&oacute;prios ficheiros eliminados ou modificados em pastas partilhadas sem ser necess&aacute;ria a ajuda do administrador.</p>

<p>Imagem instant&acirc;nea e Replica&ccedil;&atilde;o ajuda a gerir e a monitorizar os instant&acirc;neos na sua DiskStation.</p>

<p>Dependendo das fun&ccedil;&otilde;es suportadas pela sua DiskStation, <strong>Imagem Instant&acirc;nea e Replica&ccedil;&atilde;o</strong> ajuda a realizar as seguintes tarefas:</p>
<ul>
	<li>Tirar e gerir instant&acirc;neos de <strong>pastas partilhadas*</strong> e <strong>iSCSI LUNs</strong>.</li>
	<li>Configurar <strong>instant&acirc;neos agendados</strong> e <strong>defini&ccedil;&otilde;es de reten&ccedil;&atilde;o</strong>. Estas defini&ccedil;&otilde;es determinam quando e como devem ser tirados, retidos e/ou removidos instant&acirc;neos.</li>
	<li>Ver o registo de eventos relativos a instant&acirc;neos.</li>
</ul>

<p>_____<br/> <strong>*</strong> Instant&acirc;neos de pastas partilhadas podem apenas ser tirados quando o seu armazenamento est&aacute; a usar o sistema de ficheiros <strong>Btrfs</strong>.</p>

</body>
</html>