<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Vis&atilde;o Geral</h2>
	<p>Esta p&aacute;gina mostra o estado geral dos destinos de instant&acirc;neos e dos seus instant&acirc;neos.</p>

<h3>Sum&aacute;rio</h3>
	<p>Esta sec&ccedil;&atilde;o mostra tr&ecirc;s estados listados sob os destinos de instant&acirc;neos (incluindo as pastas partilhadas e iSCSI LUNs). O tamanho total dos destinos de instant&acirc;neos nos estados respectivos s&atilde;o apresentados tamb&eacute;m nesta sec&ccedil;&atilde;o.</p>
	<ul>
		<li><b>Instant&acirc;neo agendado</b>: Agendado o tirar de instant&acirc;neo para destinos de instant&acirc;neos.</li>
		<li><b>N&atilde;o agendado</b>: Foram tirados instant&acirc;neos para os destinos de instant&acirc;neos, mas n&atilde;o est&aacute; agendado o tirar de instant&acirc;neo.</li>
		<li><b>N&atilde;o protegida</b>: Nenhum instant&acirc;neo tirado para os destinos de instant&acirc;neos.</li> 
   </ul>

<h3>Instant&acirc;neos recentes</h3>
	<p>Esta sec&ccedil;&atilde;o apresenta uma cronologia de instant&acirc;neos categorizados para facilitar a recupera&ccedil;&atilde;o dos seus dados.</p>

<h4>Para restaurar/clonar as suas pastas partilhadas ou iSCSI LUNs de instant&acirc;neos recentes:</h4>

<ol>
	<li>Clique no &iacute;cone calend&aacute;rio, e seleccione a data para a qual deseja restaurar os dados.</li>
  <li>Arraste a cronologia para recuar ou avan&ccedil;ar, e seleccione um ponto espec&iacute;fico no tempo, no qual foram tirados instant&acirc;neos.</li>
	<li>Seleccione uma pasta partilhada ou iSCSI LUN que deseja restaurar/clonar.</li>
  <li>Ser&aacute; redireccionado para a p&aacute;gina <strong>Recupera&ccedil;&atilde;o</strong>. Para mais informa&ccedil;&otilde;es sobre os passos seguintes, consulte <a href="recovery.html">Recupera&ccedil;&atilde;o</a>.</li>
</ol>

</body>
</html>