<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Recupera&ccedil;&atilde;o</h2>

<p>Esta p&aacute;gina permite aos administradores de sistema realizar uma recupera&ccedil;&atilde;o. Para permitir que utilizadores acedam a instant&acirc;neos de pastas partilhadas, active <strong>Tornar vis&iacute;vel instant&acirc;neo</strong> para cada pasta partilhada, para que os utilizadores possam aceder aos instant&acirc;neos atrav&eacute;s da File Station ou Explorador de Ficheiros do Windows.</p>

<h3>Pasta Partilhada</h3>

<h4>Para restaurar ficheiros/pastas individuais numa pasta partilhada:</h4>
<ol>
	<li>Selecione a pasta partilhada que deseja restaurar.</li>
	<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
	<li>Seleccione uma vers&atilde;o de instant&acirc;neo da qual deseja restaurar.</li>
  <li>Clique em <strong>Percorrer</strong>, e copie os ficheiros/pastas que deseja restaurar para o destino.</li>
</ol>

<h4>Para restaurar uma pasta partilhada:</h4>
<ol>
	<li>Selecione a pasta partilhada que deseja restaurar.</li>
	<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
	<li>Seleccione uma vers&atilde;o de instant&acirc;neo da qual deseja restaurar.</li>
	<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Restaurar em substitui&ccedil;&atilde;o</strong> da lista de selec&ccedil;&atilde;o.</li>
  <li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a ac&ccedil;&atilde;o.</li>
</ol>

<h4>Para clonar um instant&acirc;neo para uma nova pasta partilhada:</h4>
<ol>
<li>Selecione uma pasta partilhada que deseja clonar.</li>
<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
<li>Seleccione uma vers&atilde;o de instant&acirc;neo que deseja clonar para uma nova pasta partilhada.</li>
<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Clonar com um novo nome</strong> da lista de selec&ccedil;&atilde;o.</li>
<li>Ser&aacute; redireccionado para a p&aacute;gina <strong>Clonar</strong> no <strong>Painel de Controlo</strong> &gt; <strong>Pasta Partilhada</strong> &gt; <strong>Criar</strong>. Introduza o nome da pasta partilhada clonada e clique em <strong>OK</strong> para terminar.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>N&atilde;o &eacute; poss&iacute;vel restaurar os &quot;homes&quot; da pasta partilhada.</li>
	<li>A pasta partilhada clonada n&atilde;o pode estar encriptada.</li>
	<li>Se for tirado um instant&acirc;neo quando est&aacute; a decorrer uma transfer&ecirc;ncia de quaisquer ficheiros, n&atilde;o pode ser garantida a consist&ecirc;ncia dos dados.</li>
	<li>Limita&ccedil;&otilde;es em pastas partilhadas encriptadas:
		<ul>
			<li>Nenhum tipo de recupera&ccedil;&atilde;o est&aacute; dispon&iacute;vel para pastas partilhadas montadas e encriptadas.</li>
			<li><strong>Clonar com um novo nome</strong> n&atilde;o est&aacute; dispon&iacute;vel para pastas partilhadas encriptadas.</li>
			<li>Pastas partilhadas encriptadas e desmontadas podem ser restauradas a partir de instant&acirc;neos tirados anteriormente, usando <strong>Restaurar em substitui&ccedil;&atilde;o</strong>.</li>
		</ul>
	</li>
</ul>
</div>

<h4>Para parar realizar um switchover da replica&ccedil;&atilde;o de pasta partilhada:</h4>
<ol>
	<li>Selecione a pasta partilhada que deseja realizar o switchover.</li>
	<li>Clique em <strong>Mudan&ccedil;a</strong>.</li>
	<li>Selecione o novo servidor de destino caso existam m&uacute;ltiplas tarefas de replica&ccedil;&atilde;o da pasta partilhada.</li>
	<li>Clique em <strong>Switchover</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<h4>Para realizar um failover de replica&ccedil;&atilde;o de uma pasta partilhada:</h4>
<ol>
	<li>Selecione a pasta partilhada replicada sobre a qual deseja realizar o switchover.</li>
	<li>Clique em <strong>Failover</strong> &gt; <strong>Failover</strong>.</li>
	<li>Selecione a vers&atilde;o do instant&acirc;neo a restaurar.</li>
	<li>Clique em <strong>Failover</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Pode apenas iniciar um failover se houver uma falha no servidor de origem.</li>
</ul>
</div>

<h4>Para parar proteger novamente a replica&ccedil;&atilde;o de uma pasta partilhada:</h4>
<p>Quando se inicia a transi&ccedil;&atilde;o por falha para o servidor de destino, a tarefa de replica&ccedil;&atilde;o ir&aacute; parar de sincronizar os dados entre os dois servidores. Ter&aacute; de proteger novamente a tarefa de replica&ccedil;&atilde;o depois de recuperado o servidor original.</p>
<ol>
<li>Selecione a pasta partilhada transitada por falha que deseja proteger novamente.</li>
<li>Clique em <strong>Failover</strong> &gt; <strong>Proteger novamente</strong>.</li>
<li>Selecione o novo servidor de origem.</li>
<li>Selecione o novo servidor de destino caso existam m&uacute;ltiplas tarefas de replica&ccedil;&atilde;o da pasta partilhada.</li>
<li>Clique em <strong>Proteger novamente</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Os dados da pasta partilhada replicada que existirem no novo servidor de destino ser&atilde;o substitu&iacute;dos pelos dados do novo servidor de origem.</li>
	<li>Se a vers&atilde;o selecionada de instant&acirc;neo para failover n&atilde;o existir no servidor parceiro, poder&aacute; demorar mais a proteger novamente.</li>
</ul>
</div>

<h4>Para realizar um failover de teste para uma pasta partilhada replicada:</h4>
<ol>
	<li>Selecione a pasta partilhada replicada que deseja testar.</li>
	<li>Clique em <strong>Failover de Teste</strong> &gt; <strong>Failover de Teste</strong>.</li>
	<li>Selecione o <strong>Servidor de Teste</strong> caso existam m&uacute;ltiplas tarefas de replica&ccedil;&atilde;o da pasta partilhada.</li>
	<li>Introduza no <strong>Nome para Failover de Teste</strong> da pasta partilhada, e selecione a vers&atilde;o do instant&acirc;neo a testar.</li>
	<li>Clique em <strong>Failover de Teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Realizar um switchover/failover de uma replica&ccedil;&atilde;o ir&aacute; limpar o failover de teste.</li>
	<li>N&atilde;o pode criar uma tarefa de replica&ccedil;&atilde;o para um failover de teste de pasta partilhada.</li>
</ul>
</div>

<h4>Para limpar um failover de teste para uma pasta partilhada replicada:</h4>
<ol>
	<li>Selecione a pasta partilhada replicada da qual deseja limpar o failover de teste.</li>
	<li>Clique em <strong>Failover de Teste</strong> &gt; <strong>Limpar Failover de Teste</strong>.</li>
	<li>Assinale o failover de teste que deseja limpar.<br /><span class="note_head">Nota:</span> Assinale <strong>Eliminar dados de failover de teste</strong> caso n&atilde;o queira mais manter a pasta partilhada criada para o failover de teste.</li>
	<li>Clique em <strong>Limpar Failover de Teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<h3>iSCSI LUN</h3>

<h4>Para restaurar um iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN que pretende restaurar.</li>
	<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
	<li>Selecione a vers&atilde;o de instant&acirc;neo da qual deseja restaurar.</li>
	<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Restaurar em substitui&ccedil;&atilde;o</strong> da lista de selec&ccedil;&atilde;o.</li>
  <li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a ac&ccedil;&atilde;o.</li>
</ol>

<h4>Para clonar um instant&acirc;neo para um novo iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN que pretende clonar.</li>
	<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
	<li>Selecione a vers&atilde;o de instant&acirc;neo que deseja clonar para um novo iSCSI LUN.</li>
	<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Clonar com um novo nome</strong> da lista de selec&ccedil;&atilde;o.</li>
	<li>Ser&aacute; redireccionado para a p&aacute;gina <strong>Clonar</strong> no <strong>Gestor de Armazenamento</strong> &gt; <strong>iSCSI LUN</strong>. Introduza o nome do iSCSI LUN clonado e clique em <strong>OK</strong> para terminar.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Se for tirado um instant&acirc;neo quando est&aacute; a decorrer uma transfer&ecirc;ncia de quaisquer ficheiros, n&atilde;o pode ser garantida a consist&ecirc;ncia dos dados.</li>
</ul>
</div>

<h4>Para parar realizar um switchover da replica&ccedil;&atilde;o de pasta partilhada:</h4>
<ol>
	<li>Selecione o iSCSI LUN que deseja realizar o switchover.</li>
	<li>Clique em <strong>Mudan&ccedil;a</strong>.</li>
	<li>Selecione o novo servidor de destino caso existam m&uacute;ltiplas tarefas de replica&ccedil;&atilde;o do iSCSI LUN.</li>
	<li>Clique em <strong>Switchover</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<h4>Para realizar um failover de replica&ccedil;&atilde;o de um iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN que deseja realizar o failover.</li>
	<li>Clique em <strong>Failover</strong> &gt; <strong>Failover</strong>.</li>
	<li>Selecione a vers&atilde;o do instant&acirc;neo a restaurar.</li>
	<li>Clique em <strong>Failover</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Pode apenas iniciar um failover se houver uma falha no servidor de origem.</li>
</ul>
</div>

<h4>Para parar proteger novamente a replica&ccedil;&atilde;o de um iSCSI LUN:</h4>
<p>Quando se inicia a transi&ccedil;&atilde;o por falha para o servidor de destino, a tarefa de replica&ccedil;&atilde;o ir&aacute; parar de sincronizar os dados entre os dois servidores. Ter&aacute; de proteger novamente a tarefa de replica&ccedil;&atilde;o depois de recuperado o servidor original.</p>
<ol>
<li>Selecione o iSCSI LUN transitado por falha que deseja proteger novamente.</li>
<li>Clique em <strong>Failover</strong> &gt; <strong>Proteger novamente</strong>.</li>
<li>Selecione o novo servidor de origem.</li>
<li>Selecione o novo servidor de destino caso existam m&uacute;ltiplas tarefas de replica&ccedil;&atilde;o do iSCSI LUN.</li>
<li>Clique em <strong>Proteger novamente</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Os dados do iSCSI LUN replicado que existirem no novo servidor de destino ser&atilde;o substitu&iacute;dos pelos dados do novo servidor de origem.</li>
	<li>Se a vers&atilde;o selecionada de instant&acirc;neo para failover n&atilde;o existir no servidor parceiro, poder&aacute; demorar mais a proteger novamente.</li>
</ul>
</div>

<h4>Para realizar um failover de teste para um iSCSI LUN replicado:</h4>
<ol>
	<li>Selecione o iSCSI LUN que deseja testar.</li>
	<li>Clique em <strong>Failover de Teste</strong> &gt; <strong>Failover de Teste</strong>.</li>
	<li>Selecione o <strong>Servidor de Teste</strong> caso existam m&uacute;ltiplas tarefas de replica&ccedil;&atilde;o do iSCSI LUN.</li>
	<li>Introduza no <strong>Nome para Failover de Teste</strong> do iSCSI LUN, e selecione a vers&atilde;o do instant&acirc;neo a testar.</li>
	<li>Clique em <strong>Failover de Teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Realizar um switchover/failover de uma replica&ccedil;&atilde;o ir&aacute; limpar o failover de teste.</li>
	<li>N&atilde;o pode criar uma tarefa de replica&ccedil;&atilde;o para um failover de teste do iSCSI LUN.</li>
</ul>
</div>

<h4>Para limpar um failover de teste para um iSCSI LUN replicado:</h4>
<ol>
	<li>Selecione o iSCSI LUN replicado do qual deseja limpar o failover de teste.</li>
	<li>Clique em <strong>Failover de Teste</strong> &gt; <strong>Limpar Failover de Teste</strong>.</li>
	<li>Assinale o failover de teste que deseja limpar.<br /><span class="note_head">Nota:</span> Assinale <strong>Eliminar dados de failover de teste</strong> caso n&atilde;o queira mais manter o iSCSI LUN criado para o failover de teste.</li>
	<li>Clique em <strong>Limpar Failover de Teste</strong> para iniciar a a&ccedil;&atilde;o.</li>
</ol>

</body>
</html>