<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Replica&ccedil;&atilde;o</h2>

<p>Esta p&aacute;gina permite aos administradores gerir replica&ccedil;&otilde;es. Pode criar, editar e eliminar tarefas de replica&ccedil;&atilde;o. Pode tamb&eacute;m executar/interromper a sincroniza&ccedil;&atilde;o e visualizar as informa&ccedil;&otilde;es das suas tarefas de replica&ccedil;&atilde;o.</p>

<h3>Pasta Partilhada</h3>

<h4>Para criar uma tarefa de replica&ccedil;&atilde;o para uma pasta partilhada:</h4>
<ol>
	<li>Aceda ao separador <strong>Pasta Partilhada</strong>.</li>
	<li>Clique em <strong>Criar</strong>.</li>
	<li>Ver&aacute; o assistente <strong>Criar Tarefa de Replica&ccedil;&atilde;o</strong>. Siga os passos do assistente para criar uma replica&ccedil;&atilde;o de pasta partilhada.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>N&atilde;o &eacute; poss&iacute;vel replicar os &quot;homes&quot; da pasta partilhada.</li>
	<li>N&atilde;o pode replicar uma pasta partilhada encriptada.</li>
	<li>A pasta partilhada tem de estar localizada num volume Btrfs.</li>
	<li>Pode criar <a href="#multiple_replication">replica&ccedil;&otilde;es um-para-muitas/expandidas</a> para uma pasta partilhada em diferentes servidores de destino. No entanto, pode apenas criar uma replica&ccedil;&atilde;o para um servidor de destino para cada pasta partilhada.</li>
</ul>
</div>

<h4>Para eliminar uma replica&ccedil;&atilde;o de pasta partilhada:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o de pasta partilhada que deseja eliminar.</li>
	<li>De seguida, clique em <strong>Eliminar</strong>.</li>
	<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Eliminar</strong> para confirmar a elimina&ccedil;&atilde;o.</li>
</ol>

<h4>Para editar uma replica&ccedil;&atilde;o de pasta partilhada:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o de pasta partilhada que deseja editar.</li>
	<li>Clique em <strong>Editar</strong>.</li>
	<li>Ver&aacute; uma janela com os seguintes separadores:
	  <ul>
			<li>Servidor Parceiro</li>
			<li>Agendamento</li>
			<li>Reten&ccedil;&atilde;o</li>
		</ul>
	</li>
	<li>No separador <strong>Servidor Parceiro</strong>, pode editar as informa&ccedil;&otilde;es do servidor parceiro incluindo o nome do anfitri&atilde;o, porta, nome de utilizador e palavra-passe.</li>
	<li>No separador <strong>Agendamento</strong>, assinale a caixa de verifica&ccedil;&atilde;o <strong>Activar agendamento de instant&acirc;neo</strong>, e configure o momento e frequ&ecirc;ncia para tirar instant&acirc;neos. Pode desmarcar a caixa de verifica&ccedil;&atilde;o para cancelar instant&acirc;neos agendados para a pasta partilhada.</li>
	<li>No separador <strong>Reten&ccedil;&atilde;o</strong>, escolha qualquer das seguintes op&ccedil;&otilde;es:
		<ul>
			<li><strong>Manter os 256 mais recentes instant&acirc;neos:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo (256) de instant&acirc;neos, os instant&acirc;neos mais antigos ser&atilde;o substitu&iacute;dos por outros novos.</li>
			<li><strong>Reter sempre instant&acirc;neos:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo de instant&acirc;neos, o Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; parar de tirar novos instant&acirc;neos sem remover os que j&aacute; foram tirados.</li>
			<li><strong>Manter instant&acirc;neos com a seguinte pol&iacute;tica:</strong> Pode configurar as regras de reten&ccedil;&atilde;o para blocos de tempo especificados.</li>
		</ul>
	</li>
	<li>Clique em <strong>OK</strong> para aplicar as novas defini&ccedil;&otilde;es.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Pode apenas editar o agendamento da tarefa de replica&ccedil;&atilde;o no servidor de origem.</li>
	<li>Alterar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o ir&aacute; afetar as defini&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Instant&acirc;neo</strong>.</li>
</ul>
</div>

<h4>Para ver as informa&ccedil;&otilde;es de uma replica&ccedil;&atilde;o de pasta partilhada:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o de pasta partilhada que deseja visualizar.</li>
	<li>Clique em <strong>Informa&ccedil;&atilde;o</strong>.</li>
	<li>Ver&aacute; uma janela com as seguintes informa&ccedil;&otilde;es:
	  <ul>
			<li><strong>Estado</strong> desta replica&ccedil;&atilde;o.</li>
			<li><strong>Estat&iacute;sticas</strong> desta replica&ccedil;&atilde;o.</li>
		</ul>
	</li>
</ol>

<h4>Para realizar a sincroniza&ccedil;&atilde;o de uma replica&ccedil;&atilde;o de pasta partilhada:</h4>
<ol>
	<li>Selecione a replica&ccedil;&atilde;o de pasta partilhada que deseja sincronizar.</li>
	<li>Clique em <strong>Executar</strong>.</li>
	<li>Introduza a descri&ccedil;&atilde;o do instant&acirc;neo a tirar.</li>
	<li>Clique em <strong>OK</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>

<h4>Para parar a sincroniza&ccedil;&atilde;o de uma replica&ccedil;&atilde;o de pasta partilhada:</h4>
<ol>
	<li>Selecione a replica&ccedil;&atilde;o de pasta partilhada sincronizada que deseja interromper.</li>
	<li>Clique em <strong>Parar</strong>.</li>
	<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Parar</strong> para confirmar a ac&ccedil;&atilde;o.</li>
</ol>

<h3>iSCSI LUN</h3>

<h4>Para tirar uma tarefa de replica&ccedil;&atilde;o de um iSCSI LUN:</h4>
<ol>
	<li>Aceda ao separador <strong>iSCSI LUN</strong>.</li>
	<li>Clique em <strong>Criar</strong>.</li>
	<li>Ver&aacute; o assistente <strong>Criar Tarefa de Replica&ccedil;&atilde;o</strong>. Siga os passos do assistente para criar uma replica&ccedil;&atilde;o iSCSI LUN.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>O iSCSI LUN tem de ser criado como um <strong>LUN avan&ccedil;ado</strong>.</li>
	<li>Pode criar <a href="#multiple_replication">replica&ccedil;&otilde;es um-para-muitas/expandidas</a> para um iSCSI LUN em diferentes servidores de destino. No entanto, pode apenas criar uma replica&ccedil;&atilde;o para um servidor de destino para cada iSCSI LUN.</li>
</ul>
</div>

<h4>Para eliminar uma replica&ccedil;&atilde;o iSCSI LUN:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o iSCSI LUN que deseja eliminar.</li>
	<li>De seguida, clique em <strong>Eliminar</strong>.</li>
	<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Eliminar</strong> para confirmar a ac&ccedil;&atilde;o.</li>
</ol>

<h4>Para editar uma replica&ccedil;&atilde;o iSCSI LUN:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o iSCSI LUN que deseja editar.</li>
	<li>Clique em <strong>Editar</strong>.</li>
	<li>Ver&aacute; uma janela com os seguintes separadores:
	  <ul>
			<li>Servidor Parceiro</li>
			<li>Agendamento</li>
			<li>Reten&ccedil;&atilde;o</li>
		</ul>
	</li>
	<li>No separador <strong>Servidor Parceiro</strong>, pode editar as informa&ccedil;&otilde;es do servidor parceiro incluindo o nome do anfitri&atilde;o, porta, nome de utilizador e palavra-passe.</li>
	<li>No separador <strong>Agendamento</strong>, assinale a caixa de verifica&ccedil;&atilde;o <strong>Activar agendamento de instant&acirc;neo</strong>, e configure o momento e frequ&ecirc;ncia para tirar instant&acirc;neos. Pode desmarcar a caixa de verifica&ccedil;&atilde;o para cancelar instant&acirc;neos agendados para iSCSI LUN.</li>
	<li>No separador <strong>Reten&ccedil;&atilde;o</strong>, escolha qualquer das seguintes op&ccedil;&otilde;es:
		<ul>
			<li><strong>Manter os 256 mais recentes instant&acirc;neos:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo (256) de instant&acirc;neos, os instant&acirc;neos mais antigos ser&atilde;o substitu&iacute;dos por outros novos.</li>
			<li><strong>Reter sempre instant&acirc;neos:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo de instant&acirc;neos, o Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; parar de tirar novos instant&acirc;neos sem remover os que j&aacute; foram tirados.</li>
			<li><strong>Manter instant&acirc;neos com a seguinte pol&iacute;tica:</strong> Pode configurar as regras de reten&ccedil;&atilde;o para blocos de tempo especificados.</li>
		</ul>
	</li>
	<li>No separador <strong>Aplica&ccedil;&atilde;o</strong>, assinale <strong>Ativar instant&acirc;neos consistentes com aplica&ccedil;&otilde;es</strong> para ativar instant&acirc;neos consistentes com aplica&ccedil;&otilde;es. Para cancelar instant&acirc;neos consistentes com aplica&ccedil;&otilde;es, desmarque a caixa de verifica&ccedil;&atilde;o.</li>
	<li>Clique em <strong>OK</strong> para aplicar as novas defini&ccedil;&otilde;es.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Pode apenas editar o agendamento na origem da replica&ccedil;&atilde;o.</li>
	<li>Alterar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o/aplica&ccedil;&atilde;o ir&aacute; afetar as defini&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Instant&acirc;neo</strong>.</li>
</ul>
</div>

<h4>Para ver as informa&ccedil;&otilde;es de uma replica&ccedil;&atilde;o iSCSI LUN:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o iSCSI LUN que deseja visualizar.</li>
	<li>Clique em <strong>Informa&ccedil;&atilde;o</strong>.</li>
	<li>Ver&aacute; uma janela com as seguintes informa&ccedil;&otilde;es:
	  <ul>
			<li><strong>Estado</strong> desta replica&ccedil;&atilde;o.</li>
			<li><strong>Estat&iacute;sticas</strong> desta replica&ccedil;&atilde;o.</li>
		</ul>
	</li>
</ol>

<h4>Para executar a sincroniza&ccedil;&atilde;o de uma replica&ccedil;&atilde;o iSCSI LUN:</h4>
<ol>
  <li>Selecione a tarefa de replica&ccedil;&atilde;o iSCSI LUN que deseja sincronizar.</li>
	<li>Clique em <strong>Executar</strong>.</li>
	<li>Introduza a descri&ccedil;&atilde;o do instant&acirc;neo a tirar.</li>
	<li>Clique em <strong>OK</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>

<h4>Para interromper a execu&ccedil;&atilde;o de uma replica&ccedil;&atilde;o iSCSI LUN:</h4>
<ol>
	<li>Selecione a tarefa de replica&ccedil;&atilde;o de sincroniza&ccedil;&atilde;o iSCSI LUN que deseja interromper.</li>
	<li>Clique em <strong>Parar</strong>.</li>
	<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Parar</strong> para confirmar a ac&ccedil;&atilde;o.</li>
</ol>

<h3><a name="multiple_replication"></a>Um-para-muitos/Replica&ccedil;&atilde;o expandida</h3>

<p>Pode criar m&uacute;ltiplas replica&ccedil;&otilde;es para uma pasta partilhada/iSCSI LUN para m&uacute;ltiplos servidores de destino, formando um esquema <strong>um-para-muitos</strong>. Pode tamb&eacute;m criar uma replica&ccedil;&atilde;o para uma pasta partilhada replicada/iSCSI LUN, formando um esquema <strong>expandido</strong>.</p>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Quer seja um esquema um-para-muitos ou expandido, qualquer tarefa de replica&ccedil;&atilde;o pode ter apenas tr&ecirc;s servidores de destino no m&aacute;ximo.</li>
</ul>
</div>

<div class="section"><h4><a name="smart_retention"></a>Pol&iacute;tica de Reten&ccedil;&atilde;o</h4>
<p>Esta op&ccedil;&atilde;o proporciona uma solu&ccedil;&atilde;o ideal para o ajudar a especificar os montantes m&aacute;ximos de vers&otilde;es de instant&acirc;neos para poupar espa&ccedil;o no seu volume, mas poder&aacute; ter de reter os seus instant&acirc;neos durante per&iacute;odos maiores de tempo.</p>
<p>A Synology emprega a pol&iacute;tica de reten&ccedil;&atilde;o GFS, ou Grandfather-Father-Son Pode configurar os montantes m&aacute;ximos de vers&otilde;es de instant&acirc;neos a ser retidos para os seguintes blocos de tempo, respectivamente: <strong>a cada hora</strong>, <strong>di&aacute;rio</strong>, <strong>semanal</strong>, <strong>mensal</strong>, e <strong>anual</strong>.</p>
<p>O Gestor de Protec&ccedil;&atilde;o de Dados ir&aacute; reter o n&uacute;mero m&aacute;ximo de intant&acirc;neos configurados para cada bloco de tempo. Se mais que uma vers&atilde;o de instant&acirc;neo existir dentro de um bloco de tempo, apenas ser&aacute; mantido o mais recente. Por exemplo, se configurar uma pol&iacute;tica de 10 <strong>instant&acirc;neos semanais</strong>, o Gestor de Protec&ccedil;&atilde;o de Dados ir&aacute; reter o instant&acirc;neo mais recente (caso seja tirado mais que um instant&acirc;neo numa semana) para cada uma das mais recentes 10 semanas.</p>
<img class="help_image" src="https://help.synology.com/file/DSM/5.2/online_img/dsm/DisasterRecovery/retention_policy.png">
<p>Mais ainda, todas as vers&otilde;es de instant&acirc;neos com menos de uma hora relativamente ao instant&acirc;neo mais recente ser&atilde;o mantidas por predefini&ccedil;&atilde;o, para ser mais f&aacute;cil encontrar e restaurar de vers&otilde;es recentes de instant&acirc;neos. Pode tamb&eacute;m bloquear um instant&acirc;neo para evitar a sua remo&ccedil;&atilde;o autom&aacute;tica segundo as suas regras de reten&ccedil;&atilde;o.</p>
</div>

</body>
</html>