<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Instant&acirc;neos</h2>
	<p>Esta p&aacute;gina permite-lhe tirar, remover e editar instant&acirc;neos, bem como configurar o agendamento e defini&ccedil;&otilde;es de reten&ccedil;&atilde;o de instant&acirc;neos</p>
    <p>Pode armazenar at&eacute; 256 c&oacute;pias de instant&acirc;neos de uma s&oacute; vez para cada pasta partilhada ou iSCSI LUN. Instant&acirc;neos minimizam o consumo do disco, preservando blocos individuais em vez de ficheiros inteiros. Pode ser usado espa&ccedil;o extra quando os ficheiros em pastas partilhadas ou blocos em iSCSI LUNs s&atilde;o actualizados ou removidos.</p>

<h3>Pasta Partilhada</h3>
<h4>Para tirar um instant&acirc;neo para uma pasta partilhada:</h4>
<ol>
  <li>Seleccione a pasta partilhada da qual deseja tirar um instant&acirc;neo.</li>
	<li>Clique em <strong>Tirar um Instant&acirc;neo</strong>.</li>
	<li>Introduza a descri&ccedil;&atilde;o na <strong>Descri&ccedil;&atilde;o</strong> para que o instant&acirc;neo seja tirado.</li>
	<li>Assinale/desmarque a caixa de verifica&ccedil;&atilde;o <strong>Bloquear</strong> para determinar se o instant&acirc;neo ir&aacute; ignorar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o quando a remo&ccedil;&atilde;o autom&aacute;tica &eacute; activada.</li>
  <li>Clique em <strong>OK</strong> para come&ccedil;ar a tirar um instant&acirc;neo.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul><li>De entre as defini&ccedil;&otilde;es da p&aacute;gina <strong>Painel de Controlo</strong> &gt; <strong>Pasta Partilhada</strong> &gt; <strong>Editar</strong>, apenas a permiss&atilde;o Windows ACL ser&aacute; gravada num instant&acirc;neo.</li></ul>
</div>

<h4>Para percorrer os instant&acirc;neos de pastas partilhadas:</h4>
<ol>
  <li>Seleccione uma pasta partilhada na qual deseja percorrer os instant&acirc;neos.</li>
	<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
  <li>Seleccione um instant&acirc;neo que percorrer e clique em <strong>Percorrer</strong>.</li>
</ol>

<div class="section"><h4>Nota:</h4>
	<ul>
		<li><strong>Percorrer</strong> instant&acirc;neo n&atilde;o est&aacute; dispon&iacute;vel para pastas partilhadas encriptadas.</li>
		<li>Se n&atilde;o conseguir percorrer o instant&acirc;neo, aceda ao <strong>Painel de Controlo</strong> &gt; <strong>Pasta Partilhada</strong> &gt; <strong>Editar</strong> para activar <strong>Tornar vis&iacute;vel instant&acirc;neo</strong>.</li>
	</ul>
</div>

<h4>Para remover os instant&acirc;neos de pastas partilhadas:</h4>
<ol>
	<li>Seleccione uma pasta partilhada da qual deseja remover os instant&acirc;neos.</li>
	<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
	<li>Seleccione um ou mais instant&acirc;neos que deseja remover, e clique em <strong>Remover</strong>. (Mantenha premida a tecla Shift ou Ctrl enquanto efetua sele&ccedil;&otilde;es m&uacute;ltiplas.)</li>
	<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Eliminar</strong> para confirmar a remo&ccedil;&atilde;o.</li>
</ol>

<h4>Para editar os instant&acirc;neos de pastas partilhadas:</h4>
<ol>
	<li>Seleccione uma pasta partilhada da qual deseja editar os instant&acirc;neos.</li>
	<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
	<li>Seleccione um instant&acirc;neo que deseja editar e clique em <strong>Editar</strong>.</li>
	<li>Pode modificar a descri&ccedil;&atilde;o do instant&acirc;neo na <strong>Descri&ccedil;&atilde;o</strong>, e assinalar/desmarcar a caixa de verifica&ccedil;&atilde;o <strong>Bloquear</strong> para determinar se o instant&acirc;neo ir&aacute; ignorar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o quando a remo&ccedil;&atilde;o autom&aacute;tica for para ser activada.</li>
	<li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
</ol>

<h4>Para configurar instant&acirc;neos agendados:</h4>
<p>Com instant&acirc;neos agendados, Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; tirar automaticamente instant&acirc;neos no momento e com a frequ&ecirc;ncia predeterminadas, poupando-lhe o trabalho de tirar manualmente o instant&acirc;neo.</p>
<ol>
	<li>Seleccione uma pasta partilhada.</li>
	<li>Clique em <strong>Definir agendamento</strong>.</li>
	<li>No separador <strong>Agendamento</strong>, assinale a caixa de verifica&ccedil;&atilde;o <strong>Activar agendamento de instant&acirc;neo</strong>, e configure o momento e frequ&ecirc;ncia para tirar instant&acirc;neos. Para cancelar instant&acirc;neos agendados para esta pasta partilhada, desmarque a caixa de verifica&ccedil;&atilde;o.</li>
  <li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
  <li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>OK</strong> para confirmar a configura&ccedil;&atilde;o.</li>
</ol>

<div class="section"><h4>Nota:</h4>
	<ul>
	  <li>A configura&ccedil;&atilde;o de instant&acirc;neos agendados n&atilde;o ser&aacute; inclu&iacute;da na funcionalidade <strong>Painel de Controlo</strong> &gt; <strong>Actualizar e Restaurar</strong> &gt; <strong>C&oacute;pia de Seguran&ccedil;a de Configura&ccedil;&atilde;o</strong>.</li>
	</ul>
</div>

<h4>Para configurar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o para os instant&acirc;neos agendados:</h4>
<ol>
<li>Seleccione uma pasta partilhada.</li>
<li>Clique em <strong>Definir agendamento</strong>.</li>
<li>Seleccione o separador <strong>Reten&ccedil;&atilde;o</strong>.</li>
<li>Configure as suas defini&ccedil;&otilde;es de reten&ccedil;&atilde;o. Escolha uma das seguintes op&ccedil;&otilde;es:
	<ul>
		<li><strong>Remover instant&acirc;neos antigos assim que o limite seja atingido:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo de instant&acirc;neos, os instant&acirc;neos mais antigos ser&atilde;o substitu&iacute;dos por outros novos.</li>
		<li><strong>Reter sempre instant&acirc;neos:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo de instant&acirc;neos, o Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; parar de tirar novos instant&acirc;neos sem remover os que j&aacute; foram tirados.</li>
		<li><strong>Manter instant&acirc;neos com a seguinte pol&iacute;tica:</strong> Pode configurar as regras de reten&ccedil;&atilde;o para blocos de tempo especificados. Para mais informa&ccedil;&otilde;es, consulte a nota relativa &agrave; <a href="#smart_retention">Pol&iacute;tica de Reten&ccedil;&atilde;o</a>.</li>
	</ul>
</li>
<li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Alterar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o ir&aacute; afetar as defini&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Replica&ccedil;&atilde;o</strong>.</li>
</ul>
</div>

<h3>iSCSI LUN</h3>

<h4>Para tirar um instant&acirc;neo de um iSCSI LUN:</h4>
<ol>
<li>Seleccione o iSCSI LUN do qual deseja tirar um instant&acirc;neo.</li>
<li>Clique em <strong>Tirar um Instant&acirc;neo</strong>.</li>
<li>Introduza a descri&ccedil;&atilde;o na <strong>Descri&ccedil;&atilde;o</strong> para que o instant&acirc;neo seja tirado.</li>
<li>A partir da lista de selec&ccedil;&atilde;o <strong>Bloquear</strong>, seleccione <strong>Sim</strong>/<strong>N&atilde;o</strong> para determinar se o instant&acirc;neo ir&aacute; ignorar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o quando for activada a remo&ccedil;&atilde;o autom&aacute;tica.</li>
<li>Clique em <strong>OK</strong> para come&ccedil;ar a tirar um instant&acirc;neo.</li>
</ol>

<h4>Para remover um instant&acirc;neo de um iSCSI LUN:</h4>
<ol>
<li>Seleccione um iSCSI LUN do qual deseja remover os instant&acirc;neos.</li>
<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
<li>Seleccione um ou mais instant&acirc;neos que deseja remover, e clique em <strong>Remover</strong>. (Mantenha premida a tecla Shift ou Ctrl enquanto efetua sele&ccedil;&otilde;es m&uacute;ltiplas.)</li>
<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a remo&ccedil;&atilde;o.</li>
</ol>

<h4>Para editar um instant&acirc;neo de um iSCSI LUN:</h4>
<ol>
<li>Seleccione um iSCSI LUN do qual deseja editar os instant&acirc;neos.</li>
<li>Clique em <strong>Lista de instant&acirc;neos</strong>.</li>
<li>Seleccione um instant&acirc;neo que deseja editar e clique em <strong>Editar</strong>.</li>
<li>Pode fazer qualquer um dos seguintes para editar o instant&acirc;neo:
	<ul>
	  <li>Altere a descri&ccedil;&atilde;o do instant&acirc;neo na <strong>Descri&ccedil;&atilde;o</strong>.</li>
	  <li>Seleccione o <strong>Estado consistente</strong> caso esteja activado o instant&acirc;neo <a href="#app-consistent">consistente com aplica&ccedil;&atilde;o</a>.</li>
	  <li>Alterne entre <strong>Sim</strong>/<strong>N&atilde;o</strong> a partir da lista de selec&ccedil;&atilde;o <strong>Bloquear</strong> para determinar se o instant&acirc;neo ir&aacute; ignorar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o quando for activada a remo&ccedil;&atilde;o autom&aacute;tica.</li>
	</ul>
</li>
<li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
</ol>

<h4>Para configurar instant&acirc;neos agendados:</h4>
<p>Com instant&acirc;neos agendados, Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; tirar automaticamente instant&acirc;neos no momento e com a frequ&ecirc;ncia predeterminadas, poupando-lhe o trabalho de tirar manualmente o instant&acirc;neo.</p>
<ol>
	<li>Seleccione um iSCSI LUN.</li>
	<li>Clique em <strong>Definir agendamento</strong>.</li>
	<li>No separador <strong>Agendamento</strong>, assinale a caixa de verifica&ccedil;&atilde;o <strong>Activar agendamento de instant&acirc;neo</strong>, e configure o momento e frequ&ecirc;ncia para tirar instant&acirc;neos. Para cancelar instant&acirc;neos agendados para esta pasta partilhada, desmarque a caixa de verifica&ccedil;&atilde;o.</li>
  <li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
</ol>

<h4>Para configurar as defini&ccedil;&otilde;es de reten&ccedil;&atilde;o para os instant&acirc;neos agendados:</h4>
<ol>
<li>Seleccione um iSCSI LUN.</li>
<li>Clique em <strong>Definir agendamento</strong>.</li>
<li>Seleccione o separador <strong>Reten&ccedil;&atilde;o</strong>.</li>
<li>Configure as suas defini&ccedil;&otilde;es de reten&ccedil;&atilde;o. Escolha uma das seguintes op&ccedil;&otilde;es:
	<ul>
		<li><strong>Remover instant&acirc;neos antigos assim que o limite seja atingido:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo de instant&acirc;neos, os instant&acirc;neos mais antigos ser&atilde;o substitu&iacute;dos por outros novos.</li>
		<li><strong>Reter sempre instant&acirc;neos:</strong> Quando &eacute; atingido o n&uacute;mero m&aacute;ximo de instant&acirc;neos, o Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; parar de tirar novos instant&acirc;neos sem remover os que j&aacute; foram tirados.</li>
		<li><strong>Manter instant&acirc;neos com a seguinte pol&iacute;tica:</strong> Pode configurar as regras de reten&ccedil;&atilde;o para blocos de tempo especificados. Para mais informa&ccedil;&otilde;es, consulte a nota relativa &agrave; <a href="#smart_retention">Pol&iacute;tica de Reten&ccedil;&atilde;o</a>.</li>
	</ul>
</li>
<li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique novamente em <strong>OK</strong> para confirmar a configura&ccedil;&atilde;o.</li>
</ol>

<h4>Para configurar o estado consistente dos instant&acirc;neos iSCSI LUN:</h4>
<ol>
<li>Seleccione um iSCSI LUN.</li>
<li>Clique em <strong>Definir agendamento</strong>.</li>
<li>Seleccione o separador <strong>Aplica&ccedil;&atilde;o</strong>.</li>
<li>Assinale/desmarque a caixa de verifica&ccedil;&atilde;o <strong>Activar instant&acirc;neos consistentes com aplica&ccedil;&atilde;o</strong> para alternar entre os seguintes estados consistentes:
  <ul>
<li><a name="app-consistent"></a><strong>Consistente com a Aplica&ccedil;&atilde;o</strong> Instant&acirc;neos neste estado consistente s&oacute; podem ser obtidos com o Synology Snapshot Manager instalado no seu servidor Windows ou VMware vCenter Server, dependendo do seu ambiente operativo para comunicar com o DSM. Quando s&atilde;o acionados instant&acirc;neos consistentes com a aplica&ccedil;&atilde;o no DSM, s&atilde;o notificadas as aplica&ccedil;&otilde;es e todos os dados da mem&oacute;ria s&atilde;o enviados para o LUN do qual o instant&acirc;neo &eacute; obtido, para garantir a consist&ecirc;ncia dos dados.
	<div class="section"><h4>Nota:</h4>
		<ul><li>Se o Synology Snapshot Manager n&atilde;o tiver sido instalado no seu ambiente operativo, o instant&acirc;neo consistente com a aplica&ccedil;&atilde;o permanecer&aacute; desactivado mesmo que a caixa de verifica&ccedil;&atilde;o esteja assinalada.</li></ul>
	</div>
</li>
<li><strong>Consistente com Avaria</strong> Se o Synology Snapshot Manager n&atilde;o foi instalado em qualquer dos seus clientes, pode apenas capturar instant&acirc;neos consistentes com avarias de LUNs. Quando s&atilde;o accionados instant&acirc;neos consistentes com avarias, as aplica&ccedil;&otilde;es n&atilde;o ser&atilde;o notificadas para enviar os dados da mem&oacute;ria para o LUN e, dessa forma, n&atilde;o &eacute; garantida a consist&ecirc;ncia dos dados.</li>
</ul>
</li>
<li>Clique em <strong>OK</strong> para guardar as suas defini&ccedil;&otilde;es.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>Alterar as defini&ccedil;&otilde;es do estado consistente ir&aacute; afetar as defini&ccedil;&otilde;es equivalentes na p&aacute;gina <strong>Replica&ccedil;&atilde;o</strong>.</li>
</ul>
</div>

<p>____<br/>
<div class="section">
  <h4><a name="smart_retention"></a>Pol&iacute;tica de Reten&ccedil;&atilde;o</h4>
  <p>Esta op&ccedil;&atilde;o proporciona uma solu&ccedil;&atilde;o ideal para o ajudar a especificar os montantes m&aacute;ximos de vers&otilde;es de instant&acirc;neos para poupar espa&ccedil;o no seu volume, mas poder&aacute; ter de reter os seus instant&acirc;neos durante per&iacute;odos maiores de tempo.</p>
  <p>A Synology emprega a pol&iacute;tica de reten&ccedil;&atilde;o GFS, ou Grandfather-Father-Son Pode configurar os montantes m&aacute;ximos de vers&otilde;es de instant&acirc;neos a ser retidos para os seguintes blocos de tempo, respectivamente: <strong>a cada hora</strong>, <strong>di&aacute;rio</strong>, <strong>semanal</strong>, <strong>mensal</strong>, e <strong>anual</strong>.</p>
  <p>Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; reter o n&uacute;mero m&aacute;ximo de intant&acirc;neos configurados para cada bloco de tempo. Se mais que uma vers&atilde;o de instant&acirc;neo existir dentro de um bloco de tempo, apenas ser&aacute; mantido o mais recente. Por exemplo, se configurar uma pol&iacute;tica de 10 <strong>instant&acirc;neos semanais</strong>, o Instant&acirc;neo e Replica&ccedil;&atilde;o ir&aacute; reter o instant&acirc;neo mais recente (caso seja tirado mais que um instant&acirc;neo numa semana) para cada uma das mais recentes 10 semanas.</p>
<img class="help_image" src="../../../online_img/dsm/DisasterRecovery/retention_policy.png">
  <p>Mais ainda, todas as vers&otilde;es de instant&acirc;neos com menos de uma hora relativamente ao instant&acirc;neo mais recente ser&atilde;o mantidas por predefini&ccedil;&atilde;o, para ser mais f&aacute;cil encontrar e restaurar de vers&otilde;es recentes de instant&acirc;neos. Pode tamb&eacute;m bloquear um instant&acirc;neo para evitar a sua remo&ccedil;&atilde;o autom&aacute;tica segundo as suas regras de reten&ccedil;&atilde;o.</p>
</div>
</p>

</body>
</html>