<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Envio de Registos - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Configure DiskStation as a syslog client to transmit logs to a syslog server for centralized management.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Envio de Registos</h2>
<p>Se disp&otilde;e de um servidor syslog, pode seguir as instru&ccedil;&otilde;es abaixo para configurar o seu DiskStation como um cliente syslog e transmitir registos de sistema local do seu DiskStation para um servidor syslog para monitoriza&ccedil;&atilde;o e gest&atilde;o centralizadas. </p>

<h4>Para enviar registos para um servidor syslog:</h4>
<ol>
<li>Aceda a <strong>Centro de Registos</strong> &gt; <strong>Envio de Registos</strong>. </li>
<li>Assinale a caixa <strong>Enviar registos para um servidor syslog</strong>.</li>
<li>Introduza o nome de anfitri&atilde;o ou o endere&ccedil;o IP do servidor syslog em <strong>Servidor</strong>. </li>
<li>Especifique um n&uacute;mero de porta para a rece&ccedil;&atilde;o de mensagens do syslog em <strong>Porta</strong>.</li>
<li>Selecione <strong>UDP</strong> ou <strong>TCP</strong> em <strong>Protocolo de transfer&ecirc;ncia</strong>. Isto deve ser coincidente com o protocolo utilizado pelo servidor syslog.</li>
<li>Selecione <strong>BSD (RFC 3164)</strong> ou <strong>IETF (RFC 5424)</strong> em <strong>Formato do Registo</strong> para enviar os registos utilizando o formato selecionado.</li>
	
    <div class="section">
	<h4>Nota:</h4>
	<ul>
    <li>Por predefini&ccedil;&atilde;o, a porta &eacute; 514. Deve definir as regras de encaminhamento de porta adequadas se pretender atribuir de novo um n&uacute;mero de porta diferente a um servidor syslog.</li>
    <li>O UDP (Protocolo Datagram do Utilizador) &eacute; um protocolo de liga&ccedil;&otilde;es baseadas em mensagem mais simples, que &eacute; mais r&aacute;pido mas tem falhas a n&iacute;vel de seguran&ccedil;a e de corre&ccedil;&atilde;o de erros. O TCP (Protocolo de Controlo de Transmiss&atilde;o) oferece garantia da entrega, em que utiliza um controlo de fluxo para determinar se todos os pacotes foram enviados com &ecirc;xito at&eacute; serem processados novos pacotes.</li>
    <li>A liga&ccedil;&atilde;o segura (SSL) apenas est&aacute; dispon&iacute;vel com a utiliza&ccedil;&atilde;o do TCP.</li>
    <li>Se escolher o TCP e pretender proteger a liga&ccedil;&atilde;o syslog com SSL, pode assinalar a op&ccedil;&atilde;o <strong>Ativar liga&ccedil;&atilde;o segura (SSL)</strong>. Em seguida, clique em <strong>Importar certificado</strong> e selecione o certificado para transferir registos para o servidor syslog em seguran&ccedil;a.</li>
    </ul>
	</div>

<li>Clique em <strong>Enviar registo de teste</strong> para confirmar se o servidor syslog recebe o registo com &ecirc;xito. Se o servidor syslog n&atilde;o receber o registo de teste, verifique se as defini&ccedil;&otilde;es est&atilde;o corretas.</li>
<li>Clique em <strong>Aplicar</strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<h3>Filtrar Registos</h3>
<p>No separador <strong>Filtrar</strong>, pode especificar que tipos de registos s&atilde;o enviados para o servidor syslog, de acordo com a categoria (por exemplo, sistema, liga&ccedil;&atilde;o, c&oacute;pia de seguran&ccedil;a) ou a gravidade (por exemplo, aviso, erro, informa&ccedil;&atilde;o).</p>
</body>
</html>
