<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Contatar suporte</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>



</head>
<body>

<h2>Contatar suporte</h2>
<p>O Synology Support Center &eacute; o recurso de conhecimento que prestar&aacute; suporte para seus problemas de DiskStation durante o per&iacute;odo de garantia do produto. Estamos aqui para ajudar a garantir e manter o desempenho ideal de seu DiskStation. Para usar esse servi&ccedil;o e manter um t&iacute;quete de suporte, v&aacute; para <b>Centro de suporte</b> &gt; <b>Contatar suporte</b>.</p>

<h4>Leia antes de iniciar um novo t&iacute;quete de suporte:</h4>
<ul>
<li>Para economizar tempo, aconselhamos que voc&ecirc; pesquise a <a href="http://www.synology.com/support/knowledge_base" target="_blank">Base de conhecimento</a> antes de iniciar um novo t&iacute;quete de suporte, pois suas perguntas j&aacute; podem ter sido feitas e n&oacute;s cri&aacute;mos um artigo sobre isso.
</li>
<li>Voc&ecirc; pode usar sua <a href="https://account.synology.com/" target="_blank">conta Synology</a> ou endere&ccedil;o de e-mail preferido para iniciar um novo t&iacute;quete de suporte do DSM.</li>
<li>Todos os campos obrigat&oacute;rios devem ser preenchidos no novo t&iacute;quete de suporte.
</li>
<li>Para evitar mau entendimentos, envie o t&iacute;quete de suporte em <b>Ingl&ecirc;s</b> ou <b>Chin&ecirc;s</b>.
</li>
</ul>

<h4>Dicas para iniciar um novo t&iacute;quete de suporte:</h4>
<ul>
<li>Descreva o problema que est&aacute; reportando e inclua algumas etapas que realizou para resolver o problema sozinho. Inclua detalhes que ajudar&atilde;o os engenheiros de suporte t&eacute;cnico da Synology a compreenderem o problema. Se poss&iacute;vel, forne&ccedil;a etapas numeradas, incluindo capturas de telas, para reproduzir a situa&ccedil;&atilde;o.
</li>
<li>Nossa equipe de suporte remover&aacute; anexos superiores a 20 MB.
</li>
</ul>

<h4>O que esperar depois que um t&iacute;quete de suporte for enviado:</h4>
<ul>
<li>Um engenheiro de suporte t&eacute;cnico da Synology entrar&aacute; em contato com voc&ecirc; em breve, depois que o t&iacute;quete de suporte for enviado.
</li>
<li>Se n&atilde;o formos conhecidos seus, &eacute; muito importante certificar-se de que esses emails n&atilde;o estejam bloqueados pelo software de seguran&ccedil;a em seu computador ou em sua rede.
</li>
<li>Cada t&iacute;quete de suporte possui um ID exclusivo e esse ID est&aacute; contido no assunto do email enviado em resposta ao t&iacute;quete de suporte.
</li>
<li>Nossos engenheiros de suporte t&eacute;cnico podem pedir a voc&ecirc; que habilite acesso remoto em seu DiskStation para poderem executar diagn&oacute;sticos adicionais a partir de um escrit&oacute;rio da Synology. Consulte os <a href="support_services.html">Servi&ccedil;os de suporte</a> para obter instru&ccedil;&otilde;es detalhadas.
</li>
</ul>

</body>
</html>