<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Servi&ccedil;os de Suporte</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>Servi&ccedil;os de Suporte</h2>
<p>
Os Servi&ccedil;os de Suporte incluem ferramentas de acesso remoto e de gera&ccedil;&atilde;o de registos, permitindo aos nossos engenheiros de suporte verem, diagnosticarem e resolverem rapidamente eventuais problemas t&eacute;cnicos com o seu DiskStation a partir de um escrit&oacute;rio da Synology. Para isso, aceda a <b>Centro de Suporte</b> &gt; <b>Servi&ccedil;os de Suporte</b>.
</p>

<h4>Para activar o acesso remoto: </h4>
<p>
Active o acesso remoto no seu DiskStation somente quando solicitado pelos engenheiros de suporte t&eacute;cnico da Synology.
</p>
<ol>
<li>Assinale a caixa de verifica&ccedil;&atilde;o <b>Activar o acesso remoto</b> e, em seguida, clique em <b>Aplicar</b> para que as altera&ccedil;&otilde;es sejam assumidas.
</li>
<li>Forne&ccedil;a aos engenheiros de suporte t&eacute;cnico da Synology a sua palavra-passe de admin e a chave de identifica&ccedil;&atilde;o de suporte via e-mail.
</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>O acesso remoto ser&aacute; desactivado automaticamente ap&oacute;s 14 dias. N&atilde;o dever&aacute; ser desactivado manualmente, salvo se um engenheiro de suporte t&eacute;cnico da Synology lhe pedir que o fa&ccedil;a.
</li>
<li>Remova todos os conte&uacute;dos que considere privados do seu DiskStation. 
</li>
<li>Embora a Synology n&atilde;o possa garantir que a disponibiliza&ccedil;&atilde;o do acesso remoto resolva o problema, ir&aacute; efectuar todas as dilig&ecirc;ncias razo&aacute;veis para prestar os servi&ccedil;os de suporte de forma profissional.
</li>	
</ul>
</div>

<h4>Para gerar registos: </h4>
<p>
Gere e forne&ccedil;a registos apenas a engenheiros de suporte t&eacute;cnico da Synology.
</p>
<ol>
<li>Clique em <b>Gerar registos</b> e aguarde alguns minutos pela conclus&atilde;o da transfer&ecirc;ncia.
</li>
<li>Envie os registos por e-mail aos engenheiros de suporte t&eacute;cnico da Synology.
</li>
</ol>

<div class="section">
<h4>Informa&ccedil;&otilde;es importantes acerca dos nossos Servi&ccedil;os de Suporte</h4>
<ul>
<li>Respeitamos o seu DiskStation como se fosse nosso.</li>
<li>O seu DiskStation apenas ser&aacute; utilizado para fins de diagn&oacute;stico do sistema. A Synology n&atilde;o aceder&aacute; nem divulgar&aacute; quaisquer outras informa&ccedil;&otilde;es pessoais guardadas no seu DiskStation. </li> 

</ul>
</div>

</body>
</html>
