<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Synology Account</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Conta Synology</h2>

<p>Na <strong>Conta Synology</strong>, voc&ecirc; pode acessar e gerenciar facilmente as configura&ccedil;&otilde;es dos seus servi&ccedil;os e eNews associados ao seu DiskStation e pacotes. 

<ul>
<li><strong>Conta</strong>: visualizar e editar as informa&ccedil;&otilde;es de sua conta Synology.</li>
<li><strong>Hist&oacute;rico de compras</strong>: Procure ou pesquise as atividades de compras de pacotes.</li>
<li><strong>eNews</strong>: Selecione uma ou mais categorias de eNews para receber da Synology e personalize o conte&uacute;do assinado.</li>
<li><strong>Logout</strong>: Encerre todos os servi&ccedil;os da conta Synology associados ao seu DiskStation.</li>
</ul>

<h4>Para fazer login em sua conta Synology:</h4>
<ol>
<li>V&aacute; para <strong>Conta Synology</strong>.</li>
<li>Na janela pop-up <strong>Fa&ccedil;a login em sua conta Synology</strong>, digite o endere&ccedil;o de e-mail e senha que voc&ecirc; usou para registar sua conta Synology.</li>
       <ul>
       <li>Se voc&ecirc; n&atilde;o tem uma conta Synology, clique em <strong>Precisa de uma conta Synology?</strong> para se registrar.</li>
       <li>Se voc&ecirc; esqueceu sua senha, clique em <strong>Esqueceu sua senha?</strong> para que uma nova senha seja enviada por e-mail.</li>   
       </ul>
<li>Clique em <strong>Login</strong> para acessar os servi&ccedil;os da sua conta Synology.</li>
</ol>

<h4>Para visualizar e editar a conta Synology:</h4>
<ol>
<li>Clique em <strong>Conta</strong> no painel esquerdo para exibir informa&ccedil;&otilde;es de sua conta.</li>
<li>Clique no campo para alterar as informa&ccedil;&otilde;es da conta.</li>
<li>Para aplicar as configura&ccedil;&otilde;es, clique em <strong>Aplicar</strong>.</li>
</ol>

<h4>Para exibir o hist&oacute;rico de compras de seu DiskStation:</h4>
<ol>
<li>Clique <strong>Hist&oacute;rico de compras</strong> no painel esquerdo.</li>
<li>Escolha uma das formas para encontrar o hist&oacute;rico de compras de pacote de seu DiskStation.
    <ul>
    <li>Para fazer isso por meio de palavras-chave, selecione <strong>Pesquisa por palavra-chave</strong>.
        <ul>
        <li>Digite a palavra-chave e selecione o filtro apropriado.</li>
        </ul>
        </li>
    <li>Para fazer isso por data de compra, selecione <strong>Procurar por data</strong>.
        <ul>
        <li>Clique nos &iacute;cones de calend&aacute;rio para especificar um per&iacute;odo de tempo em que voc&ecirc; comprou o seu DiskStation ou pacotes.</li>        
        </ul>
        </li>
  </ul>
  </li>
<li>Clique em <strong>Pesquisar</strong>.</li>
<li>As informa&ccedil;&otilde;es de compra de pacote consultadas (ex.: a data da compra e o pre&ccedil;o) ser&atilde;o exibidas.</li>
</ol>




<h4>Para assinar o Synology eNews:</h4>
<ol>
<li>Clique em <strong>eNews</strong> no painel esquerdo.</li>
<li>Em <strong>Configura&ccedil;&otilde;es do eNews</strong>, marque uma ou mais categorias de eNews para receber da Synology.</li>
<li>Voc&ecirc; pode ajustar as configura&ccedil;&otilde;es do eNews nas listas suspensas:</li>
    <ul>
    <li><strong>Novos produtos e lan&ccedil;amentos de recursos</strong>: Selecione o idioma da assinatura.</li>
    <li><strong>Informa&ccedil;&otilde;es em primeira m&atilde;o sobre eventos promocionais locais</strong>: Selecione um pa&iacute;s para conhecer seus eventos locais promovidos pela Synology.</li>
    <li><strong>Atualiza&ccedil;&otilde;es importantes do DSM</strong>: Selecione uma ou mais vers&otilde;es do DSM para as atualiza&ccedil;&otilde;es correspondentes.</li>   
    </ul>
<li>Para aplicar as configura&ccedil;&otilde;es, clique em <strong>Aplicar</strong>.</li>
</ol>



<h4>Para fazer logout da conta Synology:</h4>
<ol>
<li>Clique no bot&atilde;o <strong>Logout</strong> no canto inferior esquerdo.</li>
<li>Ap&oacute;s sair, todos os servi&ccedil;os da conta Synology (como DDNS e QuickConnect) e pacotes associados &agrave; conta de login n&atilde;o estar&atilde;o dispon&iacute;veis para seu DiskStation.</li>
</ol>



<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ol>
<li>Ap&oacute;s alterar o endere&ccedil;o de e-mail, uma mensagem de confirma&ccedil;&atilde;o ser&aacute; enviada para o novo endere&ccedil;o para verificar a altera&ccedil;&atilde;o.</li>
<li>Ap&oacute;s sair, os pacotes permanecer&atilde;o instalados em seu DiskStation, mas suas licen&ccedil;as ir&atilde;o expirar.</li>
</ol>
</div>

</body>
</html>
