<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Optionen</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Photo Station</h2>
<p>Die pers&ouml;nliche Photo Station ist ein Online-Fotoalbum mit Blog, das von einem DSM-Benutzer verwaltet wird. DiskStation erstellt den Ordner <b>home/photo</b>, in dem Sie Fotos und Videos speichern k&ouml;nnen, die Sie freigeben m&ouml;chten. Das System erzeugt automatisch Miniaturansichten der Fotos und Videos, und Nutzer k&ouml;nnen dann Fotoalben &uuml;ber einen Webbrowser ansehen.</p>
<h4>So aktivieren Sie die pers&ouml;nliche Photo Station:</h4>
<p>Klicken Sie auf <b>Photo Station aktivieren - [Benutzername]</b> und klicken Sie auf <b>OK</b>.</p>
<h4>So bearbeiten Sie die Einstellungen der pers&ouml;nlichen Photo Station:</h4>
<ol>

<li>Markieren Sie <b>Neue Ordner als &ouml;ffentliche Alben einstellen</b>, wenn die hochgeladenen Fotoalben Besuchern zur Verf&uuml;gung stehen sollen.</li>
<li>Klicken Sie auf <b>Neu ordnen</b>, um die Index-Struktur der Bilderdateien zu rekonstruieren, wenn Bilder in der Photo Station fehlen.</li>

<li>Klicken Sie auf <b>OK</b>.</li>
</ol>

<h4>Gehen Sie auf eine der folgenden Weisen vor, um die Photo Station zu starten:</h4>
<ul>
  <li> Wechseln Sie zum <b>Hauptmen&uuml;</b> und klicken Sie auf <b>Photo Station</b>. </li>
  <li>Geben Sie die folgende Webadresse in die Adresszeile Ihres Browsers ein: <strong>http://Synology_Server_IP_Address/photo/</strong></li>
</ul>
<h4>Gehen Sie auf eine der folgenden Weisen vor, um die pers&ouml;nliche Photo Station zu starten:</h4>
<ul>
<li>Klicken Sie auf <b>Photo Station starten</b>.</li>
<li>Gehen Sie zu <b>Hauptmen&uuml;</b> und klicken Sie auf <b>Photo Station - [Benutzername]</b>.</li>
<li>Geben Sie die folgende Webadresse in die Adresszeile Ihres Browsers ein: <strong>http://Synology_Server_IP_Address/~username/photo/</strong></li>
</ul>

<div class="section">
<h4>Unterst&uuml;tzung und Beschr&auml;nkungen:</h4>

<ul>
<li>Unterst&uuml;tzte Bildformate: BMP, JPEG, GIF, RAW (arw, srf, sr2, dcr, k25, kdc, cr2, crw, nef, mrw, ptx, pef, raf, raw, 3fr, erf, mef, mos, orf, rw2, dng, x3f), TIFF, PNG</li>
<li>Unterst&uuml;tzte Videoformate: 3G2, 3GP, ASF, AVI, DAT, DivX, FLV, M4V, MOV, MP4, MPEG, MPG, MTS, M2TS, M2T QT, WMV, XviD, RM<sup>(1)</sup>, RMVB<sup>(1)</sup>, VOB<sup>(1)</sup></li>
<li>Sie k&ouml;nnen maximal 2&nbsp;GB an Inhalten auf einmal mit der pers&ouml;nlichen Photo Station hochladen.</li>
<p><span class="note_head">Hinweis (1):</span> Benutzer k&ouml;nnen Dateien der angegebenen Formate herunterladen, sie aber nicht als komprimiertes Flash Video mit Photo Station abspielen.</p>
</ul>

<h4>So wird die pers&ouml;nliche Photo Station verwendet:</h4>
<p>Sie k&ouml;nnen Bilder oder Videodateien in den Ordner <b>home/photo</b> hochladen und einen Blog erstellen. Gegen Sie wie folgt vor:</p>
<ol>
<li>Legen Sie Fotos und Videos, die Sie freigeben m&ouml;chten, in Ordnern ab. Diese Ordner werden auf der pers&ouml;nlichen Photo Station zu Alben.</li>
<li>Laden Sie die Albumordner in den Ordner <b>home/photo</b> hoch.</li>
<li>Gehen Sie mit dem Browser zu <b>http://servername/~username/photo/</b>, um Ihre Alben anzusehen.</li>
<li>Wenn Sie Ihren Blog erstellen m&ouml;chten, klicken Sie auf <b>Blog</b> in der rechten oberen Ecke und melden Sie sich an, um Eintr&auml;ge vorzunehmen.</li>
</ol>
<h4></b>So werden eigene Alben und Blogs auf der pers&ouml;nlichen Photo Station ver&ouml;ffentlicht:</h4>
<p>Wenn Sie Ihre pers&ouml;nliche Photo Station ver&ouml;ffentlichen und anderen &uuml;ber das Internet zur Verf&uuml;gung stellen m&ouml;chten, m&uuml;ssen Sie DiskStation so einstellen, dass externe IPs verwendet werden.</p>
<ol>
<li>Melden Sie sich als <b>admin</b> oder als Benutzer der Gruppe <b>administrators</b> bei DiskStation an.</li>
<li>Wenden Sie Folgendes an, um DiskStation im Internet zu verankern:</li>
<ul>
<li>Eine externe IP. Wechseln Sie zu <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <b>Netzwerk</b>, um die Netzwerkeinstellungen Ihres Servers zu bearbeiten, wenn Sie von Ihrem Netzwerk-Serviceanbieter eine spezielle externe IP-Adresse erhalten.</li>
<li>Die PPPoE-Einstellungen. Wechseln Sie zu <b>PPPoE</b> unter <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <b>Netzwerk</b>, um die PPPoE-Verbindung zu aktivieren.</li>
</ul>
<li>Wenn Sie ein registriertes DDNS-Konto verwenden m&ouml;chten, gehen Sie zu <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <strong>Externer Zugriff</strong> &gt; <b>DDNS</b>, um den DDNS-Dienst zu aktivieren.</li>
<li>Fertig!</li>
</ol>
<p>Jetzt k&ouml;nnen Personen &uuml;ber das Internet Ihre Alben und Ihren Blog durchsuchen, indem sie in ihrem Browser <b>http://serverIP/~username/photo/</b> oder <b>http://DDNS_hostname/~username/photo/</b> eingeben.</p>

</div>
</body>
</html>
