<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Optionen</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Desktop</h2>
<p>Sie k&ouml;nnen das Aussehen Ihres Desktops anpassen.</p>
<h4>So &auml;ndern Sie den Hintergrund und die Textfarbe Ihres Desktops:</h4>
<ol>
<li>Markieren Sie <b>Benutzerdefinierte Farbe</b> und w&auml;hlen Sie anschlie&szlig;end Optionen in den Drop-down-Men&uuml;s, um die Textfarbe von Desktop-Miniaturansichten und die Hintergrundfarbe des DSM-Desktops zu &auml;ndern.</li>
<li>Klicken Sie auf <b>OK</b>.</li>
</ol>

<h4>So laden Sie ein benutzerdefiniertes Bild, das Sie als Hintergrundbild auf Ihrem Desktop verwenden m&ouml;chten, hoch:</h4>
<ol>
<li>Markieren Sie <b>Hintergrund anpassen</b>, und gehen Sie anschlie&szlig;end folgenderma&szlig;en vor, um Ihr Hintergrundbild auszuw&auml;hlen:</li>
<ul>
<li>Wenn Sie ein auf DiskStation gespeichertes Bild verwenden m&ouml;chten, klicken Sie auf <b>Bild ausw&auml;hlen</b>, um das Bild auszuw&auml;hlen. Klicken Sie anschlie&szlig;end auf <b>Ausw&auml;hlen</b>.</li>
<li>Wenn Sie den von Synology bereitgestellten Standardhintergrund verwenden oder ein Bild ausw&auml;hlen m&ouml;chten, das Sie zuvor bereits als Hintergrundbild genutzt haben, klicken Sie auf <b>Bild ausw&auml;hlen</b>, w&auml;hlen Sie ein Bild im Bereich <b>Eigene Bilder</b> aus, und klicken Sie auf <b>Ausw&auml;hlen</b>.<br></li>
<li>Wenn Sie ein auf dem Computer gespeichertes Bild verwenden m&ouml;chten, klicken Sie auf <b>Bild ausw&auml;hlen</b> und anschlie&szlig;end auf <strong>Hochladen</strong>, um das Bild auszuw&auml;hlen.</li>
</li>
</ul>
<li>W&auml;hlen Sie eine Option im Drop-down-Men&uuml;, um zu entscheiden, wie das Bild auf dem DSM-Desktop angeordnet wird.</li>
</li>
<li>Klicken Sie auf <b>OK</b>.</li>
</ol>
</body>
</html>
