<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Options</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Photo Station</h2>
<p>Photo Station personnel est un album photo en ligne avec blog, d&eacute;tenu et g&eacute;r&eacute; par un utilisateur de DSM. DiskStation fournit le dossier <b>home/photo</b>permettant de stocker les photos et les vid&eacute;os que vous souhaitez partager. Le syst&egrave;me cr&eacute;era automatiquement des miniatures d&rsquo;index des photos et des vid&eacute;os puis vos albums photos pourront &ecirc;tre visionn&eacute;s depuis un navigateur Web.</p>
<h4>Pour activer Photo Station personnel&nbsp;:</h4>
<p>Cliquez sur <b>Activer Photo Station personnel - [nom d&rsquo;utilisateur]</b> et cliquez sur <b>OK</b>.</p>
<h4>Pour modifier les param&egrave;tres de Photo Station personnel&nbsp;:</h4>
<ol>

<li>Cochez <b>D&eacute;finir les dossiers comme albums publics</b> si vous voulez que les visiteurs aient acc&egrave;s aux albums photos charg&eacute;s.</li>
<li>Cliquez sur <b>Re-indexation</b> pour reconstituer la structure de l&apos;index des fichiers image si des images sont absentes dans Photo&nbsp;Station.</li>

<li>Cliquez sur <b>OK</b>.</li>
</ol>

<h4>Pour lancer Photo Station, proc&eacute;dez de l&rsquo;une des mani&egrave;res suivantes&nbsp;:</h4>
<ul>
  <li> Allez dans <b>Menu principal</b> et cliquez sur <b>Photo Station</b>. </li>
  <li>Saisissez l&apos;adresse Web suivante dans la barre d&apos;adresse de votre navigateur Web&nbsp;: <strong>http://Synology_Server_IP_Address/photo/</strong></li>
</ul>
<h4>Pour lancer Photo Station personnel, proc&eacute;dez d&rsquo;une des mani&egrave;res suivantes&nbsp;:</h4>
<ul>
<li>Cliquez sur <b>Lancer Photo Station</b>.</li>
<li>Allez dans <b>Menu principal</b> et cliquez sur <b>Photo Station - [nom d&apos;utilisateur]</b></li>
<li>Saisissez l&apos;adresse Web suivante dans la barre d&apos;adresse de votre navigateur Web&nbsp;: <strong>http://Synology_Server_IP_Address/~username/photo/</strong></li>
</ul>

<div class="section">
<h4>Prise en charge et limites&nbsp;:</h4>

<ul>
<li>Formats d&apos;image pris en charge&nbsp;: BMP, JPEG, GIF, RAW (arw, srf, sr2, dcr, k25, kdc, cr2, crw, nef, mrw, ptx, pef, raf, raw, 3fr, erf, mef, mos, orf, rw2, dng, x3f), TIFF, PNG</li>
<li>Prend en charge les formats vid&eacute;o&nbsp;: 3G2, 3GP, ASF, AVI, DAT, DivX, FLV, M4V, MOV, MP4, MPEG, MPG, MTS, M2TS, M2T QT, WMV, XviD, RM<sup>(1)</sup>, RMVB<sup>(1)</sup>, VOB<sup>(1)</sup></li>
<li>Si vous chargez du contenu avec Photo Station personnel, vous pouvez uniquement charger jusqu&apos;&agrave; 2&nbsp;Go de contenu en une fois.</li>
<p><span class="note_head">Remarque (1)&nbsp;:</span> Les utilisateurs peuvent t&eacute;l&eacute;charger les fichiers aux formats sp&eacute;cifi&eacute;s mais ne peuvent pas les lire dans Photo Station en tant que vid&eacute;o flash compress&eacute;e.</p>
</ul>

<h4>Comment utiliser Photo Station personnel&nbsp;?</h4>
<p>Vous pouvez charger des fichiers images ou vid&eacute;o dans le dossier <b>home/photo</b> et cr&eacute;er un blog. Pour ce faire&nbsp;:</p>
<ol>
<li>Organisez les photos et les vid&eacute;os que vous souhaitez partager dans des dossiers. Ces dossiers deviendront des albums dans Photo Station personnel.</li>
<li>Chargez les dossiers album dans le dossier <b>home/photo</b><b>.</b></li>
<li>Rendez-vous &agrave; l&apos;adresse <b>http://servername/~username/photo/</b> avec votre navigateur pour voir vos albums.</li>
<li>Pour cr&eacute;er votre blog, cliquez sur<b> <b>Blog</b></b> dans le coin sup&eacute;rieur droit et identifiez-vous pour pouvoir poster des messages.</li>
</ol>
<h4></b>Comment publier mes albums et mon blog sur Photo Station personnel&nbsp;?</h4>
<p>Pour publier mes albums et mon blog sur Photo Station personnel et les rendre accessibles depuis Internet, vous devez configurer DiskStation pour utiliser une IP externe.</p>
<ol>
<li>Connectez-vous &agrave; DiskStation en tant qu&apos;<b><b>admin</b></b> ou en tant qu&apos;utilisateur appartenant au groupe <b><b>administrators</b></b>.</li>
<li>Pour raccorder DiskStation &agrave; Internet, vous pouvez appliquer&nbsp;:</li>
<ul>
<li>Soit une IP externe. Acc&eacute;dez &agrave; <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>R&eacute;seau</b> pour &eacute;diter les param&egrave;tres r&eacute;seau du serveur si vous recevez une adresse IP externe sp&eacute;cifique de votre fournisseur de services r&eacute;seau.</li>
<li>Param&eacute;trage de PPPoE. Allez dans <b>PPPoE</b> en passant par <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>R&eacute;seau</b> pour activer la connexion PPPoE.</li>
</ul>
<li>Si vous souhaitez utiliser un compte DDNS enregistr&eacute;, allez dans <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <strong>Acc&egrave;s externe</strong> &gt; <b>DDNS</b> pour activer le service DDNS.</li>
<li>Termin&eacute;&nbsp;!</li>
</ol>
<p>D&eacute;sormais, les internautes peuvent parcourir vos albums et votre blog en dirigeant leur navigateur sur <b>http://serverIP/~username/photo/</b> ou <b>http://DDNS_hostname/~username/photo/</b>.</p>

</div>
</body>
</html>
