<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Options</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Bureau</h2>
<p>Vous pouvez personnaliser l&apos;apparence de votre bureau.</p>
<h4>Pour modifier l&rsquo;arri&egrave;re-plan et la couleur du texte de votre bureau&nbsp;:</h4>
<ol>
<li>Cochez <b>Couleur personnalis&eacute;e</b> puis choisissez dans les menus d&eacute;roulants pour changer la couleur du texte des miniatures du bureau et la couleur d&rsquo;arri&egrave;re-plan du bureau de DSM.</li>
<li>Cliquez sur <b>OK</b>.</li>
</ol>

<h4>Pour charger une image personnalis&eacute;e qui sera utilis&eacute;e comme papier-peint de votre bureau&nbsp;:</h4>
<ol>
<li>Cochez <b>Fond d&apos;&eacute;cran personnalis&eacute;</b>, puis proc&eacute;dez d&rsquo;une des mani&egrave;res suivantes pour s&eacute;lectionner votre image d&rsquo;arri&egrave;re-plan&nbsp;:</li>
<ul>
<li>Si vous voulez utiliser une image stock&eacute;e sur votre DiskStation, cliquez sur <b>S&eacute;lectionnez une image</b> pour s&eacute;lectionner l&apos;image, puis cliquez sur <b>S&eacute;lectionner</b>.</li>
<li>Si vous voulez utiliser le papier peint par d&eacute;faut fourni par Synology ou s&eacute;lectionner une image qui a &eacute;t&eacute; utilis&eacute;e pr&eacute;c&eacute;demment comme image d&rsquo;arri&egrave;re-plan, cliquez sur <b>S&eacute;lectionner une image</b>, s&eacute;lectionnez une image dans la section <b>Mes images</b>, puis cliquez sur <b>S&eacute;lectionner</b>.<br></li>
<li>Si vous voulez utiliser une image stock&eacute;e sur votre ordinateur, cliquez sur <b>S&eacute;lectionner une image</b>, puis cliquez sur <strong>Charger</strong> pour s&eacute;lectionner l&rsquo;image.</li>
</li>
</ul>
<li>Choisissez dans le menu d&eacute;roulant pour d&eacute;cider comment votre image d&apos;arri&egrave;re-plan est plac&eacute;e sur votre bureau de DSM.</li>
</li>
<li>Cliquez sur <b>OK</b>.</li>
</ol>
</body>
</html>
