<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Medienindizierungsdienst</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Konvertierungseinstellungen</h2>
<p>Wenn Sie Fotos oder Videos zur Verwendung mit Medienserver und Photo Station hochladen, werden Miniaturansichten erstellt, die die Navigation erleichtern. Hier k&ouml;nnen Sie die Qualit&auml;t der Miniaturansichten einstellen und die Konvertierung verfolgen.</p>
<p>Wenn Sie Videos im gemeinsamen Ordner <strong>photo</strong> der Photo Station auf Ihren mobilen Ger&auml;ten anzeigen m&ouml;chten, k&ouml;nnen Sie die Videokonvertierung aktivieren und den Fortschritt verfolgen.</p>
<h4>So stellen Sie die Qualit&auml;t der Miniaturansichten ein:</h4>
<ol>
<li>
W&auml;hlen Sie die gew&uuml;nschte Qualit&auml;t im Drop-down-Men&uuml; aus.
</li>
<li>
Klicken Sie auf <b>&Uuml;bernehmen</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Hinweis: </span>
<ul>
<li>Die Erstellung von hochwertigen Miniaturansichten ist zeitaufw&auml;ndiger.</li>
</ul>
</div>
<h4>So aktivieren Sie die Videokonvertierung f&uuml;r Mobilger&auml;te:</h4>
<ol>
<li>Markieren Sie <strong>Videokonvertierung f&uuml;r Mobilger&auml;te aktivieren</strong>.</li>
<li>Klicken Sie auf <strong>&Uuml;bernehmen</strong> und Sie werden in der Lage sein, Videos auf Ihren Mobilger&auml;ten unterwegs anzuschauen.
</li>
</ol>

<div class="section">
<span class="note_head">Hinweis: </span>
<ul>
<li>Sie k&ouml;nnen nur Videos, welche zum gemeinsamen Ordner <strong>photo</strong> auf der Photo Station hochgeladen wurden, in das Format konvertieren, das von Ihren Mobilger&auml;ten unterst&uuml;tzt wird.</li>
<li>MP4 Dateien werden nicht konvertiert.</li>
</ul>
</div>
<h4>So zeigen Sie den Vorgang der Foto-/Videokonvertierung an:</h4>
<ol>
<li>Wenn Fotos oder Videos auf DiskStation hochgeladen werden, klicken Sie auf das Symbol <strong>Konvertierungsvorgang</strong> oben rechts in der Taskleiste. </li>
<li>
Gehen Sie im angezeigten Fenster folgenderma&szlig;en vor:
</li>
<ul>
<li>
&Uuml;berwachen Sie unter <b>Konvertierungsvorgang</b> den Fortschritt und den Status der im Hintergrund erstellten Miniaturansichten.
</li>
<li>
Gehen Sie folgenderma&szlig;en vor, um den Konvertierungsvorgang anzuhalten:
</li>
<ol>
<li>
W&auml;hlen Sie im Drop-down-Men&uuml; <b>Verz&ouml;gerung um [Zahl] Stunde(n)</b> und klicken Sie auf <b>Pause</b>, um den Vorgang anzuhalten. (Standardm&auml;&szlig;ig wird <b>Verz&ouml;gerung um 1 Stunde(n)</b> vorgegeben.)
</li>
<li>Der Konvertierungsvorgang wird um die angegebene Verz&ouml;gerungszeit verz&ouml;gert. Um den Vorgang sofort fortzusetzen, k&ouml;nnen Sie auf <b>Fortsetzen</b> klicken.
</li>
</ol>
<div class="section">
<span class="note_head">Hinweis: </span>
<ul>
<li>Da der Konvertierungsvorgang die CPU stark auslastet, k&ouml;nnen durch eine Unterbrechung des Vorgangs Systemressourcen f&uuml;r andere laufende Aufgaben freigegeben werden.</li>
</ul>
</div>
</ul>
<li>
Wenn die Konvertierung abgeschlossen ist, wird das Symbol in der Taskleiste nicht mehr angezeigt.
</li>
</ol>

<div class="section">
<span class="note_head">Hinweis: </span>
<ul>
</li>Da Photo Station Uploader eine bessere Leistung bei der Erstellung von Miniaturansichten bietet, empfehlen wir die Verwendung von Photo Station Uploader, wenn Sie eine gro&szlig;e Anzahl von Fotos/Videos in Ihre Photo Station-Bibliothek hochladen m&ouml;chten.</li>
</ul>
</div>

</body>
</html>