<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Berechtigungen - Synology DSM-Hilfe</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology NAS provides rich applications services which can be accessed by local or domain users. Synology DiskStation Manager (DSM) provides flexible settings for controlling users' application privileges, making it easy to manage users' access to different applications.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Berechtigungen</h1>
<p>Benutzer- und Gruppenberechtigungen f&uuml;r einzelne Dienste und Anwendungen k&ouml;nnen angezeigt und bearbeitet werden. DSM bietet flexible Einstellungen f&uuml;r die Kontrolle der Anwendungsberechtigungen, wodurch die Verwaltung des Zugriffs von Benutzern und Gruppen auf verschiedene Anwendungen vereinfacht wird.</p>
<h4>Anwendungsberechtigungen f&uuml;r Benutzer und Gruppen &auml;ndern:</h4>
<ol>
<li>Gehen Sie zu <strong>Systemsteuerung</strong> &gt; <strong>Berechtigungen</strong>.</li>
<li>W&auml;hlen Sie die Anwendung, die ge&auml;ndert werden soll. Klicken Sie auf <strong>Bearbeiten</strong>.</li>
<li>Klicken Sie auf <strong>Benutzer</strong>, um einzelne Berechtigungen anzuzeigen oder auf <strong>Gruppe</strong>, um Gruppenberechtigungen anzuzeigen. </li>
<li>Markieren Sie f&uuml;r jeden Benutzer oder jede Gruppe <strong>Zulassen</strong>, um den Zugriff zu erlauben, oder <strong>Verweigern</strong>, um den Zugriff f&uuml;r die ausgew&auml;hlte Anwendung zu verweigern. Je nach Anwendung k&ouml;nnen Sie auch <strong>Nach IP</strong> ausw&auml;hlen, um den Zugriff basierend auf der IP-Adresse zu erlauben/zu verweigern.</li>
<li>Klicken Sie auf <strong>OK</strong>, um die &Auml;nderungen zu speichern.</li>
</ol>

<h4>Anwendungsberechtigungen f&uuml;r Benutzer mit unterschiedlichen Netzwerk-IP-Adressen anzeigen:</h4>
<ol>
<li>Gehen Sie zu <strong>Systemsteuerung</strong> &gt; <strong>Berechtigungen</strong>.</li>
<li> Klicken Sie auf <strong>Genehmigungsansicht</strong>.</li>
<li>W&auml;hlen Sie einen Benutzer unter <strong>Benutzername</strong> aus, und geben Sie dann die IP-Adresse ein, f&uuml;r die Berechtigungen unter <strong>IP-Adresse</strong> angezeigt werden sollen. </li>
</ol>

<h4>Standard-Anwendungsberechtigungen f&uuml;r alle Benutzer festlegen:</h4>
<ol>
<li>Gehen Sie zu <strong>Systemsteuerung</strong> &gt; <strong>Berechtigungen</strong>.</li>
<li>W&auml;hlen Sie die Anwendung, die ge&auml;ndert werden soll. Klicken Sie auf <strong>Bearbeiten</strong>.</li>
<li>Klicken Sie auf <strong>Standardberechtigungen</strong>, und markieren Sie <strong>Diese Berechtigung f&uuml;r alle Benutzer gew&auml;hren</strong>. </li>
<li>Klicken Sie auf <strong>OK</strong>, um die &Auml;nderungen zu speichern.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Die Rechte von <b>admin</b> und <b>guest</b> k&ouml;nnen hier nicht ge&auml;ndert werden.</li>
<li>Beachten Sie bei Berechtigungskonflikten folgende Priorit&auml;t: Nicht zulassen &gt; Zulassen.</li>
<li>Nicht alle Pakete und Dienste unterst&uuml;tzen die Zugriffsrechte-Einstellungen <strong>Nach IP</strong>.</li>
</ul>
</div>
</body>
</html>