
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>LAN/WLAN</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="lan"></a>LAN/Internet</h2>
<p>Je nach DiskStation-Modell und den Netzwerkeinstellungen k&ouml;nnen Sie die DHCP-Einstellungen f&uuml;r LAN oder Internet unter <strong>Systemsteuerung</strong> &gt; <strong>Netzwerk</strong> &gt; <strong>Netzwerk-Schnittstelle</strong> konfigurieren. DHCP ist ein Netzwerk-Protokoll f&uuml;r die automatische IP-Konfiguration. Damit DHCP dem System eine IP-Adresse zuweisen kann, klicken Sie auf <strong>Bearbeiten</strong> und w&auml;hlen Sie <b>Netzwerkkonfiguration automatisch erhalten (DHCP)</b> auf der Registerkarte <strong>IPv4</strong>.</p>
<p>Wenn Sie eine bestimmte IP-Adresse Ihres Netzwerk-Dienstanbieters benutzen, w&auml;hlen Sie <b>Manuelle Konfiguration verwenden</b> und geben Sie die IP-Adresse und Subnetz-Maske manuell ein. Wenn kein DNS Server oder Standard-Gateway zur Verf&uuml;gung steht, lassen Sie dieses Feld frei.</p>

<div class="section">
<h4>Hinweis:</h4>
<ol>
<li>Um sicherzustellen, dass E-Mail-Benachrichtigungen &uuml;ber den SMTP-Server korrekt gesendet werden, muss eine g&uuml;ltige DNS Server-IP eingegeben werden.</li>
<li>Jumbo Frames sind Ethernet-Frames mit mehr als den standardm&auml;&szlig;igen 1500 Bytes Maximum Transmission Unit (MTU). Damit ist die Ethernet-&Uuml;bertragung umfangreicher Dateien effektiver. Sie k&ouml;nnen nur in einer Gigabit-Netzwerkumgebung aktiviert werden.  Damit Jumbo Frame korrekt funktioniert, m&uuml;ssen alle Computer und Ger&auml;te in dem Netzwerk, das auf Ihren DiskStation zugreift, diese unterst&uuml;tzen und denselben MTU-Wert verwenden.</li>
</ol>
</div>

<h3><a name="vlan"></a>VLAN</h3>
<p>Wenn die Netzwerkumgebung VLAN-Einstellungen verlangt, k&ouml;nnen Sie die VLAN-Option aktivieren und eine VLAN-ID f&uuml;r die Netzwerkumgebung auf der Registerkarte <strong>IPv4</strong> im Fenster &bdquo;Bearbeiten&ldquo; eingeben.</p>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Stellen Sie sicher, dass Ihr Netzwerk-Switch richtig konfiguriert ist, anderenfalls k&ouml;nnte der Dienst auf Ihrem DiskStation nicht verf&uuml;gbar sein.</li>
<li>Wenn Sie nach der &Auml;nderung der oben genannten Einstellungen keine Verbindung zu DiskStation herstellen k&ouml;nnen, dr&uuml;cken Sie bitte die RESET-Taste am DiskStation, um die Werksstandardeinstellungen wiederherzustellen.</li>
</ul>
</div>


<h3><a name="ipv6"></a>IPv6-Setup</h3>
<p>DiskStation-Ger&auml;te unterst&uuml;tzen das duale IPv4/IPv6 Programmschema. Dies bedeutet, dass IPv4 und IPv6 gleichzeitig auf dem DiskStation funktionieren. Die Standardeinstellung f&uuml;r IPv6 ist <b>Automatisch</b>. W&auml;hlen Sie eine vorhandene Netzwerk-Schnittstelle, klicken Sie auf die Schaltfl&auml;che <b>Bearbeiten</b>, und gehen Sie zur Registerkarte <b>IPv6</b>, um die Einstellungen zu &auml;ndern.</p>

<h4>IPv6-Einstellungen konfigurieren:</h4>
<ol>
<li>Gehen Sie zu <strong>Systemsteuerung</strong> &gt; <strong>Netzwerk</strong> &gt; <strong>Netzwerk-Schnittstelle</strong>.</li>
<li>W&auml;hlen Sie eine vorhandene Netzwerk-Schnittstelle, und klicken Sie auf <strong>Bearbeiten</strong>.</li>
<li>W&auml;hlen Sie unter der Registerkarte <strong>IPv6</strong> einen Konfigurationstyp aus <strong>IPv6-Setup</strong> aus:<ul>
    <li><b>Automatisch</b>: Ihr DiskStation wird automatisch eine IPv6-Adresse erstellen, abh&auml;ngig vom LAN-Router Advertisement (RA).</li>
	<ul>
	  <li><strong>Statusfreier Modus</strong>: Dadurch k&ouml;nnen an den Router angeschlossene Ger&auml;te automatisch eine IPv6-Adresse konfigurieren, ohne die Einstellung eines IPv6-DNS Servers.</li>
      <li><strong>Statusfreier DHCPv6-Modus</strong>: Dadurch k&ouml;nnen an den Router angeschlossene Ger&auml;te automatisch eine IPv6-Adresse konfigurieren und DNS-Informationen &uuml;ber DHCPv6 erhalten.</li>
      <li><strong>Status-Modus</strong>: Dadurch k&ouml;nnen an den Router angeschlossene Ger&auml;te eine IPv6-Adresse und DNS-Informationen &uuml;ber DHCPv6 erhalten. In diesem Modus muss der DHCPv6-Server aktiviert und die<strong>Start-IP-Adresse</strong> und die <strong>End-IP-Adresse</strong> des DHCPv6-Servers festgelegt werden.</li>
	</ul>
<li><b>Manuell</b>: Richten Sie IPv6 manuell ein, in dem Sie Informationen in <b>IPv6-Adresse</b>, <b>Prefix-L&auml;nge</b> und <b>Standard-Gateway</b> eingeben.</li>
<li><b>Aus</b>: IPv6-Unterst&uuml;tzung ist deaktiviert.</li>
  </ul>
</ol>
<p>Bis IPv4 vollst&auml;ndig durch IPv6 ersetzt wird, werden IPv6-&Uuml;bergangsmechanismen ben&ouml;tigt, damit Hosts mit IPv4-Adressen IPv6-Dienste erreichen k&ouml;nnen. W&auml;hlen Sie zwischen den verschiedenen IPv6-&Uuml;bergangsmechanismen:</p>
<ul>
  <li><b>6in4</b>: Verbindung mit dem IPv6-Netzwerk durch einen Tunnel-Broker. Sie m&uuml;ssen <b>IPv6-Adresse</b>, <b>Prefix-L&auml;nge</b>, <b>Prefix</b>und <b>Tunnel-Broker-IPv4-Adresse</b> ausf&uuml;llen. Dies erfordert eine &ouml;ffentliche IPv4-Adresse.</li>
<li><b>6bis4</b>: Verbindung mit dem IPv6-Netzwerk durch einen Tunnel-Broker mit Anycast. Dies erfordert eine &ouml;ffentliche IPv4-Adresse.</li>
<li><b>DHCP-PD</b>: Ruft ein IPv6-Prefix vom DHCP Server &uuml;ber Prefix-Delegation innerhalb des LAN ab. Dies erfordert eine ISP-Unterst&uuml;tzung und funktioniert nur im Router-Modus.</li>
<li><strong>IPv6 Tunneling (TSP)</strong>: Wechseln Sie zu <strong>Systemsteuerung</strong> &gt; <strong>Netzwerk</strong> &gt; <strong>Allgemein</strong>, um diese Option zu konfigurieren.</li>
</ul>


<h3>802.1X</h3>
<p>802.1X ist ein Authentifizierungsstandard, der von der IEEE für Rechnernetzwerke entwickelt wurde. 802.1X kann in Netzwerken verwendet werden, um den Client zu authentifizieren, wobei Clients, die sich für den Zugriff auf das geschützte Netzwerk nicht authentifizieren können, zurückgewiesen werden. </p>
<p>Sie können es Ihrem Synology NAS gestatten, die Verbindung zu dem durch die 802.1X-Authentifizierung geschützten Netzwerk herzustellen.</p>

<h4>802.1X-Authentifizierung aktivieren:</h4>
<ol>
<li>Gehen Sie zu <strong>Systemsteuerung</strong> > <strong>Netzwerk</strong> > <strong>Netzwerkschnittstelle</strong>. </li>
<li>Wählen Sie eine Funknetzwerkschnittstelle (d. h. LAN) aus und klicken Sie auf <strong>Bearbeiten</strong>. </li>
<li>Gehen Sie zur Registerkarte <strong>802.1X</strong> und aktivieren Sie <strong>802.1X-Authentifizierung aktivieren</strong>. </li>
<li>Wählen Sie aus dem Dropdown-Menü <strong>Authentifizierung</strong> eines der folgenden Protokolle aus. Wählen Sie <strong>Automatisch</strong> aus, wenn Sie nicht sicher sind, welches Protokoll am besten geeignet ist.  <ul>
<li><strong>Protected EAP (PEAP)</strong>: Verwendet ein CA-Zertifikat (optional) zum Herstellen einer sicheren Verbindung. Diese sichere Verbindung wird von der inneren Authentifizierung verwendet.</li>
<li><strong>Tunneled TLS (TTLS)</strong>: Verwendet ein CA-Zertifikat (optional) zum Herstellen einer sicheren Verbindung. Diese sichere Verbindung wird von der inneren Authentifizierung verwendet.</li>
<li><strong>TLS</strong>: Verwendet TLS (Transport Layer Security) zur Authentifizierung.</li> </ul> </li>
<li>Wenn Sie <strong>TTLS</strong> oder <strong>PEAP</strong> auswählen, wählen Sie eines der inneren Authentifizierungsprotokolle aus dem Dropdown-Menü aus.
<ul>
<li><strong>MS CHAP v2</strong>: Die Authentifizierungsdaten werden mit Microsoft CHAP v2 verschlüsselt.</li>
<li><strong>GTC</strong>: Die Authentifizierungsdaten verwenden GTC (Generic Token Card) für die Verschlüsselung.</li>
</ul></li>
<li>Geben Sie Ihren Benutzernamen und Ihr Kennwort ein.</li>
<li>Klicken Sie bei Bedarf auf <strong>Importieren</strong> und dann auf <strong>Durchsuchen</strong>, um nach einem vom Radius-Server exportiertes Zertifikat (z. B. ca.crt) zu suchen und es zu importieren.</li>
<li>Klicken Sie auf <strong>OK</strong>, um Ihre Einstellungen zu speichern.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Gehen Sie zum Konfigurieren der 802.1X-Authentifizierung für WLAN-Netze zu <strong>Systemsteuerung</strong> > <strong>WLAN</strong> > <strong>WLAN</strong>.</li>
<li>Die Authentifizierungseinstellungen müssen mit denen des Radius-Servers übereinstimmen. Weitere Informationen erhalten Sie vom Radius-Server-Administrator.</li>
</ul>
</div>

<h2>WLAN*</h2>
<p>Wenn Ihr DiskStation als WLAN-Router fungiert, k&ouml;nnen Sie die folgenden Einstellungen f&uuml;r WLAN unter <strong>Systemsteuerung</strong> &gt; <strong>Netzwerk</strong> &gt; <strong>Netzwerkschnittstelle</strong> konfigurieren.</p>
<h3>IPv4-Einstellungen</h3>

<h4>IP-Adresse und Subnetz-Maske</h4> 
<p>Sie k&ouml;nnen die IP-Adresse und die Subnetz-Maske f&uuml;r Ihren DiskStation hier festlegen.</p>
<h4>DHCP Server</h4>
<p>Markieren Sie die Option <strong>DHCP Server aktivieren</strong>, um Ihrem DiskStation die Vergabe von IP-Adressen an Client-Ger&auml;te zu erm&ouml;glichen, die eine Verbindung zum lokalen Netzwerk herstellen, das vom DiskStation bereitgestellt wird.</p>
<h4>PPPoE Relay</h4>
<p>Markieren Sie <strong>PPPoE Relay</strong>, damit Ger&auml;te, die mit dem DiskStation verbunden sind, die Verbindung zum Internet &uuml;ber PPPoE herstellen k&ouml;nnen.</p>

<h4>Als UPnP-Internetgateway konfigurieren</h4>
<p>Markieren Sie den Dienst <strong>UPnP</strong>, damit DiskStation ein UPnP-Internet Gateway-Ger&auml;t wird, sodass an das lokale Netzwerk des DiskStation angeschlossene Ger&auml;te die Portweiterleitungs-Einstellungen mit UPnP konfigurieren k&ouml;nnen.</p>

<h3>IPv6-Einstellungen</h3>
<p>Sie k&ouml;nnen eine IPv6-Adresse und ein Prefix vom <strong>LAN/Internet</strong> mit 6in4, 6bis4 oder DHCP-PD erhalten. Mit diesen Informationen k&ouml;nnen Sie hier IPv6-Routing-Optionen f&uuml;r Ihren DiskStation konfigurieren.</p>
<ul>
<li><strong>IPv6-Adresse</strong>: Geben Sie die IPv6-Adresse ein, die Sie vom <strong>LAN/Internet</strong> erhalten haben.</li>
<li><strong>Prefix-L&auml;nge</strong>: Geben Sie die Prefix-L&auml;nge der IPv6-Adresse ein, die Sie vom <strong>LAN/Internet</strong> erhalten haben, in der Regel 64.</li>
<li><strong>Prim&auml;res DNS</strong>: Der prim&auml;re DNS Server f&uuml;r die Ger&auml;te, die an den Router angeschlossen sind. Dies muss nicht auf den <strong>Statusfreien Modus</strong> eingestellt sein.</li>
<li><strong>Sekund&auml;res DNS</strong>: Der sekund&auml;re DNS Server f&uuml;r die Ger&auml;te, die am Router angeschlossen sind. Dies muss nicht auf den <strong>Statusfreien Modus</strong> eingestellt sein.</li>
</ul>
<p>Es stehen drei Router Advertisement (RA)-Modi zur Auswahl:</p>
<ul>
<li><strong>Statusfreier Modus</strong>: Dadurch k&ouml;nnen an den Router angeschlossene Ger&auml;te automatisch eine IPv6-Adresse konfigurieren, ohne die Einstellung eines IPv6-DNS Servers.</li>
<li><strong>Statusfreier DHCPv6-Modus</strong>: Dadurch k&ouml;nnen an den Router angeschlossene Ger&auml;te automatisch eine IPv6-Adresse konfigurieren und DNS-Informationen &uuml;ber DHCPv6 erhalten.</li>
<li><strong>Status-Modus</strong>: Dadurch k&ouml;nnen an den Router angeschlossene Ger&auml;te eine IPv6-Adresse und DNS-Informationen &uuml;ber DHCPv6 erhalten. In diesem Modus m&uuml;ssen Sie den DHCPv6-Server aktivieren und die <strong>Start-IP-Adresse</strong> und die <strong>End-IP-Adresse</strong> des DHCPv6-Servers festlegen.</li>
</ul>

<h3>DHCP Clients</h3>
<p>Hier k&ouml;nnen Sie eine Liste mit DHCP Clients und deren Netzwerkkonfigurationen (z.&nbsp;B. MAC-Adresse, IP-Adresse, Hostname und die Frist, bis das DHCP-Leasing ung&uuml;ltig wird) anzeigen.</p>
<p>Sie k&ouml;nnen die Drop-down-Liste f&uuml;r IPv4/IPv6-Clients filtern, um Clients anzuzeigen, die jeweils IPv4 und IPv6 verwenden. W&auml;hlen Sie einen Client aus, und klicken Sie auf <strong>Zur Adressenreservierung hinzuf&uuml;gen</strong>, um die Clients zur Liste f&uuml;r die Adressenreservierung hinzuzuf&uuml;gen.</p>

<h3>DHCP Reservierung</h3>
<p>Falls ein Client bei jeder Erneuerung des DHCP-Leasings die selbe IP-Adresse erhalten soll, k&ouml;nnen Sie den Client der Liste f&uuml;r die Adressenreservierung hinzuf&uuml;gen.</p>
<p>Sie k&ouml;nnen die Drop-down-Liste der IPv4/IPv6-Adressreservierung filtern. Die IPv4-Adressen werden durch MAC-Adressen identifiziert, w&auml;hrend IPv6-Adressen durch DUID identifiziert werden.</p>
<h4>So f&uuml;gen Sie einen Client der Liste f&uuml;r die Adressenreservierung hinzu:</h4>
<ul>
<li>W&auml;hlen Sie einen Client aus, und klicken Sie auf <b>Hinzuf&uuml;gen</b>.</li>
<li>Geben Sie die MAC-Adresse oder DUID der IPv4/IPv6-Adresse des Clients an, die diesem zugewiesen werden soll, und den Hostnamen des Clients. </li>
<li>Klicken Sie auf <b>OK</b>, um Ihre Einstellungen zu speichern.</li>
</ul>
<p><b>_____</b> <br>* Nur bei bestimmten Modellen oder basierend auf Ihrer Umgebung verf&uuml;gbar.</p>
</body>
</html>
