
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Mobil</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2><a name="usbmodem"></a>Mobil*</h2>

<p>Mit einem mobilen Breitband-Dongle kann der DiskStation sich &uuml;ber ein drahtloses 3G/LTE-Netzwerk mit dem Internet verbinden. &Uuml;ber die Einstellungen unter <strong>Systemsteuerung</strong> &gt; <strong>Netzwerk</strong> &gt; <strong>Netzwerkschnittstelle</strong> &gt; <strong>Mobil</strong> k&ouml;nnen Sie eine drahtlose Internet-Verbindung &uuml;ber Ihren mobilen Breitband-Dongle herstellen und anpassen.</p>

<div class="section">
<h4>Hinweis:</h4>
<p>Die vollst&auml;ndige Liste der mobilen Breitband-Dongles, die von Synology Produkten unterst&uuml;tzt werden, finden Sie unter <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</p>
</div>

<h4>Mobiles Netzwerk einrichten:</h4>
<p>Wenn ein mobiler Breitband-Dongle mit einem der USB-Ports auf Ihrem DiskStation verbunden ist, versucht DiskStation automatisch, die Verbindung herzustellen. Falls die Verbindung nicht automatisch hergestellt werden kann oder die Verbindungseinstellungen ge&auml;ndert werden sollen, m&uuml;ssen Sie Folgendes beachten: </p>

<ul>
<li><b>SIM entsperren/Einstellungen:</b> Wenn die SIM-Karte durch eine PIN gesch&uuml;tzt ist, muss sie entsperrt werden, damit die DiskStation die Verbindung zum Netzwerk herstellen kann. Nach dem Entsperren enth&auml;lt dieser Bereich Optionen zur &Auml;nderung der PIN-Einstellungen.</li>

<li><b>Bearbeiten:</b> Sie k&ouml;nnen die Verbindung manuell konfigurieren oder nach Standort und Tr&auml;gerfrequenz ausw&auml;hlen. Das manuelle Einrichten der Verbindung erfordert die Eingabe von APN, Telefonnummer, Benutzername und Passwort. Wenden Sie sich an Ihren Mobilfunkanbieter, falls Sie diese Informationen nicht besitzen.</li>

<li><b>Verbinden/Trennen:</b> Mit diesen Schaltfl&auml;chen k&ouml;nnen Sie die Verbindung von DiskStation zum 3G/LTE-Netzwerk herstellen oder trennen.</li>
<li><b>Optionen:</b> Dieser Abschnitt enth&auml;lt eine Option, um die mobile Breitband-Dongle-Schnittstelle als Standard-Gateway f&uuml;r Ihre DiskStation festzulegen. Wenn Sie das Mobilfunknetz als Standard-Gateway konfigurieren, wird der Internetverkehr von Ihrem DiskStation &uuml;ber das Mobilfunknetz anstelle &uuml;ber das Kabelnetz geleitet. </li>
</ul>
<div class="section">
<h4>Hinweis:</h4>
<ol>
<li>Einige mobile Breitband-Dongles zeigen die Signalst&auml;rke nicht an, wenn sie mit dem Internet verbunden sind, wenn diese Funktion nicht unterst&uuml;tzt wird.</li>
<li>Bei einigen mobilen Breitband-Dongles k&ouml;nnen Sie die SIM-Einstellungen nicht &auml;ndern, wenn sie mit dem Internet verbunden sind.</li>
</ol>
</div>
<p>____<br> <strong> *</strong>Nur bei bestimmten Modellen verf&uuml;gbar. </p>


</body>
</html>
