<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Automatische Blockierung</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Automatische Blockierung</h2>

<p>Mit der automatischen Blockierung verhindern Sie nicht autorisierte Anmeldungen. Nachdem dieser Dienst aktiviert wurde, wird eine IP-Adresse blockiert, wenn Sie zu viele Fehlversuche bei der Anmeldung hatte. Fehlgeschlagene Anmeldeversuche &uuml;ber SSH, Telnet, rsync, Netzwerksicherung, Synchronisierung gemeinsamer Ordner, FTP, WebDAV, mobile Synology-Apps, File Station oder DSM summieren sich. Sie k&ouml;nnen auch eine Freigabe-Liste mit den IP-Adressen, die niemals blockiert werden, verwenden.</p>

<h4>Einstellen der automatischen Blockierung:</h4>
<ol>
<li>Gehen Sie zur Registerkarte <strong>Allgemein</strong> und aktivieren Sie <b>Automatische Blockierung aktivieren</b>.</li>
<li>Geben Sie eine Zahl f&uuml;r die <b>Login-Versuche</b> und <b>Innerhalb von (Minuten)</b> ein, um eine IP-Adresse nach der eingestellten Anzahl Fehlversuche innerhalb der eingestellten Minutenzahl zu blockieren.</li>
<li>Aktivieren Sie <b>Blockablauf aktivieren</b>, und geben Sie eine Zahl ein, um eine blockierte IP-Adresse nach der angegebenen Anzahl von Tagen zu entfernen.  Blockierte IP-Adressen verbleiben eine unbestimmte Zeit in der Blockierungsliste, sofern sie nicht manuell aus der Liste entfernt werden, wenn diese Option nicht ausgew&auml;hlt ist oder wenn <b>Blockierung nach (Tagen) aufheben</b> auf 0 gesetzt ist.</li>

<li>Klicken Sie auf <b>&Uuml;bernehmen</b>.</li>
</ol>

<h4>Blockierte IP-Adressen hinzuf&uuml;gen:</h4>
<p>Klicken Sie auf die Registerkarte <strong>Blockierungsliste</strong> und w&auml;hlen Sie eine der Folgenden aus dem <strong>Erstellen</strong> Dropdown-Men&uuml; aus:</p>
<ul>
<li><strong>IP-Adresse hinzuf&uuml;gen</strong></li>
<p>Geben Sie eine IP-Adresse ein und stellen Sie die Ablaufzeit ein.<p/>
<li><strong>IP-Adressliste importieren</strong></li>
<p>Importieren Sie eine Textdatei mit den IP-Adressen, um gleichzeitig mehrere IP-Adressen hinzuzuf&uuml;gen und die Ablaufzeit einzustellen.  Markieren Sie das entsprechende Kontrollk&auml;stchen, um bestehende IP-Adressen zu &uuml;berschreiben. Wenn diese Option nicht ausgew&auml;hlt ist, werden doppelte IP-Adressen &uuml;bersprungen.</p>
<p>Um eine Datei zu importieren, muss die Datei die folgenden Kriterien erf&uuml;llen:</p>
<ul>
<li>Die Datei muss eine reine Textdatei sein.</li>
<li>Jede Zeile der Datei darf nur eine IP-Adresse enthalten.</li>
<li>Kommentarzeilen beginnen mit einem # (Rautezeichen).</li>
<p>Wenn die ausgew&auml;hlte Datei ein korrektes Format besitzt, werden alle IP-Adressen im Vorschaubereich angezeigt. Klicken Sie auf <strong>OK</strong>, um mit dem Import zu beginnen.</p>
</ul>
</ul>

<h4>Blockierte IP-Adressen entfernen:</h4>
<ol>
<li>
Klicken Sie auf die Registerkarte <b>Blockierungsliste</b>, um die Liste der blockierten IP-Adressen anzuzeigen.
</li>
<li>
W&auml;hlen Sie die IP-Adressen, die von der Liste entfernen m&ouml;chten und klicken Sie auf <b>Entfernen</b>.
</li>
</ol>


<h4>Freigegebene IP-Adressen hinzuf&uuml;gen:</h4>
<p>Klicken Sie auf die Registerkarte <strong>Freigabe-Liste</strong> und w&auml;hlen Sie eine der folgenden Optionen aus dem <strong>Erstellen</strong> Dropdown-Men&uuml; aus:</p>
<ul>
<li><strong>IP-Adresse hinzuf&uuml;gen</strong></li>
<p>Eine IP-Adresse eingeben.<p/>
<li><strong>IP-Adressliste importieren</strong></li>
<p>Importieren Sie eine Textdatei mit den IP-Adressen, um gleichzeitig mehrere IP-Adressen hinzuzuf&uuml;gen. Markieren Sie das entsprechende Kontrollk&auml;stchen, um bestehende IP-Adressen zu &uuml;berschreiben. Wenn diese Option nicht ausgew&auml;hlt ist, werden doppelte IP-Adressen &uuml;bersprungen.</p>
<p>Um eine Datei zu importieren, muss die Datei die folgenden Kriterien erf&uuml;llen:</p>
<ul>
<li>Die Datei muss eine reine Textdatei sein.</li>
<li>Jede Zeile der Datei darf nur eine IP-Adresse enthalten.</li>
<li>Kommentarzeilen beginnen mit einem # (Rautezeichen).</li>
<p>Wenn die ausgew&auml;hlte Datei ein korrektes Format besitzt, werden alle IP-Adressen im Vorschaubereich angezeigt. Klicken Sie auf <strong>OK</strong>, um mit dem Import zu beginnen.</p>
</ul>
</ul>

<h4>Freigegebene IP-Adressen entfernen:</h4>
<ol>
<li>
Klicken Sie auf die Registerkarte <b>Freigabe-Liste</b>, um die Liste der freigegebenen IP-Adressen anzuzeigen.
</li>
<li>
W&auml;hlen Sie die IP-Adressen, die von der Liste entfernen m&ouml;chten und klicken Sie auf <b>Entfernen</b>. </li>
</ol>


</body>
</html>
