<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Firewall</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_firewall"></a>Zulassen / Verweigern</h2>
<p>
Eine integrierte Firewall sch&uuml;tzt vor unberechtigtem Zugriff und erm&ouml;glicht, die Zugriffe auf Dienste zu kontrollieren. Au&szlig;erdem k&ouml;nnen Sie w&auml;hlen, ob der Zugriff auf bestimmte Netzwerkports von spezifischen IP-Adressen erlaubt oder verweigert werden soll.</p>
<h4>Erstellen von Firewall-Regeln:</h4>
<ol>
<li>Wechseln Sie zu <b>Systemsteuerung</b> &gt; <b>Firewall</b>, und w&auml;hlen Sie je nach dem Typ der Netzwerkverbindung die Netzwerkschnittstelle in der linken Spalte aus.</li>
<li>Klicken Sie auf <b>Erstellen</b>.</li>
<li>W&auml;hlen Sie im Abschnitt <b>Ports</b> eine der folgenden Optionen f&uuml;r die Regel aus:</li>
<ul>
<li>W&auml;hlen Sie <b>Alle</b>, um die Regeln auf alle Ports anzuwenden.</li>
<li>W&auml;hlen Sie <b>W&auml;hlen Sie aus der Liste der eingebauten Anwendungen aus</b>.</li>
<li>W&auml;hlen Sie <b>Benutzerdefiniert</b> und klicken Sie auf <b>Benutzerdefiniert</b>, um dann bis zu 15 Ports einzugeben, die durch Kommas getrennt sind, oder um einen Portbereich festzulegen.</li>
<li class="no">
Sie k&ouml;nnen ebenfalls die Protokolle festlegen.
</li>
</ul>
<li>W&auml;hlen Sie im Abschnitt <b>Quell-IP</b> eine der folgenden Optionen f&uuml;r die Regel aus:</li>
<ul>
<li>W&auml;hlen Sie <b>Alle</b>, um alle IP-Adresse zuzulassen oder abzuweisen.</li>
<li>Eine <b>Single Host IP-Adresse</b> eingeben.</li>
<li>Ein <b>Teilnetz</b> eingeben. </li>
</ul>
<li>W&auml;hlen Sie im Abschnitt <b>Aktion</b> eine der folgenden Optionen f&uuml;r die Regel aus:</li>
<ul>
<li>W&auml;hlen Sie <b>Zulassen</b>, um den Zugriff auf die o. g. Ports und die Quell-IP-Einstellungen zuzulassen.</li>
<li>W&auml;hlen Sie <b>Verweigern</b>, um den Zugriff auf die o. g. Ports und die Quell-IP-Einstellungen zu verweigern.</li>
</ul>
</ol>
<p>
Sie sehen jetzt die erstellte Firewall-Regel in der Regelliste.
</p>
<h4>Um die Firewallregeln zu l&ouml;schen, w&auml;hlen Sie ein der folgenden M&ouml;glichkeiten:</h4>
<ul>
<li>Deaktivieren Sie das Kontrollk&auml;stchen der Regel in der Spalte <b>Aktiviert</b> der Liste</li>
<li>L&ouml;schen Sie die Firewallregel</li>
</ul>
<p>
Sie haben auch die M&ouml;glichkeit, die Option <b>Zugriff zulassen</b> oder <b>Zugriff verweigern</b> am Ende der Regelliste zu w&auml;hlen, um einen Zugriff, der mit keinen Regeln &uuml;bereinstimmt, zuzulassen oder zu verweigern.
</p>
<ol>
<span class="note_head">Hinweis:</span>
<li>Sie k&ouml;nnen bis zu 100 Regeln f&uuml;r eine Netzwerkschnittstelle festlegen und die Regeln per Drag-and-Drop neu anordnen.</li>
<li>Die Priorit&auml;t der Regeln richtet sich nach ihrer Position in der Liste.</li>
<li>Wenn bei Ihrem System mehrere Netzwerkports &uuml;ber dasselbe Teilnetz verbunden sind, arbeiten die Firewallregeln m&ouml;glicherweise nicht korrekt.* </li>
<li>Wenn Sie mehrere LAN-Ports mit der Link Aggregation kombinieren, &uuml;bernimmt die Firewall die Regeln der ersten Netzwerk-Schnittstelle und merkt sich die Regeln der zweiten Netzwerk-Schnittstelle.</li>
</ol>
<p>____<br> * Gilt nur f&uuml;r bestimmte Modelle.</p>
</body>
</html>
