<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Gemeinsamer Ordner</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Papierkorb aktivieren</h2>
<p>Wenn Sie den Papierkorb in einem gemeinsam verwendeten Ordner aktivieren, wird ein Unterordner erstellt, um gel&ouml;schte Dateien zu speichern. Sie k&ouml;nnen gel&ouml;schte Dateien aus dem Papierkorb wiederherstellen. Leeren Sie den Papierkorb, wenn Sie die Dateien endg&uuml;ltig l&ouml;schen m&ouml;chten.</p>
<h4>Papierkorb aktivieren:</h4>
<ol>
<li>W&auml;hlen Sie einen gemeinsam verwendeten Ordner und klicken Sie anschlie&szlig;end auf <strong>Bearbeiten</strong>.</li>
<li>Markieren Sie das Kontrollk&auml;stchen <strong>Papierkorb aktivieren</strong>.</li>
<li>Markieren Sie <strong>Zugriff auf ausschlie&szlig;lich Administratoren beschr&auml;nken</strong>, wenn Sie m&ouml;chten, dass der Papierkorb nur f&uuml;r Administratoren zug&auml;nglich ist.</li>
<li>Klicken Sie auf <strong>OK</strong>, um die Einstellungen zu speichern.</li>
</ol>
<h4>Papierkorb leeren:</h4>
<p>Klicken Sie auf die Schaltfl&auml;che <strong>Papierkorb leeren</strong>, um alle gel&ouml;schten Dateien im Papierkorb endg&uuml;ltig zu l&ouml;schen.</p>
<h4>Alle Papierk&ouml;rbe leeren:</h4>
<p>W&auml;hlen Sie <strong>Alle Papierk&ouml;rbe leeren</strong> aus dem Drop-Down Men&uuml; <strong>Aktion</strong>, um gel&ouml;schte Dateien in allen Papierk&ouml;rben endg&uuml;ltig zu l&ouml;schen.</p>
<p><span class="note_head">Hinweis: </span> Sie die Privilegieneinstellungen des Papierkorb-Ordners der File Station konfigurieren, indem mit der rechten Maustaste auf den <strong>#recycle</strong> Ordner klicken. W&auml;hlen Sie <strong>Eigenschaften</strong> und klicken Sie auf die Registerkarte <strong>Berechtigung</strong>.</p>

</body>
</html>
