<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Gemeinsamer Ordner</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Erweiterte Berechtigungen f&uuml;r gemeinsame Ordner verwalten</h2>

<p>Die Seite unter<strong> Systemsteuerung</strong> &gt; <strong>Gemeinsamer Ordner</strong> &gt; <strong>Bearbeiten</strong> &gt; <strong>Erweitert</strong> enth&auml;lt die folgenden Optionen, um weitere Feinabstimmungen der Zugriffsberechtigungen eines gemeinsamen Ordners vorzunehmen.</p>

<h3>Erweiterte Freigabeberechtigungen</h3>
<p>Erweiterte Freigabeberechtigungen bieten eine zus&auml;tzliche Kontrollebene, um die Zugriffsberechtigungen f&uuml;r den gemeinsamen Ordner zu verwalten. Falls aktiviert, k&ouml;nnen Benutzer und Gruppen den Inhalt eines gemeinsamen Ordner nur anzeigen oder &auml;ndern, wenn dem Benutzer oder der Gruppe sowohl erweiterte Freigabeberechtigungen gew&auml;hrt wurden,<em> und </em>Windows-ACL-Berechtigungen (unter<strong> Gemeinsamer Ordner</strong> &gt; <strong>Bearbeiten</strong> &gt; <strong>Berechtigungen</strong>).</p>

<h4>So werden erweiterte Freigabeberechtigungen aktiviert:</h4>

<ol>
<li>Markieren Sie das K&auml;stchen <strong>Erweiterte Freigabeberechtigung aktivieren</strong>.</li>
<li>Klicken Sie auf <strong>Erweiterte Freigabeberechtigungen</strong>, um die erweiterten Freigabeberechtigungen f&uuml;r den gemeinsamen Ordner zu &auml;ndern. </li>
</ol>

<div class="section">
  <h4>Hinweis:</h4>
<ul>
<li>Erweiterte Freigabeberechtigungen werden angewendet, wenn ein Benutzer &uuml;ber die folgenden Dateidienste auf einen gemeinsamen Ordner zugreift: Windows Dateifreigabe, Apple Dateifreigabe, File Station, FTP und WebDAV.</li>
</ul>
</div>

<h3>Erweiterte Einstellungen</h3>

<p>Falls n&ouml;tig, k&ouml;nnen Sie weitere Einschr&auml;nkungen f&uuml;r Benutzer f&uuml;r den Zugriff auf den gemeinsamen Ordner &uuml;ber File Station, FTP oder WebDAV festlegen.</p>
	<ul>
    <li><strong>Durchsuchen von Verzeichnissen deaktivieren:</strong> Durch das Aktivieren dieser Option wird der Inhalt des gemeinsamen Ordners f&uuml;r Benutzer nicht mehr angezeigt.</li>
    <li><strong>&Auml;nderungen an bestehenden Dateien deaktivieren:</strong> Durch das Aktivieren dieser Option k&ouml;nnen Benutzer Dateien im gemeinsamen Ordner nicht mehr verschieben, l&ouml;schen oder &auml;ndern. Bitte beachten Sie, dass die Benutzer immer noch in der Lage sind, den Inhalt des gemeinsamen Ordners anzuzeigen, herunter/hochzuladen, zu kopieren oder zu entpacken.</li>
    <li><strong>Herunterladen von Dateien deaktivieren:</strong> Durch das Aktivieren dieser Option k&ouml;nnen Benutzer den Inhalt des gemeinsamen Ordners nicht mehr herunterladen.</li>
    </ul>

<div class="section">
<h4>Hinweis:</h4>
<p>Die oben genannten Beschr&auml;nkungen gelten nicht f&uuml;r Benutzer, die zur Gruppe <strong>administrators</strong> geh&ouml;ren.</p>
</div>
</body>
</html>
