<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Benutzer</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Passwort-Einstellungen</h2>
<p>Klicken Sie auf die Schaltfl&auml;che <strong>Passwort-Einstellungen</strong>, um die unten beschriebenen Einstellungen anzuzeigen und zu &auml;ndern.</p>

<h3>Zur&uuml;cksetzen vergessener Passw&ouml;rter</h3>
<p>Dieser Bereich enth&auml;lt die Option <strong>Nicht-Admin-Benutzern erlauben, vergessene Passw&ouml;rter per E-Mail zur&uuml;ckzusetzen</strong>. Wenn diese Option aktiviert ist, erscheint der Link <strong>Haben Sie Ihr Passwort vergessen?</strong> auf der DSM-Anmeldeseite. Wenn ein Benutzer sein Passwort vergessen hat, kann er auf diesen Link klicken und seinen Benutzernamen eingeben. Dann sendet das System eine Meldung an den Benutzer mit einem Link zum Zur&uuml;cksetzen seines vergessenen Passworts. </p>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Bevor Sie diese Option aktivieren, vergewissern Sie sich, dass die SMTP E-Mail-Benachrichtigungen aktiviert sind. Gehen Sie hierzu zu <strong>Systemsteuerung</strong> &gt; <strong>Benachrichtigung</strong> &gt; <strong>Allgemein</strong>. Wenn die Benachrichtigungen nicht aktiviert sind, kann das System keine Benachrichtigungen an Benutzer senden, die Passw&ouml;rter zur&uuml;cksetzen m&ouml;chten.</li>
<li>Um Benachrichtigungen vom System zu erhalten, muss der Benutzer im Bereich Benutzerinformationen seines Kontos eine E-Mail-Adresse angeben.</li>
<li>Benutzer, die zur Gruppe <strong>administrators</strong> geh&ouml;ren, k&ouml;nnen ihr Passwort nicht mit dieser Option zur&uuml;cksetzen.</li>
<li>Domainbenutzer k&ouml;nnen mit dieser Option keine Passw&ouml;rter zur&uuml;cksetzen.</li>
<li>LDAP-Benutzer k&ouml;nnen mit dieser Option Passw&ouml;rter zur&uuml;ckzusetzen, solange die DiskStation als LDAP-Directory Server dient.</li>

</ul>
</div>


<h3>Kennwortst&auml;rke</h3>
<p>Sie k&ouml;nnen Regeln f&uuml;r die Kennwortst&auml;rke f&uuml;r die Benutzer Ihrer DiskStation festlegen.</p>

<div class="section">
<h4>Hinweis:</h4>
<p>Regeln f&uuml;r die Kennwortst&auml;rke gelten nur f&uuml;r neue Kennw&ouml;rter. So werden beispielsweise neue Regeln f&uuml;r die Kennwortst&auml;rke nur angewendet, wenn ein neues Benutzerkonto erstellt wird oder wenn ein bestehender Benutzer sein Kennwort &auml;ndert. Bestehende Kennw&ouml;rter und solche Kennw&ouml;rter, die zu importierten Benutzerkonten geh&ouml;ren, sind von der Regel f&uuml;r die Kennwortst&auml;rke ausgenommen.</p>
</div>
<h4>So aktivieren Sie die Regeln f&uuml;r die Kennwortst&auml;rke:</h4>
<ol>
<li>Aktivieren Sie das Kontrollk&auml;stchen <b>Regeln f&uuml;r Kennwortst&auml;rke anwenden</b>, um die Kennworteinschr&auml;nkungen zu aktivieren.</li>
<li>W&auml;hlen Sie mehrere Kennworteinschr&auml;nkungen aus den folgenden Regeln aus:</li>
<ul>
<li><b>Namen und Beschreibung des Benutzers von Kennwort ausschlie&szlig;en</b>: Das Kennwort darf den Namen oder die Beschreibung des Benutzers nicht einschlie&szlig;en. UTF-8-codierte Zeichen sind ausgeschlossen.</li>
<li><b>Gro&szlig;-/Kleinschreibung zulassen</b>: Gro&szlig;-/Kleinschreibung ist im Kennwort zul&auml;ssig.</li>
<li><b>Numerische Zeichen einbeziehen</b>: Das Kennwort muss mindestens ein numerisches Zeichen enthalten (0 bis 9).</li>
<li><b>Sonderzeichen einbeziehen</b>: Das Kennwort muss mindestens ein ASCII-Sonderzeichen enthalten (z. B.: ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Mindest-Kennwortl&auml;nge</b>: Das Kennwort muss mindestens so lang wie der angegebene Wert im Textfeld sein. Die L&auml;nge sollte eine Zahl zwischen 6 und 127 sein.</li>
</ul>
<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um die Einstellungen zu speichern.</li>
</ol>
 
</body>
</html>

