<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Gemeinsamer Ordner</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Gemeinsamer Ordner</h1>
<p>Gemeinsame Ordner sind die Grundverzeichnisse, in denen Sie Dateien und Ordner auf Ihrem DiskStation speichern k&ouml;nnen. Sie m&uuml;ssen mindestens einen gemeinsamen Ordner erstellen, bevor Sie Daten auf dem DiskStation speichern k&ouml;nnen. In den gemeinsamen Ordnern gespeicherte Daten k&ouml;nnen privat bleiben oder mit bestimmten Benutzern oder Benutzergruppen geteilt werden, je nach den anpassbaren Zugriffsrechten. Dar&uuml;ber hinaus k&ouml;nnen gemeinsame Ordner bei der Erstellung verschl&uuml;sselt werden, um eine zus&auml;tzliche Schutzschicht zu erreichen.</p>

<h3>Voreingestellter gemeinsamer Ordner</h3>

<p>Nachfolgend finden Sie eine Liste der gemeinsamen Ordner, die automatisch erstellt werden, wenn bestimmte Anwendungen, Dienste oder Pakete installiert oder aktiviert werden.</p> 

<table>
<tr>
<th>Name</th>
<th>Beschreibung</th>
</tr>
<tr>
<th>public</th>
<td>Der Ordner <strong>public</strong> wird bei der ersten Einrichtung des DiskStation automatisch erstellt.*</td>
</tr>
<tr>
<th>web</th>
<td>Der Ordner <strong>web</strong> ist der Standard-Speicherort f&uuml;r die Inhalte einer Website, die auf DiskStation gehostet wird. Er wird automatisch erstellt, wenn <strong>Web Station</strong> aktiviert ist.</td>
</tr>
<tr>
<th>photo</th>
<td>Der Ordner <strong>photo</strong> speichert Fotos und Videos, die Sie mit anderen auf der Photo Station teilen m&ouml;chten. Er wird automatisch erstellt, wenn die <strong>Photo Station</strong> oder der <strong>DLNA/UPnP</strong>-Medienserver aktiviert ist.</td>
</tr>
<tr>
<th>music</th>
<td>Der Ordner <strong>music</strong> enth&auml;lt Musik, die Sie auf Audio Station h&ouml;ren m&ouml;chten. Er wird automatisch erstellt, wenn <strong>Audio Station</strong> aktiviert ist.</td>
</tr>
<tr>
<th>video</th>
<td>Der Ordner <strong>video</strong> enth&auml;lt Videos, die Sie &uuml;ber DLNA/UPnP-Ger&auml;te durchsuchen k&ouml;nnen. Er wird automatisch erstellt, wenn <strong>Medienserver</strong> aktiviert ist.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Der Ordner <strong>surveillance</strong> enth&auml;lt die Aufzeichnungen der Surveillance Station. Er wird automatisch erstellt, wenn <strong>Surveillance Station</strong> aktiviert ist. Er hat nur Lesezugriff und kann nur vom System-Administrator aufgerufen werden.</td>
</tr>
<tr>
<th>home</th>
<td>Der Ordner <strong>home</strong> bietet einen privaten Bereich f&uuml;r jeden Benutzer, in dem Daten gespeichert werden k&ouml;nnen, auf die nur dieser Benutzer zugreifen kann. Er wird automatisch erstellt, wenn die Funktion <strong>Benutzer-Home</strong> aktiviert ist.</td>
</tr>
<tr>
<th>homes</th>
<td>Der Ordner <strong>homes</strong> enth&auml;lt die &bdquo;home&ldquo;-Ordner aller Benutzer. Er wird automatisch erstellt, wenn die Funktion <strong>Benutzer-Home</strong> aktiviert ist. Nur der Systemadministrator hat Zugriff und kann alle Benutzer-Home-Ordner verwalten.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Der Ordner <strong>NetBackup</strong> wird automatisch erstellt, wenn die <strong>Netzwerksicherung</strong> aktiviert ist.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Der Ordner <strong>usbshare [Nummer]</strong> wird automatisch erstellt, wenn Sie ein externes USB-Ger&auml;t an den USB-Port von DiskStation anschlie&szlig;en.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Der Ordner <strong>satashare</strong> wird automatisch erstellt, wenn Sie ein externes eSATA-Laufwerk an den eSATA-Port von DiskStation anschlie&szlig;en.*</td>
</tr>
</table>

<p>____<br> * Nur bei bestimmten Modellen verf&uuml;gbar.</p>

</body>
</html>
