<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Benutzer</h2>
<p>Mit den flexiblen Benutzerverwaltungsoptionen k&ouml;nnen Sie Benutzerkonten f&uuml;r einzelne Familienmitglieder oder Mitarbeiter eines Unternehmens erstellen, und f&uuml;r jede Person Zugangsberechtigungen f&uuml;r gemeinsame Ordner festlegen.</p>

<h4>So erstellen Sie einen Benutzer:</h4>
<ol>
<li>Gehen Sie zu <b>Systemsteuerung (Einfach-Modus)</b> &gt; <b>Benutzer</b>, und klicken Sie auf der linken Seite auf das Symbol <b>+</b>.</li>
<li>Geben Sie einen Namen und ein Passwort f&uuml;r den Benutzer ein.</li>
<li>Legen Sie die Gruppen fest, denen der neue Benutzer angeh&ouml;ren soll.</li>
<li>Weisen Sie dem neuen Benutzer entsprechende Berechtigungen f&uuml;r gemeinsame Ordner zu. Beachten Sie bei Berechtigungskonflikten folgende Priorit&auml;t: <b>Kein Zugriff</b> &gt; <b>Lesen/Schreiben</b> &gt; <b>Nur Lesen</b>.</li>
<ul>
<li><b>Vorschau:</b> Diese Spalte zeigt die aktuellen Zugriffsberechtigungen f&uuml;r gemeinsame Ordner gem&auml;&szlig; den aktuellen Einstellungen und Gruppen an, zu welchen der Benutzer geh&ouml;rt.</li>
<li><b>Lesen/Schreiben:</b> Der Benutzer hat Zugriff auf Dateien und Unterordner im entsprechenden, gemeinsamen Ordner und kann &Auml;nderungen vornehmen.</li>
<li><b>Nur Lesen:</b> Der Benutzer hat Zugriff auf die Dateien und Unterordner im entsprechenden, gemeinsamen Ordner.</li>
<li><b>Kein Zugriff:</b> Der Benutzer hat keinen Zugriff auf die Dateien und Unterordner im entsprechenden, gemeinsamen Ordner.</li>
</ul>
<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um die Einstellungen zu speichern.</li>

<div class="section">
<h4>Beschr&auml;nkungen f&uuml;r Benutzername:</h4>
<ul>
<li>Bei dem Benutzernamen wird die Gro&szlig;-/Kleinschreibung nicht ber&uuml;cksichtigt, und er kann aus 1 bis 64 Unicode-Zeichen mit Ausnahme der folgenden Symbole bestehen:<br> <b>! &quot; # $ % &amp; &apos; ( ) * + , / : ; < = > ? @ [ ] \ ^ ` { } | ~</b></li>
<li>Das erste Zeichen darf kein Minus- oder Leerzeichen sein und das letzte Zeichen darf kein Leerzeichen sein.</li>
<li>Die folgenden Benutzernamen sind f&uuml;r das System reserviert:<br> <b>mailer-daemon</b>, <b>postmaster</b></li>
</ul>
<h4>Kennworteinschr&auml;nkungen:</h4>
<ul>
<li>Beim Kennwort wird die Gro&szlig;-/Kleinschreibung ber&uuml;cksichtigt und es ist beschr&auml;nkt auf bis zu 127 anzeigbare Zeichen einschlie&szlig;lich Buchstaben, Zahlen, Symbolen und Leerzeichen.</li>
</ul>
</div>

</ol>
<h4>Bearbeiten eines Benutzers:</h4>
<ol>
<li>Gehen Sie zu <b>Systemsteuerung (Einfach-Modus)</b> &gt; <b>Benutzer</b>.</li>
<li>W&auml;hlen Sie auf der linken Seite den gew&uuml;nschten Benutzer.</li>
<li>Bearbeiten Sie die allgemeinen Informationen des Benutzers, z.&nbsp;B. Name, Passwort, Gruppe und Berechtigungen f&uuml;r gemeinsame Ordner.</li>
<li>Markieren Sie <b>Dieses Konto deaktivieren</b>, wenn das Konto nicht mehr benutzt werden soll.</li>
<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um die Einstellungen zu speichern.</li>
</ol>

<h4>Einen Benutzer entfernen:</h4>
<ol>
<li>Gehen Sie zu <b>Systemsteuerung (Einfach-Modus)</b> &gt; <b>Benutzer</b>.</li>
<li>W&auml;hlen Sie auf der linken Seite den gew&uuml;nschten Benutzer.</li>
<li>Klicken Sie auf das Symbol <b>Papierkorb</b> auf der linken Seite, um den ausgew&auml;hlten Benutzer zu l&ouml;schen.</li>
</ol>
</body>
</html>