<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>&Uuml;berblick</h2>
<p><b>Systemsteuerung (Einfach-Modus)</b> &gt; <b>&Uuml;bersicht</b> ist eine schnelle und zentrale M&ouml;glichkeit, mit der Sie verschiedene Grundeinstellungen verwalten und System-Ressourcen Ihres DiskStation &uuml;berwachen k&ouml;nnen.</p>


<h3>Systemzustand</h3>
<p>Dieser Abschnitt zeigt den Gesamtstatus Ihres Systems an. Wenn ein Fehler aufgetreten ist sowie Speicher abgest&uuml;rzt oder fehlerhaft sind, k&ouml;nnen Sie die Maus &uuml;ber diesen Abschnitt f&uuml;hren und in der rechten, oberen Ecke auf das Symbol <b>Weitere</b> klicken, um die entsprechenden Seiten f&uuml;r Reparatur und Verwaltung zu &ouml;ffnen.</p>

<h3>DSM-Version</h3>
<p>Ihre aktuelle DSM-Version und der Status werden in diesem Abschnitt angezeigt. Wenn ein neuer DSM zum Herunterladen verf&uuml;gbar ist, k&ouml;nnen Sie hier die neueste Version herunterladen.</p>

<h3>QuickConnect ID</h3>
<p>Sie k&ouml;nnen Ihre QuickConnect ID hier anzeigen. F&uuml;r erweiterte Einstellungen und Verwaltung bewegen Sie die Maus &uuml;ber diesen Abschnitt und klicken Sie in der rechten, oberen Ecke auf das Symbol <b>Mehr</b>, um die Seite <b>QuickConnect</b> zu &ouml;ffnen.</p>
<h3>Speicher</h3>
<p>Dieser Abschnitt zeigt die Hardware-Informationen und den Status Ihrer Speicher an, z.&nbsp;B. Festplattenauslastung und Nutzung/Kapazit&auml;t des Volumes. Sie k&ouml;nnen &uuml;berpr&uuml;fen, wie viele Festplatten durch welche Speicher verwendet werden. F&uuml;r erweiterte Einstellungen und Verwaltung bewegen Sie die Maus &uuml;ber diesen Abschnitt und klicken Sie in der rechten, oberen Ecke auf das Symbol <b>Mehr</b>, um die Seite <b>Speicher-Manager</b> zu &ouml;ffnen.</p>

<h3>Ressourcen-Monitor</h3>
<p>Sie k&ouml;nnen den Prozentsatz der gesamten CPU-Auslastung, die Speicherauslastung, und die gesendeten und empfangenen Daten in kB pro Sekunde &uuml;berwachen. Wenn mehr als ein LAN verwendet wird, klicken Sie zur Umschaltung auf das Pfeil-Symbol im Netzwerkdurchfluss-Diagramm. F&uuml;r erweiterte Einstellungen und Verwaltung bewegen Sie die Maus &uuml;ber diesen Abschnitt und klicken Sie in der rechten, oberen Ecke auf das Symbol <b>Mehr</b>, um die Seite <b>Ressourcen-Monitor</b> zu &ouml;ffnen.</p>

<h3>Verbundene Benutzer</h3>
<p>Sie k&ouml;nnen hier die Clients anzeigen und verwalteten, die aktuell mit dem System verbunden sind, und auf die Ressourcen zugreifen. Dieser Bereich zeigt Clients an, die &uuml;ber HTTP, Telnet, SSH, SMB/CIFS, AFP, FTP und NFS verbunden sind. F&uuml;r erweiterte Einstellungen und Verwaltung bewegen Sie die Maus &uuml;ber diesen Abschnitt und klicken Sie in der rechten, oberen Ecke auf das Symbol <b>Mehr</b>, um die Seite <b>Ressourcen-Monitor</b> zu &ouml;ffnen.</p>

<h4>Aktuelle Verbindungen trennen:</h4>
<p>Klicken Sie neben dem gew&uuml;nschten Benutzer auf das Symbol <b>Verbindung trennen</b>, um dem Benutzer den Zugriff auf die Ressource zu verweigern. Der getrennte Benutzer ben&ouml;tigt eine erneute Autorisierung, bevor er wieder auf die Ressource zugreifen kann.</p>

</body>
</html>