<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Gemeinsamer Ordner</h2>
<p>Gemeinsame Ordner sind die Grundverzeichnisse, in denen Sie Dateien und Ordner auf Ihrem DiskStation speichern k&ouml;nnen. Sie m&uuml;ssen im DSM mindestens einen gemeinsamen Ordner erstellen, bevor Sie Daten auf dem DiskStation speichern k&ouml;nnen. In den gemeinsamen Ordnern gespeicherte Daten k&ouml;nnen privat bleiben oder mit bestimmten Benutzern oder Benutzergruppen geteilt werden, je nach den anpassbaren Zugriffsrechten.</p>



<p>Nachfolgend finden Sie eine Liste der voreingestellten gemeinsamen Ordner, die automatisch erstellt werden, wenn bestimmte Anwendungen, Dienste oder Pakete installiert oder aktiviert werden.</p> 
<table>
<tr>
<th>Name</th>
<th>Beschreibung</th>
</tr>
<tr>
<th>public</th>
<td>Der Ordner <strong>public</strong> wird bei der ersten Einrichtung des DiskStation automatisch erstellt.*</td>
</tr>
<tr>
<th>web</th>
<td>Der Ordner <strong>web</strong> ist der Standard-Speicherort f&uuml;r die Inhalte einer Website, die auf DiskStation gehostet werden. Er wird automatisch erstellt, wenn <strong>Web Station</strong> aktiviert ist.</td>
</tr>
<tr>
<th>photo</th>
<td>Der Ordner <strong>photo</strong> speichert Fotos und Videos, die Sie mit anderen auf der Photo Station teilen m&ouml;chten. Er wird automatisch erstellt, wenn die <strong>Photo Station</strong> oder der <strong>DLNA/UPnP-Medienserver</strong> aktiviert ist.</td>
</tr>
<tr>
<th>music</th>
<td>Der Ordner <strong>music</strong> enth&auml;lt Musik, die Sie auf Audio Station h&ouml;ren m&ouml;chten. Er wird automatisch erstellt, wenn die <strong>Audio Station</strong> oder der <b>DLNA/UPnP-Medienserver</b> aktiviert ist.</td>
</tr>
<tr>
<th>video</th>
<td>Der Ordner <strong>video</strong> enth&auml;lt Videos, die Sie &uuml;ber DLNA/UPnP-Ger&auml;te durchsuchen k&ouml;nnen. Er wird automatisch erstellt, wenn die <b>Video Station</b> oder der <strong>DLNA/UPnP-Medienserver</strong> aktiviert ist.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Der Ordner <strong>surveillance</strong> enth&auml;lt die Aufzeichnungen der Surveillance Station. Er wird automatisch erstellt, wenn <strong>Surveillance Station</strong> aktiviert ist. Er hat nur Lesezugriff und kann nur vom System-Administrator aufgerufen werden.</td>
</tr>
<tr>
<th>home</th>
<td>Der Ordner <strong>home</strong> bietet einen privaten Bereich f&uuml;r jeden Benutzer, in dem Daten gespeichert werden k&ouml;nnen, auf die nur dieser Benutzer zugreifen kann. Er wird automatisch erstellt, wenn die Funktion <strong>Benutzer-Home</strong> aktiviert ist.</td>
</tr>
<tr>
<th>homes</th>
<td>Der Ordner <strong>homes</strong> enth&auml;lt die home-Ordner aller Benutzer. Er wird automatisch erstellt, wenn die Funktion <strong>Benutzer-Home</strong> aktiviert ist. Nur der Systemadministrator hat Zugriff und kann alle Benutzer-Home-Ordner verwalten.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Der Ordner <strong>NetBackup</strong> wird automatisch erstellt, wenn die <strong>Netzwerksicherung</strong> aktiviert ist.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Der Ordner <strong>usbshare [Nummer]</strong> wird automatisch erstellt, wenn Sie ein externes USB-Ger&auml;t an den USB-Port von DiskStation anschlie&szlig;en.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Der Ordner <strong>satashare</strong> wird automatisch erstellt, wenn Sie ein externes eSATA-Laufwerk an den eSATA-Port von DiskStation anschlie&szlig;en.*</td>
</tr>
</table>
<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Sie k&ouml;nnen Berechtigungen f&uuml;r gemeinsame Ordner von Benutzern nur im Einfach-Modus bearbeiten. Wenn Sie Benutzergruppen erstellen oder Gruppen-Zugriffsrechte f&uuml;r gemeinsame Ordner verwalten m&ouml;chten, gehen Sie zu <b>Systemsteuerung (Erweiterter Modus)</b> &gt; <b>Gruppe</b>.</li>
</ul>
</div>

<h4>So erstellen Sie einen gemeinsamen Ordner:</h4>
<ol>
<li>Gehen Sie zu <b>Systemsteuerung (Einfach-Modus)</b> &gt; <b>Gemeinsamer Ordner</b>, und klicken Sie auf der linken Seite auf das Symbol <b>+</b>.</li>
<li>Geben Sie einen Namen an und w&auml;hlen Sie ein Volume, auf dem der gemeinsame Ordner erstellt werden soll.</li>
<li>Markieren Sie bei Bedarf <b>Papierkorb aktivieren</b>. Falls diese Option aktiviert ist und Dateien im gemeinsamen Ordner gel&ouml;scht werden, werden sie in einen Ordner namens <b>#recycle</b> verschoben. Der Zugriff auf den Papierkorb kann auf Benutzer der Gruppe <b>administrators</b> beschr&auml;nkt werden.</li>
<li>Aktivieren oder deaktivieren Sie die entsprechenden Felder f&uuml;r jeden Benutzer, um seine Berechtigungen f&uuml;r den gemeinsamen Ordner anzupassen:</li>
<ul>
<li><b>Lesen/Schreiben:</b> Der Benutzer hat Zugriff auf Dateien und Unterordner im gemeinsamen Ordner und kann &Auml;nderungen vornehmen.</li>
<li><b>Nur Lesen:</b> Der Benutzer hat Zugriff auf die Dateien und Unterordner im gemeinsamen Ordner.</li>
<li><b>Kein Zugriff:</b> Der Benutzer hat keinen Zugriff auf die Dateien und Unterordner im gemeinsamen Ordner.</li>
</ul>
<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um die Einstellungen zu speichern.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Bei Namen f&uuml;r gemeinsame Ordner wird die Gro&szlig;-/Kleinschreibung nicht beachtet und sie k&ouml;nnen 1-32 Zeichen umfassen. Der Name darf die folgenden Zeichen nicht enthalten:<br> <strong>! &quot; # $ % &amp; &apos; ( ) * + , / : ; <= > ? @ [ ] \ ^ ` { } | ~</strong></li>
<li>Die folgenden Namen sind f&uuml;r die Systemnutzung reserviert:<br> <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong></li>
<li>Das erste Zeichen eines gemeinsamen Ordners darf kein Minus- oder Leerzeichen sein, und das letzte Zeichen darf ebenfalls kein Leerzeichen sein.</li>
<li>Beachten Sie bei Berechtigungskonflikten folgende Priorit&auml;t: <b>Kein Zugriff</b> &gt; <b>Lesen/Schreiben</b> &gt; <b>Nur Lesen</b>.</li>
<li>Wenn beim Erstellen eines neuen gemeinsamen Ordners die Berechtigungen f&uuml;r die Benutzer der Gruppe <b>administrators</b> auf <b>Kein Zugriff</b> gesetzt sind, k&ouml;nnen diese Benutzer den gemeinsamen Ordner nur unter <b>Systemsteuerung</b> &gt; <b>Gemeinsame Ordner</b> anzeigen.</li>
<li>Sie k&ouml;nnen die Berechtigungseinstellungen des Papierkorb-Ordners der File Station konfigurieren, indem Sie mit der rechten Maustaste auf den Ordner <b>#recycle</b> klicken. W&auml;hlen Sie <b>Eigenschaften</b>, und klicken Sie auf die Registerkarte <b>Berechtigungen</b>.</li>
</ul>
</div>

<h4>Bearbeiten eines gemeinsamen Ordners:</h4>
<ol>
<li>Gehen Sie zu <b>Systemsteuerung (Einfach-Modus)</b> &gt; <b>Gemeinsamer Ordner</b>.</li>
<li>W&auml;hlen Sie auf der linken Seite den gew&uuml;nschten gemeinsamen Ordner.</li>
<li>Bearbeiten Sie die allgemeine Informationen des gemeinsamen Ordners, z.&nbsp;B. Name, Speicherort und Benutzerrechte.</li>
<li>Falls <b>Papierkorb aktivieren</b> bereits markiert wurde, k&ouml;nnen Sie auf <b>Papierkorb leeren</b> klicken, um alle gel&ouml;schten Dateien im Papierkorb endg&uuml;ltig zu entfernen.</li>
<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um die Einstellungen zu speichern.</li>
</ol>

<h4>L&ouml;schen eines gemeinsamen Ordners:</h4>
<ol>
<li>Gehen Sie zu <b>Systemsteuerung (Einfach-Modus)</b> &gt; <b>Gemeinsamer Ordner</b>.</li>
<li>W&auml;hlen Sie auf der linken Seite den gew&uuml;nschten gemeinsamen Ordner.</li>
<li>Klicken Sie auf der linken Seite auf das Symbol <b>Papierkorb</b>, um den ausgew&auml;hlten gemeinsamen Ordner zu l&ouml;schen.</li>

</ol>


<p>____<br> * Nur bei bestimmten Modellen verf&uuml;gbar.</p>
</body>
</html>