<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM-Aktualisierung</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>DSM-Aktualisierung</h1>
<p>Synology ver&ouml;ffentlicht regelm&auml;&szlig;ig kostenlose DSM-Aktualisierungen. Die Aktualisierungen k&ouml;nnen neue Funktionen, Funktionsverbesserungen und Leistungserweiterungen beinhalten.</p>
<p><span class="note_head">Wichtig:</span> Normalerweise hat die DSM-Aktualisierung keine Auswirkung auf die Daten der DiskStation. Trotzdem empfehlen wir Ihnen, Ihre Daten zu sichern, bevor Sie mit der Aktualisierung beginnen.</p>

<h2>Manuelle DSM-Aktualisierung durchf&uuml;hren</h2>
<p>Sie k&ouml;nnen die &bdquo;.pat-Aktualisierungsdatei&ldquo; im Synology <a href="http://www.synology.com/support/download.php" target="_blank">Download-Zentrum</a> herunterladen und eine manuelle DSM-Aktualisierung durchf&uuml;hren.</p>
<h4>So aktualisieren Sie den DSM auf manuelle Weise:</h4>

<ol>
<li>Besuchen Sie <a href="http://www.synology.com" target="_blank">www.synology.com</a>, um die neueste DSM-Aktualisierung herunterzuladen und Ihren Computer zu aktualisieren. Entpacken Sie die Datei, um eine .pat Aktualisierungsdatei zu erhalten.</li>
<li>Klicken Sie auf <b>Manuelle DSM-Aktualisierung</b>, um zur Seite &bdquo;Manuelle DSM-Aktualisierung&ldquo; zu wechseln</li>
<li>Klicken Sie auf <b>Durchsuchen</b>, um die Aktualisierungsdatei auszuw&auml;hlen.</li>
<li>Klicken Sie auf <b>Anwenden</b>, um die Aktualisierung Ihres DSM zu starten. Das System startet automatisch neu, sobald die Aktualisierung abgeschlossen ist.</li>
</ol>
<div class="section">
<h4>Fehlerbehebung:</h4>
<p>Wenn Sie Ihren DSM nicht aktualisieren k&ouml;nnen, helfen Ihnen die folgenden Vorschl&auml;ge m&ouml;glicherweise, das Problem zu beheben:</p>
<ul>
<li>Pr&uuml;fen Sie, ob der Aktualisierungsprozess von einem Benutzer oder anderen unerwarteten Ereignissen, z.&nbsp;B. Stromausf&auml;llen, unterbrochen wurde.</li>
<li>&Uuml;berpr&uuml;fen Sie die DSM-Version. Sie k&ouml;nnen das System nur mit einer neueren DSM-Version aktualisieren.</li>
<li>Laden Sie die DSM-Aktualisierung erneut herunter, denn die Aktualisierungsdatei k&ouml;nnte besch&auml;digt sein.</li>
</ul>
<p>Besteht das Problem weiterhin, kontaktieren Sie bitte den <a href="https://account.synology.com/support/support_form.php" target="_blank">Technischen Support</a> von Synology.</p>
</div>

<h2>Automatische DSM-Aktualisierung durchf&uuml;hren</h2>
<p>Im Gegensatz zur manuellen Aktualisierung &uuml;berpr&uuml;ft das System bei Synology, ob eine neue DSM-Version zur Verf&uuml;gung steht. Gehen Sie zu <b>DSM-Aktualisierung</b>. Das Resultat wird mit gr&uuml;nem oder rotem Text angezeigt. Wenn das Ergebnis Ihnen anzeigt, dass der neuste DSM zum Download zur Verf&uuml;gung steht, k&ouml;nnen Sie den neusten DSM herunterladen und die Aktualisierung durchf&uuml;hren.</p>
<h4>So lassen Sie das System die neueste DSM-Version herunterladen und die Aktualisierung durchf&uuml;hren:</h4>
<ol>
<li>Wenn die neueste DSM-Version zum Herunterladen bereitsteht, klicken Sie auf den Link <b>Herunterladen</b>. Das System wird mit dem Herunterladen der neuesten DSM-Version beginnen.</li>
<li>Das System zeigt eine der folgenden Desktop-Benachrichtigungen, um Ihnen mitzuteilen, ob das Herunterladen erfolgreich war oder nicht: <b>DSM-Download abgeschlossen</b> oder <b>DSM-Download fehlgeschlagen</b>.</li>
<li>Klicken Sie auf das Desktop-Benachrichtigungsfenster, um zur <b>DSM-Aktualisierung</b> zu gelangen.</li>
<li>F&uuml;hren Sie eine der folgenden Aktionen aus:<ul>
<li>Klicken Sie nach dem Herunterladen der DSM-Version auf <b>Jetzt aktualisieren</b>, um mit der DSM-Aktualisierung sofort zu beginnen.</li>
<li>Sollte der DSM-Download fehlgeschlagen sein, klicken Sie auf <b>Neuer Versuch</b>, damit das System erneut die neueste DSM-Version von Synology herunterladen kann.</li>
</ul>
</li>
</ol>
<h4>Regelm&auml;&szlig;ig nach Aktualisierungen suchen:</h4>
<ol>
<li>Markieren Sie <b>Automatisch nach DSM Aktualisierungen suchen</b>.</li>
<li>W&auml;hlen Sie einen Aktualisierungsplan, und legen Sie den <b>Installationszeitplan</b> fest.</li>
<li>Klicken Sie auf <b>OK</b>.</li>
</ol>
<p>Ein Desktop-Benachrichtigung wird angezeigt, wenn eine DSM-Aktualisierung heruntergeladen wurde und f&uuml;r die Installation bereit steht. Um die automatische DSM-Aktualisierung zu stoppen, k&ouml;nnen Sie sie in der Desktop-Benachrichtigung abbrechen oder indem Sie die <strong>Update-Einstellungen</strong> &auml;ndern. DSM-Aktualisierungen werden vor dem geplanten Herunterfahren installiert, wenn Sie <strong>Herunterfahren</strong> unter <strong>Energie-Zeitplan</strong> aktiviert haben.</p>

<div class="section">
<h4>Fehlerbehebung:</h4>
<p>Falls w&auml;hrend der Suche nach der neuesten DSM-Version oder w&auml;hrend des Herunterladens Fehlermeldungen (mit rotem Text) angezeigt werden, versuchen Sie das Problem folgenderma&szlig;en zu l&ouml;sen:</p>
<ul>
<li>Stellen Sie sicher, dass die DiskStation mit dem Internet verbunden ist.</li>
<li>M&ouml;glicherweise ist der Download-Server von Synology derzeit besetzt. Versuchen Sie das Herunterladen zu einem sp&auml;teren Zeitpunkt noch einmal.</li>
</ul>
<p>Besteht das Problem weiterhin, kontaktieren Sie bitte den <a href="https://account.synology.com/support/support_form.php" target="_blank">Technischen Support</a> von Synology.</p>
</div>

</body>
</html>
