<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Benachrichtigungen</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Erweitert</h2>
<p>Sie k&ouml;nnen die Arten von Ereignissen ausw&auml;hlen, welche das System veranlassen, Benachrichtigungen zu senden, sowie das Medium (E-Mail, SMS, Mobiltelefon, Sofortnachricht-Programme), mit dem die Nachrichten empfangen werden. </p>
<p>F&uuml;r jedes der Ereignisse gibt es eine eigene Standardbenachrichtigung, aber Sie haben auch die Option, die Inhalte der Benachrichtigung zu &auml;ndern. Die Standardnachricht kann sp&auml;ter wiederhergestellt werden, wenn Sie ihre &Auml;nderungen r&uuml;ckg&auml;ngig machen m&ouml;chten.</p>

<ul class="disable-eds14">
<li><strong>Alle Benachrichtigungen</strong>: Hierzu geh&ouml;ren alle Arten von Benachrichtigungsereignissen.</li>
<li><b>Nach Priorit&auml;t:</b> Je nach Wichtigkeit von Benachrichtigungsereignissen werden sie in zwei Gruppen gefiltert: <strong>Kritisch</strong> und <strong>Informativ</strong>.</li>
<ul>
<li><b>Kritisch</b>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sofortige korrigierende Ma&szlig;nahmen verlangen.</li>
<li><strong>Informativ</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, f&uuml;r die keine korrigierenden Ma&szlig;nahmen erforderlich sind, und die Sie lediglich &uuml;ber &Auml;nderungen des Systemstatus informieren.</li>
</ul>
<li><b>Nach Kategorie</b>: Je nach Art von Benachrichtigungsereignissen werden sie in sechs Gruppen sortiert: <strong>System</strong>, <strong>Interner Speicher</strong>, <strong>Sicherung und Wiederherstellung</strong>, <strong>Stromversorgung</strong>, <strong>USBCopy</strong>, <strong>CMS</strong> und <strong>Externer Speicher</strong>.</li>
<ul>
<li><b>System</b>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf Systemfehler oder System&auml;nderungen beziehen.</li>
<li><strong>Interner Speicher</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf den internen Speicher beziehen.</li>
<li><strong>Sicherung und Wiederherstellung</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf Sicherungs- und Wiederherstellungsaufgaben beziehen.</li>
<li><strong>Stromversorgung</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf die Stromversorgung beziehen. </li>
<li><strong>USBCopy</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf USBCopy beziehen.</li>
<li><strong>CMS</strong>: Ereignisse, die sich auf Verbindung/Trennung mit dem CMS-Host auswirken, geh&ouml;ren zu dieser Gruppe.</li>
<li><strong>Externer Speicher</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf den externen Speicher beziehen.</li>
</ul>
</ul>

<ul class="enable-eds14">
<li><strong>Alle Benachrichtigungen</strong>: Hierzu geh&ouml;ren alle Arten von Benachrichtigungsereignissen.</li>
<li><b>Nach Priorit&auml;t:</b> Je nach Wichtigkeit von Benachrichtigungsereignissen werden sie in zwei Gruppen gefiltert: <strong>Kritisch</strong> und <strong>Informativ</strong>.</li>
<ul>
<li><b>Kritisch</b>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sofortige korrigierende Ma&szlig;nahmen verlangen.</li>
<li><strong>Informativ</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, f&uuml;r die keine korrigierenden Ma&szlig;nahmen erforderlich sind, und die Sie lediglich &uuml;ber &Auml;nderungen des Systemstatus informieren.</li>
</ul>
<li><b>Nach Kategorie</b>: Je nach Art von Benachrichtigungsereignissen werden sie in sechs Gruppen sortiert: <strong>System</strong>, <strong>Interner Speicher</strong>, <strong>Sicherung und Wiederherstellung</strong>, <strong>Netzteil</strong> und <strong>Externer Speicher</strong>.</li>
<ul>
<li><b>System</b>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf Systemfehler oder System&auml;nderungen beziehen.</li>
<li><strong>Sicherung und Wiederherstellung</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf Sicherungs- und Wiederherstellungsaufgaben beziehen.</li>
<li><strong>Stromversorgung</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf die Stromversorgung beziehen. </li>
<li><strong>CMS</strong>: Ereignisse, die sich auf Verbindung/Trennung mit dem CMS-Host auswirken, geh&ouml;ren zu dieser Gruppe.</li>
<li><strong>Externer Speicher</strong>: Zu dieser Gruppe geh&ouml;ren Ereignisse, welche sich auf den externen Speicher beziehen.</li>
</ul>
</ul>



<h4>So w&auml;hlen Sie Arten und Medium von Benachrichtigungsereignissen aus:</h4>
<ol>
<li>W&auml;hlen Sie eine Ereignisgruppe im Drop-down-Men&uuml; unter den Registerkarten aus. Ereignisse der ausgew&auml;hlten Gruppe werden angezeigt.</li>
<li>Markieren Sie die Kontrollk&auml;stchen f&uuml;r alle einzelnen Ereignisse, um das bevorzugte Benachrichtigungsmedium auszuw&auml;hlen.</li>
<li>Klicken Sie auf <b>Speichern</b>, um die Einstellungen zu &uuml;bernehmen.</li>
</ol>
<h4>So bearbeiten Sie eine Benachrichtigung:</h4>
<ol>
<li>W&auml;hlen Sie in der Ereignisliste das Ereignis aus, dessen Benachrichtigung Sie bearbeiten m&ouml;chten, und klicken Sie anschlie&szlig;end auf <b>Nachricht bearbeiten</b>.</li>
<li>Geben Sie im angezeigten Fenster die Betreffzeile und den Haupttext ein, um die Benachrichtigung zu &auml;ndern. Klicken Sie anschlie&szlig;end auf <strong>Speichern</strong>, um die &Auml;nderungen zu &uuml;bernehmen.</li>
<li>Wenn Sie die Standardbenachrichtigung nach &Uuml;bernahme der &Auml;nderungen wiederherstellen m&ouml;chten, gehen Sie folgenderma&szlig;en vor:</li>
<ol>
<li>W&auml;hlen Sie in der Ereignisliste das Ereignis aus, dessen Standardbenachrichtigung Sie wiederherstellen m&ouml;chten, und klicken Sie anschlie&szlig;end auf <b>Nachricht bearbeiten</b>.</li>
<li>Klicken Sie im angezeigten Fenster auf <b>Standard wiederherstellen</b> und anschlie&szlig;end auf <strong>Ja</strong> im Best&auml;tigungsdialogfeld.</li>
</ol>
</ol>

<p><span class="note_head">Hinweis:</span> Es ist ratsam, dass Sie den Textteil mit &apos;%&apos; sowohl in der Betreffzeile als auch im Haupttext unver&auml;ndert belassen. Der Textteil wird durch tats&auml;chliche Systeminformationen ersetzt, wenn eine Benachrichtigung gesendet wird.</p>
</body>
</html>
