<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SNMP</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SNMP</h2>

<p>Mit dem SNMP-Dienst (unter <strong>Systemsteuerung</strong> &gt; <strong>Terminal und SNMP</strong> &gt; <strong>SNMP</strong>) k&ouml;nnen Benutzer den DiskStation &uuml;ber die Netzwerkverwaltungs-Software &uuml;berwachen. Aktuell werden die Protokolle SNMPv1, SNMPv2c und SNMPv3 unterst&uuml;tzt. </p>


<h3>SNMP-Service aktivieren</h3>

<p>Markieren Sie <b>SNMP-Service aktivieren</b>, und folgen Sie den unten stehenden Schritten.</p>
<h4>SNMPv1-, SNMPv2c-Dienst aktivieren:</h4>
<ol>
<li>Markieren Sie <b>SNMPv1, SNMPv2c-Dienst</b>.<li>Geben Sie einen <b>Community</b>-Namen ein.<li>Klicken Sie auf <b>&Uuml;bernehmen</b>.</ol>
<h4>SNMPv3-Dienst aktivieren:</h4>
<ol>
<li>Markieren Sie <b>SNMPv3-Dienst</b>.<li>Geben Sie einen <b>Benutzernamen</b> und ein <b>Passwort</b> ein. Geben Sie Ihr Passwort erneut unter <b>Passwort best&auml;tigen</b> ein.<li>Klicken Sie auf <b>&Uuml;bernehmen</b>.</ol>
<p>Durch die zus&auml;tzliche Eingabe von <b>Name</b>, <b>Standort</b> und <b>Kontakt</b> wird die Identifizierung des DiskStation vereinfacht. Diese Felder sind optional.</p>


<div class="section">
<h4>Hinweis:</h4>
<ol>
<li>IPv4 und IPv6 werden vom SNMP-Dienst unterst&uuml;tzt. </li>
<li>Der SNMP-Dienst unterst&uuml;tzt gleichzeitig SNMPv1, SNMPv2c und SNMPv3. </li>
</ol>
</div>


<div class="section">
<h4>SNMPv1 , SNMPv2c Community-Einschr&auml;nkung:</h4>
<p>Der Community-Name muss 1 bis 64 darstellbare Zeichen lang sein. Die folgenden Zeichen sind nicht erlaubt: <br>&quot; &apos; \ und Leerzeichen.</p>
<h4>SNMPv3 Benutzernamen-Einschr&auml;nkung:</h4>
<p>Der Benutzername muss 1 bis 64 darstellbare Zeichen lang sein. Die folgenden Zeichen sind nicht erlaubt: <br>&quot; &apos; \ und Leerzeichen.</p>
<h4>SNMPv3 Passwort-Einschr&auml;nkung:</h4>
<p>Beim Passwort wird zwischen Gro&szlig;- und Kleinschreibung unterschieden. Es sollte 8 bis 127 darstellbare Zeichen enthalten, wozu Buchstaben, Zahlen und Zeichen geh&ouml;ren k&ouml;nnen. Die folgenden Zeichen sind nicht erlaubt: <br>&quot; &apos; \ und Leerzeichen.</p>
<p>&nbsp;</p>
</div>
<h3>Synology MIB-Dateien herunterladen</h3>
<p class="disable-eds14">Synology bietet die M&ouml;glichkeit, DiskStation &uuml;ber Netzwerkverwaltungssysteme in Bezug auf System, Festplatte und den Status der RAID-Volumes zu &uuml;berwachen.</p>

<p class="enable-eds14">Synology bietet die M&ouml;glichkeit, DiskStation &uuml;ber Netzwerkverwaltungssysteme in Bezug auf System, Festplatte und den Status der Volumes zu &uuml;berwachen.</p>

<p>Bitte besuchen Sie die <a href="http://www.synology.com/support/snmp_mib" target="_blank">Synology Website</a> f&uuml;r weitere Informationen, und um die entsprechenden Dateien herunterzuladen.</p>

<div class="section">
<h4>Hinweis:</h4>
<p>Netzwerkverwaltungssysteme basieren auf MIB-Dateien f&uuml;r Definitionen der &uuml;berwachten Ger&auml;te. Weitere Informationen erhalten Sie: <a href="http://en.wikipedia.org/wiki/Management_information_base" target="_blank">hier</a>.</p>
</div>

</body>
</html>
