<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ein/Aus</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Ruhezustand</h2>
<p>Sie k&ouml;nnen die Zeitdauer angeben, die Festplatten inaktiv sein m&uuml;ssen, bevor der HDD-Ruhemodus gestartet wird. W&auml;hrend des HDD-Ruhezustands drehen sich die Festplatten nicht mehr, wodurch sich der Stromverbrauch verringert und die Lebensdauer der Festplatten verl&auml;ngert. Sie k&ouml;nnen verschiedene Zeitintervalle f&uuml;r interne Festplatten und externe eSATA/USB-Festplatten angeben.</p>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Der HDD-Ruhezustand wird bei einem Zugriff auf die Festplatte aufgehoben.</li>
<li>Nur bestimmte externe USB-Speicherger&auml;te unterst&uuml;tzen den HDD-Ruhezustand.</li>
</ul>
</div>


<div class="section">
<h4>Warum wechselt mein DiskStation nicht in den Ruhezustand?</h4>

<p>Bitte beachten Sie, dass die folgenden Dienste verhindern, dass DiskStation in den Ruhemodus wechselt. Zudem wird das System den Ruhemodus zwei Minuten vor einer geplanten Aufgabe verlassen.</p>

<p><strong>Pakete:</strong></p>
<ul>
  <li>Download Station: DiskStation kann nicht in den Ruhezustand wechseln, wenn auf der Download Station eMule, ein geplanter RSS-Download oder aktive Aufgaben ausgef&uuml;hrt werden.</li>
  <li>Mail Station: DiskStation kann nicht in den Ruhezustand wechseln, wenn Mail Station POP3 verwendet.</li>
  <li>Surveillance Station: DiskStation kann nicht in den Ruhezustand wechseln, wenn Surveillance Station aufnimmt.</li>
  <li>Medienserver: DiskStation kann nicht in den Ruhezustand wechseln, wenn das DMA-Protokoll in den Medienserver-Einstellungen aktiviert ist (gehen Sie zu <strong>Hauptmen&uuml;</strong> &gt; <strong>Medienserver</strong> &gt; <strong>Medienserver</strong> &gt; <strong>Diagnostizieren</strong>).</li>
  <li>Directory Server</li>
  <li>Webalizer</li>
  <li>Logitech<sup>&reg;</sup> Medienserver</li>
  <li>Plex Media Server</li>
  <li>Andere Drittanbieter-Software oder Optware, z.&nbsp;B. SABnzbd</li>
</ul>
<p><strong>Prozesse:</strong></p>
<ul>
  <li>Miniaturansicht und Indexierung: DiskStation kann nicht in den Ruhezustand wechseln, wenn Miniaturansichten erstellt oder Multimedia-Dateien nach einer Aktualisierung neu geordnet werden. W&auml;hrenddessen wird der Prozess &bdquo;synoindexd&ldquo; als &bdquo;L&auml;uft&ldquo; aufgef&uuml;hrt (gehen Sie zu <strong>Hauptmen&uuml;</strong> &gt; <strong>Ressourcen-Monitor</strong> &gt; <strong>Prozess</strong>).</li>
  <li>Local Master Browser: DiskStation kann nicht in den Ruhezustand wechseln, wenn &bdquo;Local Master Browser&ldquo; aktiviert ist (gehen Sie zu <strong>Systemsteuerung</strong> &gt; <strong>Win/Mac/NFS</strong> &gt; <strong>Windows Dateidienst</strong> &gt; <strong>Local Master Browser aktivieren</strong>).</li>
  <li>Windows Media Player: DiskStation kann nicht in den Ruhezustand wechseln, wenn der Netzwerk-Freigabedienst des Windows Media Players im LAN aktiviert ist.</li>
  <li>DiskStation kann nicht in den Ruhezustand wechseln, wenn einige gleichzeitig laufenden Prozesse Swap-Speicher ben&ouml;tigen, bei denen die RAM-Kapazit&auml;t &uuml;berschritten wurde, und wenn HDDs vor&uuml;bergehend f&uuml;r Lese/Schreibvorg&auml;nge verwendet werden.</li>
</ul>
<p><strong>Sonstige</strong></p>
<ul>
  <li>USB-Ger&auml;te: DiskStation kann nicht in den System-Ruhezustand versetzt werden, wenn USB-Ger&auml;te an der Einheit angeschlossen sind. </li>
</ul>

</div>


<h3>Systemruhezustand</h3>
<p>Sie k&ouml;nnen DiskStation f&uuml;r den Aufruf des Systemruhezustandes eine Minute nach den Beginn des Ruhemodus der Festplatten einrichten. Der Systemruhezustand verringert den Stromverbrauch von DiskStation.  </p>
<p>W&auml;hrend des Ruhemodus:</p>

<ol>
  <li>Die Ein/Aus-Taste wird blinken (langsamer Ein/Ausschaltzyklus). Die anderen LEDs werden ausgeschaltet.</li>
  <li>Die Stromversorgung zu den Festplatten ist unterbrochen.</li>
  <li>Die CPU wird angehalten.</li>
  <li>Der externe L&uuml;fter stoppt.</li>
  <li>Die LEDs an den LAN Ports werden ausgeschaltet.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Jedes SMB/CIFS-Paket kann den Server davon abhalten, den Systemruhezustand aufzurufen, einschlie&szlig;lich aller Windows-Dateibrowser, die im Netzwerk eingesetzt werden. Wenn CIFS-Pakete beim Wechsel in den Systemruhezustand ignoriert werden sollen, w&auml;hlen Sie bitte <strong>Broadcasting-Pakete von Windows Explorer ignorieren</strong> aus. Bitte beachten Sie, dass SMB/CIFS-Pakete nach Auswahl dieser Option nicht zum Beenden des Systemruhezustands verwendet werden k&ouml;nnen. Der Anschluss von USB-Ger&auml;ten wird dazu f&uuml;hren, dass der Server nicht in den Systemruhezustand versetzt werden kann.</li>
</ul>
</div>

<h2>Tiefschlaf</h2>
<p>Tiefschlaf f&uuml;r Expansionseinheiten kann &uuml;ber die Schnittstelle des verbundenen DiskStation aktiviert werden. Sie k&ouml;nnen f&uuml;r die Expansionseinheit und den gepaarten DiskStation die Leerlaufzeiten separat konfigurieren. Die Expansionseinheiten k&ouml;nnen daher f&uuml;r die Aktivierung von Tiefschlaf eingestellt werden, wohingegen DiskStation online bleibt.</p>
<p>W&auml;hrend des Tiefschlafmodus:</p>
<ul>
  <li>Alle LEDs der Expansionseinheit sind ausgeschaltet.</li>
<li>Die Stromversorgung der Festplatten der Expansionseinheit wird unterbrochen.</li>
<li>Der L&uuml;fter der Expansionseinheit wird angehalten.</li>
</ul>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Der Tiefschlaf wird bei einem Zugriff auf die Festplatte aufgehoben.</li>
<li>Um einen normalen Betrieb bei der Verwendung der Tiefschlaf-Funktion auf der Expansionseinheit zu gew&auml;hrleisten, stellen Sie bitte den Schalter <b>Auto/Manual</b> auf der R&uuml;ckseite auf <b>Auto</b>.</li>
</ul>
</div>

<h2>Automatisches Ausschalten</h2>
<p>Sie k&ouml;nnen die Zeitdauer festlegen, wie lange die interne Festplatte im Ruhezustand bleibt, bevor Ihr DiskStation ausgeschaltet wird.</p>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Sie m&uuml;ssen zuerst den Ruhezustand der Festplatte aktivieren.</li>
<li>Sie m&uuml;ssen zuerst den WOL-Dienst aktivieren, bevor Sie Ihren DiskStation &uuml;ber den Fernzugriff einschalten k&ouml;nnen.</li>
</ul>
</div>

</body>
</html>

