<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Configuraci&oacute;n de red</h2>
	<p>Esta p&aacute;gina contiene tres fichas que muestran la configuraci&oacute;n de red del cl&uacute;ster high-availability, el servidor activo y el servidor pasivo.</p>
  
	<h3>Ficha Cl&uacute;ster HA</h3>
  	<p>Al crear un cl&uacute;ster high-availability, el sistema genera una direcci&oacute;n IP com&uacute;n para que la IP del cl&uacute;ster high-availability reciba conexiones entrantes. Si es necesario, se pueden crear direcciones IP adicionales para el cl&uacute;ster high-availability. Las direcciones IP de las interfaces de red activadas del servidor activo se mostrar&aacute;n en esta ficha (la interfaz de red usada por la conexi&oacute;n Heartbeat no se mostrar&aacute; en esta p&aacute;gina, ya que dicha interfaz se usar&aacute; para la replicaci&oacute;n de los datos entre los dos servidores). Esta ficha muestra la siguiente informaci&oacute;n:</p>
    	<ul>
        	<li><b>Interfaz de red:</b> indica la interfaz o las interfaces de red activadas en el servidor activo.</li>
            <li><b>Conexi&oacute;n:</b> Muestra si la interfaz est&aacute; conectada o no.</li>
            <li><b>Direcci&oacute;n IP:</b> al crear un cl&uacute;ster high-availability, el sistema genera una direcci&oacute;n IP com&uacute;n para que la IP del cl&uacute;ster high-availability reciba conexiones entrantes. Puede conectarse al cl&uacute;ster high-availability utilizando esta direcci&oacute;n IP cuando quiera iniciar sesi&oacute;n en DiskStation Manager (DSM) independientemente de qu&eacute; servidor de Synology sea el servidor activo. Esto evita tener que conectar con distintas direcciones IP despu&eacute;s de un cambio.</li>
            <li><b>M&aacute;scara de subred: </b>la m&aacute;scara de subred asociada a la direcci&oacute;n IP del cl&uacute;ster high-availability en cuesti&oacute;n.</li>
		</ul>
<h4>Para editar la Direcci&oacute;n IP y la M&aacute;scara de subred:</h4>
	<ol>
		<li>Elija una direcci&oacute;n IP o m&aacute;scara de subred que desee editar y haga clic en <b>Editar</b> o bien haga doble clic en el campo para iniciar la edici&oacute;n.</li>
   <li>Active las casillas de verificaci&oacute;n <b>Habilitar</b> para habilitar o deshabilitar cada interfaz. Puede habilitar m&aacute;s de una interfaz de red de cl&uacute;ster, pero la interfaz de red original configurada al crear el cl&uacute;ster no se puede deshabilitar.</li>
    </ol>
<h4>Para cambiar el nombre del servidor del cl&uacute;ster high-availability:</h4>
 	<ol>
    	<li>Haga clic en <b>Cambie la configuraci&oacute;n de red</b> para ver el nombre del cl&uacute;ster high-availability y cambiar la configuraci&oacute;n.</li>
   		<li>Haga clic en <b>Aplicar</b> para guardar el nombre y la configuraci&oacute;n de direcci&oacute;n IP del cl&uacute;ster high-availability actual.</li>
   		<li>Para descartar los cambios actuales, haga clic en <b>Cancelar</b>. </li>
  </ol>

<h3>Fichas del Servidor activo y pasivo (mostradas con el nombre de servidor)</h3>
<p>Estas fichas muestran el estado de las interfaces de red del servidor activo o pasivo. De estas, la conexi&oacute;n Heartbeat ocupar&aacute; una interfaz de red en cada uno de los servidores activo y pasivo. Estas fichas muestran la siguiente informaci&oacute;n:</p>
	<ul>
    	<li><b>Interfaz de red:</b> la interfaz de red f&iacute;sica del servidor.</li>
    	<li><b>Direcci&oacute;n IP:</b> la direcci&oacute;n IP asignada a la interfaz de red en cuesti&oacute;n.</li>
    	<li><b>M&aacute;scara de subred:</b> la m&aacute;scara de subred asociada a la direcci&oacute;n IP en cuesti&oacute;n.</li>
    	<li><b>Descripci&oacute;n:</b> muestra la informaci&oacute;n de la interfaz de red en cuesti&oacute;n y la accesibilidad de su direcci&oacute;n IP asignada. Este campo mostrar&aacute; las siguientes posibles condiciones:</li>
		<ol>
			<li><b>Direcci&oacute;n IP original accesible</b>: la direcci&oacute;n IP original asignada a la interfaz en el servidor activo est&aacute; accesible para datos y servicios.</li>
			<li><b>Direcci&oacute;n IP original no accesible</b>: la direcci&oacute;n IP original asignada a la interfaz en el servidor pasivo no est&aacute; accesible.</li>
			<li><b>IP de conexi&oacute;n Heartbeat, no accesible desde la intranet</b>: la direcci&oacute;n IP original asignada autom&aacute;ticamente a la conexi&oacute;n Heartbeat no est&aacute; accesible para datos y servicios.</li>
		</ol>
	</ul>
</body>
</html>