<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Control de servicios</h2>

<p>Esta p&aacute;gina le permite controlar algunos servicios. Si un servicio controlado se aver&iacute;a en el servidor activo, el sistema conmutar&aacute; al servidor pasivo en modo de espera (siempre que el servidor pasivo funcione con normalidad). En esta p&aacute;gina aparecen las siguientes secciones:</p>

<ul>
  <li><b>Servicio:</b> Muestra los servicios que se pueden controlar.</li>
  <li><b>Estado: </b> Muestra si los servicios est&aacute;n en funcionamiento o no.</li>
  <li><b>Conmutaci&oacute;n por error si el servicio falla: </b>Marque la casilla de verificaci&oacute;n junto a un servicio para comenzar a controlarlo. El servicio conmutar&aacute; si el servicio seleccionado deja de funcionar.</li>
</ul>

<h4>Para controlar un servicio:</h4>

<ol>
<li>Encuentre el servicio que desea controlar. Marque la casilla de verificaci&oacute;n junto a &eacute;l.</li>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>
</ol>

<div class="section">
<h4>Servicios compatibles</h4>
<p>Los servicios que se pueden controlar son los siguientes: Servicios de archivos Windows, iSCSI Target, FTP, Servicio de archivos Mac, Servicio NFS.</p>
</div>

<div class="section">
<h4>Conmutaci&oacute;n cuando falla la conexi&oacute;n a la red</h4>
<p>Si se habilita esta opci&oacute;n, el sistema conmutar&aacute; al servidor pasivo cuando se interrumpa o aver&iacute;e la conexi&oacute;n de un servidor activo con la red, y la conexi&oacute;n del servidor pasivo a la red todav&iacute;a funcione.</p>

<ul>
<li>La conmutaci&oacute;n se disparar&aacute; solo si el servidor pasivo tiene una mejor conexi&oacute;n. Por ejemplo, si el servidor activo tiene tres conexiones y una falla, el sistema activar&aacute; una conmutaci&oacute;n solo si el servidor pasivo tiene tres o m&aacute;s conexiones buenas.</li>
<li>Las conexiones conectadas con Link Aggregation cuentan como una conexi&oacute;n. Por ejemplo, si dos conexiones se han combinado y una de ellas falla, pero la otra todav&iacute;a funciona, la conexi&oacute;n todav&iacute;a se considera v&aacute;lida.</li>
</ul>

</div>

</body>
</html>
