<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Privilèges - Aide Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology NAS provides rich applications services which can be accessed by local or domain users. Synology DiskStation Manager (DSM) provides flexible settings for controlling users' application privileges, making it easy to manage users' access to different applications.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Privilèges</h1>
<p>Les privil&egrave;ges utilisateur et groupe pour les services et les applications individuels peuvent &ecirc;tre vus et modifi&eacute;s. DSM fournit des param&egrave;tres flexibles pour le contr&ocirc;le des privil&egrave;ges d&apos;application des utilisateurs et des groupes, ce qui facilite la gestion de l&apos;acc&egrave;s des utilisateurs et des groupes aux diff&eacute;rentes applications.</p>
<h4>Pour modifier les privil&egrave;ges d&apos;applications pour les utilisateurs et les groupes :</h4>
<ol>
<li>Allez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Privil&egrave;ges</strong>.</li>
<li>S&eacute;lectionnez l&apos;application que vous d&eacute;sirez modifier. Cliquez sur <strong>Modifier</strong>.</li>
<li>Cliquez sur <strong>Utilisateur</strong> pour voir les privil&egrave;ges individuels ou <strong>Groupe</strong> pour voir les privil&egrave;ges de groupe. </li>
<li>Pour chaque utilisateur ou groupe, cochez <strong>Autoriser</strong> pour permettre l&apos;acc&egrave;s ou <strong>Refuser</strong> pour refuser l&apos;acc&egrave;s &agrave; l&apos;application s&eacute;lectionn&eacute;e. Selon l&apos;application, vous pouvez &eacute;galement s&eacute;lectionner <strong>Par IP</strong> pour autoriser/refuser l&apos;acc&egrave;s bas&eacute;e sur l&apos;adresse IP.</li>
<li>Cliquez sur <strong>OK</strong> pour enregistrer vos modifications.</li>
</ol>

<h4>Pour voir les privil&egrave;ges d&apos;application pour les utilisateurs ayant diff&eacute;rent adresses IP r&eacute;seau :</h4>
<ol>
<li>Allez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Privil&egrave;ges</strong>.</li>
<li> Cliquez sur <strong>Visionneuse d&apos;autorisation</strong>.</li>
<li>S&eacute;lectionnez un utilisateur &agrave; partir du <strong>Nom d&rsquo;utilisateur</strong> et ensuite entrez l&apos;adresse IP que vous voulez pour voir les autorisations pour l&apos;<strong>adresse IP</strong>. </li>
</ol>

<h4>Pour configurer les privil&egrave;ges d&apos;applications par d&eacute;faut pour tous les utilisateurs :</h4>
<ol>
<li>Allez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Privil&egrave;ges</strong>.</li>
<li>S&eacute;lectionnez l&apos;application que vous d&eacute;sirez modifier. Cliquez sur <strong>Modifier</strong>.</li>
<li>Cliquez sur <strong>Privil&egrave;ges par d&eacute;faut</strong> et cochez <strong>Accorder ce privil&egrave;ge &agrave; tout le monde</strong>. </li>
<li>Cliquez sur <strong>OK</strong> pour enregistrer vos modifications.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Les privil&egrave;ges des <b>admin</b> et <b>invit&eacute;</b> ne peuvent pas &ecirc;tre modifi&eacute;s ici.</li>
<li>Lorsque vous rencontrez des conflits de privil&egrave;ges, la priorit&eacute; des privil&egrave;ges est comme suit&nbsp;: Refuser &gt; Autoriser.</li>
<li>Les paquets et les services ne sont pas tous pris en charge par les configurations de privil&egrave;ge d&apos;acc&egrave;s <strong>Par IP</strong>.</li>
</ul>
</div>
</body>
</html>