<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Base de données multimédia</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Base de donn&eacute;es du syst&egrave;me</h1>
<p> DiskStation utilise une base de donn&eacute;es syst&egrave;me pour garder des traces des donn&eacute;es de paquets et des entr&eacute;es du journaux stock&eacute;s sur vos appareils de stockage externes, tels que <b>usbshare1</b>).</p>
<p> <span class="note_head">Important : </span>Si vous d&eacute;sirez acc&eacute;der aux donn&eacute;es de paquets stock&eacute;es sur les appareils de stockage externes attach&eacute;s &agrave; votre DiskStation, ou si vous voulez voir vos enregistrements de journaux DSM dans <b>Menu principal</b> &gt; <strong>Centre des journaux</strong>, la base de donn&eacute;es syst&egrave;me doit &ecirc;tre activ&eacute;e en premier. Dans le cas contraire, tous les services correspondants seront d&eacute;sactiv&eacute;s. </p>
<h4>Pour activer la base de donn&eacute;es syst&egrave;me :</h4>
<ol>
  <li> Cochez <b>Activer la base de donn&eacute;es syst&egrave;me</b>. </li>
  <li> Proc&eacute;dez de l'une des mani&egrave;res suivantes&nbsp;:
    <ul>
      <li> S&eacute;lectionnez <b>Configuration automatique</b> si vous voulez que DSM s&eacute;lectionne automatiquement un dossier partag&eacute; pour stocker la base de donn&eacute;es syst&egrave;me. Si le p&eacute;riph&eacute;rique externe de stockage qui contient le fichier partag&eacute; est supprim&eacute;, DSM s&eacute;lectionnera automatiquement n'importe quel autre dossier partag&eacute; pour stocker la base de donn&eacute;es. </li>
      <li> Choisissez <b>Déplacer la base de données actuelle vers le dossier partagé sélectionné</b>, puis choisissez le menu d&eacute;roulant pour d&eacute;placer la base de donn&eacute;es actuelle vers un autre dossier partag&eacute; cr&eacute;&eacute; sur votre appareil externe. </li>
      <li>Choisissez <strong>Choisir l'une des bases existantes</strong>, puis s&eacute;lectionnez dans le menu d&eacute;roulant une base de donn&eacute;es existante s'il y a plus d'un appareil externe connect&eacute; sur votre DiskStation.</li>
    </ul>
  </li>
  <li> Cliquez sur <b>Appliquer</b>. </li>
</ol>
<p> <span class="note_head">Avertissement&nbsp;: </span>Pour emp&ecirc;cher la base de donn&eacute;es de se corrompre, v&eacute;rifiez que vous avez &eacute;ject&eacute; l'appareil de stockage <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <strong>Appareils externes</strong> &gt; <strong>Appareils externes</strong> ou en cliquant sur l'ic&ocirc;ne des p&eacute;riph&eacute;riques externes dans le coin sup&eacute;rieur droit avant de le retirer du DiskStation. </p>
</body>
</html>
