<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Services Web</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Applications Web</h2>

<p>Avec la caract&eacute;ristique int&eacute;gr&eacute;e Web Station et la prise en charge PHP, vous pouvez facilement abriter un site web sur votre DiskStation et cr&eacute;er des sites web dynamiques pour votre entreprise ou vos loisirs. En plus, le centre de paquet fournit une vari&eacute;t&eacute; de paquets tiers tels que la Gestion de contenu, la gestion de relation client et le syst&egrave;me e-Commerce. Un dossier partag&eacute; par d&eacute;faut appel&eacute; <b>web</b> sera cr&eacute;&eacute; pour stocker les fichiers de votre site web.</p>
<h4>Pour activer Web Station&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Services Web</strong>.</li>
<li>Cochez <b>Activer Web Station</b>.</li>
<li>Cliquez sur <b>Appliquer</b>.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Pour une meilleure flexibilit&eacute; et s&eacute;curit&eacute;, Web Station utilise le groupe utilisateur <strong>http</strong> pour ex&eacute;cuter les t&acirc;ches. Donc, pour contr&ocirc;ler les autorisations d&apos;acc&egrave;s de vos pages Web, veuillez modifier les autorisations d&apos;acc&egrave;s du groupe <strong>http</strong> pour chaque dossier et fichier correspondant. Par exemple, si vous voulez rendre un fichier <strong>sample.htm</strong> accessible dans le dossier partag&eacute; <strong>web</strong> via Web Station, vous devez vous assurer que le groupe <strong>http</strong> dispose des autorisations d&apos;&eacute;criture/lecture appropri&eacute;es pour le dossier partag&eacute; <strong>web</strong> ainsi que pour le fichier <strong>sample.htm</strong>.</li>

<li>Le fichier de la page d&apos;accueil de votre site Web doit &ecirc;tre nomm&eacute; <strong>index.htm</strong>, <strong>index.html</strong> ou <strong>index.php</strong>.</li>

<li>Lorsque vous utilisez la fonction PHP mail(), le syst&egrave;me r&eacute;cup&eacute;rera automatiquement et utilisera les informations du serveur SMTP sur la page <strong>Notification</strong>. Assurez-vous d&apos;avoir activ&eacute; les notifications par e-mail et entr&eacute; l&apos;information ad&eacute;quate pour le serveur SMTP.</li>

<li>Le vrai chemin du dossier partag&eacute;  <b>web</b> est <b>/volume1/web</b>. Certaines applications n&eacute;cessitent que l&apos;utilisateur d&eacute;finisse le chemin dans le fichier de configuration.</li>


<li>Les noms <strong>blog</strong>, <strong>photo</strong>, <strong>photosrc</strong> et <strong>webdefault</strong> sont des noms de dossiers r&eacute;serv&eacute;s. Ces noms ne peuvent pas &ecirc;tre utilis&eacute;s par Web Station. Ne cr&eacute;ez donc aucun dossier sous ces noms dans le dossier partag&eacute; <b>Web</b>.</li>

<li>Vous pouvez personnaliser la page d&apos;erreur en cr&eacute;ant un fichier <b>missing.html</b>, <b>missing.htm</b> ou <b>missing.php</b>. Activez d&apos;abord Web Station. Puis placez le fichier <b>missing.html</b>, <b>missing.htm</b> ou <b>missing.php</b> dans le dossier partag&eacute; <b>web</b> sur le serveur. Lorsque des utilisateurs font appel &agrave; une page qui n&apos;existe pas, la page d&apos;erreur personnalis&eacute;e s&apos;affiche.</li>

<li>Nombre maximum de connexions HTTP actives&nbsp;: 256</li>

<li>Nombre maximum d&apos;h&ocirc;tes virtuels&nbsp;: 30</li>
</ul>
</div>

<h3>Activation de l&rsquo;H&ocirc;te virtuel pour les sites Web</h3>
<p>Vous pouvez h&eacute;berger plusieurs sites Web sur un seul serveur avec la fonction d&rsquo;h&ocirc;te virtuel. Pour commencer, vous devez enregistrer un couple de noms de domaine et configurer un h&ocirc;te virtuel en suivant les &eacute;tapes ci-dessous.</p>
<h4>Pour activer l&apos;h&ocirc;te virtuel&nbsp;:</h4>
<ol>
<li>Cliquez sur <b>H&ocirc;te virtuel</b>.</li>
<li>Cliquez sur <b>Cr&eacute;er</b>.</li>
<li>Entrez un nom pour le sous-dossier du dossier partag&eacute; «&nbsp;<b>web</b>&nbsp;» o&ugrave; seront stock&eacute;s les fichiers du site Web.</li>
<li>Entrez un nom d&apos;h&ocirc;te pour le site Web.</li>
<li>Entrez un port pour le site Web.</li>
<li>Cliquez sur <b>OK</b>.</li>
</ol>
<h3>Activation d&apos;un site Web personnel</h3>
<P>La fonction site Web personnel est un moyen pratique de permettre &agrave; un utilisateur local, un utilisateur du domaine et un utilisateur LDAP de cr&eacute;er son propre site Web personnel.</p>
<h4>Pour les utilisateurs locaux</h4><p>Chaque utilisateur local poss&egrave;dera une adresse de site Web unique, <strong>server-IP/~nom utilisateur</strong> ou <strong>server-nom/~nom utilisateur</strong>. Par exemple&nbsp;:</p>
<ol>
<li>192.168.1.1/~ken</li>
<li>SynologyNAS/~ken</li>
</ol>
<h4 class="disable-eds14">Pour les utilisateurs du domaine</h4>
<p class="disable-eds14">Chaque utilisateur de domaine poss&egrave;dera une adresse de site Web unique, <strong>server-IP/~domainname%5cusername</strong> ou <strong>server-name/~domainname%5cusername</strong>. Par exemple&nbsp;:</p>
<ol class="disable-eds14">
<li>192.168.1.1/~testdomain<b>%5c</b>ken</li>
<li>SynologyNAS/~testdomain<b>%5c</b>ken</li>
</ol>

<h4 class="disable-eds14">Pour les utilisateurs LDAP</h4>
<p class="disable-eds14">Chaque utilisateur LDAP une adresse de site Web unique, <strong>server-IP/~username@domainname</strong> ou <strong>server-name/~username@domainname</strong>. Par exemple&nbsp;:</P>
<ol class="disable-eds14">
<li>192.168.1.1/~ken<b>@</b>testdomain</li>
<li>SynologyNAS/~ken<b>@</b>testdomain</li>
</ol>

<div class="section disable-eds14">
<h4>Remarque&nbsp;:</h4>
<p>Avant d&apos;activer cette fonction, veuillez vous assurer que les <strong>Accueils utilisateur</strong> sont activ&eacute;s. Pour les utilisateurs locaux, allez dans <b>Panneau de configuration</b> &gt; <b>Utilisateur</b> &gt; <b>Avanc&eacute;</b>; pour les utilisateurs de domaine, allez dans <b>Panneau de configuration</b> &gt; <b>Service d&apos;annuaire</b> &gt; <b>Utilisateurs de domaine</b> &gt; <b>Accueil utilisateur</b>; pour les utilisateurs LDAP, allez dans <b>Panneau de configuration</b> &gt; <b>Service d&apos;annuaire</b> &gt; <b>Utilisateurs LDAP</b> &gt; <b>Accueil utilisateur</b>.</p>
</div>

<div class="section enable-eds14">
<h4>Remarque&nbsp;:</h4>
<p>Avant d&apos;activer cette fonction, veuillez vous assurer que les <strong>Accueils utilisateur</strong> sont activ&eacute;s. Pour les utilisateurs locaux, allez dans <b>Panneau de configuration</b> &gt; <b>Utilisateur</b> &gt; <b>Avanc&eacute;</b>.</p>
</div>


<h4>Pour cr&eacute;er un site Web personnel&nbsp;:</h4>
<ol>
<li>Si vous avez coch&eacute; <strong>Activer un site Web personnel</strong>, un dossier <strong>www</strong> sera automatiquement cr&eacute;&eacute; dans l&apos;annuaire accueil de l&apos;utilisateur.</li>
<li>Maintenant l&apos;utilisateur peut charger les fichiers relatifs au site web (par ex. les pages web et fichiers sonores) dans le dossier <strong>www</strong>.</li>
<li>Assurez-vous que l&apos;utilisateur a ses propres autorisations d&apos;acc&egrave;s vers les fichiers charg&eacute;s.</li>
</ol>


<h4>Pour personnaliser la page d&apos;erreur&nbsp;:</h4>
<ol>
<li>Enregistrez la page d&apos;erreur sous le nom <b>missing.html</b>, <b>missing.htm</b> ou <b>missing.php.</b></li>
<li>Chargez le fichier dans le dossier <strong>www</strong>.</li>
</ol>
<p>Lorsque les utilisateurs font un lien vers une page inexistante sur le site Web de l&apos;utilisateur local, la page d&apos;erreur personnalis&eacute;e s&apos;affichera.<strong></strong></p>
<h4>Prises en charge et limites&nbsp;:</h4>
<p>Les utilisateurs locaux sont uniquement autoris&eacute;s &agrave; acc&eacute;der aux donn&eacute;es de&nbsp;:</p>
<ul>
<li>Leur propre accueil</li>
<li>/var/tmp</li>
<li>/tmp</li>
<li>/volumeX/@tmp</li>
</ul>

<h2>Service HTTP</h2>

<p>En plus des num&eacute;ros de port par d&eacute;faut, 80 (pour HTTP) ou 443 (pour HTTPS), des num&eacute;ros de port suppl&eacute;mentaires peuvent &ecirc;tre ajout&eacute;s pour l&apos;acc&egrave;s &agrave; Photo Station et Web Station. Vous pouvez ajouter un num&eacute;ro de port suppl&eacute;mentaire compris entre 1 et 65&nbsp;535 pour l&apos;acc&egrave;s HTTP ou HTTPS.</p>
<h4>Pour ajouter un num&eacute;ro de port suppl&eacute;mentaire pour l&apos;acc&egrave;s HTTP ou HTTPS&nbsp;:</h4>
<ol>
<li>Cochez <b>Ajouter un port HTTP suppl&eacute;mentaire</b> ou <b>Ajouter un port HTTPS suppl&eacute;mentaire</b> (l&apos;option <strong>Activer la connexion HTTPS pour les services Web</strong> doit &ecirc;tre activ&eacute;e avant d&apos;ajouter un port pour HTTPS).</li>
<li>Entrez le num&eacute;ro de port souhait&eacute; dans le champ. </li>
</ol>


<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Les ports suivants doivent &ecirc;tre exclus&nbsp;: 20, 21, 22, 23, 25, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002, les ports par d&eacute;faut eMule&nbsp;: 4662 (TCP), 4672 (UDP), et la plage de ports FTP par d&eacute;faut&nbsp;:&nbsp;la plage actuelle peut varier selon les mod&egrave;les.</li>
</ul>
</div>
</body>
</html>
