<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Blocage auto</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Blocage auto</h2>

<p>Le blocage auto vous permet d'emp&ecirc;cher une connexion non autoris&eacute;e. Apr&egrave;s avoir autoris&eacute; le service, une adresse IP sera bloqu&eacute;e si elle a trop d'&eacute;checs de tentatives de connexion. Les &eacute;checs de tentatives de connexion via SSH, Telnet, rsync, Sauvegarde r&eacute;seau, Synchro du dossier partag&eacute;, FTP, WebDAV, applis mobile de Synology, File Station ou DSM s&rsquo;ajouteront. Vous pouvez &eacute;galement avoir une Liste des permissions qui inclut les adresses IP qui ne seront jamais bloqu&eacute;es.</p>

<h4>Pour configurer le blocage auto&nbsp;:</h4>
<ol>
<li>Allez &agrave; l&rsquo;onglet <strong>G&eacute;n&eacute;ral</strong> et cochez <b>Activer le blocage auto</b>.</li>
<li>Entrez un nombre pour les <b>Tentatives de connexion</b> et <b>Sous (minutes)</b> pour bloquer une adresse IP apr&egrave;s un nombre d&eacute;fini d'&eacute;checs de tentatives de connexion sous le nombre de minutes sp&eacute;cifi&eacute;.</li>
<li>Cochez <b>Activer l&rsquo;expiration des blocages</b> et entrez un num&eacute;ro pour supprimer une adresse IP bloqu&eacute;e apr&egrave;s le nombre de jours sp&eacute;cifi&eacute;.  Les adresses IP bloqu&eacute;es resteront ind&eacute;finiment sur la liste des blocages &agrave; moins qu'elles ne soient supprim&eacute;es manuellement de la liste si cette option n&rsquo;est pas s&eacute;lectionn&eacute;e ou si <b>D&eacute;bloquer apr&egrave;s (jours)</b> est d&eacute;fini sur 0.</li>

<li>Cliquez sur <b>Appliquer</b>.</li>
</ol>

<h4>Pour ajouter des adresses IP bloqu&eacute;es&nbsp;:</h4>
<p>Cliquez sur l'onglet <strong>Liste blocages</strong> et choisissez une des options suivantes dans le menu d&eacute;roulant <strong>Cr&eacute;er</strong>&nbsp;:</p>
<ul>
<li><strong>Ajouter une adresse IP</strong></li>
<p>Entrez une adresse IP et d&eacute;finissez le d&eacute;lai d'expiration.<p/>
<li><strong>Importer une liste d'adresses IP</strong></li>
<p>Importez un fichier texte listant les adresses IP pour ajouter un certain nombre d'adresses IP et d&eacute;finir le d&eacute;lai d'expiration en m&ecirc;me. Cochez la case appropri&eacute;e si vous souhaitez &eacute;craser les adresses IP existantes. Si cette option n'est pas s&eacute;lectionn&eacute;e, les adresses IP en double seront ignor&eacute;es.</p>
<p>Pour importer un fichier, le fichier doit r&eacute;pondre aux crit&egrave;res suivants&nbsp;:</p>
<ul>
<li>Le fichier doit &ecirc;tre un fichier texte.</li>
<li>Chaque ligne du fichier ne peut contenir qu&rsquo;une seule adresse IP.</li>
<li>Les lignes de commentaires commencent par un # (di&egrave;se).</li>
<p>Si le fichier que vous avez s&eacute;lectionn&eacute; a un format correct, vous verrez toutes les adresses IP dans la zone d&rsquo;aper&ccedil;u. Cliquez sur <strong>OK</strong> pour importer.</p>
</ul>
</ul>

<h4>Pour supprimer des adresses IP bloqu&eacute;es&nbsp;:</h4>
<ol>
<li>
Cliquez sur l'onglet <b>Liste blocages</b> pour voir la liste des adresses IP bloqu&eacute;es.
</li>
<li>
S&eacute;lectionnez les adresses IP que vous souhaitez supprimer de la liste et cliquez sur <b>Supprimer</b>.
</li>
</ol>


<h4>Pour ajouter des adresses IP permises&nbsp;:</h4>
<p>Cliquez sur l'onglet <strong>Liste des permissions</strong> et choisissez une des options suivantes dans le menu d&eacute;roulant <strong>Cr&eacute;er</strong>&nbsp;:</p>
<ul>
<li><strong>Ajouter une adresse IP</strong></li>
<p>Entrez une adresse IP.<p/>
<li><strong>Importer une liste d'adresses IP</strong></li>
<p>Importez un fichier texte listant les adresses IP pour ajouter un certain nombre d'adresses IP en m&ecirc;me. Cochez la case appropri&eacute;e si vous souhaitez &eacute;craser les adresses IP existantes. Si cette option n'est pas s&eacute;lectionn&eacute;e, les adresses IP en double seront ignor&eacute;es.</p>
<p>Pour importer un fichier, le fichier doit r&eacute;pondre aux crit&egrave;res suivants&nbsp;:</p>
<ul>
<li>Le fichier doit &ecirc;tre un fichier texte.</li>
<li>Chaque ligne du fichier ne peut contenir qu&rsquo;une seule adresse IP.</li>
<li>Les lignes de commentaires commencent par un # (di&egrave;se).</li>
<p>Si le fichier que vous avez s&eacute;lectionn&eacute; a un format correct, vous verrez toutes les adresses IP dans la zone d&rsquo;aper&ccedil;u. Cliquez sur <strong>OK</strong> pour importer.</p>
</ul>
</ul>

<h4>Pour supprimer des adresses IP permises&nbsp;:</h4>
<ol>
<li>
Cliquez sur l'onglet <b>Liste des permissions</b> pour voir la liste des adresses IP permises.
</li>
<li>
S&eacute;lectionnez les adresses IP que vous souhaitez supprimer de la liste et cliquez sur <b>Supprimer</b>. </li>
</ol>


</body>
</html>
