
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>R&eacute;seau local / R&eacute;seau local sans fil</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="lan"></a>R&eacute;seau local/Internet</h2>
<p>Selon le mod&egrave;le de votre DiskStation et les param&egrave;tres r&eacute;seau, vous pouvez configurer les param&egrave;tres DHCP pour le r&eacute;seau local ou Internet dans <strong>Panneau de configuration</strong> &gt; <strong>R&eacute;seau</strong> &gt; <strong>Interface r&eacute;seau</strong>. DHCP est un protocole r&eacute;seau pour la configuration automatique des adresses IP. Pour laisser le DHCP attribuer une adresse IP pour le syst&egrave;me, cliquez sur <strong>Modifier</strong>, puis choisissez <b>D&eacute;finir la configuration r&eacute;seau automatiquement (DHCP)</b> dans l&apos;onglet <strong>IPv4</strong>.</p>
<p>Si vous utilisez une adresse IP sp&eacute;cifique de votre fournisseur de services r&eacute;seau, choisissez <b>Utiliser la configuration manuelle</b> et saisissez manuellement l&apos;adresse IP et le masque de sous-r&eacute;seau. Si aucun serveur DNS ou passerelle par d&eacute;faut n&apos;est disponible, laissez le champ vide.</p>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ol>
<li>Pour &ecirc;tre s&ucirc;r que les courriers &eacute;lectroniques de notification sont correctement envoy&eacute;s par le serveur SMTP, vous devez entrer une IP valide pour le serveur DNS.</li>
<li>Les Jumbo Frames sont des trames Ethernet dont l&apos;unit&eacute; de transmission maximale (MTU, Maximum Transmission Unit) exc&egrave;de 1500 octets. Ainsi la transmission de fichiers de grande taille via Ethernet en est am&eacute;lior&eacute;e. Elles ne peuvent &ecirc;tre activ&eacute;es que dans un environnement r&eacute;seau Gigabit.  Pour vous assurer que Jumbo Frame fonctionne correctement, tous les ordinateurs et p&eacute;riph&eacute;riques sur le r&eacute;seau acc&eacute;dant &agrave; votre DiskStation doivent le prendre en charge et utiliser la m&ecirc;me valeur de MTU.</li>
</ol>
</div>

<h3><a name="vlan"></a>VLAN</h3>
<p>Lorsque l&apos;environnement r&eacute;seau n&eacute;cessite des param&egrave;tres VLAN, vous pouvez activer l&apos;option VLAN et saisir un ID VLAN pour l&apos;environnement r&eacute;seau dans l&apos;onglet <strong>IPv4</strong> de la fen&ecirc;tre Modifier.</p>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Assurez-vous que votre commutateur r&eacute;seau est correctement configur&eacute;, sinon le service du DiskStation pourrait devenir inaccessible.</li>
<li>Si vous ne pouvez pas vous connecter au DiskStation apr&egrave;s avoir modifi&eacute; les param&egrave;tres ci-dessus, veuillez appuyer sur le bouton RESET situ&eacute; sur votre DiskStation pour pouvoir restaurer les param&egrave;tres par d&eacute;faut.</li>
</ul>
</div>


<h3><a name="ipv6"></a>Configuration d&rsquo;IPv6</h3>
<p>DiskStation prend en charge le sch&eacute;ma de fonctionnement IPv4/IPv6 dual stack. Cela signifie que l&rsquo;IPv4 et l&rsquo;IPv6 peuvent fonctionner simultan&eacute;ment sur votre DiskStation. Le param&egrave;tre par d&eacute;faut de l&apos;IPv6 est <b>Auto</b>. S&eacute;lectionnez une interface r&eacute;seau existante, cliquez sur le bouton <b>Modifier</b> et aller dans l&apos;onglet <b>IPv6</b> pour modifier les param&egrave;tres.</p>

<h4>Pour configurer les param&egrave;tres IPv6&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez dans <strong>Panneau de configuration</strong> &gt; <strong>R&eacute;seau</strong> &gt; <strong>Interface r&eacute;seau</strong>.</li>
<li>S&eacute;lectionnez une interface r&eacute;seau existante et cliquez sur <strong>Modifier</strong>.</li>
<li>Sous l&apos;onglet <strong>IPv6</strong>, s&eacute;lectionnez un type de configuration depuis <strong>configuration IPv6</strong> :<ul>
    <li><b>Auto</b>&nbsp;: Votre DiskStation cr&eacute;era automatiquement une adresse IPv6 selon le LAN Router Advertisement (RA).</li>
	<ul>
	  <li><strong>Mode sans &eacute;tat</strong> : Permettre aux appareils connect&eacute;s au routeur de configurer automatiquement une adresse IPv6 sans configurer de serveur IPv6 DNS.</li>
      <li><strong>Mode DHCPv6 sans &eacute;tat</strong> : Permettre aux appareils connect&eacute;s au routeur de configurer automatiquement une adresse IPv6 et d&apos;obtenir des informations DNS via DHCPv6.</li>
      <li><strong>Mode d&apos;&eacute;tat</strong> : Permettre aux appareils connect&eacute;s au routeur d&apos;obtenir une adresse IPv6 et des informations DNS via DHCPv6. Dans ce mode, vous devez activer le serveur DHCPv6 et d&eacute;finissez l&apos;<strong>Adresse IP de début</strong> et l&apos;<strong>Adresse IP</strong> de fin du serveur DHCPv6.</li>
	</ul>
<li><b>Manuel</b>&nbsp;: Configurez manuellement l&apos;IPv6 en entrant des informations dans <b>Adresse IPv6</b>, <b>Longueur du pr&eacute;fixe</b>, et <b>Passerelle par d&eacute;faut</b>.</li>
<li><b>D&eacute;sactiv&eacute;</b> : D&eacute;sactiver la prise en charge d&rsquo;IPv6.</li>
  </ul>
</ol>
<p>Jusqu&apos;&agrave; ce que IPv6 supplante compl&egrave;tement IPv4, les m&eacute;canismes de transition IPv6 sont n&eacute;cessaires pour permettre aux h&ocirc;tes avec des adresse IPv6 d&apos;atteindre des services IPv6. Choisissez entre les diff&eacute;rents types de m&eacute;canismes de transition IPv6 :</p>
<ul>
  <li><b>6in4</b> : Connectez vous au r&eacute;seau IPv6 &agrave; travers un agent de tunnel. Vous devrez remplir l&apos;<b>Adresse IPv6</b>, la <b>Longueur de pr&eacute;fixe</b>, le <b>Pr&eacute;fixe</b> et l&apos;<b>Adresse IPv4 de l&apos;agent de tunnel</b>. Ceci n&eacute;cessite une adresse IPv4 publique.</li>
<li><b>6to4</b> : Connectez vous au r&eacute;seau IPv6 &agrave; travers un agent de tunnel utilisant anycast. Ceci n&eacute;cessite une adresse IPv4 publique.</li>
<li><b>DHCP-PD</b> : Obtenez un pr&eacute;fixe IPv6 depuis le serveur DHCP par d&eacute;l&eacute;gation de pr&eacute;fixe dans le LAN. Ceci requiert une prise en charge ISP et fonctionne uniquement en mode routeur.</li>
<li><strong>Tunnellisation IPv6 (TSP)</strong> : Allez dans <strong>Panneau de configuration</strong> &gt; <strong>R&eacute;seau</strong> &gt; <strong>G&eacute;n&eacute;ral</strong> pour configurer cette option.</li>
</ul>

<h3>802.1X</h3>
<p>802.1X est une norme d'authentification développée par l'IEEE pour les réseaux de connexions utilisateur. 802.1X peut être utilisé sur des réseaux pour authentifier le client, en n'autorisant pas les clients ne répondant avec succès aux critères d'authentification à accéder au réseau protégé. </p>
<p>Vous pouvez autoriser votre Synology NAS à se connecter au réseau protégé par authentification 802.1X.</p>
<h4>Pour activer l'authentification 802.1X :</h4>
<ol>
<li>Accédez dans <strong>Panneau de configuration</strong> > <strong>Réseau</strong> > <strong>Interface réseau</strong>. </li>
<li>Sélectionnez une interface de réseau câblé (par ex. LAN) et cliquez sur <strong>Modifier</strong>. </li>
<li>Accédez à l'onglet <strong>802.1X</strong> et cochez <strong>Activer l'authentification 802.1X</strong>. </li>
<li>Choisissez l'un des protocoles suivants dans le menu déroulant <strong>Authentification</strong> : Si vous n'êtes pas certain du protocole le plus adapté, sélectionnez <strong>Auto</strong>. <ul>
<li><strong>Protected EAP (PEAP)</strong> : Utiliser un certificat CA (facultatif) pour établir une connexion sécurisée. Cette connexion sécurisée est utilisée par l'authentification interne.</li>
<li><strong>Tunneled TLS (TTLS)</strong> : Utiliser un certificat CA (facultatif) pour établir une connexion sécurisée. Cette connexion sécurisée est utilisée par l'authentification interne.</li>
<li><strong>TLS</strong> : Utiliser TLS (Transport Layer Security) pour l'authentification.</li> </ul> </li>
<li>Si vous choisissez <strong>TTLS</strong> ou <strong>PEAP</strong>, vous devez choisir l'un des protocoles d'authentification interne dans le menu déroulant.
<ul>
<li><strong>MS CHAP v2</strong> : Les informations d'authentification sont chiffrées avec Microsoft CHAP v2.</li>
<li><strong>GTC</strong> : Les informations d'authentification utilisent GTC (Generic Token Card) pour le chiffrement.</li>
</ul></li>
<li>Saisissez votre nom d'utilisateur et votre mot de passe.</li>
<li>Si nécessaire, cliquez sur <strong>Importer</strong>, puis <strong>Parcourir</strong> pour rechercher et importer un certificat exporté depuis un serveur Radius (par exemple ca.crt).</li>
<li>Cliquez sur <strong>OK</strong> pour enregistrer vos paramètres.</li>
</ol>
<div class="section">
<h4>Remarque :</h4>
<ul>
<li>Pour configurer l'authentification 802.1X pour des réseaux sans fil, accédez à <strong>Panneau de configuration</strong> > <strong>Sans fil</strong> > <strong>Wi-Fi</strong>.</li>
<li>Les paramètres d'authentification doivent être identiques à ceux de Radius Server. Pour plus d'informations, veuillez contacter l'administrateur de Radius Server.</li>
</ul>
</div>

<h2>R&eacute;seau local sans fil*</h2>
<p>Lorsque votre DiskStation fait office de routeur sans fil, vous pouvez configurer les param&egrave;tres suivants pour le r&eacute;seau local sans fil dans <strong>Panneau de configuration</strong> &gt; <strong>R&eacute;seau</strong> &gt; <strong>Interface r&eacute;seau</strong>.</p>
<h3>Param&egrave;tres IPv4</h3>

<h4>Adresse IP et masque de sous-r&eacute;seau</h4> 
<p>Vous pouvez d&eacute;finir l&apos;adresse IP et le masque de sous-r&eacute;seau pour le DiskStation ici.</p>
<h4>DHCP Server</h4>
<p>Cochez l&apos;option <strong>Activer le serveur DHCP</strong> pour permettre &agrave; votre DiskStation d&apos;attribuer des adresses IP aux appareils client qui se connectent au r&eacute;seau local fourni par votre DiskStation.</p>
<h4>Relais PPPoE</h4>
<p>Activer <strong>Relais PPPoE</strong> pour permettre aux appareils qui sont connect&eacute;s &agrave; votre DiskStation de se connecter &agrave; Internet via la connexion PPPoE.</p>

<h4>Configurer un port Internet UPnP</h4>
<p>Activez <strong>UPnP</strong> pour permettre &agrave; votre DiskStation de devenir un p&eacute;riph&eacute;rique UPnP Internet Gateway, de sorte que les appareils connect&eacute;s au r&eacute;seau local du DiskStation puissent configurer les param&egrave;tres de transmission de port avec UPnP.</p>

<h3>Param&egrave;tres IPv6</h3>
<p>Vous pouvez obtenir une adresse et un pr&eacute;fixe IPv6 depuis <strong>LAN/Internet</strong> avec 6in4, 6to4, ou DHCP-PD. Avec ces informations, vous pouvez configurer les options de routage IPv6 pour votre DiskStation ici.</p>
<ul>
<li><strong>Adresse IPv6</strong> : Entrez l&apos;adresse IPv6 obtenue depuis <strong>LAN/Internet</strong>.</li>
<li><strong>Longueur du pr&eacute;fixe</strong> : Entrez la longueur du pr&eacute;fixe de l&apos;adresse IPv6 obtenue depuis <strong>LAN/Internet</strong>, g&eacute;n&eacute;ralement 64.</li>
<li><strong>DNS principal</strong> : Le serveur DNS principal pour les appareils connect&eacute;s au routeur. Ceci ne doit pas n&eacute;cessairement &ecirc;tre d&eacute;fini dans <strong>Mode sans &eacute;tat</strong>.</li>
<li><strong>DNS secondaire</strong> : Le serveur DNS secondaire pour les appareils connect&eacute;s au routeur. Ceci ne doit pas n&eacute;cessairement &ecirc;tre d&eacute;fini dans <strong>Mode sans &eacute;tat</strong>.</li>
</ul>
<p>Vous pouvez choisir entre trois Router Advertisement (RA) :</p>
<ul>
<li><strong>Mode sans &eacute;tat</strong> : Permettre aux appareils connect&eacute;s au routeur de configurer automatiquement une adresse IPv6 sans configurer de serveur IPv6 DNS.</li>
<li><strong>Mode DHCPv6 sans &eacute;tat</strong> : Permettre aux appareils connect&eacute;s au routeur de configurer automatiquement une adresse IPv6 et d&apos;obtenir des informations DNS via DHCPv6.</li>
<li><strong>Mode d&apos;&eacute;tat</strong> : Permettre aux appareils connect&eacute;s au routeur d&apos;obtenir une adresse IPv6 et des informations DNS via DHCPv6. Dans ce mode, vous devez activer le serveur DHCPv6 et d&eacute;finissez l&apos;<strong>Adresse IP de début </strong> et l&apos;<strong>Adresse IP de fin</strong> du serveur DHCPv6.</li>
</ul>

<h3>Clients DHCP</h3>
<p>Ici, vous pouvez voir une liste des clients DHCP et leur configuration r&eacute;seau (comme adresse MAC, adresse IP, nom d&apos;h&ocirc;te, et temps restant avant l&apos;expiration du bail DHCP).</p>
<p>Vous pouvez filtrer la liste d&eacute;roulante des clients IPv4/IPv6 &agrave; afficher aux clients qui utilisent respectivement IPv4 et IPv6. Choisissez un client et cliquez sur <strong>Ajouter &agrave; la r&eacute;servation d&apos;adresse</strong> pour ajouter le client &agrave; la liste de r&eacute;servation d&apos;adresse.</p>

<h3>R&eacute;servation DHCP</h3>
<p>Si vous voulez qu&apos;un client re&ccedil;oive toujours la m&ecirc;me adresse IP lors du renouvellement du bail DHCP, vous pouvez ajouter le client &agrave; la liste de r&eacute;servation d&apos;adresse.</p>
<p>Vous pouvez filtrer la liste d&eacute;roulante de r&eacute;servation d&apos;adresse IPv4/IPv6. Les adresses IPv4 sont identifi&eacute;es par l&apos;adresse MAC, tandis que les adresses IPv6 sont identifi&eacute;es par DUID.</p>
<h4>Pour ajouter un client &agrave; la liste de r&eacute;servation d&apos;adresses&nbsp;:</h4>
<ul>
<li>S&eacute;lectionnez un client et cliquez sur <b>Ajouter</b>.</li>
<li>Sp&eacute;cifiez l&apos;adresse MAC du client ou DUID, l&apos;adresse IPv4/IPv6 que vous d&eacute;sirez attribuer au client et le nom d&apos;h&ocirc;te du client. </li>
<li>Cliquez sur <b>OK</b> pour sauvegarder les param&egrave;tres.</li>
</ul>
<p><b>_____</b> <br> * Uniquement disponible sur des mod&egrave;les sp&eacute;cifiques ou selon votre environnement.</p>
</body>
</html>
