
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Mobile</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2><a name="usbmodem"></a>Mobile*</h2>

<p>Lorsque l'appareil est &eacute;quip&eacute; d'un dongle mobile &agrave; large bande, le DiskStation peut se connecter &agrave; Internet via un r&eacute;seau sans fil 3G/LTE. Les param&egrave;tres figurant dans <strong>Panneau de configuration</strong> &gt; <strong>R&eacute;seau</strong> &gt; <strong>Interface r&eacute;seau</strong> &gt; <strong>Mobile</strong> vous aident &agrave; &eacute;tablir et &agrave; modifier une connexion Internet sans fil via votre dongle &agrave; large bande mobile.</p>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Pour conna&icirc;tre la liste compl&egrave;te des dongles mobiles large bande pris en charge par les produits Synology, veuillez visiter <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</p>
</div>

<h4>Pour configurer un r&eacute;seau mobile&nbsp;:</h4>
<p>Lorsqu'un dongle mobile &agrave; large bande est connect&eacute; &agrave; l'un des ports USB sur votre DiskStation, le DiskStation essaie de se connecter automatiquement. S'il est impossible d'&eacute;tablir automatiquement une connexion ou si vous d&eacute;sirez modifier les param&egrave;tres de connexion, veuillez consulter ce qui suit&nbsp;: </p>

<ul>
<li><b>D&eacute;verrouillage/param&eacute;trages SIM&nbsp;:</b> Si la carte SIM est prot&eacute;g&eacute;e par un code PIN, elle doit &ecirc;tre d&eacute;bloqu&eacute;e pour permettre au DiskStation de se connecter au r&eacute;seau. Une fois d&eacute;bloqu&eacute;e, cette section vous fournit des options pour modifier les param&eacute;trages PIN.</li>

<li><b>Modifier :</b> Vous pouvez configurer manuellement la connexion ou la d&eacute;finir en fonction de l'emplacement ou de l'op&eacute;rateur. La configuration manuelle de la connexion requiert la saisie de vos APN, num&eacute;ro de t&eacute;l&eacute;phone, nom d'utilisateur et mot de passe. Si vous ne connaissez pas ces informations, veuillez contacter votre op&eacute;rateur mobile pour un support.</li>

<li><b>Connexion/d&eacute;connexion :</b> Ces boutons vous permettent de vous connecter ou de vous d&eacute;connecter du DiskStation depuis le r&eacute;seau 3G/LTE.</li>
<li><b>Options&nbsp;:</b> Cette section inclut une option pour d&eacute;finir l'interface du dongle mobile &agrave; large bande comme la passerelle par d&eacute;faut pour votre DiskStation. Lorsque vous configurez le r&eacute;seau mobile comme passerelle par d&eacute;faut, le trafic Internet depuis votre DiskStation passe via le r&eacute;seau mobile au lieu du r&eacute;seau c&acirc;bl&eacute;. </li>
</ul>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<ol>
<li>Lors d'une connexion &agrave; Internet, certains dongles mobiles &agrave; large bande n'affichent pas la force du signal s'ils ne prennent pas en charge cette fonction.</li>
<li>Pour certains dongles mobiles &agrave; large bande, vous ne pouvez pas changer les param&egrave;tres SIM lorsqu'ils sont connect&eacute;s &agrave; Internet.</li>
</ol>
</div>
<p>____<br> <strong>*</strong>Uniquement disponible sur certains mod&egrave;les. </p>


</body>
</html>
