<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Protection</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Protection</h2>
<p>L&apos;option <strong>Panneau de configuration</strong> &gt; <strong>S&eacute;curit&eacute;</strong> &gt; <strong>Protection</strong> fournit des options pour am&eacute;liorer la s&eacute;curit&eacute; du r&eacute;seau pour chaque interface r&eacute;seau.</p>

<h3>Protection DoS</h3>
<p>La protection DoS (d&eacute;ni de service) permet d&apos;&eacute;viter les attaques malveillantes sur Internet.</p>
<h4>Pour activer la protection DoS&nbsp;:</h4>
<ol>
<li>Cochez la case <strong>Activer la protection DoS</strong>.</li>
<li>Cliquez sur <strong>Appliquer</strong>.</li>
</ol>
<h3>Pass-through VPN*</h3>

<p>Lorsque le DiskStation agit comme routeur, le pass-through VPN permet aux clients de passer par le NAT du DiskStation et d&apos;&eacute;tablir des connexions VPN sortantes ou entrantes. Si votre configuration interne comprend un serveur VPN, veuillez aller &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Acc&egrave;s externe</strong> &gt; <strong>Configuration du routeur</strong> pour configurer des r&egrave;gles de transmission de port et permettre au serveur VPN d&apos;&eacute;tablir des connexions VPN.</p>

<h4>Pour modifier les param&egrave;tres de pass-through VPN&nbsp;:</h4>
<ol>
<li>Les param&egrave;tres suivants peuvent &ecirc;tre activ&eacute;s ou d&eacute;sactiv&eacute;s ici&nbsp;:</li>
<ul>
<li><strong>Pass-through PPTP&nbsp;:</strong> Permet au trafic PPTP (Point-to-Point Tunneling Protocol) d&apos;&ecirc;tre relay&eacute; et d&apos;&eacute;tablir des connexions.</li>
<li><strong>Pass-through IPSec&nbsp;:</strong> Permet au trafic IPSec (IP Security Protocol) d&apos;&ecirc;tre relay&eacute; et d&apos;&eacute;tablir des connexions.</li>
<li><strong>Pass-through L2TP&nbsp;:</strong> Permet au trafic L2TP (Layer 2 Tunneling Protocol) d&apos;&ecirc;tre relay&eacute; et d&apos;&eacute;tablir des connexions.</li>
</ul>
<li>Apr&egrave;s avoir modifi&eacute; les param&egrave;tres, cliquez sur <strong>Appliquer</strong>.</li>
</ol>


<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Si votre DiskStation se connecte &agrave; Internet via PPPoE, les r&egrave;gles de protection DoS ou de pass-through VPN li&eacute;es doivent &ecirc;tre configur&eacute;es sur l&apos;interface PPPoE correspondante.</p>
</div>


<p>____<br> * Uniquement pris en charge sur certains mod&egrave;les.</p>
</body>
</html>
