
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>R&eacute;seau</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="pppoe"></a>PPPoE</h2>
<p>Si vous utilisez un modem c&acirc;ble ou DSL pour vous connecter &agrave; Internet et que votre fournisseur de services Internet (ISP) utilise le PPPoE (Point to Point Protocol over Ethernet), vous pouvez activer le PPPoE dans <strong>Panneau de configuration</strong> &gt; <strong>R&eacute;seau</strong> &gt; <strong>Interface r&eacute;seau</strong> et entrez les informations du compte afin de vous connecter directement &agrave; Internet sans passer par le routeur.</p>
<p>Pour plus d&apos;informations concernant le PPPoE, contactez votre ISP ou votre administrateur r&eacute;seau.</p>

<h3><a name="ipv6"></a>Configuration d&rsquo;IPv6</h3>
<p>DiskStation prend en charge le sch&eacute;ma de fonctionnement IPv4/IPv6 dual stack. Cela signifie que l&rsquo;IPv4 et l&rsquo;IPv6 peuvent fonctionner simultan&eacute;ment sur votre DiskStation. Le param&egrave;tre par d&eacute;faut de l&apos;IPv6 est <b>Auto</b>. S&eacute;lectionnez une interface r&eacute;seau existante, cliquez sur le bouton <b>Modifier</b> et aller dans l&apos;onglet <b>IPv6</b> pour modifier les param&egrave;tres.</p>
<p>Jusqu&apos;&agrave; ce que IPv6 supplante compl&egrave;tement IPv4, les m&eacute;canismes de transition IPv6 sont n&eacute;cessaires pour permettre aux h&ocirc;tes avec des adresse IPv6 d&apos;atteindre des services IPv6. Choisissez entre les diff&eacute;rents types de m&eacute;canismes de transition IPv6 :</p>
<ul>
  <li><b>6in4</b> : Connectez vous au r&eacute;seau IPv6 &agrave; travers un agent de tunnel. Vous devrez remplir l&apos;<b>Adresse IPv6</b>, la <b>Longueur de pr&eacute;fixe</b>, le <b>Pr&eacute;fixe</b> et l&apos;<b>Adresse IPv4 de l&apos;agent de tunnel</b>. Ceci n&eacute;cessite une adresse IPv4 publique.</li><li><b>6to4</b> : Connectez vous au r&eacute;seau IPv6 &agrave; travers un agent de tunnel utilisant anycast. Ceci n&eacute;cessite une adresse IPv4 publique.</li>
  <li><b>DHCP-PD</b> : Obtenez un pr&eacute;fixe IPv6 depuis le serveur DHCP par d&eacute;l&eacute;gation de pr&eacute;fixe dans le LAN. Ceci requiert une prise en charge ISP et fonctionne uniquement en mode routeur.</li>
</ul>
</body>
</html>
