
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>R&eacute;seau</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless"></a>Rejoindre le r&eacute;seau sans fil*</h2>

<p>Vous pouvez connecter un appareil DiskStation &agrave; un r&eacute;seau sans fil en branchant un dongle sans fil dans son port USB. Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Sans fil</strong> &gt; <strong>Configuration de la carte du r&eacute;seau</strong> et choisissez <strong>Joindre le r&eacute;seau sans fil</strong>.</p>


<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Pour une liste compl&egrave;te des dongles sans fil pris en charge, visitez <a href="https://www.synology.com/compatibility?search_by=category&category=usb_wifi_dongles&p=1&not_recommend_mode=false" target=_blank>www.synology.com</a>.</p>
</div>

<h4>Pour configurer un r&eacute;seau sans fil&nbsp;:</h4>
<p>Allez dans l&apos;onglet <strong>Wifi</strong>. Cliquez sur <b>Configurer un r&eacute;seau sans fil</b> et choisissez parmi les options suivantes (si vous &ecirc;tes connect&eacute; &agrave; un r&eacute;seau sans fil, cliquez d&rsquo;abord sur <b>D&eacute;connecter</b>).</p>
<ul>
<li><b>Rejoindre un r&eacute;seau sans fil </b>: L&rsquo;assistant analysera les points d&rsquo;acc&egrave;s sans fil disponibles ou les r&eacute;seaux Ad-Hoc ainsi que la force de leur signal et le type de s&eacute;curit&eacute;. Si le point d&rsquo;acc&egrave;s auquel vous voulez acc&eacute;der est verrouill&eacute; par un mot de passe, l&rsquo;assistant vous demandera de saisir ce mot de passe.</li>
<li><b>Se connecter &agrave; un r&eacute;seau sans fil cach&eacute;</b>: Si un point d&apos;acc&egrave;s ne diffuse pas son SSID (nom du r&eacute;seau) pour des raisons de confidentialit&eacute;, il ne sera pas d&eacute;couvert lors de l&apos;analyse. Vous pouvez vous connecter &agrave; ces points d&rsquo;acc&egrave;s cach&eacute;s en saisissant les informations requises manuellement.</li>
<li><b>Cr&eacute;er un r&eacute;seau Ad-Hoc</b>&nbsp;: En plus de l&apos;infrastructure r&eacute;seau, dans laquelle le point d&apos;acc&egrave;s central (AP) est une passerelle entre le r&eacute;seau sans fil et le r&eacute;seau c&acirc;bl&eacute; par Ethernet, un r&eacute;seau Ad-Hoc est &eacute;galement couramment utilis&eacute;. Dans un r&eacute;seau Ad-Hoc, tous les appareils sans fil &agrave; port&eacute;e les uns des autres peuvent communiquer en mode pair &agrave; pair sans point d&apos;acc&egrave;s central. Pour configurer un r&eacute;seau Ad-Hoc, tous les appareils sans fil doivent &ecirc;tre configur&eacute;s en mode Ad-Hoc et non en mode infrastructure.</li>
</ul>
<p>____<br> * Uniquement disponible sur certains mod&egrave;les. <br></body>
</html>
