<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Cette page fournit des options pour g&eacute;rer les adaptateurs Bluetooth et connecter les appareils Bluetooth &agrave; votre DiskStation. Une fois connect&eacute;s, certains appareils Bluetooth, tels que les haut-parleurs ou un casque, peuvent &ecirc;tre s&eacute;lectionn&eacute;s comme sortie audio pour Audio Station, vous permettant de facilement &eacute;couter la musique stock&eacute;e sur votre DiskStation.</p>
<h2>D&eacute;marrage</h2>
<p>Connectez un adaptateur Bluetooth USB &agrave; un port USB de votre DiskStation. Une liste des adaptateurs Bluetooth est affich&eacute;e sur le c&ocirc;t&eacute; gauche de la page principale Bluetooth. Des informations et les options li&eacute;s aux appareils Bluetooth sont affich&eacute;es sur la droite.</p>
<h4>Pour activer ou d&eacute;sactiver les adaptateurs Bluetooth&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez un adaptateur Bluetooth.</li>
<li>Cliquez sur <strong>Param&egrave;tres avanc&eacute;s</strong>.</li>
<li>Cochez la case <strong>Activer Bluetooth</strong>.</li>
<li>Cliquez sur <strong>OK</strong> pour enregistrer les param&egrave;tres.</li>
</ol>
<h2>G&eacute;rer les appareils Bluetooth</h2>
<p>Lors de la connexion &agrave; un nouvel appareil Bluetooth, assurez-vous qu'il est d&eacute;tectable, situ&eacute;s dans les 10 m&egrave;tres du DiskStation, et utilise A2DP (Advanced Audio Distribution Profile). Consultez le manuel de l'utilisateur de l'appareil Bluetooth pour plus de d&eacute;tails concernant la configuration.</p>
<h4>Pour se connecter &agrave; un appareil Bluetooth&nbsp;:</h4>
<ol>
<li>Sur la page principale <strong>Bluetooth</strong>, s&eacute;lectionnez l'appareil Bluetooth que vous voulez connecter au DiskStation. Si l'appareil n'appara&icirc;t pas, essayez de cliquer sur <strong>Actualiser</strong> pour rechercher des appareils &agrave; proximit&eacute;.</li>
<li>S&eacute;lectionnez l'appareil quand il appara&icirc;t.</li>
<li>Cliquez sur <strong>Connecter</strong>.</li>
<li>Entrez le PIN de votre appareil si n&eacute;cessaire.</li>
</ol>
<h4>Pour afficher les informations de l'appareil Bluetooth&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez un appareil Bluetooth connect&eacute;.</li>
<li>Cliquez sur <strong>Infos</strong>.</li>
<li>Une fen&ecirc;tre appara&icirc;t pour afficher les informations, telles que l'adresse Bluetooth, le nom, le type et l'&eacute;tat.</li>
</ol>
<h4>Pour supprimer un appareil Bluetooth&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez un appareil Bluetooth que vous ne voulez plus utiliser avec votre DiskStation.</li>
<li>Cliquez sur <strong>Supprimer</strong>.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Lors de la lecture de musique via des haut-parleurs ou un casque Bluetooth, vous risquez de rencontrer des probl&egrave;mes de lecture si les param&egrave;tres de votre adaptateur Bluetooth sont modifi&eacute;s ou lorsque vous connectez &agrave; de trop nombreux appareils Bluetooth en m&ecirc;me temps.</li>
<li>Selon l'appareil, si des haut-parleurs Bluetooth qui ont &eacute;t&eacute; connect&eacute;s &agrave; votre DiskStation sont ensuite connect&eacute;s &agrave; un autre DiskStation (ou lecteur de musique Bluetooth), les haut-parleurs pourraient oublier votre DiskStation. Dans ce cas, une erreur se produira lorsque vous essayez de lire de la musique avec les haut-parleurs. Pour r&eacute;soudre ce probl&egrave;me, veuillez supprimer les haut-parleurs et essayez de vous connecter &agrave; nouveau.</li>
</ul>

</div>
</body>
</html>
