<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="router"></a>Port du routeur</h2>

<p>Si vous d&eacute;sirez que des services Internet (tels que Google Docs ou Pixlr) acc&egrave;dent &agrave; votre DiskStation, vous pouvez sp&eacute;cifier le nom d'h&ocirc;te public, externe et le num&eacute;ro de port au <strong>Panneau de configuration</strong> &gt; <strong>Acc&egrave;s externe</strong> &gt; <strong>Avanc&eacute;</strong>.</p>

<p> Par d&eacute;faut, le nom d'h&ocirc;te est votre adresse IP (&agrave; savoir le nom d'h&ocirc;te d&eacute;fini dans <strong>Panneau de configuration</strong> &gt; <strong>Acc&egrave;s externe</strong> &gt; <strong>DDNS</strong>), et le num&eacute;ro de port est 5000 (ou 5001 pour les connexions HTTPS). Cependant, si vous avez un autre nom d'h&ocirc;te qui n'est pas configur&eacute; sur la page <strong>DDNS</strong>, ou que vous avez sp&eacute;cifi&eacute; des num&eacute;ros de port diff&eacute;rents sur votre routeur lorsque vous avez d&eacute;fini les r&egrave;gles de transmission de port, vous devez saisir le nom d'h&ocirc;te ou les num&eacute;ros de port pour vous assurer que l'on peut acc&eacute;der sans probl&egrave;me aux fichiers que vous avez partag&eacute;s via des services Internet.</p>


<h4>Pour activer la configuration des ports du routeur&nbsp;:</h4>
<ol>
<li>Saisissez le nom d'h&ocirc;te DNS ou l'adresse IP publique de votre DiskStation dans le champ <b>Nom d'h&ocirc;te ou IP statique</b>.</li>
<li>Saisissez le num&eacute;ro de port du routeur que vous avez d&eacute;fini en configurant la r&egrave;gle de transmission de port de DSM sur votre routeur dans le champ <b>DSM (HTTP)</b> ou <b>DSM (HTTPS)</b>.</li>
<li>Cliquez sur <b>Appliquer</b>.</li>
</ol>

</body>
</html>

