
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>R&eacute;seau</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless_ap"></a>Point d&apos;acc&egrave;s*</h2>
<p>Votre appareil DiskStation prend en charge la cr&eacute;ation d&apos;un point d&apos;acc&egrave;s pour partager sa connexion Internet avec les autres appareils sans fil si vous avez install&eacute; un adaptateur USB Wi-Fi ou si votre DiskStation a un Wi-Fi int&eacute;gr&eacute;. Vous pouvez configurer votre DiskStation pour &ecirc;tre un point d&apos;acc&egrave;s sans fil (AP) ou un routeur sans fil, selon la fa&ccedil;on dont vous souhaitez utiliser Internet.</p>

<table>
<tr>
<th width="23%">Mode de point d&apos;acc&egrave;s</th>
<th width="77%">Description</th>
</tr>
<tr>
<th>AP sans fil</th>
<td>
<ul>
<li>Faites un pont avec votre LAN et votre r&eacute;seau Wi-Fi.</li>
<li>Votre LAN et les clients sans fil seront sur le m&ecirc;me r&eacute;seau local.</li>
<li>Applicable lorsque vous avez d&eacute;j&agrave; un routeur et que vous voulez utiliser votre DiskStation en tant que point d&apos;acc&egrave;s suppl&eacute;mentaire vers un r&eacute;seau existant.</li> 
<li>Permet le partage des ressources r&eacute;seau telles que les appareils DLNA, les imprimantes, Synology Web Assistant ou les autres services reposant sur les diffusions r&eacute;seau.</li>
<li>DHCP Server sera d&eacute;sactiv&eacute; sur les appareils DiskStation qui agissent comme des points d&apos;acc&egrave;s sans fil. Pour r&eacute;activer DHCP Server pour votre DiskStation, retirez les dongles Wi-Fi et red&eacute;marrez DiskStation.</li>
<li>Pour les mod&egrave;les avec plusieurs ports LAN, seul le LAN 1 sera utilis&eacute; pour servir de pont au AP sans fil.</li>
</ul>
</td>
</tr>
<tr>
<th>Routeur sans fil</th>
<td>
<ul>
<li>Configurez un r&eacute;seau sans fil o&ugrave; les appareils sont sur un sous-r&eacute;seau priv&eacute;.</li>
</ul>
</td>
</tr>
</table>


<div class="section">
<h4>Remarque&nbsp;:</h4>

<ol>
<li>Certains mod&egrave;les requi&egrave;rent la connexion de dongles sans fil pour cr&eacute;er des points d&apos;acc&egrave;s. Pour une liste compl&egrave;te des dongles sans fil pris en charge, visitez <a href="http://www.synology.com/support/faq/444" target=_blank>www.synology.com</a>.</li>
<li>Pour les mod&egrave;les qui ne sont pas DS213air, l&apos;option Point d&apos;Acc&egrave;s sans fil dans DSM 4.3 est renomm&eacute; en &quot;Routeur sans fil&quot; dans DSM 5.0 et ult&eacute;rieur.</li>
</ul>
</ol>

</div>

<h3>G&eacute;rer les param&egrave;tres du point d&apos;acc&egrave;s</h3>
<p>Cette section explique comment activer et g&eacute;rer les param&egrave;tres du point d&apos;acc&egrave;s de votre DiskStation.</p>


<h4>Pour transformer le $-DSPRODUCTNAME_$ en point d&apos;acc&egrave;s :</h4>
<ol>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Sans fil</strong> &gt; <strong>Configuration de la carte du r&eacute;seau</strong>. Choisissez <strong>Wireless AP</strong> ou <strong>Wireless Router</strong>.</li>
<li>Allez dans l&apos;onglet <strong>Wi-Fi</strong> et cliquez sur <strong>Modifier</strong> pour g&eacute;rer les param&egrave;tres suivants :</li>
<ul>
<li><strong>Nom (SSID)&nbsp;:</strong> Entrez un nom pour le r&eacute;seau sans fil.</li>
<li><strong>Afficher/Masquer&nbsp;:</strong> Choisissez si le r&eacute;seau sans fil est visible ou non par les autres appareils.</li>
<li><strong>Mode sans fil&nbsp;:</strong> S&eacute;lectionnez un standard sans fil. Chaque standard prend en charge diff&eacute;rentes bandes passantes et fr&eacute;quences.</li>
<li><strong>Largeur de canal&nbsp;:</strong> S&eacute;lectionnez une largeur de canal (disponible uniquement lorsque vous utilisez le mode sans fil 802.11n).</li>
<li><strong>Canal&nbsp;:</strong> Entrez une fr&eacute;quence pour le r&eacute;seau sans fil. Pour de meilleures performances, choisissez une fr&eacute;quence diff&eacute;rente de celles utilis&eacute;es par les r&eacute;seaux &agrave; proximit&eacute;.</li>
<li><strong>Alimentation de transmission&nbsp;:</strong> Entrez une longueur de signal pour le r&eacute;seau sans fil.</li>
<li><strong>Connexions maximum&nbsp;:</strong> Choisissez le nombre d&apos;appareils clients qui peuvent se connecter au r&eacute;seau. Le param&egrave;tre de connexion le plus &eacute;lev&eacute; est 256.</li>
<li><strong>Activer WMM QoS&nbsp;:</strong> Wi-Fi Multimedia (WMM) QoS (qualit&eacute; de service) via Wi-Fi. Cette option permet au r&eacute;seau sans fil de hi&eacute;rarchiser le trafic et d&apos;optimiser la mani&egrave;re dont les ressources sont partag&eacute;es entre les applications.</li>
</ul>
</ol>



<h4>Pour configurer un calendrier sans fil&nbsp;:*</h4>
<p>Activer un calendrier de r&eacute;seau sans fil vous permet de contr&ocirc;ler quand le r&eacute;seau sans fil de votre DiskStation est actif et accessible.</p>
<ol>
<li>Allez dans l&apos;onglet <strong>Wi-Fi</strong> et cliquez sur <strong>Modifier</strong>. </li>
<li>Cochez la case <strong>Activer le calendrier</strong>.</li>

<li>Cliquez sur <strong>D&eacute;finir le calendrier</strong>.</li>
<li>Sur l&apos;&eacute;cran du calendrier, s&eacute;lectionnez quand le r&eacute;seau sans fil est actif.</li>
</ol>


<h3>Param&egrave;tres de s&eacute;curit&eacute;</h3>
<p>La fonction <strong>Panneau de configuration</strong> &gt; <strong>Sans fil</strong> &gt; <strong>Wi-Fi</strong> fournit des options pour modifier les param&egrave;tres de s&eacute;curit&eacute; de votre r&eacute;seau sans fil.</p>


<h4>Pour configurer la s&eacute;curit&eacute; sans fil&nbsp;:</h4>
<ol>

<li>Cliquez sur <strong>Modifier</strong>.</li>
<li>Choisissez l&apos;un des &eacute;l&eacute;ments suivants dans le menu d&eacute;roulant <strong>Param&egrave;tres de s&eacute;curit&eacute;</strong>&nbsp;:</li>
<ul>
<li><strong>WEP&nbsp;:</strong> Un protocole de s&eacute;curit&eacute; de base qui oblige les utilisateurs &agrave; entrer un mot de passe pour acc&eacute;der au r&eacute;seau sans fil, mais fournit une protection minimale.</li>
<li><strong>WPA/WPA2 Personnel&nbsp;:</strong> Recommand&eacute;. Oblige les utilisateurs &agrave; entrer un mot de passe pour acc&eacute;der au r&eacute;seau sans fil, et est plus s&eacute;curis&eacute; que le WEP.</li>
<li><strong>WPA/WPA2 Enterprise :</strong>* Un protocole de s&eacute;curit&eacute; con&ccedil;u pour les entreprises, ce qui n&eacute;cessite l&apos;authentification des utilisateurs avec un serveur d&apos;authentification externe.</li>

</ul>
</ol>

<h4>Pour configurer WPS (Wi-Fi Protected Setup)&nbsp;:*</h4>
<p>WPS (Wi-Fi Protected Setup) est une norme promue par la Wi-Fi Alliance pour simplifier les param&egrave;tres de s&eacute;curit&eacute; sans fil pour les utilisateurs. Vous pouvez utiliser un bouton-poussoir ou un code PIN pour s&eacute;curiser votre r&eacute;seau WiFi. Cliquez sur <strong>WPS</strong> pour activer Wi-Fi Protected Setup.</p>


<h3>R&eacute;seau invit&eacute;*</h3>
<p>En plus de cr&eacute;er un r&eacute;seau sans fil h&ocirc;te, votre DiskStation prend &eacute;galement en charge la cr&eacute;ation d&apos;un r&eacute;seau sans fil invit&eacute;. Les param&egrave;tres du r&eacute;seau invit&eacute; peuvent &ecirc;tre limit&eacute;s &agrave; restreindre l&apos;acc&egrave;s des utilisateurs, ce qui est utile pour les entreprises ou d&apos;autres institutions qui souhaitent fournir un r&eacute;seau sans fil pour les visiteurs, mais en les emp&ecirc;chant d&apos;acc&eacute;der au r&eacute;seau h&ocirc;te.</p>


<h4>Pour activer le r&eacute;seau invit&eacute;&nbsp;:</h4>

<ol>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Sans fil</strong> &gt; <strong>WiFi</strong>. </li>
<li>Cliquez sur <strong>Modifier</strong> pour g&eacute;rer les param&egrave;tres suivants sur l&apos;onglet <strong>R&eacute;seau invit&eacute;</strong>&nbsp;:</li>

<ul>
<li><strong>Nom (SSID)&nbsp;:</strong> Entrez un nom pour le r&eacute;seau sans fil.</li>
<li><strong>Afficher/Masquer&nbsp;:</strong> Choisissez si le r&eacute;seau sans fil est visible ou non par les autres appareils.</li>
<li><strong>Connexions maximum&nbsp;:</strong> Choisissez le nombre d&apos;appareils clients qui peuvent se connecter au r&eacute;seau. Le param&egrave;tre de connexion maximum est 256.</li>
</ul>
</ol>

<h4>Pour configurer la s&eacute;curit&eacute; du r&eacute;seau invit&eacute;&nbsp;:</h4>
<p>Choisissez l&apos;un des &eacute;l&eacute;ments suivants dans le menu d&eacute;roulant <strong>Param&egrave;tres de s&eacute;curit&eacute;</strong>&nbsp;:</p>
<ul>
<li><strong>WEP&nbsp;:</strong> Un protocole de s&eacute;curit&eacute; de base qui oblige les utilisateurs &agrave; entrer un mot de passe pour acc&eacute;der au r&eacute;seau sans fil, mais fournit une protection minimale.</li>
<li><strong>WPA/WPA2 Personnel&nbsp;:</strong> Recommand&eacute;. Oblige les utilisateurs &agrave; entrer un mot de passe pour acc&eacute;der au r&eacute;seau sans fil, et est plus s&eacute;curis&eacute; que le WEP.</li>
</ul>


<h4>Pour configurer un calendrier de r&eacute;seau invit&eacute;&nbsp;:</h4>
<p>Activer un calendrier de r&eacute;seau invit&eacute; vous permet de contr&ocirc;ler quand le r&eacute;seau sans fil invit&eacute; de votre DiskStation est actif et accessible.</p>

<ol>
<li>Cochez la case <strong>Activer le calendrier du r&eacute;seau invit&eacute;</strong>.</li>
<li>Cliquez sur <strong>D&eacute;finir le calendrier invit&eacute;</strong>.</li>
<li>Sur l&apos;&eacute;cran du calendrier, s&eacute;lectionnez quand le r&eacute;seau sans fil invit&eacute; est actif.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Le r&eacute;seau sans fil invit&eacute; ne peut pas &ecirc;tre actif pendant les p&eacute;riodes o&ugrave; le r&eacute;seau sans fil h&ocirc;te est d&eacute;sactiv&eacute;.</p>
</div>


<h3>Param&egrave;tre du filtre MAC*</h3>
<p>Le filtre MAC (dans <strong>Panneau de configuration</strong> &gt; <strong>Sans fil</strong>) sp&eacute;cifie quelles adresses MAC sont autoris&eacute;es &agrave; acc&eacute;der au r&eacute;seau sans fil, vous permettant de bloquer ou autoriser l&apos;acc&egrave;s &agrave; des appareils sp&eacute;cifiques. Cette fonction ne contr&ocirc;le que l&apos;acc&egrave;s au r&eacute;seau, pas les autres param&egrave;tres de chiffrement.</p>


<h4>Pour cr&eacute;er des r&egrave;gles de filtre MAC&nbsp;:</h4>
<ol>
<li>Saisir la description et l&apos;adresse MAC d&apos;un appareil.</li>
<li>Choisir une politique d&apos;acc&egrave;s&nbsp;:<ul>
<li><strong>Refuser&nbsp;:</strong> Interdit aux adresses MAC sp&eacute;cifi&eacute;es l&apos;acc&egrave;s au r&eacute;seau sans fil.</li>
<li><strong>Autoriser&nbsp;:</strong> Autorise les adresses MAC sp&eacute;cifi&eacute;es l&apos;acc&egrave;s au r&eacute;seau sans fil.</li>
</ul> 
</ol>



<h3>Contr&ocirc;le parental*</h3>
<p>La fonction de contr&ocirc;le parental vous permet de contr&ocirc;ler le moment o&ugrave; chaque appareil client connect&eacute; au r&eacute;seau local du DiskStation peut acc&eacute;der &agrave; Internet. Par exemple, si les ordinateurs ou les appareils mobiles de vos enfants se connectent sur Internet via le DiskStation, vous devez configurer les param&egrave;tres de contr&ocirc;le parental pour restreindre leur usage d&apos;Internet en fonction des appareils et heures sp&eacute;cifiques.</p>

<h4>Pour activer le Contr&ocirc;le parental&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez &agrave; <strong>Panneau de configuration</strong> &gt; <strong>Sans fil</strong> &gt; <strong>Configuration du contr&ocirc;le parental</strong>.</li>

<li>Cliquez sur le bouton <strong>Ajouter</strong> pour ajouter un appareil client.</li>
<ul>
<li><strong>Nom du client&nbsp;:</strong> Choisissez un appareil qui est connect&eacute; au DiskStation ou saisissez un nom manuellement (par ex. le portable de Louisa).</li>
<li><strong>Adresse MAC :</strong> Saisissez l&apos;adresse MAC de l&apos;appareil dont vous d&eacute;sirez r&eacute;glementer l&apos;usage d&apos;Internet.</li>
<li><strong>D&eacute;finir le calendrier :</strong> D&eacute;terminez les moments o&ugrave; l&apos;appareil en question sera autoris&eacute; &agrave; acc&eacute;der &agrave; Internet via le DiskStation.</li>
</ul>
</ol>

<h3>Liste de connexion*</h3>
<p>La liste de connexion (dans <strong>Panneau de configuration</strong> &gt; <strong>Sans fil</strong>) affiche des informations concernant les appareils connect&eacute;s au DiskStation. Les appareils peuvent &ecirc;tre directement ajout&eacute;s &agrave; la liste des filtres MAC &agrave; partir d&apos;ici.</p>

<h4>Pour ajouter des appareils &agrave; la liste de filtre MAC&nbsp;:</h4>
<ol>
<li>Cochez la case &agrave; c&ocirc;t&eacute; de l&apos;appareil que vous souhaitez ajouter au filtre MAC.</li>
<li>Cliquez sur <strong>Ajouter &agrave; la liste de filtre MAC</strong>.</li>
</ol>



<p>____<br> * Uniquement disponible sur certains mod&egrave;les.<br></body>
</html>
