<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Dossier partag&eacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>G&eacute;rer les permissions avanc&eacute;es sur le dossier partag&eacute;</h2>

<p>La page <strong>Panneau de configuration</strong> &gt; <strong>Dossier partag&eacute;</strong> &gt; <strong>Modifier</strong> &gt; <strong>Avanc&eacute;</strong> inclut les options ci-dessous afin de r&eacute;gler plus finement les permissions d'acc&egrave;s d'un dossier partag&eacute;.</p>

<h3>Permissions du dossier partag&eacute;</h3>
<p>Les permissions du dossier partag&eacute; offrent une couche suppl&eacute;mentaire de contr&ocirc;le pour g&eacute;rer les permissions d'acc&egrave;s des dossiers partag&eacute;s.  Lorsqu'elles sont activ&eacute;es, les utilisateurs et les groupes peuvent voir ou modifier le contenu d'un dossier partag&eacute; uniquement si l'utilisateur ou le groupe a re&ccedil;u &agrave; la fois les permissions de partage avanc&eacute;es <em>et</em> les permissions Windows ACL (situ&eacute;es dans <strong>Dossier partag&eacute;</strong> &gt; <strong>Modifier</strong> &gt; <strong>Permissions</strong>).</p>

<h4>Pour activer les permissions de partage avanc&eacute;es :</h4>

<ol>
<li>Cochez la case <strong>Activer les permissions de partage avanc&eacute;es</strong>.</li>
<li>Cliquez sur <strong>Permissions de partage avanc&eacute;es</strong> pour modifier les permissions de partage avanc&eacute;es pour le dossier partag&eacute;. </li>
</ol>

<div class="section">
  <h4>Remarque&nbsp;:</h4>
<ul>
<li>Les permissions de partage avanc&eacute;es sont appliqu&eacute;es lorsqu'un utilisateur acc&egrave;de &agrave; un dossier partag&eacute; via les services suivants : Windows File Sharing, Apple File Sharing, File Station, FTP et WebDAV.</li>
</ul>
</div>

<h3>Param&egrave;tres avanc&eacute;s</h3>

<p>Si n&eacute;cessaire, vous pouvez placer d'autres restrictions sur les utilisateurs lorsqu'ils acc&egrave;dent &agrave; un dossier partag&eacute; via File Station, FTP ou WebDAV.</p>
	<ul>
    <li><strong>D&eacute;sactiver la navigation dans le r&eacute;pertoire&nbsp;:</strong> Cette option emp&ecirc;che les utilisateurs de voir le contenu du dossier partag&eacute;.</li>
    <li><strong>D&eacute;sactiver la modification des fichiers existants&nbsp;:</strong> Cette option emp&ecirc;che les utilisateurs de d&eacute;placer, d&eacute;truire ou modifier les fichiers dans le dossier partag&eacute;. Veuillez noter que les utilisateurs seront capables de visualiser, t&eacute;l&eacute;charger/charger, copier ou d&eacute;compresser les contenus du dossier partag&eacute;.</li>
    <li><strong>D&eacute;sactiver le t&eacute;l&eacute;chargement de fichiers&nbsp;:</strong> Cette option emp&ecirc;che les utilisateurs de t&eacute;l&eacute;charger le contenu du dossier partag&eacute;.</li>
    </ul>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Veuillez noter que ces restrictions ne s'appliquent pas aux utilisateurs qui appartiennent au groupe <strong>administrators</strong>.</p>
</div>
</body>
</html>
