<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Utilisateur</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Param&egrave;tres du mot de passe</h2>
<p>Cliquez sur le bouton <strong>Param&egrave;tres du mot de passe</strong> pour visualiser et modifier les param&eacute;trages d&eacute;crits ci-dessous.</p>

<h3>R&eacute;initialisation des mots de passe oubli&eacute;s</h3>
<p>Cette section inclut une option <strong>Autoriser les utilisateurs non admin &agrave; r&eacute;initialiser leurs mots de passe oubli&eacute;s via email</strong>. Lorsque cette option est activ&eacute;e, un lien intitul&eacute; <strong>Mot de passe oubli&eacute;&nbsp;?</strong> appara&icirc;t sur la page de connexion &agrave; DSM. Si un utilisateur oublie son mot de passe, il peut cliquer sur ce lien et saisir son nom d'utilisateur.  Dans ce cas, le syst&egrave;me enverra un message &agrave; l'utilisateur contenant un lien permettant de r&eacute;initialiser son mot de passe oubli&eacute;. </p>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Avant d'activer cette option, assurez-vous que vous avez d&eacute;j&agrave; activ&eacute; les notifications SMTP par email. Pour ce faire, allez dans <strong>Panneau de configuration</strong> &gt; <strong>Notifications</strong> &gt; <strong>G&eacute;n&eacute;ral</strong>. Si les notifications ne sont pas activ&eacute;es, le syst&egrave;me ne pourra pas envoyer des messages aux utilisateurs qui d&eacute;sirent r&eacute;initialiser leur mot de passe.</li>
<li>Pour recevoir des messages syst&egrave;me, les utilisateurs doivent fournir une adresse email dans la section informations concernant l'utilisateur de leur compte.</li>
<li>Les utilisateurs appartenant au groupe <strong>administrators</strong> ne peuvent pas r&eacute;initialiser leur mot de passe &agrave; l'aide de cette option.</li>
<li>Les utilisateurs du domaine ne peuvent pas r&eacute;initialiser leur mot de passe &agrave; l'aide de cette option.</li>
<li>Les utilisateurs peuvent r&eacute;initialiser leur mots de passe &agrave; l'aide de cette option, tant que le DiskStation sert de serveur d'annuaire LDAP.</li>

</ul>
</div>


<h3>Force du mot de passe</h3>
<p>Vous pouvez d&eacute;finir des r&egrave;gles de force du mot de passe pour les utilisateurs sur votre DiskStation.</p>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Les r&egrave;gles de force du mot de passe ne s'appliquent qu'aux nouveaux mots de passe. Par exemple, les nouvelles r&egrave;gles de force de passe ne s'appliquent que lors de la cr&eacute;ation d'un nouveau compte utilisateur ou lorsqu'un utilisateur existant change son mot de passe.  Les mots de passe existants et ceux appartenant aux comptes utilisateurs import&eacute;s sont exclus des nouvelles r&egrave;gles de mot de passe.</p>
</div>
<h4>Pour appliquer les r&egrave;gles de force du mot de passe&nbsp;:</h4>
<ol>
<li>Cochez la case <b>Appliquer les r&egrave;gles de force de mot de passe</b> pour activer les restrictions concernant les mots de passe.</li>
<li>S&eacute;lectionnez plus d'une restriction de mot de passe dans les r&egrave;gles ci-dessous&nbsp;:</li>
<ul>
<li><b>Exclure du mot de passe le nom et la description de l&rsquo;utilisateur</b>&nbsp;: Le mot de passe ne doit pas contenir le nom de l'utilisateur ou la description de l'utilisateur. Mais les caract&egrave;res cod&eacute;s en UTF-8 sont exclus.</li>
<li><b>Permettre le m&eacute;lange majuscule/minuscule </b>: Des lettres de casses diff&eacute;rentes sont autoris&eacute;es dans le mot de passe.</li>
<li><b>Inclure les caract&egrave;res num&eacute;riques </b>: Le mot de passe doit contenir au moins un caract&egrave;re num&eacute;rique (0 &agrave; 9).</li>
<li><b>Inclure les caract&egrave;res sp&eacute;ciaux </b>: Le mot de passe doit contenir au moins un caract&egrave;re ASCII sp&eacute;cial (c.-&agrave;-d., ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Longueur minimale du mot de passe </b>: La longueur du mot de passe doit &ecirc;tre sup&eacute;rieure ou &eacute;gale &agrave; la valeur sp&eacute;cifi&eacute;e dans le champ texte. La longueur doit &ecirc;tre un nombre compris entre 6 et 127.</li>
</ul>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>
 
</body>
</html>

