<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Dossier partag&eacute;</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Dossier partag&eacute;</h1>
<p>Les dossiers partag&eacute;s sont les r&eacute;pertoires de base o&ugrave; vous pouvez stocker les fichiers et dossiers sur votre DiskStation. Avant de stocker des fichiers sur votre DiskStation, vous devez cr&eacute;er au moins un dossier partag&eacute;. Les donn&eacute;es stock&eacute;es sur des dossiers partag&eacute;s peuvent &ecirc;tre maintenues priv&eacute;es ou &ecirc;tre partag&eacute;es avec des utilisateurs sp&eacute;cifiques ou des groupes d'utilisateurs selon les autorisations d'acc&egrave;s personnalis&eacute;es. En plus, les dossiers partag&eacute;s peuvent &ecirc;tre crypt&eacute;s pendant la cr&eacute;ation, en ajoutant une couche de protection suppl&eacute;mentaire.</p>

<h3>Dossiers partag&eacute;s par d&eacute;faut</h3>

<p>Ci-dessous vous trouverez une liste de dossiers partag&eacute;s qui sont cr&eacute;&eacute;s automatiquement quand certaines applications, services ou paquets sont install&eacute;s ou activ&eacute;s. </p> 

<table>
<tr>
<th>Nom</th>
<th>Description</th>
</tr>
<tr>
<th>public</th>
<td>Le dossier <strong>public</strong> est cr&eacute;&eacute; automatiquement apr&egrave;s la premi&egrave;re installation de votre DiskStation.*</td>
</tr>
<tr>
<th>web</th>
<td>Le dossier <strong>web</strong> est l'emplacement de stockage par d&eacute;faut pour les contenus d'un site web abrit&eacute; sur le DiskStation. Il est automatiquement cr&eacute;&eacute; lorsque <strong>Web Station</strong> est activ&eacute;.</td>
</tr>
<tr>
<th>photo</th>
<td>Le dossier <strong>photo</strong> est utilis&eacute; pour stocker des photos et des vid&eacute;os que vous voulez partager avec Photo&nbsp;Station. Il est cr&eacute;&eacute; automatiquement lorsque <strong>Photo Station</strong> ou le <strong> DLNA/UPnP Media Server</strong> est activ&eacute;.</td>
</tr>
<tr>
<th>music</th>
<td>Le dossier <strong>music</strong> est utilis&eacute; pour stocker la musique que vous voulez &eacute;couter avec Audio Station.  Il est automatiquement cr&eacute;&eacute; lorsque <strong>Audio Station</strong> est activ&eacute;.</td>
</tr>
<tr>
<th>video</th>
<td>Le dossier <strong>video</strong> est utilis&eacute; pour stocker des vid&eacute;os que vous voulez parcourir via les appareils DLNA/UPnP. Il est automatiquement cr&eacute;&eacute; lorsque le <strong>Serveur m&eacute;dia</strong> est activ&eacute;.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Le dossier <strong>surveillance</strong> est utilis&eacute; pour stocker les enregistrements de Surveillance&nbsp;Station. Il est automatiquement cr&eacute;&eacute; lorsque <strong>Surveillance Station</strong> est activ&eacute;. Il est en lecture seule et seul l'administrateur syst&egrave;me peut y acc&eacute;der.</td>
</tr>
<tr>
<th>home</th>
<td>Les dossiers <strong>home</strong> offre des espaces priv&eacute;s pour chaque utilisateur pour qu&rsquo;il puisse stocker des donn&eacute;es accessibles par lui uniquement. Il est automatiquement cr&eacute;&eacute; quand la fonction <strong>Accueil Utilisateur</strong> est activ&eacute;e.</td>
</tr>
<tr>
<th>homes</th>
<td>Le dossier <strong>homes</strong> contient tous les dossiers accueil de tous les utilisateurs. Il est automatiquement cr&eacute;&eacute; quand la fonction <strong>Accueil Utilisateur</strong> est activ&eacute;e. Seul l'administrateur syst&egrave;me peut avoir acc&egrave;s aux dossiers home de tous les utilisateurs et les g&eacute;rer.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Le dossier <strong>NetBackup</strong> est cr&eacute;&eacute; automatiquement lorsque la <strong>Sauvegarde r&eacute;seau</strong> est activ&eacute;e.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Le dossier <strong>usbshare[number]</strong> est cr&eacute;&eacute; automatiquement quand vous vous connectez &agrave; un pilote USB externe vers le port USB du DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Le dossier <strong>satashare</strong> est cr&eacute;&eacute; automatiquement quand vous vous connectez &agrave; un pilote eSATA externe vers le port eSATA du DiskStation.*</td>
</tr>
</table>

<p>____<br> * Uniquement disponible sur certains mod&egrave;les.</p>

</body>
</html>
