<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Utilisateur</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Accueil utilisateur</h2>
<p>Activez la fonction accueil utilisateur pour cr&eacute;er un dossier d' <b>accueil</b> personnel pour chaque utilisateur except&eacute; <b>guest</b>. Tous les utilisateurs peuvent acc&eacute;der &agrave; leurs propres dossiers personnalis&eacute;s via CIFS, AFP, FTP ou File Station.</p>
<p>Admin peut acc&eacute;der &agrave; tous les dossiers personnels du dossier partag&eacute; par d&eacute;faut du syst&egrave;me <b>homes</b>. Le nom du dossier d'accueil est le m&ecirc;me que le compte utilisateur.</p>
<h4>Pour activer le service d&rsquo;accueil de l&rsquo;utilisateur :</h4>
<ol>
<li>Cliquez sur <b>Accueil utilisateur</b>.</li>
<li>Cochez <b>Activer le service d&rsquo;accueil de l&rsquo;utilisateur</b>.</li>
<li>S'il y a plus d'un volume sur Synology DiskStation, s&eacute;lectionnez le volume o&ugrave; vous voulez stocker le dossier <b>homes</b>.</li>
<li>Cliquez sur <b>OK</b>.</li>
</ol>
<p><span class="note_head">Remarque&nbsp;:</span> une fois le service d'accueil de l'utilisateur local d&eacute;sactiv&eacute;, le service d'accueil de l'utilisateur du domaine sera &eacute;galement d&eacute;sactiv&eacute; parall&egrave;lement.</p>
<h4>Pour d&eacute;sactiver le service d&rsquo;accueil de l&rsquo;utilisateur&nbsp;:</h4>
<ol>
<li>Cliquez sur <b>Accueil utilisateur</b>.</li>
<li>D&eacute;cochez <b>Activer le service d&rsquo;accueil de l&rsquo;utilisateur</b>.</li>
</ol>
<p>Apr&egrave;s la d&eacute;sactivation du service d'accueil de l'utilisateur, l'acc&egrave;s au dossier partag&eacute; <b>homes</b> sera r&eacute;serv&eacute; &agrave; admin.  Les utilisateurs pourront &agrave; nouveau acc&eacute;der &agrave; leurs dossiers d'accueil quand le service d'accueil utilisateur sera r&eacute;activ&eacute;.</p>
<ol>
<span class="note_head">Remarque&nbsp;:</span>
<li>Pour supprimer le dossier partag&eacute; <b>homes</b>, le service d'accueil utilisateur doit d'abord &ecirc;tre d&eacute;sactiv&eacute;.</li>
<li>Le service d'accueil de l'utilisateur du domaine sera d&eacute;sactiv&eacute; si le service d'accueil de l'utilisateur est d&eacute;sactiv&eacute;.</li> 
</ol> 
</body>	
</html> 
