<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Dossier partag&eacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Modifier un dossier crypt&eacute;</h2>
<p>Une fois le dossier crypt&eacute;, vous pouvez utiliser le menu d&eacute;roulant <b>Cryptage</b> pour modifier le dossier.</p>
<h4>Les &eacute;l&eacute;ments affich&eacute;s dans le menu d&eacute;pendent de l'&eacute;tat du dossier partag&eacute; s&eacute;lectionn&eacute;&nbsp;:</h4>
<ul>
<li>Si vous s&eacute;lectionnez un dossier partag&eacute; non crypt&eacute;, le menu d&eacute;roulant <b>Cryptage</b> est d&eacute;sactiv&eacute;.</li>
<li>Si vous s&eacute;lectionnez un dossier partag&eacute; crypt&eacute; et mont&eacute;, vous pouvez choisir <b>D&eacute;connecter</b> dans le menu <b>Cryptage</b> pou d&eacute;connecter le dossier ou <b>Exporter la cl&eacute;</b> pour enregistrer la cl&eacute; de cryptage.</li>
<li>Si vous s&eacute;lectionnez un dossier partag&eacute; crypt&eacute; et d&eacute;connect&eacute;, vous pouvez choisir <b>Montage</b> dans le menu d&eacute;roulant <b>Cryptage</b> puis entrez ou importez la cl&eacute; de cryptage pour monter le dossier et pouvoir y acc&eacute;der.</li>
</ul>
<ol>
<span class="note_head">Remarque&nbsp;:</span>
<li><span  class="note_content">Il est tr&egrave;s important de se souvenir de la cl&eacute; de cryptage.</span> Nous vous recommandons fortement d'exporter et enregistrer la cl&eacute; de cryptage. Si vous oubliez ou perdez la cl&eacute;, il n'y a aucun moyen de r&eacute;cup&eacute;rer les donn&eacute;es crypt&eacute;es.</li>
<li>Quand le dossier partag&eacute; crypt&eacute; est mont&eacute;, vous ne pouvez pas le renommer ou modifier l'emplacement de son volume. Vous ne pouvez apporter des modifications qu'apr&egrave;s l'avoir d&eacute;mont&eacute;.</li></ol>
</body>
</html>
