<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Utilisateur</h2>
<p>Gr&acirc;ce aux options de gestion de l&apos;utilisateur flexibles, vous pouvez cr&eacute;er des comptes utilisateur pour les membres individuels de votre famille ou entreprise et d&eacute;finissez les permissions d&apos;acc&egrave;s au dossier partag&eacute; pour chaque personne.</p>

<h4>Pour cr&eacute;er un utilisateur&nbsp;:</h4>
<ol>
<li>Allez &agrave; <b>Panneau de configuration (Mode simple)</b> &gt; <b>Utilisateur</b> et cliquez sur l&apos;ic&ocirc;ne <b>+</b> sur le panneau de gauche.</li>
<li>Sp&eacute;cifiez un nom et un mot de passe pour l&apos;utilisateur.</li>
<li>Sp&eacute;cifiez les groupes pour lesquels appartiendra le nouvel utilisateur.</li>
<li>Assignez les permissions de dossier partag&eacute; appropri&eacute;es au nouvel utilisateur.  Lorsque vous rencontrez des conflits de permissions, la priorit&eacute; de la permission s&apos;&eacute;tablit comme suit&nbsp;: <b>Pas d&apos;acc&egrave;s</b> &gt; <b>Lecture/&eacute;criture</b> &gt; <b>Lecture seule</b>.</li>
<ul>
<li><b>Aper&ccedil;u&nbsp;:</b> Cette colonne affiche les privil&egrave;ges d&apos;acc&egrave;s aux dossiers partag&eacute;s de l&apos;utilisateur, en fonction des param&egrave;tres actuels et des groupes auxquels l&apos;utilisateur appartient.</li>
<li><b>Lecture/&eacute;criture :</b> L&apos;utilisateur peut acc&eacute;der et effectuer des modifications sur les fichiers et sous-dossiers dans le dossier partag&eacute; correspondant.</li>
<li><b>Lecture seule&nbsp;:</b> L&apos;utilisateur peut acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute; correspondant.</li>
<li><b>Pas d&rsquo;acc&egrave;s&nbsp;:</b> L&apos;utilisateur ne peut pas acc&eacute;der aux fichiers ou sous-dossiers du dossier partag&eacute; correspondant.</li>
</ul>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>

<div class="section">
<h4>Restrictions concernant le nom d&apos;utilisateur&nbsp;:</h4>
<ul>
<li>Le nom d&apos;utilisateur n&apos;est pas sensible &agrave; la casse et peut inclure de 1 &agrave; 64 caract&egrave;res Unicode, mais ne peut pas contenir les symboles suivants&nbsp;:<br> <b>! &quot; # $ % &amp; &apos; ( ) * + , / : ; < = > ? @ [ ] \ ^ ` { } | ~</b></li>
<li>Le premier caract&egrave;re ne peut pas &ecirc;tre le signe moins ou un espace, et le dernier caract&egrave;re ne peut pas &ecirc;tre un espace.</li>
<li>Les noms d&apos;utilisateur suivants sont r&eacute;serv&eacute;s pour le syst&egrave;me&nbsp;:<br> <b>mailer-daemon</b>, <b>postmaster</b></li>
</ul>
<h4>Restrictions concernant le mot de passe&nbsp;:</h4>
<ul>
<li>Le mot de passe est sensible &agrave; la casse et peut &ecirc;tre compos&eacute; de 127 caract&egrave;res affichables au maximum, tels que des lettres, des chiffres, des symboles et des espaces.</li>
</ul>
</div>

</ol>
<h4>Pour modifier un utilisateur&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez &agrave; <b>Panneau de configuration (Mode simple)</b> &gt; <b>Utilisateur</b>.</li>
<li>S&eacute;lectionnez l&apos;utilisateur d&eacute;sir&eacute; sur le panneau de gauche.</li>
<li>Modifiez l&apos;information g&eacute;n&eacute;rale de l&apos;utilisateur telle que le nom, le mot de passe, le groupe et les permissions du dossier partag&eacute;.</li>
<li>Cochez <b>D&eacute;sactiver ce compte</b> si vous voulez arr&ecirc;ter le fonctionnement du compte.</li>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>

<h4>Pour supprimer un utilisateur :</h4>
<ol>
<li>Acc&eacute;dez &agrave; <b>Panneau de configuration (Mode simple)</b> &gt; <b>Utilisateur</b>.</li>
<li>S&eacute;lectionnez l&apos;utilisateur d&eacute;sir&eacute; sur le panneau de gauche.</li>
<li>Cliquez sur l&apos;ic&ocirc;ne <b>Poubelle</b> sur le panneau de gauche pour supprimer l&apos;utilisateur s&eacute;lectionn&eacute;.</li>
</ol>
</body>
</html>