<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Aper&ccedil;u</h2>
<p>Le <b>Panneau de configuration (Mode simple)</b> &gt; <b>Aper&ccedil;u</b> est une passerelle rapide et centralis&eacute;e qui vous permet de g&eacute;rer diff&eacute;rentes fonctions de base et de surveiller les ressources du syst&egrave;me de votre DiskStation.</p>


<h3>Sant&eacute; du syst&egrave;me</h3>
<p>Cette section affiche le statut global de votre syst&egrave;me. Si une erreur s&apos;est produite ou que vos espaces de stockage sont en pannes ou d&eacute;grad&eacute;s, vous pouvez faire passer votre souris sur cette section et cliquez sur l&apos;ic&ocirc;ne <b>Plus</b> dans le coin sup&eacute;rieur droit pour ouvrir les pages correspondantes pour la r&eacute;paration et la gestion.</p>

<h3>Version de DSM</h3>
<p>Votre version actuelle de DSM et le statut seront affich&eacute;s dans cette section. Lorsqu&apos;un nouveau DSM est disponible pour le t&eacute;l&eacute;chargement, vous pouvez mettre &agrave; jour &agrave; la derni&egrave;re version directement ici. </p>

<h3>QuickConnect ID</h3>
<p>Vous pouvez afficher votre QuickConnect ID ici. Pour des param&egrave;tres et une gestion plus avanc&eacute;s, faites passer votre souris sur cette section et cliquez sur l&apos;ic&ocirc;ne <b>Plus</b> sur le coin sup&eacute;rieur droit pour ouvrir la page <b>QuickConnect</b>.</p>
<h3>Stockage</h3>
<p>Cette section affiche l&apos;information et le statut du mat&eacute;riel de vos espaces de stockage, tels que l&apos;utilisation du disque dur et l&apos;utilisation/capacit&eacute; du volume.  Vous pouvez v&eacute;rifiez combien de disques durs sont utilis&eacute;es par quels espaces de stockage.  Pour des param&egrave;tres et une gestion plus avanc&eacute;s, faites passer votre souris sur cette section et cliquez sur l&apos;ic&ocirc;ne <b>Plus</b> sur le coin sup&eacute;rieur droit pour ouvrir la page <b>Gestionnaire de stockage</b>.</p>

<h3>Moniteur de ressources</h3>
<p>Vous pouvez surveiller le pourcentage de l&apos;utilisation globale du processeur, l&apos;utilisation de la m&eacute;moire et le taux de donn&eacute;es re&ccedil;ues et envoy&eacute;es en Ko par seconde.  Si plus d&apos;un processeur est en cours d&apos;utilisation, cliquez sur l&apos;ic&ocirc;ne fl&eacute;ch&eacute;e sur le diagramme de flux r&eacute;seau pour basculer.  Pour des param&egrave;tres et une gestion plus avanc&eacute;s, faites passer votre souris sur cette section et cliquez sur l&apos;ic&ocirc;ne <b>Plus</b> sur le coin sup&eacute;rieur droit pour ouvrir la page <b>Moniteur de ressources</b>.</p>

<h3>Utilisateurs connect&eacute;s</h3>
<p>Vous pouvez voir et g&eacute;rer les clients qui sont actuellement connect&eacute;s au syst&egrave;me et acc&egrave;dent aux ressources. Cette section affiche les clients qui sont connect&eacute;s via HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP et NFS. Pour des param&egrave;tres et une gestion plus avanc&eacute;s, faites passer votre souris sur cette section et cliquez sur l&apos;ic&ocirc;ne <b>Plus</b> sur le coin sup&eacute;rieur droit pour ouvrir la page <b>Moniteur de ressources</b>.</p>

<h4>Pour tuer les connexions actuelles&nbsp;:</h4>
<p>Cliquez sur l&apos;ic&ocirc;ne <b>Tuer la connexion</b> &agrave; c&ocirc;t&eacute; de l&apos;utilisateur souhait&eacute; pour arr&ecirc;ter l&apos;acc&egrave;s de l&apos;utilisateur &agrave; la ressource. L&rsquo;utilisateur d&eacute;connect&eacute; devra &ecirc;tre autoris&eacute; &agrave; nouveau pour obtenir l&rsquo;acc&egrave;s &agrave; la ressource.</p>

</body>
</html>