<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Dossier partag&eacute;</h2>
<p>Les dossiers partag&eacute;s sont les r&eacute;pertoires de base o&ugrave; vous pouvez stocker les fichiers et dossiers sur votre DiskStation. Avant de stocker des fichiers sur votre DiskStation, vous devez cr&eacute;er au moins un dossier partag&eacute; dans DSM. Les donn&eacute;es stock&eacute;es sur des dossiers partag&eacute;s peuvent &ecirc;tre maintenues priv&eacute;es ou &ecirc;tre partag&eacute;es avec des utilisateurs sp&eacute;cifiques ou des groupes d&apos;utilisateurs selon les autorisations d&apos;acc&egrave;s personnalis&eacute;es.</p>



<p>Ci-dessous vous trouverez une liste de dossiers partag&eacute;s par d&eacute;faut qui sont cr&eacute;&eacute;s automatiquement quand certaines applications, services ou paquets sont install&eacute;s ou activ&eacute;s.</p> 
<table>
<tr>
<th>Nom</th>
<th>Description</th>
</tr>
<tr>
<th>public</th>
<td>Le dossier <strong>public</strong> est cr&eacute;&eacute; automatiquement apr&egrave;s la premi&egrave;re installation de votre DiskStation.*</td>
</tr>
<tr>
<th>web</th>
<td>Le dossier <strong>web</strong> est l&apos;emplacement de stockage par d&eacute;faut pour les contenus d&apos;un site web abrit&eacute; sur le DiskStation. Il est automatiquement cr&eacute;&eacute; lorsque <strong>Web Station</strong> est activ&eacute;.</td>
</tr>
<tr>
<th>photo</th>
<td>Le dossier <strong>photo</strong> est utilis&eacute; pour stocker des photos et des vid&eacute;os que vous voulez partager avec Photo&nbsp;Station. Il est cr&eacute;&eacute; automatiquement lorsque <strong>Photo Station</strong> ou le <strong>Serveur multim&eacute;dia DLNA/UPnP</strong> est activ&eacute;.</td>
</tr>
<tr>
<th>music</th>
<td>Le dossier <strong>Musique</strong> est utilis&eacute; pour stocker la musique que vous voulez &eacute;couter avec Audio Station. Il est cr&eacute;&eacute; automatiquement lorsque <strong>Audio Station</strong> ou le <b>Serveur multim&eacute;dia DLNA/UPnP</b> est activ&eacute;.</td>
</tr>
<tr>
<th>video</th>
<td>Le dossier <strong>vid&eacute;o</strong> est utilis&eacute; pour stocker des vid&eacute;os que vous voulez parcourir via les appareils DLNA/UPnP. Il est cr&eacute;&eacute; automatiquement lorsque <b>Video Station</b> ou le <strong>Serveur multim&eacute;dia DLNA/UPnP</strong> est activ&eacute;.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Le dossier <strong>surveillance</strong> est utilis&eacute; pour stocker les enregistrements de Surveillance&nbsp;Station. Il est automatiquement cr&eacute;&eacute; lorsque <strong>Surveillance Station</strong> est activ&eacute;. Il est en lecture seule et seul l&apos;administrateur syst&egrave;me peut y acc&eacute;der.</td>
</tr>
<tr>
<th>home</th>
<td>Les dossiers <strong>accueil</strong> offre des espaces priv&eacute;s pour chaque utilisateur pour qu&rsquo;il puisse stocker des donn&eacute;es accessibles par lui uniquement. Il est automatiquement cr&eacute;&eacute; quand la fonction <strong>Accueil Utilisateur</strong> est activ&eacute;e.</td>
</tr>
<tr>
<th>homes</th>
<td>Le dossier <strong>homes</strong> contient tous les dossiers accueil de tous les utilisateurs. Il est automatiquement cr&eacute;&eacute; quand la fonction <strong>Accueil Utilisateur</strong> est activ&eacute;e. Seul l&apos;administrateur syst&egrave;me peut avoir acc&egrave;s aux dossiers accueil de tous les utilisateurs et les g&eacute;rer.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Le dossier <strong>NetBackup</strong> est cr&eacute;&eacute; automatiquement lorsque la <strong>Sauvegarde r&eacute;seau</strong> est activ&eacute;e.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Le dossier <strong>usbshare[number]</strong> est cr&eacute;&eacute; automatiquement quand vous vous connectez &agrave; un pilote USB externe vers le port USB du DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Le dossier <strong>satashare</strong> est cr&eacute;&eacute; automatiquement quand vous vous connectez &agrave; un pilote eSATA externe vers le port eSATA du DiskStation.*</td>
</tr>
</table>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Vous pouvez uniquement modifier les permissions de dossier partag&eacute; des utilisateurs dans le mode simple.  Si vous voulez cr&eacute;ez des groupes utilisateurs ou g&eacute;rer des privil&egrave;ges d&apos;acc&egrave;s de groupe pour les dossiers partag&eacute;s, veuillez aller &agrave; <b>Panneau de configuration (Mode avanc&eacute;)</b> &gt; <b>Groupe</b>.</li>
</ul>
</div>

<h4>Pour cr&eacute;er un dossier partag&eacute;&nbsp;:</h4>
<ol>
<li>Allez &agrave; <b>Panneau de configuration (Mode simple)</b> &gt; <b>Dossier partag&eacute;</b> et cliquez sur l&apos;ic&ocirc;ne <b>+</b> sur le panneau de gauche.</li>
<li>Sp&eacute;cifiez un nom et s&eacute;lectionnez un volume sur lequel cr&eacute;er le dossier partag&eacute;. </li>
<li>Cochez <b>Activer la corbeille</b> si n&eacute;cessaire. Si cette option est activ&eacute;e, quand les fichiers dans le dossier partag&eacute; sont supprim&eacute;s, ils seront d&eacute;plac&eacute;s vers un dossier nomm&eacute; <b>#recycle</b> L&apos;acc&egrave;s &agrave; la corbeille de recyclage peut &ecirc;tre limit&eacute; aux utilisateurs appartenant au groupe <b>administrators</b>.</li>
<li>Cochez ou d&eacute;cochez les cases appropri&eacute;es pour chaque utilisateur afin de personnaliser leurs privil&egrave;ges d&apos;acc&egrave;s au dossier partag&eacute;&nbsp;:</li>
<ul>
<li><b>Lecture/&eacute;criture :</b> L&apos;utilisateur peut acc&eacute;der et effectuer des modifications sur les fichiers et sous-dossiers du dossier partag&eacute;.</li>
<li><b>Lecture seule&nbsp;:</b> L&apos;utilisateur peut acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute;.</li>
<li><b>Pas d&rsquo;acc&egrave;s&nbsp;:</b> L&apos;utilisateur ne peut pas acc&eacute;der aux fichiers ou sous-dossiers du dossier partag&eacute;.</li>
</ul>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Les noms de dossiers partag&eacute;s sont sensibles &agrave; la casse et peuvent &ecirc;tre compos&eacute;s de 1 &agrave; 32 caract&egrave;res. Les noms ne peuvent pas inclure les caract&egrave;res suivants&nbsp;:<br> <strong>! &quot; # $ % &amp; &apos; ( ) * + , / : ; <= > ? @ [ ] \ ^ ` { } | ~</strong></li>
<li>Les noms suivants sont r&eacute;serv&eacute;s pour le syst&egrave;me&nbsp;:<br> <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong>.</li>
<li>Le premier caract&egrave;re du nom d&apos;un dossier partag&eacute; ne peut &ecirc;tre ni le signe moins ni un espace tout comme le dernier caract&egrave;re qui ne peut &eacute;galement pas &ecirc;tre un espace.</li>
<li>Lorsque vous rencontrez des conflits de privil&egrave;ges, la priorit&eacute; des privil&egrave;ges s&apos;&eacute;tablit comme suit&nbsp;: <b>Pas d&apos;acc&egrave;s</b> &gt; <b>Lecture/&eacute;criture</b> &gt; <b>Lecture seule</b>.</li>
<li>Lors de la cr&eacute;ation d&apos;un nouveau dossier partag&eacute;, si les permissions pour les utilisateurs appartenant au groupe <b>administrators</b> sont d&eacute;finies sur <b>Pas d&apos;acc&egrave;s</b>, ces utilisateurs ne pourront voir le dossier partag&eacute; que dans <b>Panneau de configuration</b> &gt; <b>Dossier partag&eacute;</b>.</li>
<li> Vous pouvez configurer les param&egrave;tres de privil&egrave;ge du dossier Corbeille dans File Station en cliquant-droit de le dossier <b>#recycle</b>. S&eacute;lectionnez <b>Propri&eacute;t&eacute;s</b> et cliquez sur l&apos;onglet <b>Permissions</b>.</li>
</ul>
</div>

<h4>Pour modifier un dossier partag&eacute;&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez &agrave; <b>Panneau de configuration (Mode simple)</b> &gt; <b>Dossier partag&eacute;</b>.</li>
<li>S&eacute;lectionnez le dossier partag&eacute; sur le panneau de gauche. </li>
<li>Modifiez l&apos;information g&eacute;n&eacute;rale d&apos;un dossier partag&eacute; telle que le nom, l&apos;emplacement et les permissions utilisateur.</li>
<li>Si <b>Activer la corbeille</b> a d&eacute;j&agrave; &eacute;t&eacute; coch&eacute;, vous pouvez cliquer sur <b>Vider la corbeille</b> pour retirer tous les fichiers supprim&eacute;s dans la corbeille de fa&ccedil;on permanente.</li>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>

<h4>Pour supprimer un dossier partag&eacute;&nbsp;:</h4>
<ol>
<li>Acc&eacute;dez &agrave; <b>Panneau de configuration (Mode simple)</b> &gt; <b>Dossier partag&eacute;</b>.</li>
<li>S&eacute;lectionnez le dossier partag&eacute; sur le panneau de gauche.</li>
<li>Cliquez sur l&apos;ic&ocirc;ne <b>Poubelle</b> sur le panneau de gauche pour supprimer le dossier partag&eacute; s&eacute;lectionn&eacute;.</li>

</ol>


<p>_____<br> * Uniquement disponible sur certains mod&egrave;les.</p>
</body>
</html>