<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="login"></a>Style de la connexion</h2>

<p>Vous pouvez personnaliser l&apos;apparence de l&apos;&eacute;cran de connexion de DSM en choisissant parmi tout un &eacute;ventail de mod&egrave;les, en changeant l&apos;image d&apos;arri&egrave;re-plan ou en ajoutant un logo. Pour ce faire, allez dans <strong>Panneau de configuration</strong> &gt; <strong>Style de connexion</strong>.</p>

<h4>Pour personnaliser l&apos;&eacute;cran de connexion DSM&nbsp;:</h4>
<p>Les options suivantes apparaissent sur la page <strong>Style de connexion</strong>&nbsp;:</p>
<ul>
<li><strong>Titre de la page de connexion&nbsp;:</strong>  Le texte saisi ici appara&icirc;t sur l&apos;&eacute;cran de connexion.</li>
<li><strong>Information sur la dur&eacute;e :</strong> Choisissez d&apos;afficher ou de masquer les informations sur l&apos;heure locale sur l&apos;&eacute;cran de connexion.</li>
<li><strong>Mod&egrave;le&nbsp;:</strong> S&eacute;lectionnez un th&egrave;me de couleur et une image d&apos;arri&egrave;re-plan par d&eacute;faut. Le mod&egrave;le choisi prend effet la prochaine fois que vous vous connectez dans le DiskStation.</li>
<li><strong>Arri&egrave;re-plan :</strong> Pour modifier l&apos;image d&apos;arri&egrave;re-plan qui appara&icirc;t sur l&apos;&eacute;cran de connexion, cliquez sur l&apos;&eacute;cran de connexion, cliquez sur l&apos;image existante ou le signe plus (<strong>+</strong>) si aucune image est s&eacute;lectionn&eacute;e. Vous pouvez choisir parmi les papier peints par d&eacute;faut, les images stock&eacute;es sur le DiskStation ou les images pr&eacute;c&eacute;demment utilis&eacute;es. Seuls les formats de fichier image JPE, JPEG, JPG, BMP, GIF ou PNG sont pris en charge.</li>
<li><strong>Logo&nbsp;:</strong> Pour ajouter un logo sur l&apos;&eacute;cran de connexion, cliquez sur le logo existant ou le signe plus (<strong>+</strong>) si aucune image est s&eacute;lectionn&eacute;e. Vous pouvez charger une image inf&eacute;rieure &agrave; 1 Mo, choisissez parmi les images stock&eacute;es sur le DiskStation, ou choisissez une image pr&eacute;c&eacute;demment utilis&eacute;e.</li>
</ul>

</body>
</html>

