<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Notification</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Param&egrave;tres Avanc&eacute;s</h2>
<p>Vous pouvez s&eacute;lectionner les types d&apos;&eacute;v&eacute;nements qui d&eacute;clencheront le syst&egrave;me pour l&apos;envoi de messages de notification ainsi que le moyen (e-mail, SMS, mobile et programmes de messagerie instantan&eacute;e) qui recevra les messages. </p>
<p>Chacun des &eacute;v&eacute;nements a son propre message de notification par d&eacute;faut, mais vous avez &eacute;galement l&apos;option de personnaliser votre propre contenu de notification en modifiant le message de notification. Le message par d&eacute;faut peut &ecirc;tre restaur&eacute; si vous d&eacute;cidez d&apos;annuler vos param&egrave;tres personnalis&eacute;s plus tard.</p>

<ul class="disable-eds14">
<li><strong>Toutes les notifications</strong>: Comme son nom l&apos;indique, il comprend tous les types d&apos;&eacute;v&eacute;nements de notification.</li>
<li><b>Par priorit&eacute;&nbsp;:</b> Selon l&apos;importance des &eacute;v&eacute;nements de notification, ils sont filtr&eacute;s en deux groupes&nbsp;: <strong>Critique</strong> et <strong>Informatif</strong>.</li>
<ul>
<li><b>Critique</b>: Les &eacute;v&eacute;nements qui n&eacute;cessitent de prendre imm&eacute;diatement des mesures correctives appartiennent &agrave; ce groupe.</li>
<li><strong>Informatif</strong>: Les &eacute;v&eacute;nements qui ne n&eacute;cessitent pas de mesures correctives et dont le but est de vous informer du changement d&apos;&eacute;tat du syst&egrave;me appartiennent &agrave; ce groupe.</li>
</ul>
<li><b>Par cat&eacute;gorie</b>: Selon la nature des &eacute;v&eacute;nements de notification, ils sont filtr&eacute;s en six groupes&nbsp;: <strong>Syst&egrave;me</strong>, <strong>Stockage interne</strong>, <strong>Sauvegarde et restauration</strong>, <strong>Alimentation</strong>, <strong>USBCopy</strong>, <strong>CMS</strong>, et <strong>Stockage externe</strong>.</li>
<ul>
<li><b>Syst&egrave;me</b> : Les &eacute;v&eacute;nements relatifs aux erreurs ou changements du syst&egrave;me appartiennent &agrave; ce groupe.</li>
<li><strong>Stockage interne</strong>: Les &eacute;v&eacute;nements relatifs au stockage interne appartiennent &agrave; ce groupe.</li>
<li><strong>Sauvegarde et restauration</strong>: Les &eacute;v&eacute;nements relatifs aux t&acirc;ches de sauvegarde et restauration appartiennent &agrave; ce groupe.</li>
<li><strong>Alimentation</strong>: Les &eacute;v&eacute;nements relatifs &agrave; l&apos;alimentation appartiennent &agrave; ce groupe. </li>
<li><strong>USBCopy</strong>: Les &eacute;v&eacute;nements relatifs &agrave; USBCopy appartiennent &agrave; ce groupe.</li>
<li><strong>CMS</strong>: Les &eacute;v&egrave;nements relatifs &agrave; la connexion/d&eacute;connexion avec l&apos;h&ocirc;te CMS appartiennent &agrave; ce groupe.</li>
<li><strong>Stockage externe</strong>: Les &eacute;v&eacute;nements relatifs au stockage externe appartiennent &agrave; ce groupe.</li>
</ul>
</ul>

<ul class="enable-eds14">
<li><strong>Toutes les notifications</strong>: Comme son nom l&apos;indique, il comprend tous les types d&apos;&eacute;v&eacute;nements de notification.</li>
<li><b>Par priorit&eacute;&nbsp;:</b> Selon l&apos;importance des &eacute;v&eacute;nements de notification, ils sont filtr&eacute;s en deux groupes&nbsp;: <strong>Critique</strong> et <strong>Informatif</strong>.</li>
<ul>
<li><b>Critique</b>: Les &eacute;v&eacute;nements qui n&eacute;cessitent de prendre imm&eacute;diatement des mesures correctives appartiennent &agrave; ce groupe.</li>
<li><strong>Informatif</strong>: Les &eacute;v&eacute;nements qui ne n&eacute;cessitent pas de mesures correctives et dont le but est de vous informer du changement d&apos;&eacute;tat du syst&egrave;me appartiennent &agrave; ce groupe.</li>
</ul>
<li><b>Par cat&eacute;gorie</b>: Selon la nature des &eacute;v&eacute;nements de notification, ils sont filtr&eacute;s en six groupes&nbsp;: <strong>Syst&egrave;me</strong>, <strong>Stockage interne</strong>, <strong>Sauvegarde et restauration</strong>, <strong>Alimentation</strong>, et Stockage externe.</li>
<ul>
<li><b>Syst&egrave;me</b> : Les &eacute;v&eacute;nements relatifs aux erreurs ou changements du syst&egrave;me appartiennent &agrave; ce groupe.</li>
<li><strong>Sauvegarde et restauration</strong>: Les &eacute;v&eacute;nements relatifs aux t&acirc;ches de sauvegarde et restauration appartiennent &agrave; ce groupe.</li>
<li><strong>Alimentation</strong>: Les &eacute;v&eacute;nements relatifs &agrave; l&apos;alimentation appartiennent &agrave; ce groupe. </li>
<li><strong>CMS</strong>: Les &eacute;v&egrave;nements relatifs &agrave; la connexion/d&eacute;connexion avec l&apos;h&ocirc;te CMS appartiennent &agrave; ce groupe.</li>
<li><strong>Stockage externe</strong>: Les &eacute;v&eacute;nements relatifs au stockage externe appartiennent &agrave; ce groupe.</li>
</ul>
</ul>



<h4>Pour s&eacute;lectionner les types et moyens des &eacute;v&eacute;nements de notification&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez un groupe d&apos;&eacute;v&eacute;nements dans le menu d&eacute;roulant sous les onglets. Les &eacute;v&eacute;nements du groupe s&eacute;lectionn&eacute; seront affich&eacute;s.</li>
<li>Cochez la ou les cases pour chaque &eacute;v&eacute;nement individuel pour s&eacute;lectionner le moyen de notification pr&eacute;f&eacute;r&eacute;.</li>
<li>Cliquez sur <b><b>Enregistrer</b> </b>pour appliquer les param&egrave;tres.</li>
</ol>
<h4>Pour modifier le message de notification&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez un &eacute;v&eacute;nement dont vous souhaitez modifier le message de notification dans la liste des &eacute;v&eacute;nements, puis cliquez sur <b>Modifier le message</b>.</li>
<li>Dans la fen&ecirc;tre qui appara&icirc;t, saisissez la ligne de l&apos;objet et le contenu du corps pour personnaliser le message de notification, puis cliquez sur  <strong>Enregistrer</strong> pour appliquer les modifications.</li>
<li>Si vous souhaitez restaurer le message par d&eacute;faut d&apos;une notification apr&egrave;s que les modifications sont sauvegard&eacute;es, proc&eacute;dez comme suit&nbsp;:</li>
<ol>
<li>S&eacute;lectionnez un &eacute;v&eacute;nement dont vous souhaitez restaurer le message de notification aux valeurs par d&eacute;faut dans la liste des &eacute;v&eacute;nements, puis cliquez sur <b>Modifier le message</b>.</li>
<li>Dans la fen&ecirc;tre qui appara&icirc;t, cliquez sur <b>Restaurer les param&egrave;tres par d&eacute;faut</b> puis sur <strong>Oui</strong>dans la bo&icirc;te de dialogue de confirmation.</li>
</ol>
</ol>

<p><span class="note_head">Remarque&nbsp;:</span> Il est sugg&eacute;r&eacute; de conserver les segments contenant &apos;%&apos; dans la ligne de l&apos;objet et le contenu du corps. Ils seront remplac&eacute;s par les informations r&eacute;elles du syst&egrave;me quand une notification est envoy&eacute;e.</p>
</body>
</html>
