<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Mise &agrave; jour de DSM</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Mise &agrave; jour de DSM</h1>
<p>R&eacute;guli&egrave;rement, Synology sort des mises &agrave; jour gratuites pour DSM. Les mises &agrave; jour peuvent inclure de nouvelles fonctionnalit&eacute;s, l&apos;am&eacute;lioration de certaines fonctions et l&apos;am&eacute;lioration des performances.</p>
<p><span class="note_head">Important :</span> Normalement, la mise &agrave; niveau de DSM n&apos;affecte pas les donn&eacute;es sur DiskStation. Cependant, pour assurer la s&eacute;curit&eacute; des donn&eacute;es, il est fortement recommand&eacute; de sauvegarder vos donn&eacute;es avant de commencer.</p>

<h2>Faire une mise &agrave; jour manuelle de DSM</h2>
<p>Vous pouvez t&eacute;l&eacute;charger le fichier de mise &agrave; jour .pat depuis le <a href="http://www.synology.com/support/download.php" target="_blank">Centre de t&eacute;l&eacute;chargement</a> Synology et effectuer une mise &agrave; jour manuelle de DSM.</p>
<h4>Pour effectuer une mise &agrave; jour DSM manuelle&nbsp;:</h4>

<ol>
<li>Visitez <a href="http://www.synology.com" target="_blank">www.synology.com</a> pour t&eacute;l&eacute;charger la derni&egrave;re mise &agrave; jour de DSM sur votre ordinateur local. D&eacute;compresser le fichier pour obtenir un fichier de mise &agrave; niveau .pat.</li>
<li>Cliquez sur <b>Mise &agrave; jour DSM manuelle</b> pour acc&eacute;der &agrave; la page Mise &agrave; jour DSM manuelle</li>
<li>Cliquez sur <b>Parcourir</b> pour s&eacute;lectionner le fichier de mise &agrave; jour.</li>
<li>Cliquez sur <b>Appliquer</b> pour d&eacute;marrer la mise &agrave; jour de DSM. Le syst&egrave;me red&eacute;marrera automatiquement une fois la mise &agrave; jour termin&eacute;e.</li>
</ol>
<div class="section">
<h4>D&eacute;pannage&nbsp;:</h4>
<p>Si vous ne pouvez pas mettre &agrave; jour DSM, les suggestions ci-dessous vous aideront peut-&ecirc;tre &agrave; r&eacute;soudre votre probl&egrave;me&nbsp;:</p>
<ul>
<li>V&eacute;rifiez si le processus de mise &agrave; niveau a &eacute;t&eacute; interrompu par l&rsquo;utilisateur ou par tout autre &eacute;v&egrave;nement inattendu, comme par exemple une panne d&rsquo;&eacute;lectricit&eacute;.</li>
<li>V&eacute;rifiez la version de DSM. Vous ne pouvez mettre &agrave; jour le syst&egrave;me qu&apos;avec une nouvelle version de DSM.</li>
<li>T&eacute;l&eacute;charger de nouveau la mise &agrave; jour de DSM au cas o&ugrave; le fichier de mise &agrave; jour serait corrompu.</li>
</ul>
<p>Si le probl&egrave;me persiste, veuillez contacter le <a href="https://account.synology.com/support/support_form.php" target="_blank">Support technique</a> de Synology.</p>
</div>

<h2>Faire une mise &agrave; jour automatique de DSM</h2>
<p>En plus de la mise &agrave; jour manuelle, chaque fois que vous allez dans <b>Mise &agrave; jour de DSM</b>, le syst&egrave;me contacte Synology pour savoir si une nouvelle version de DSM est disponible au t&eacute;l&eacute;chargement, puis affiche les r&eacute;sultats en vert ou en rouge. Si les r&eacute;sultats indiquent que la derni&egrave;re version de DSM est disponible au t&eacute;l&eacute;chargement, vous pouvez demander au syst&egrave;me de t&eacute;l&eacute;charger cette version pour vous, puis effectuer la mise &agrave; jour.</p>
<h4>Pour que le syst&egrave;me t&eacute;l&eacute;charge le dernier DSM et effectue la mise &agrave; jour&nbsp;:</h4>
<ol>
<li>Si le dernier DSM est pr&ecirc;t pour &ecirc;tre t&eacute;l&eacute;charg&eacute;, cliquez sur le lien <b>T&eacute;l&eacute;charger</b> pour que le syst&egrave;me t&eacute;l&eacute;charge le dernier DSM pour vous.</li>
<li>Le syst&egrave;me affiche l&rsquo;une des notifications de bureau ci-dessous pour vous dire si le t&eacute;l&eacute;chargement est r&eacute;ussi ou non&nbsp;: <b>T&eacute;l&eacute;chargement de DSM termin&eacute;</b> ou <b>&Eacute;chec du t&eacute;l&eacute;chargement de DSM</b>.</li>
<li>Cliquez sur la notification de bureau pour aller &agrave; <b>Mise &agrave; jour de DSM</b>.</li>
<li>Proc&eacute;dez de l&apos;une des mani&egrave;res suivantes&nbsp;:<ul>
<li>Si le t&eacute;l&eacute;chargement de DSM est termin&eacute;, cliquez sur <b>Mettre &agrave; jour maintenant</b> pour commencer &agrave; mettre &agrave; jour DSM imm&eacute;diatement.</li>
<li>Si le t&eacute;l&eacute;chargement de DSM a &eacute;chou&eacute;, cliquez sur <b>R&eacute;essayer</b> pour que le syst&egrave;me t&eacute;l&eacute;charge &agrave; nouveau le dernier DSM depuis Synology.</li>
</ul>
</li>
</ol>
<h4>Pour v&eacute;rifier les mises &agrave; jour r&eacute;guli&egrave;rement&nbsp;:</h4>
<ol>
<li>Cochez <b>Rechercher les mises &agrave; jour pour DSM automatiquement</b>.</li>
<li>S&eacute;lectionnez un plan de mise &agrave; jour et configurez le <b>Calendrier d&apos;installation</b></li>
<li>Cliquez sur <b>OK</b>.</li>
</ol>
<p>Une notification bureau s&apos;affichera lorsqu&apos;une mise &agrave; jour DSM est t&eacute;l&eacute;charg&eacute;e et pr&ecirc;te &agrave; &ecirc;tre install&eacute;e. Pour arr&ecirc;ter que DSM fasse des mises &agrave; jour automatiquement, vous pouvez l&apos;annuler dans la notification bureau ou en modifiant les <strong>Param&egrave;tres de mise &agrave; jour</strong>. Les mises &agrave; jour de DSM seront install&eacute;es avant l&apos;arr&ecirc;t programm&eacute; si vous avez activ&eacute; <strong>Arr&ecirc;ter</strong> dans <strong>Planification de l&apos;alimentation</strong>.</p>

<div class="section">
<h4>D&eacute;pannage&nbsp;:</h4>
<p>Si vous voyez des messages d&rsquo;erreur (en rouge) lors de la v&eacute;rification ou du t&eacute;l&eacute;chargement de la derni&egrave;re version de DSM, les suggestions ci-dessous vous aideront peut-&ecirc;tre &agrave; r&eacute;soudre votre probl&egrave;me&nbsp;:</p>
<ul>
<li>V&eacute;rifiez que votre DiskStation est connect&eacute; &agrave; Internet.</li>
<li>Le serveur de t&eacute;l&eacute;chargement de Synology doit &ecirc;tre occup&eacute;. R&eacute;essayer de t&eacute;l&eacute;charger plus tard pourrait solutionner le probl&egrave;me.</li>
</ul>
<p>Si le probl&egrave;me persiste, veuillez contacter le <a href="https://account.synology.com/support/support_form.php" target="_blank">Support technique</a> de Synology.</p>
</div>

</body>
</html>
