<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Služba indexov&aacute;n&iacute; m&eacute;di&iacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Nastaven&iacute; převodu form&aacute;tu</h2>
<p>Po odesl&aacute;n&iacute; fotografi&iacute; a&nbsp;vide&iacute;, kter&aacute; maj&iacute; b&yacute;t přehr&aacute;v&aacute;na pomoc&iacute; medi&aacute;ln&iacute;ho serveru nebo služby Photo&nbsp;Station, budou vytvořeny miniatury umožňuj&iacute;c&iacute; pohodlněj&scaron;&iacute; proch&aacute;zen&iacute;. Můžete nastavit kvalitu miniatur a&nbsp;sledovat průběh převodu form&aacute;tu.</p>
<p>Pokud chcete mezit&iacute;m sledovat videa uložen&aacute; ve sd&iacute;len&eacute; složce <strong>photo</strong> Photo&nbsp;Station pomoc&iacute; mobiln&iacute;ho zař&iacute;zen&iacute;, můžete povolit funkci převodu form&aacute;tu videa a&nbsp;z&aacute;roveň sledovat průběh převodu.</p>
<h4>Postup nastaven&iacute; kvality miniatur:</h4>
<ol>
<li>
Vyberte z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky typ kvality.
</li>
<li>
Klikněte na možnost <b>Použ&iacute;t</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Pozn&aacute;mka: </span>
<ul>
<li>Vytv&aacute;řen&iacute; miniatur s&nbsp;vysokou kvalitou bude trvat d&eacute;le.</li>
</ul>
</div>
<h4>Postup povolen&iacute; funkce převodu form&aacute;tu videa na mobiln&iacute;ch zař&iacute;zen&iacute;ch:</h4>
<ol>
<li>Za&scaron;krtněte možnost <strong>Povolit převod k&oacute;du videa pro mobiln&iacute; zař&iacute;zen&iacute;</strong>.</li>
<li>Klikněte na možnost <strong>Použ&iacute;t</strong>. Pot&eacute; můžete videa sledovat na mobiln&iacute;m zař&iacute;zen&iacute;, ať jste kdekoli.
</li>
</ol>

<div class="section">
<span class="note_head">Pozn&aacute;mka: </span>
<ul>
<li>Na form&aacute;t kompatibiln&iacute; s&nbsp;mobiln&iacute;mi zař&iacute;zen&iacute;mi lze přev&eacute;st pouze videa odeslan&aacute; do sd&iacute;len&eacute; složky <strong>photo</strong> aplikace Photo Station.</li>
<li>Nelze přev&aacute;dět soubory typu MP4.</li>
</ul>
</div>
<h4>Postup sledov&aacute;n&iacute; průběhu převodu form&aacute;tu fotografi&iacute;/vide&iacute;:</h4>
<ol>
<li>Při odes&iacute;l&aacute;n&iacute; fotografi&iacute; nebo vide&iacute; na zař&iacute;zen&iacute; DiskStation klikněte na ikonu <strong>Průběh přev&aacute;děn&iacute;</strong> zobrazenou v&nbsp;prav&eacute;m horn&iacute;m rohu hlavn&iacute;ho panelu. </li>
<li>
V&nbsp;zobrazen&eacute;m okně proveďte někter&yacute; z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch kroků:
</li>
<ul>
<li>
V&nbsp;č&aacute;sti <b>Průběh přev&aacute;děn&iacute;</b> můžete na pozad&iacute; sledovat průběh a&nbsp;stav vytv&aacute;řen&iacute; miniatur.
</li>
<li>
Průběh převodu form&aacute;tu můžete pozastavit n&aacute;sleduj&iacute;c&iacute;m způsobem:
</li>
<ol>
<li>
Z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky vyberte možnost <b>Odložit o&nbsp;[počet] hod</b>. Průběh pozastav&iacute;te kliknut&iacute;m na možnost <b>Pozastavit</b>. (Zvolen&eacute; v&yacute;choz&iacute; nastaven&iacute; je <b>Odložit o&nbsp;1 hod</b>.)
</li>
<li>Průběh převodu form&aacute;tu bude pokračovat po nastaven&eacute; době; proces můžete tak&eacute; obnovit okamžitě kliknut&iacute;m na možnost <b>Pokračovat</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Pozn&aacute;mka: </span>
<ul>
<li>Vzhledem k&nbsp;tomu, že průběh převodu form&aacute;tu zatěžuje procesor, můžete pozastaven&iacute;m procesu uvolnit syst&eacute;mov&eacute; prostředky pro dal&scaron;&iacute; prob&iacute;haj&iacute;c&iacute; &uacute;lohy.</li>
</ul>
</div>
</ul>
<li>
Po dokončen&iacute; procesu konverze ikona hlavn&iacute;ho panelu zmiz&iacute;.
</li>
</ol>

<div class="section">
<span class="note_head">Pozn&aacute;mka: </span>
<ul>
<li>N&aacute;stroj Photo Station Uploader nab&iacute;z&iacute; vy&scaron;&scaron;&iacute; v&yacute;kon při vytv&aacute;řen&iacute; miniatur. Pokud tedy chcete odes&iacute;lat vet&scaron;&iacute; počet fotografi&iacute;/vide&iacute; do knihovny Photo Station, doporučujeme v&aacute;m, abyste použili pr&aacute;vě n&aacute;stroj Photo Station Uploader.</li>
</ul>
</div>

</body>
</html>