<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Databáze multimédií</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Syst&eacute;mov&aacute; datab&aacute;ze</h1>
<p> Zař&iacute;zen&iacute; DiskStation využ&iacute;v&aacute; syst&eacute;movou datab&aacute;zi pro vytv&aacute;řen&iacute; přehledů o&nbsp;datech bal&iacute;čků a&nbsp;z&aacute;znamech syst&eacute;mov&yacute;ch protokolů uložen&yacute;ch ve sd&iacute;len&yacute;ch složk&aacute;ch vytvořen&yacute;ch na extern&iacute;ch &uacute;ložn&yacute;ch zař&iacute;zen&iacute;ch, jako je např&iacute;klad <b>usbshare1</b>.</p>
<p> <span class="note_head">Důležit&eacute; upozorněn&iacute;: </span>Chcete-li z&iacute;skat př&iacute;stup k&nbsp;datům bal&iacute;čků na extern&iacute;ch &uacute;ložn&yacute;ch zař&iacute;zen&iacute;ch připojen&yacute;ch k&nbsp;zař&iacute;zen&iacute; DiskStation, nebo pokud chcete zobrazit z&aacute;znamy protokolů syst&eacute;mu DSM v&nbsp;č&aacute;sti <b>Hlavn&iacute; nab&iacute;dka</b> &gt; <strong>Centrum protokolů</strong>, je nutn&eacute; datab&aacute;zi nejdř&iacute;ve povolit. V&nbsp;opačn&eacute;m př&iacute;padě budou v&scaron;echny souvisej&iacute;c&iacute; služby nepř&iacute;stupn&eacute;. </p>
<h4>Postup povolen&iacute; syst&eacute;mov&eacute; datab&aacute;ze:</h4>
<ol>
  <li> Za&scaron;krtněte možnost <b>Povolit syst&eacute;movou datab&aacute;zi</b>. </li>
  <li> Proveďte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch akc&iacute;:
    <ul>
      <li> Pokud chcete, aby syst&eacute;m DSM automaticky vybral sd&iacute;lenou složku pro uložen&iacute; syst&eacute;mov&eacute; datab&aacute;ze, vyberte možnost <b>Automatick&aacute; konfigurace</b>. Pokud bude extern&iacute; &uacute;loži&scaron;tě obsahuj&iacute;c&iacute; sd&iacute;lenou složku odebr&aacute;no, syst&eacute;m DSM automaticky vybere jinou sd&iacute;lenou složku. </li>
      <li> Vyberte možnost <b>Přesuňte aktuální databázi do vybrané sdílené složky</b> a&nbsp;pot&eacute; vyberte z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky možnost přesunut&iacute; aktu&aacute;ln&iacute; datab&aacute;ze do jin&eacute; sd&iacute;len&eacute; složky vytvořen&eacute; na extern&iacute;m zař&iacute;zen&iacute;. </li>
      <li>Zvolte možnost <strong>Vybrat jednu ze st&aacute;vaj&iacute;c&iacute;ch datab&aacute;z&iacute;</strong> a&nbsp;pot&eacute; vyberte z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky možnost v&yacute;běru st&aacute;vaj&iacute;c&iacute; datab&aacute;ze, pokud je k&nbsp;dispozici v&iacute;ce než jedno extern&iacute; zař&iacute;zen&iacute; připojen&eacute; k&nbsp;zař&iacute;zen&iacute; DiskStation.</li>
    </ul>
  </li>
  <li> Klikněte na možnost <b>Použ&iacute;t</b>. </li>
</ol>
<p> <span class="note_head">Upozorněn&iacute;: </span>Chcete-li zabr&aacute;nit po&scaron;kozen&iacute; datab&aacute;ze, přesvědčte se je&scaron;tě před připojen&iacute;m zař&iacute;zen&iacute; DiskStation, zda jste &uacute;ložn&eacute; zař&iacute;zen&iacute; odpojili v&nbsp;č&aacute;sti <b>Hlavn&iacute; nab&iacute;dka</b> &gt; <b>Ovl&aacute;dac&iacute; panel</b> &gt; <strong>Externí zařízení</strong><strong> </strong>&gt; <strong>Externí zařízení</strong> nebo kliknut&iacute;m na ikonu extern&iacute;ch zař&iacute;zen&iacute; v&nbsp;prav&eacute;m horn&iacute;m rohu. </p>
</body>
</html>
