<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Na t&eacute;to str&aacute;nce jsou zobrazeny možnosti spr&aacute;vy adapt&eacute;rů Bluetooth a&nbsp;připojen&iacute; zař&iacute;zen&iacute; Bluetooth na zař&iacute;zen&iacute; DiskStation. Po připojen&iacute; lze někter&aacute; zař&iacute;zen&iacute; Bluetooth, jako jsou reproduktory nebo sluch&aacute;tka, použ&iacute;t jako zvukov&yacute; v&yacute;stup pro Audio Station. T&iacute;m je umožněn snadn&yacute; poslech hudby uložen&iacute; na zař&iacute;zen&iacute; DiskStation.</p>
<h2>Zač&iacute;n&aacute;me</h2>
<p>Připojte adapt&eacute;r&nbsp;USB Bluetooth k&nbsp;portu&nbsp;USB na zař&iacute;zen&iacute; DiskStation. V&nbsp;lev&eacute; č&aacute;sti hlavn&iacute; str&aacute;nky Bluetooth je zobrazen seznam adapt&eacute;rů Bluetooth. V&nbsp;prav&eacute; č&aacute;sti jsou zobrazeny informace a&nbsp;možnosti t&yacute;kaj&iacute;c&iacute; se zař&iacute;zen&iacute; Bluetooth.</p>
<h4>Povolen&iacute; nebo zak&aacute;z&aacute;n&iacute; adapt&eacute;rů Bluetooth:</h4>
<ol>
<li>Vyberte adapt&eacute;r Bluetooth.</li>
<li>Klepněte na možnost <strong>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</strong>.</li>
<li>Za&scaron;krtněte pol&iacute;čko <strong>Povolit Bluetooth</strong>.</li>
<li>Nastaven&iacute; ulož&iacute;te klepnut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>
<h2>Spr&aacute;va zař&iacute;zen&iacute; Bluetooth</h2>
<p>Pokud se připojujete k&nbsp;nov&eacute;mu zař&iacute;zen&iacute; Bluetooth, přesvědčte se, zda je toto zař&iacute;zen&iacute; viditeln&eacute;, zda je v&nbsp;dosahu 10&nbsp;metrů od zař&iacute;zen&iacute; DiskStation a&nbsp;použ&iacute;v&aacute; profil A2DP (Advanced Audio Distribution Profile). Dal&scaron;&iacute; podrobnosti t&yacute;kaj&iacute;c&iacute; se nastaven&iacute; naleznete v&nbsp;uživatelsk&eacute; př&iacute;ručce zař&iacute;zen&iacute; Bluetooth.</p>
<h4>Připojen&iacute; k&nbsp;zař&iacute;zen&iacute; Bluetooth:</h4>
<ol>
<li>Na hlavn&iacute; str&aacute;nce <strong>Bluetooth</strong> vyberte zař&iacute;zen&iacute; Bluetooth, kter&eacute; chcete připojit k&nbsp;zař&iacute;zen&iacute; DiskStation. Pokud zař&iacute;zen&iacute; nebude zobrazeno, zkuste zař&iacute;zen&iacute; v&nbsp;okol&iacute; vyhledat klepnut&iacute;m na tlač&iacute;tko <strong>Aktualizovat</strong>.</li>
<li>Až bude zař&iacute;zen&iacute; zobrazeno, vyberte jej.</li>
<li>Klepněte na možnost <strong>Připojit</strong>.</li>
<li>V&nbsp;př&iacute;padě potřeby zadejte PIN zař&iacute;zen&iacute;.</li>
</ol>
<h4>Zobrazen&iacute; informac&iacute; o&nbsp;zař&iacute;zen&iacute; Bluetooth:</h4>
<ol>
<li>Vyberte připojen&iacute; zař&iacute;zen&iacute; Bluetooth.</li>
<li>Klepněte na možnost <strong>Informace</strong>.</li>
<li>Zobraz&iacute; se okno s&nbsp;informacemi, jako je adresa Bluetooth, n&aacute;zev, typ a&nbsp;stav.</li>
</ol>
<h4>Odebr&aacute;n&iacute; zař&iacute;zen&iacute; Bluetooth:</h4>
<ol>
<li>Vyberte zař&iacute;zen&iacute; Bluetooth, kter&eacute; již nechce použ&iacute;vat na zař&iacute;zen&iacute; DiskStation.</li>
<li>Klepněte na možnost <strong>Odebrat</strong>.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Při přehr&aacute;v&aacute;n&iacute; hudby pomoc&iacute; reproduktorů nebo sluch&aacute;tek Bluetooth může doch&aacute;zet k&nbsp;probl&eacute;mům s&nbsp;přehr&aacute;v&aacute;n&iacute;m, pokud byla změněna nastaven&iacute; adapt&eacute;ru Bluetooth nebo připojujete př&iacute;li&scaron; velk&yacute; počet zař&iacute;zen&iacute; Bluetooth současně.</li>
<li>V&nbsp;př&iacute;padě, že reproduktory, kter&eacute; byly dosud připojeny k&nbsp;zař&iacute;zen&iacute; DiskStation, připoj&iacute;te později k&nbsp;jin&eacute;mu zař&iacute;zen&iacute; DiskStation (nebo přehr&aacute;vači hudby Bluetooth), mohou reproduktory v&nbsp;z&aacute;vislosti na zař&iacute;zen&iacute; zapomenout připojen&iacute; ke konkr&eacute;tn&iacute;mu zař&iacute;zen&iacute; DiskStation. V&nbsp;takov&eacute;m př&iacute;padě dojde při přehr&aacute;v&aacute;n&iacute; hudby pomoc&iacute; reproduktorů k&nbsp;chybě. Chcete-li vyře&scaron;it tento probl&eacute;m, reproduktory odpojte a&nbsp;zkuste je připojit znovu.</li>
</ul>

</div>
</body>
</html>
