<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DDNS</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="UTF-8">
</head>
<body>
<h2>DDNS</h2>
<p>Služba DDNS (Dynamic Domain Name Service) nab&iacute;z&iacute; jednodu&scaron;&scaron;&iacute; připojen&iacute; k&nbsp;zař&iacute;zen&iacute; DiskStation přes Internet, a&nbsp;to prostřednictv&iacute;m mapov&aacute;n&iacute; n&aacute;zvu hostitele k&nbsp;IP&nbsp;adrese. Služba DDNS umožňuje např&iacute;klad př&iacute;stup k&nbsp;zař&iacute;zen&iacute; DiskStation pomoc&iacute; n&aacute;zvu dom&eacute;ny (např.&nbsp;<i>www.john.synology.me</i>), bez nutnosti pamatovat si IP&nbsp;adresu (např.&nbsp;<i>172.16.254.1</i>).</p>

<h3>Nastaven&iacute; DDNS</h3>
<p>Můžete přiřadit existuj&iacute;c&iacute; n&aacute;zev hostitele k&nbsp;IP&nbsp;adrese zař&iacute;zen&iacute; DiskStation nebo zaregistrovat novou adresu poskytnutou společnost&iacute; Synology nebo několika dal&scaron;&iacute;mi poskytovateli služby DDNS. Dal&scaron;&iacute; podrobnosti t&yacute;kaj&iacute;c&iacute; se registrace n&aacute;zvů hostitele v&aacute;m sděl&iacute; jednotliv&iacute; poskytovatel&eacute;.</p>



<h4>Nastaven&iacute; n&aacute;zvu hostitele DDNS:</h4>
<ol>
<li>Klikněte na tlač&iacute;tko <b>Přidat</b>.</li>
<li>Zobraz&iacute; se dialogov&eacute; okno, ve kter&eacute;m je nutn&eacute; upravit n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:<ul>
<li><strong>Poskytovatel služeb:</strong> Vyberte poskytovatele služeb. Chcete-li zaregistrovat bezplatn&yacute; n&aacute;zev hostitele od společnosti Synology, vyberte z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky možnost <b>Synology</b>, klepněte na možnost <b>Zaregistrovat</b> a&nbsp;zadejte př&iacute;slu&scaron;n&eacute; &uacute;daje.</li>
<li><strong>N&aacute;zev hostitele:</strong> Zadejte registrovan&yacute; n&aacute;zev hostitele DDNS, např.&nbsp;<i>john.synology.me</i>.</li>
<li><strong>Uživatelsk&eacute; jm&eacute;no:</strong> Zadejte uživatelsk&eacute; jm&eacute;no poskytovatele DDNS.</li>
<li><strong>Heslo:</strong> Zadejte heslo poskytovatele DDNS.</li>
<li><strong>Extern&iacute; adresa:</strong> Zadejte extern&iacute; IP&nbsp;adresu zař&iacute;zen&iacute; DiskStation, kter&eacute; bude použ&iacute;vat n&aacute;zev hostitele.</li>
<li><strong>Připojen&iacute; prezenčn&iacute;ho sign&aacute;lu:</strong> Na z&aacute;kladě t&eacute;to možnosti můžete přij&iacute;mat upozorněn&iacute; t&yacute;kaj&iacute;c&iacute; se stavu namalovan&eacute;ho n&aacute;zvu hostitele (plat&iacute; pouze pro n&aacute;zvy hostitele poskytovan&eacute; společnost&iacute; Synology).</li>
</ul>
</li>
<li>Klepnut&iacute;m na možnost <strong>Vyzkou&scaron;et připojen&iacute;</strong> zjist&iacute;te, zda byla nastaven&iacute; provedena spr&aacute;vně.</li>
<li>Postup dokončete klepnut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>

<p>Po dokončen&iacute; nastaven&iacute; z&iacute;sk&aacute;te př&iacute;stup k&nbsp;zař&iacute;zen&iacute; DiskStation přes Internet zad&aacute;n&iacute;m n&aacute;zvu hostitele DDNS do webov&eacute;ho prohl&iacute;žeče.</p>
<div class="section">
<h4>Požadavky a&nbsp;omezen&iacute;</h4>
<ul> 
<li>Servery poskytovatele služeb DDNS funguj&iacute;.</li>
<li>Zař&iacute;zen&iacute; DiskStation se může připojit k&nbsp;Internetu.</li>
<li>DDNS funguje pouze v s&iacute;ťov&eacute;m prostřed&iacute;, ve kter&eacute;m nen&iacute; vyžadov&aacute;n server proxy.</li>
<li>Pro jednotliv&eacute; poskytovatele DDNS lze zadat pouze jeden n&aacute;zev hostitele.</li>

</ul>
</div>

<h3>Spr&aacute;va n&aacute;zvů hostitele</h3>
<p>Pomoc&iacute; těchto tlač&iacute;tek můžete prov&aacute;dět spr&aacute;vu existuj&iacute;c&iacute;ch n&aacute;zvů hostitele:</p>
<ul>
<li><strong>Odstranit:</strong> Odebere vybran&yacute; n&aacute;zev hostitele ze seznamu.</li>
<li><strong>Upravit:</strong> Změn&iacute; nastaven&iacute; vybran&eacute;ho n&aacute;zvu hostitele.</li>
<li><strong>Aktualizovat:</strong> Aktualizuje stav v&scaron;ech n&aacute;zvů hostitele, kteř&iacute; maj&iacute; povolenou službu DDNS.</li></ul>

<h3>Nastaven&iacute; vlastn&iacute;ho poskytovatele DDNS.</h3>
<p>Můžete přidat vlastn&iacute;ho poskytovatele DDNS, pokud se v&aacute;s poskytovatel již neobjevuje v seznamu poskytovatelů služeb.</p>
<h4>Nastaven&iacute; vlastn&iacute;ho poskytovatele DDNS:</h4>
<ol>
<li>Klepněte na možnost <b>Nastavit</b>.</li>
<li>Zobraz&iacute; se dialogov&eacute; okno, ve kter&eacute;m je nutn&eacute; zadat n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:<ul>
    <li><strong>Poskytovatel služeb:</strong> Zadejte n&aacute;zev vlastn&iacute;ho poskytovatele služeb.</li>
    <li><strong>Uveďte URL:</strong> Zadejte URL vlastn&iacute;ho poskytovatele služeb.</li>
  </ul>
</li>
<li>Klikněte na <strong>Uložit</strong> k přid&aacute;n&iacute; vlastn&iacute;ho poskytovatele služeb do seznamu poskytovatelů služby DDNS.</li>
</ol>
<div class="section">
<h4>Požadavky a&nbsp;omezen&iacute;</h4>
<ul>
  <li>Zadan&aacute; URL mus&iacute; dodržovat protokol stanoven&yacute; va&scaron;&iacute;m poskytovatelem služeb. Tato URL se použ&iacute;v&aacute; k aktualizaci IP informac&iacute; pro server DDNS va&scaron;eho poskytovatele.</li>
  <li>Zadan&aacute; URL obecně obsahuje čtyři n&iacute;že uveden&eacute; parametry. Při zad&aacute;v&aacute;n&iacute; URL nahraďte n&aacute;sleduj&iacute;c&iacute; parametry odpov&iacute;daj&iacute;c&iacute; proměnnou.</li>
  <ul>
    <li>Uživatelsk&eacute; jm&eacute;no: __USERNAME__</li>
    <li>Heslo: __PASSWORD__</li>
    <li>N&aacute;zev hostitele: __HOSTNAME__</li>
    <li>Extern&iacute; adresa: __MYIP__</li>
  </ul>
<li>Zadan&aacute; URL nemůže obsahovat mezery nebo středn&iacute;ky.</li>
</ul>
</div>
</body>
</html>
