<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Automatick&yacute; blok</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Automatick&yacute; blok</h2>

<p>Automatick&yacute; blok zabraňuje neopr&aacute;vněn&eacute;mu přihl&aacute;&scaron;en&iacute;. Je-li tato služba povolena, IP adresy s př&iacute;li&scaron; velk&yacute;m množstv&iacute;m ne&uacute;spě&scaron;n&yacute;ch pokusů o přihl&aacute;&scaron;en&iacute; budou blokov&aacute;ny. Lze tak&eacute; zařadit ne&uacute;spě&scaron;n&eacute; pokusy o&nbsp;přihl&aacute;&scaron;en&iacute; přes protokoly SSH, Telnet, rsync, S&iacute;ťova z&aacute;loha, Synchronizace sd&iacute;len&yacute;ch složek, FTP, WebDAV, mobiln&iacute; aplikace Synology, File Station nebo DSM. Můžete si tak&eacute; vytvořit Seznam povolen&yacute;ch položek, kde budou zařazeny IP&nbsp;adresy, kter&eacute; nebudou nikdy blokov&aacute;ny.</p>

<h4>Nastaven&iacute; automatick&eacute;ho bloku:</h4>
<ol>
<li>Přejděte na kartu <strong>Obecn&eacute;</strong> a&nbsp;za&scaron;krtněte možnost <b>Povolit automatick&yacute; blok</b>.</li>
<li>Zadejte hodnoty pro položky <b>Pokusy o přihl&aacute;&scaron;en&iacute;</b> a <b>Během (minuty)</b>. IP adresa bude blokov&aacute;na po nastaven&eacute;m počtu ne&uacute;spě&scaron;n&yacute;ch pokusů o přihl&aacute;&scaron;en&iacute; během určit&eacute;ho počtu minut.</li>
<li>Za&scaron;krtněte možnost <b>Povolit vypr&scaron;en&iacute; platnosti blokov&aacute;n&iacute;</b> a zadejte počet dn&iacute;, po jejichž uplynut&iacute; bude blokov&aacute;n&iacute; IP adresy zru&scaron;eno.  Pokud nen&iacute; možnost <b>Odblokovat po (dny)</b> vybr&aacute;na nebo je nastavena na hodnotu 0, zůstanou blokovan&eacute; IP&nbsp;adresy na tomto seznamu do doby, než je ručně neodstran&iacute;te</li>

<li>Klepněte na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<h4>Přid&aacute;n&iacute; blokovan&eacute; adresy:</h4>
<p>Klepněte na kartu <strong>Seznam blokov&aacute;n&iacute;</strong> a&nbsp;z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky <strong>Vytvořit</strong> vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:</p>
<ul>
<li><strong>Přidat IP&nbsp;adresu</strong></li>
<p>Zadejte IP&nbsp;adresu a&nbsp;nastavte dobu platnosti.<p/>
<li><strong>Importovat seznam IP&nbsp;adres</strong></li>
<p>Importujte textov&yacute; soubor se seznamem IP&nbsp;adres, kter&yacute; umožňuje zadat současně vět&scaron;&iacute; počet IP&nbsp;adres a&nbsp;dobu platnosti. Chcete-li přepsat st&aacute;vaj&iacute;c&iacute; IP&nbsp;adresy, za&scaron;krtněte př&iacute;slu&scaron;n&eacute; pol&iacute;čko. Pokud nen&iacute; tato možnost vybr&aacute;na, budou duplicitn&iacute; IP&nbsp;adresy vynech&aacute;ny.</p>
<p>Chcete-li importovat soubor, mus&iacute; splňovat n&aacute;sleduj&iacute;c&iacute; krit&eacute;ria:</p>
<ul>
<li>Soubor mus&iacute; m&iacute;t form&aacute;t prost&eacute;ho textu.</li>
<li>Každ&yacute; ř&aacute;dek souboru může obsahovat pouze jednu IP&nbsp;adresu.</li>
<li>Ř&aacute;dek koment&aacute;ře zač&iacute;n&aacute; symbolem #&nbsp;(znak libry).</li>
<p>Pokud je vybran&yacute; soubor ve spr&aacute;vn&eacute;m form&aacute;tu, budou v&scaron;echny IP&nbsp;adresy zobrazeny v&nbsp;oblasti n&aacute;hledu. Import potvrďte klepnut&iacute;m na možnost <strong>OK</strong>.</p>
</ul>
</ul>

<h4>Odebr&aacute;n&iacute; blokovan&yacute;ch IP&nbsp;adres:</h4>
<ol>
<li>
Klepnut&iacute;m na kartu <b>Seznam blokov&aacute;n&iacute;</b> zobraz&iacute;te seznam zablokovan&yacute;ch IP&nbsp;adres.
</li>
<li>
Vyberte IP&nbsp;adresy, kter&eacute; chcete odebrat ze seznamu, a&nbsp;klepněte na možnost <b>Odebrat</b>.
</li>
</ol>


<h4>Přid&aacute;n&iacute; povolen&yacute;ch IP&nbsp;adres:</h4>
<p>Klepněte na kartu <strong>Seznam povolen&yacute;ch</strong> a&nbsp;z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky <strong>Vytvořit</strong> vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:</p>
<ul>
<li><strong>Přidat IP&nbsp;adresu</strong></li>
<p>Zadejte IP adresu.<p/>
<li><strong>Importovat seznam IP&nbsp;adres</strong></li>
<p>Importujte textov&yacute; soubor se seznamem IP&nbsp;adres, kter&yacute; umožňuje zadat vět&scaron;&iacute; počet IP&nbsp;adres. Chcete-li přepsat st&aacute;vaj&iacute;c&iacute; IP&nbsp;adresy, za&scaron;krtněte př&iacute;slu&scaron;n&eacute; pol&iacute;čko. Pokud nen&iacute; tato možnost vybr&aacute;na, budou duplicitn&iacute; adresy vynech&aacute;ny.</p>
<p>Chcete-li importovat soubor, mus&iacute; splňovat n&aacute;sleduj&iacute;c&iacute; krit&eacute;ria:</p>
<ul>
<li>Soubor mus&iacute; m&iacute;t form&aacute;t prost&eacute;ho textu.</li>
<li>Každ&yacute; ř&aacute;dek souboru může obsahovat pouze jednu IP&nbsp;adresu.</li>
<li>Ř&aacute;dek koment&aacute;ře zač&iacute;n&aacute; symbolem #&nbsp;(znak libry).</li>
<p>Pokud je vybran&yacute; soubor ve spr&aacute;vn&eacute;m form&aacute;tu, budou v&scaron;echny IP&nbsp;adresy zobrazeny v&nbsp;oblasti n&aacute;hledu. Import potvrďte klepnut&iacute;m na možnost <strong>OK</strong>.</p>
</ul>
</ul>

<h4>Odebr&aacute;n&iacute; povolen&yacute;ch IP&nbsp;adres:</h4>
<ol>
<li>
Klepnut&iacute;m na kartu <b>Seznam povolen&yacute;ch</b> zobraz&iacute;te seznam povolen&yacute;ch IP&nbsp;adres.
</li>
<li>
Vyberte IP&nbsp;adresy, kter&eacute; chcete odebrat ze seznamu, a&nbsp;klepněte na možnost <b>Odebrat</b>. </li>
</ol>


</body>
</html>
