
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Mobiln&iacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="utf-8">
</head>
<body>


<h2><a name="usbmodem"></a>Mobiln&iacute; př&iacute;stup*</h2>

<p>Pokud je zař&iacute;zen&iacute; DiskStation vybaveno hardwarov&yacute;m kl&iacute;čem mobiln&iacute;ho &scaron;irokop&aacute;smov&eacute;ho připojen&iacute;, lze je připojit k&nbsp;internetu přes bezdr&aacute;tovou s&iacute;ť nebo s&iacute;tě&nbsp;3G/LTE. Nastaven&iacute; v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>S&iacute;ť</strong> &gt; <strong>S&iacute;ťov&eacute; rozhran&iacute;</strong> &gt; <strong>Mobiln&iacute; př&iacute;stup</strong> v&aacute;m pomohou s&nbsp;vytvořen&iacute;m a&nbsp;&uacute;pravou bezdr&aacute;tov&eacute;ho připojen&iacute; k&nbsp;internetu prostřednictv&iacute;m hardwarov&eacute;ho kl&iacute;če mobiln&iacute;ho &scaron;irokop&aacute;smov&eacute;ho připojen&iacute;.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Kompletn&iacute; seznam podporovan&yacute;ch hardwarov&yacute;ch kl&iacute;čů mobiln&iacute;ho &scaron;irokop&aacute;smov&eacute;ho připojen&iacute; najdete na str&aacute;nk&aacute;ch <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</p>
</div>

<h4>Postup nastaven&iacute; mobiln&iacute; s&iacute;tě:</h4>
<p>Pokud je hardwarov&yacute; kl&iacute;č mobiln&iacute;ho &scaron;irokop&aacute;smov&eacute;ho připojen&iacute; připojen k&nbsp;portům&nbsp;USB zař&iacute;zen&iacute; DiskStation, bude se toto zař&iacute;zen&iacute; DiskStation připojovat automaticky. Pokud nelze připojen&iacute; nav&aacute;zat automaticky, nebo chcete změnit nastaven&iacute; připojen&iacute;, proveďte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch akc&iacute;: </p>

<ul>
<li><b>Odemknout&nbsp;SIM/Nastaven&iacute; SIM:</b> Pokud je SIM&nbsp;karta chr&aacute;něna PIN&nbsp;k&oacute;dem, je nutn&eacute; ji před připojen&iacute;m zař&iacute;zen&iacute; DiskStation k&nbsp;s&iacute;ti odemknout. Po odblokov&aacute;n&iacute; můžete v&nbsp;t&eacute;to č&aacute;sti změnit nastaven&iacute; PIN&nbsp;k&oacute;du.</li>

<li><b>Upravit:</b> Můžete prov&eacute;st ručn&iacute; &uacute;pravu připojen&iacute; nebo vybrat připojen&iacute; podle um&iacute;stěn&iacute; a&nbsp;oper&aacute;tora. Ručn&iacute; nastaven&iacute; vyžaduje zad&aacute;n&iacute; n&aacute;zvu př&iacute;stupov&eacute;ho bodu&nbsp;APN, telefonn&iacute;ho č&iacute;sla, uživatelsk&eacute;ho jm&eacute;na a&nbsp;hesla. Pokud tyto informace nem&aacute;te k&nbsp;dispozici, obraťte se na sv&eacute;ho mobiln&iacute;ho oper&aacute;tora.</li>

<li><b>Připojit/Odpojit:</b> Tato tlač&iacute;tka umožňuj&iacute; připojen&iacute; nebo odpojen&iacute; zař&iacute;zen&iacute; DiskStation ze s&iacute;tě&nbsp;3G/LTE.</li>
<li><b>Možnosti:</b> Tato č&aacute;st obsahuje možnost nastaven&iacute; rozhran&iacute; hardwarov&eacute;ho kl&iacute;če pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute; připojen&iacute; jako v&yacute;choz&iacute; br&aacute;ny zař&iacute;zen&iacute; DiskStation. Pokud nastav&iacute;te mobiln&iacute; s&iacute;ť jako v&yacute;choz&iacute; br&aacute;nu, bude internetov&yacute; přenos zař&iacute;zen&iacute; DiskStation uskutečňov&aacute;n nam&iacute;sto přes dr&aacute;tovou s&iacute;ť prostřednictv&iacute;m mobiln&iacute; s&iacute;tě. </li>
</ul>
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ol>
<li>Pokud jste připojeni k&nbsp;internetu, někter&eacute; hardwarov&eacute; kl&iacute;če pro mobiln&iacute; &scaron;irokop&aacute;smov&eacute; připojen&iacute; nezobrazuj&iacute; s&iacute;lu sign&aacute;lu, pokud tuto funkci nepodporuj&iacute;.</li>
<li>V&nbsp;př&iacute;padě někter&yacute;ch hardwarov&yacute;ch kl&iacute;čů pro mobiln&iacute; připojen&iacute; nelze změnit nastaven&iacute; SIM, pokud jste připojen&iacute; k&nbsp;internetu.</li>
</ol>
</div>
<p>____<br> <strong>*</strong>K&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů. </p>


</body>
</html>
