<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Br&aacute;na firewall</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_firewall"></a>Povolit / Zakázat</h2>
<p>
Integrovaná brána firewall může zabránit neoprávněným přihlášením a kontrolovat přístup ke službám. Navíc můžete zvolit, zda povolíte nebo zakážete přístup určitým síťovým portům z konkrétních IP adres.</p>
<h4>Vytvoření pravidla brány firewall:</h4>
<ol>
<li>Přejděte na položky <b>Ovládací panel</b> > <b>Brána firewall</b> a z levého sloupce vyberte síťové rozhraní podle typu síťového připojení.</li>
<li>Klepněte na možnost <b>Vytvořit</b>.</li>
<li>V sekci <b>Porty</b> vyberte některé z následujících pravidel:</li>
<ul>
<li>Zvolením možnosti <b>Vše</b> použijete pravidla pro všechny porty.</li>
<li>Zvolte možnost <b>Vyberte ze seznamu integrovaných aplikací</b>.</li>
<li>Zvolte možnost <b>Vlastní</b> a klepněte na možnost <b>Vlastní</b>, potom zadejte až 15 portů oddělených čárkami nebo zadejte rozsah portů.</li>
<li class="no">
Můžete také definovat protokoly.
</li>
</ul>
<li>V sekci <b>Zdrojová IP adresa</b> vyberte některé z následujících pravidel:</li>
<ul>
<li>Zvolením možnosti <b>Vše</b> povolíte nebo zakážete všechny IP adresy.</li>
<li>Zadejte <b>IP adresu jediného hostitele.</b></li>
<li>Zadejte <b>Podsíť.</b> </li>
</ul>
<li>V sekci <b>Akce</b> vyberte některé z následujících pravidel:</li>
<ul>
<li>Zvolením možnosti <b>Povolit</b> povolíte přístup podle nastavení portů a zdrojové IP adresy výše.</li>
<li>Zvolením možnosti <b>Zakázat</b> zakážete přístup podle nastavení portů a zdrojové IP adresy výše.</li>
</ul>
</ol>
<p>
Nyní uvidíte vytvořené pravidlo brány firewall v seznamu pravidel.
</p>
<h4>Chcete-li odstranit pravidla brány firewall, postupujte jedním z těchto způsobů:</h4>
<ul>
<li>Zrušte zaškrtnutí políčka daného pravidla ve sloupci <b>Povolit</b> v seznamu</li>
<li>Odstranit pravidlo brány firewall</li>
</ul>
<p>
Můžete také vybrat <b>Povolit přístup</b> nebo <b>Zakázat přístup</b> ve spodní části seznamu pravidel, abyste povolili nebo zakázali přístup, který neodpovídá žádným pravidlům.
</p>
<ol>
<span class="note_head">Pozn&aacute;mka:</span>
<li>pro s&iacute;ťov&eacute; rozhran&iacute; můžete vytvořit až 100 pravidel. Pravidla můžete uspoř&aacute;dat v&nbsp;seznamu jejich přetažen&iacute;m.</li>
<li>Priorita pravidel je d&aacute;na jejich pozic&iacute; v&nbsp;seznamu.</li>
<li>Pokud syst&eacute;m obsahuje několik s&iacute;ťov&yacute;ch portů připojen&yacute;ch ke stejn&eacute; pods&iacute;ti, nemus&iacute; pravidla br&aacute;ny firewall fungovat spr&aacute;vně.* </li>
<li>Pokud zkombinujete několik s&iacute;ťov&yacute;ch portů&nbsp;LAN s&nbsp;funkc&iacute; Link Aggregation, bude br&aacute;na firewall použ&iacute;vat pravidla prvn&iacute;ho s&iacute;ťov&eacute;ho rozhran&iacute; a&nbsp;vyhrad&iacute; pravidla druh&eacute;ho s&iacute;ťov&eacute;ho rozhran&iacute;.</li>
</ol>
<p>____<br> * Plat&iacute; jen u&nbsp;někter&yacute;ch modelů.</p>
</body>
</html>
