<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Zabezpečen&iacute;</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Zabezpečen&iacute;</h2>
<p>Na t&eacute;to kartě můžete upravit nastaven&iacute; zabezpečen&iacute; s&iacute;tě pro jednotliv&aacute; s&iacute;ťov&aacute; rozhran&iacute;.</p>
<h3>Zabezpečen&iacute; DoS</h3>
<p>Zabezpečen&iacute; pomoc&iacute; protokolu odepřen&iacute; služby (DoS) pom&aacute;h&aacute; chr&aacute;nit před &uacute;toky na&nbsp;Internetu.</p>
<h4>Povolen&iacute; zabezpečen&iacute; DoS:</h4>
<ol>
<li>Za&scaron;krtněte pol&iacute;čko <strong>Povolit zabezpečen&iacute; DoS</strong>.</li>
<li>Klepněte na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>
<h3>Průchod&nbsp;VPN*</h3>
<p>Pokud zař&iacute;zen&iacute; DiskStation pln&iacute; funkci směrovače, umožňuje koncept průchodu VPN připojen&iacute; klientsk&yacute;ch zař&iacute;zen&iacute; k&nbsp;zař&iacute;zen&iacute; DiskStation NAT a&nbsp;vytvořen&iacute; odchoz&iacute;ch nebo př&iacute;choz&iacute;ch připojen&iacute;&nbsp;VPN. Pokud je souč&aacute;st&iacute; intern&iacute;ho nastaven&iacute; tak&eacute; server&nbsp;VPN, přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Konfigurace směrovače</strong> a&nbsp;nastavte pravidla před&aacute;v&aacute;n&iacute; portů a&nbsp;povolte na serveru&nbsp;VPN vytv&aacute;řen&iacute; připojen&iacute;&nbsp;VPN.</p>
<h4>&Uacute;prava nastaven&iacute; průchodu&nbsp;VPN:</h4>
<ol>
<li>V&nbsp;t&eacute;to č&aacute;sti můžete povolit nebo zak&aacute;zat n&aacute;sleduj&iacute;c&iacute; nastaven&iacute;:</li>
<ul>
<li><strong>Průchod&nbsp;PPTP:</strong> umožňuje průchod a&nbsp;vytvořen&iacute; připojen&iacute; pro přenosy prostřednictv&iacute;m protokolu PPTP (Point-to-Point Tunneling Protocol).</li>
<li><strong>Průchod&nbsp;IPSec:</strong> umožňuje průchod a&nbsp;vytvořen&iacute; připojen&iacute; pro přenosy prostřednictv&iacute;m protokolu IPSec (IP Security Protocol).</li>
<li><strong>Průchod&nbsp;L2TP:</strong> umožňuje průchod a&nbsp;vytvořen&iacute; připojen&iacute; pro přenosy prostřednictv&iacute;m protokolu L2TP (Layer 2 Tunneling Protocol).</li>
</ul>
<li>Po změně nastaven&iacute; klepněte na možnost <strong>Použ&iacute;t</strong>.</li>
</ol>
<p>____<br> *K&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů.</p>
</body>
</html>
