<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Sd&iacute;len&aacute; složka</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Spr&aacute;va roz&scaron;&iacute;řen&yacute;ch opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky</h2>

<p>Str&aacute;nka uveden&aacute; v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Sd&iacute;len&aacute; složka</strong> &gt; <strong>Upravit</strong> &gt; <strong>Upřesnit</strong> zahrnuje n&iacute;že uveden&eacute; možnosti upřesněn&iacute; př&iacute;stupov&yacute;ch opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky.</p>

<h3>Roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky</h3>
<p>Roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky nab&iacute;z&iacute; dodatečnou vrstvu kontroly spr&aacute;vy př&iacute;stupov&yacute;ch opr&aacute;vněn&iacute; sd&iacute;len&yacute;ch složek. Je-li tato možnost povolena, uživatel&eacute; a&nbsp;skupiny mohou zobrazovat a&nbsp;upravovat obsah sd&iacute;len&eacute; složky, pokud byla uživateli nebo skupině přidělena roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky <em>a&nbsp;z&aacute;roveň</em> opr&aacute;vněn&iacute; seznamu Windows&nbsp;ACL (v&nbsp;č&aacute;sti <strong>Sd&iacute;len&aacute; složka</strong> &gt; <strong>Upravit</strong> &gt; <strong>Opr&aacute;vněn&iacute;</strong>).</p>

<h4>Postup povolen&iacute; roz&scaron;&iacute;řen&yacute;ch opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky:</h4>

<ol>
<li>Za&scaron;krtněte pol&iacute;čko <strong>Povolit roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky</strong>.</li>
<li>Kliknut&iacute;m na možnost <strong>Roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky</strong> můžete upravit roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky pro sd&iacute;lenou složku. </li>
</ol>

<div class="section">
  <h4>Pozn&aacute;mka:</h4>
<ul>
<li>Roz&scaron;&iacute;řen&aacute; opr&aacute;vněn&iacute; sd&iacute;len&eacute; složky budou použita tehdy, pokud uživatel aktivuje př&iacute;stup ke sd&iacute;len&eacute; složce přes n&aacute;sleduj&iacute;c&iacute; souborov&eacute; služby: Sd&iacute;len&iacute; souborů Windows File Sharing, Sd&iacute;len&iacute; souborů Apple File Sharing, File Station, FTP a&nbsp;WebDAV.</li>
</ul>
</div>

<h3>Roz&scaron;&iacute;řen&aacute; nastaven&iacute;</h3>

<p>V&nbsp;př&iacute;padě potřeby můžete nastavit dal&scaron;&iacute; omezen&iacute; uživatelům, kteř&iacute; aktivuj&iacute; př&iacute;stup ke sd&iacute;len&eacute; složce přes File&nbsp;Station, FTP nebo WebDAV.</p>
	<ul>
    <li><strong>Zak&aacute;zat proch&aacute;zen&iacute; adres&aacute;ře:</strong> Povolen&iacute;m t&eacute;to možnosti zak&aacute;žete uživatelům proch&aacute;zen&iacute; obsahu sd&iacute;len&eacute; složky.</li>
    <li><strong>Zak&aacute;zat &uacute;pravy st&aacute;vaj&iacute;c&iacute;ch souborů:</strong> Povolen&iacute;m t&eacute;to možnosti zak&aacute;žete uživatelům přesouvat, odstraňovat nebo prov&aacute;dět &uacute;pravy sd&iacute;len&eacute; složky. Pamatujte, že uživatel&eacute; budou moci i&nbsp;nad&aacute;le zobrazovat, stahovat/odes&iacute;lat, kop&iacute;rovat nebo dekomprimovat obsah sd&iacute;len&eacute; složky.</li>
    <li><strong>Zak&aacute;zat stahov&aacute;n&iacute; souborů:</strong> Povolen&iacute;m t&eacute;to možnosti zak&aacute;žete uživatelům stahov&aacute;n&iacute; obsahu sd&iacute;len&eacute; složky.</li>
    </ul>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>V&yacute;&scaron;e uveden&aacute; omezen&iacute; se nevztahuj&iacute; na uživatele, kteř&iacute; patř&iacute; do skupiny <strong>administrators</strong>.</p>
</div>
</body>
</html>
