<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Uživatel</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Nastaven&iacute; hesla</h2>
<p>Klepnut&iacute;m na tlač&iacute;tko <strong>Nastaven&iacute; hesla</strong> zobraz&iacute;te a&nbsp;provedete změny n&iacute;že popsan&yacute;ch nastaven&iacute;.</p>

<h3>Resetov&aacute;n&iacute; zapomenut&eacute;ho hesla</h3>
<p>Tato č&aacute;st obsahuje možnost <strong>Povolit uživatelům, kteř&iacute; nejsou spr&aacute;vci, obnoven&iacute; zapomenut&yacute;ch hesel prostřednictv&iacute;m e-mailu</strong>. Pokud je tato možnost povolena, bude na str&aacute;nce přihl&aacute;&scaron;en&iacute; k&nbsp;syst&eacute;mu&nbsp;DSM uveden odkaz <strong>Zapomněli jste heslo?</strong>. Pokud uživatel zapomene heslo, může klepnout na tento odkaz a&nbsp;zadat uživatelsk&eacute; jm&eacute;no. V&nbsp;takov&eacute;m př&iacute;padě ode&scaron;le syst&eacute;m uživateli zpr&aacute;vu obsahuj&iacute;c&iacute; odkaz s&nbsp;možnost&iacute; resetov&aacute;n&iacute; zapomenut&eacute;ho hesla. </p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Dř&iacute;ve než povol&iacute;te tuto možnost, ověřte, zda jste povolili e-mailov&aacute; upozorněn&iacute;&nbsp;SMTP. Tuto funkci nastav&iacute;te v&nbsp;č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Upozorněn&iacute;</strong> &gt; <strong>Obecn&eacute;</strong>. Pokud nebudou upozorněn&iacute; povolena, syst&eacute;m nebude moci odes&iacute;lat uživatelům zpr&aacute;vy t&yacute;kaj&iacute;c&iacute; se resetov&aacute;n&iacute; hesla.</li>
<li>Pro př&iacute;jem zpr&aacute;v syst&eacute;mu mus&iacute; uživatel&eacute; v&nbsp;č&aacute;sti s&nbsp;informacemi o&nbsp;&uacute;čtu zadat e-mailovou adresu.</li>
<li>Uživatel&eacute; ze skupiny <strong>administrators</strong> nemohou resetovat heslo pomoc&iacute; t&eacute;to možnosti.</li>
<li>Pomoc&iacute; t&eacute;to možnosti nemohou resetovat heslo ani uživatel&eacute; dom&eacute;ny.</li>
<li>Uživatel&eacute;&nbsp;LDAP mohou resetovat heslo pomoc&iacute; t&eacute;to možnosti za předpokladu, že zař&iacute;zen&iacute; DiskStation pln&iacute; funkci adres&aacute;řov&eacute;ho serveru&nbsp;LDAP.</li>

</ul>
</div>


<h3>S&iacute;la hesla</h3>
<p>Na zař&iacute;zen&iacute; DiskStation můžete nastavit pravidla s&iacute;ly hesla pro uživatele.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Pravidla s&iacute;ly hesla plat&iacute; pouze pro nov&eacute; hesla. Pravidla s&iacute;ly hesla mohou tedy platit při vytv&aacute;řen&iacute; nov&yacute;ch &uacute;čtů nebo tak&eacute; při změně hesla st&aacute;vaj&iacute;c&iacute;ho uživatele. Pravidla t&yacute;kaj&iacute;c&iacute; se nov&yacute;ch hesel neplat&iacute; pro st&aacute;vaj&iacute;c&iacute; hesla a&nbsp;importovan&eacute; uživatelsk&eacute; &uacute;čty.</p>
</div>
<h4>Povolen&iacute; pravidel s&iacute;ly hesla:</h4>
<ol>
<li>Za&scaron;krtnut&iacute;m pol&iacute;čka <b>Použ&iacute;t pravidla pro s&iacute;lu hesla</b> povol&iacute;te omezen&iacute; hesla.</li>
<li>Z&nbsp;n&iacute;že uveden&yacute;ch pravidel vyberte v&iacute;ce než jedno omezen&iacute; hesel:</li>
<ul>
<li><b>Heslo nesm&iacute; obsahovat jm&eacute;no ani popis uživatele</b>: Heslo nesm&iacute; obsahovat uživatelsk&eacute; jm&eacute;no ani popis uživatele. Znaky ve form&aacute;tu UTF-8 jsou v&scaron;ak vyloučeny.</li>
<li><b>Povolit různou velikost p&iacute;smen</b>: Heslo podporuje různou velikost p&iacute;smen.</li>
<li><b>Použ&iacute;t znaky č&iacute;slic</b>: Heslo mus&iacute; obsahovat alespoň jednu č&iacute;slici (0&ndash;9).</li>
<li><b>Použ&iacute;t speci&aacute;ln&iacute; znaky</b>: Heslo mus&iacute; obsahovat alespoň jeden speci&aacute;ln&iacute; znak ASCII (tzn. ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Minim&aacute;ln&iacute; d&eacute;lka hesla</b>: Heslo mus&iacute; obsahovat alespoň hodnotu uvedenou v&nbsp;textov&eacute;m poli. D&eacute;lka by měla m&iacute;t hodnotu v&nbsp;rozmez&iacute; od 6 do 127.</li>
</ul>
<li>Nastaven&iacute; ulož&iacute;te klepnut&iacute;m na možnost <b>Použ&iacute;t</b>.</li>
</ol>
 
</body>
</html>

