<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Uživatel</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Složka uživatele</h2>
<p>Povolte, aby domovsk&aacute; str&aacute;nka uživatele vytvořila osobn&iacute; složku <b>home</b> pro každ&eacute;ho uživatele s v&yacute;jimkou uživatele <b>guest</b>. Každ&yacute; uživatel m&aacute; ke sv&eacute; vlastn&iacute; složce př&iacute;stup prostřednictv&iacute;m CIFS, AFP, FTP nebo stanice File Station.</p>
<p>&Uacute;čet admin m&aacute; př&iacute;stup ke v&scaron;em soukrom&yacute;m složk&aacute;m, kter&eacute; se nach&aacute;zej&iacute; ve v&yacute;choz&iacute; sd&iacute;len&eacute; složce <b>homes</b>. N&aacute;zev složky uživatele je stejn&yacute; jako n&aacute;zev uživatelsk&eacute;ho &uacute;čtu.</p>
<h4>Povolen&iacute; služby Složka uživatele:</h4>
<ol>
<li>Klepněte na možnost <b>Složka uživatele</b>.</li>
<li>Za&scaron;krtněte možnost <b>Povolit službu Složka uživatele</b>.</li>
<li>Pokud je v syst&eacute;mu Synology DiskStation v&iacute;ce než jeden svazek, vyberte m&iacute;sto, na kter&eacute; chcete um&iacute;stit složku <b>homes</b>.</li>
<li>Klepněte na tlač&iacute;tko <b>OK</b>.</li>
</ol>
<p><span class="note_head">Pozn&aacute;mka:</span> Při z&aacute;kazu služby Složka m&iacute;stn&iacute;ho uživatele bude současně zak&aacute;z&aacute;na služba Složka uživatele dom&eacute;ny.</p>
<h4>Z&aacute;kaz služby Složka uživatele:</h4>
<ol>
<li>Klepněte na možnost <b>Složka uživatele</b>.</li>
<li>Zru&scaron;te za&scaron;krtnut&iacute; možnosti <b>Povolit službu Složka uživatele</b>.</li>
</ol>
<p>Pot&eacute;, co bude služba Složka uživatele zak&aacute;z&aacute;na, sd&iacute;len&aacute; složka <b>homes</b> bude zachov&aacute;na a bude k n&iacute; m&iacute;t př&iacute;stup &uacute;čet admin.  Uživatel&eacute; budou znovu moci přistupovat ke sv&eacute; složce tehdy, když bude znovu povolena služba Složka uživatele.</p>
<ol>
<span class="note_head">Pozn&aacute;mka:</span>
<li>Sd&iacute;lenou složku <b>homes</b> lze odstranit až po zak&aacute;z&aacute;n&iacute; služby Složka uživatele.</li>
<li>Pokud bude zak&aacute;z&aacute;na služba Složka m&iacute;stn&iacute;ho uživatele, služba Složka uživatele dom&eacute;ny bude rovněž zak&aacute;z&aacute;na.</li> 
</ol> 
</body>	
</html> 
