<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Sd&iacute;len&aacute; složka</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Sd&iacute;len&aacute; složka</h1>
<p>Sd&iacute;len&eacute; složky představuj&iacute; z&aacute;kladn&iacute; adres&aacute;ře, ve kter&yacute;ch můžete ukl&aacute;dat soubory a&nbsp;složky zař&iacute;zen&iacute; DiskStation. Dř&iacute;ve než začnete ukl&aacute;dat na zař&iacute;zen&iacute; DiskStation jak&eacute;koli soubory, mus&iacute;te vytvořit alespoň jednu sd&iacute;lenou složku. Data uložen&aacute; ve sd&iacute;len&yacute;ch složk&aacute;ch můžete označit jako soukrom&aacute; nebo sd&iacute;len&aacute; s&nbsp;konkr&eacute;tn&iacute;mi uživateli nebo skupinami uživatelů podle nastaviteln&yacute;ch př&iacute;stupov&yacute;ch opr&aacute;vněn&iacute;. Kromě toho lze při vytv&aacute;řen&iacute; sd&iacute;len&yacute;ch složek prov&eacute;st &scaron;ifrov&aacute;n&iacute; a&nbsp;zajistit tak dodatečnou vrstvu ochrany.</p>

<h3>V&yacute;choz&iacute; sd&iacute;len&eacute; složky</h3>

<p>N&iacute;že je uveden seznam sd&iacute;len&yacute;ch složek, kter&eacute; se vytv&aacute;ř&iacute; automaticky při instalaci nebo aktivaci určit&yacute;ch aplikac&iacute;ch, služeb nebo bal&iacute;čků.</p> 

<table>
<tr>
<th>N&aacute;zev</th>
<th>Popis</th>
</tr>
<tr>
<th>public</th>
<td>Složka <strong>public</strong> je vytvořena automaticky při prvn&iacute;m nastaven&iacute; zař&iacute;zen&iacute; DiskStation.*</td>
</tr>
<tr>
<th>web</th>
<td>Složka <strong>web</strong> je v&yacute;choz&iacute; um&iacute;stěn&iacute; &uacute;loži&scaron;tě pro obsah webov&eacute; str&aacute;nky hostovan&eacute; na zař&iacute;zen&iacute; DiskStation. Bude vytvořena automaticky při povolen&iacute; služby <strong>Web Station</strong>.</td>
</tr>
<tr>
<th>photo</th>
<td>Složka <strong>photo</strong> se použ&iacute;v&aacute; pro ukl&aacute;d&aacute;n&iacute; fotografi&iacute; a&nbsp;vide&iacute;, kter&eacute; chcete sd&iacute;let pomoc&iacute; Photo&nbsp;Station. Bude vytvořena automaticky při povolen&iacute; služeb <strong>Photo Station</strong> nebo <strong>Medi&aacute;ln&iacute; server DLNA/UPnP</strong>.</td>
</tr>
<tr>
<th>music</th>
<td>Složka <strong>photo</strong> se použ&iacute;v&aacute; pro ukl&aacute;d&aacute;n&iacute; hudby, kterou chcete poslouchat pomoc&iacute; Audio&nbsp;Station. Bude vytvořena automaticky při povolen&iacute; služby<strong>Audio Station</strong>.</td>
</tr>
<tr>
<th>video</th>
<td>Složka <strong>video</strong> obsahuje videosoubory, kter&eacute; chcete proch&aacute;zet přes zař&iacute;zen&iacute; DLNA/UPnP. Bude vytvořena automaticky při povolen&iacute; služby <strong>Medi&aacute;ln&iacute; server</strong>.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Složka <strong>surveillance</strong> se použ&iacute;v&aacute; pro ukl&aacute;d&aacute;n&iacute; z&aacute;znamů Surveillance Station. Bude vytvořena automaticky při povolen&iacute; služby <strong>Surveillance Station</strong>. Je určena jen pro čten&iacute; a&nbsp;může ji otevř&iacute;t pouze spr&aacute;vce syst&eacute;mu.</td>
</tr>
<tr>
<th>home</th>
<td>Složky <strong>home</strong> nab&iacute;z&iacute; priv&aacute;tn&iacute; prostor, kde mohou jednotliv&iacute; uživatel&eacute; ukl&aacute;dat data, k&nbsp;nimž m&aacute; př&iacute;stup pouze tento uživatel. Bude vytvořena automaticky při povolen&iacute; funkce <strong>Složka uživatele</strong>.</td>
</tr>
<tr>
<th>homes</th>
<td>Složka <strong>homes</strong> obsahuje složky v&scaron;ech uživatelů. Bude vytvořena automaticky při povolen&iacute; funkce <strong>Složka uživatele</strong>. Ke složk&aacute;m v&scaron;ech uživatelů m&aacute; př&iacute;stup pouze spr&aacute;vce syst&eacute;mu, kter&yacute; může tak&eacute; prov&aacute;dět jejich spr&aacute;vu.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Složka <strong>NetBackup</strong> bude automaticky vytvořena při povolen&iacute; služby <strong>S&iacute;ťov&aacute; z&aacute;loha</strong>.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Složka <strong>usbshare[č&iacute;slo]</strong> bude automaticky vytvořena ve chv&iacute;li, kdy k&nbsp;portu USB zař&iacute;zen&iacute; DiskStation připoj&iacute;te extern&iacute; disk USB.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Složka <strong>satashare</strong> bude automaticky vytvořena ve chv&iacute;li, kdy k&nbsp;portu eSATA zař&iacute;zen&iacute; DiskStation připoj&iacute;te extern&iacute; disk eSATA.*</td>
</tr>
</table>

<p>____<br> *&nbsp;K&nbsp;dispozici jen u&nbsp;někter&yacute;ch modelů.</p>

</body>
</html>
