<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Sikkerhetskopiering &amp; kopiering</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>LUN-sikkerhetskopiering</h2>
<p>Under fanen <b>Sikkerhetskopiering</b> i <b>Sikkerhetskopiering &amp; kopiering</b> kan du bruke <b>Lokal LUN-sikkerhetskopi</b> for &aring; sikkerhetskopiere iSCSI LUN-er p&aring; din DiskStation til lokale delte mapper. Du kan ogs&aring; bruke <b>Nettverks LUN-sikkerhetskopi</b> for &aring; sikkerhetskopiere til en annen DiskStation.</p>

<h4>Slik sikkerhetskopierer du et iSCSI LUN:</h4>
<ol>
<li>
Velg <b>Opprett</b> &gt; <b>LUN-sikkerhetskopioppgave</b> for &aring; &aring;pne <b>Veiviser for LUN-sikkerhetskopiering</b>, og klikk p&aring; <b>Neste</b>.
</li>
<li>
N&aring;r du blir bedt om &aring; velge en m&aring;ltype, velger du en av f&oslash;lgende:
</li>
<ul>
<li>
<b>Lokal LUN-sikkerhetskopi</b>: Velg dette alternativet for &aring; sikkerhetskopiere LUN fra din DiskStation til en lokal delt mappe eller en ekstern lagringsdisk som er koblet til USB- eller eSATA-porten p&aring; din DiskStation.
</li>
<li><b>Nettverks LUN-sikkerhetskopi</b>: Velg dette alternativet for &aring; sikkerhetskopiere LUN fra din DiskStation til en annen DiskStation.
</li>
</ul>
<li>
N&aring;r du blir spurt om det, m&aring; du angi sikkerhetskopim&aring;l og kilde-LUN og sikkerhetskopieringsplan.
</li>
<li>
F&oslash;lg veiviseren for &aring; fullf&oslash;re installasjonen.
</li>
</ol>
<p>N&aring;r sikkerhetskopioppgaven er opprettet, vil DiskStation utf&oslash;re sikkerhetskopioppgaven i henhold til tidsplanen og lagre den sikkerhetskopierte LUN-en i m&aring;let. Sikkerhetskopiert LUN brukes bare for sikkerhetskopieringsform&aring;l. For &aring; f&aring; tilgang til sikkerhetskopi-LUN kan du se <a href="restore.html">Slik gjenoppretter du sikkerhetskopi-LUN</a> for mer informasjon.</p>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>B책de LUN-er med vanlig fil og blokkniv책 vil bli sikkerhetskopiert som filbilder i m책let. Ved gjenoppretting, vil alle LUN-er med blokkniv책 bli endret til LUN-er med vanlig fil.</li>
<li>Hver sikkerhetskopioppgave kan bare omfatte &eacute;n LUN som sikkerhetskopikilde.</li>
<li>LUN-er kan ikke sikkerhetskopieres til en ekstern disk med formatene FAT, FAT32, HFS, HFS Plus eller NTFS.</li>
<li>F&oslash;r du utf&oslash;rer nettverks-LUN-sikkerhetskopi, m&aring; du logge deg inn p&aring; m&aring;l-DiskStation for &aring; forsikre deg om at tjenesten for nettverkssikkerhetskopi er aktivert i <b>Sikkerhetskopiering &amp; kopiering</b> &gt; <b>Sikkerhetskopitjenester</b>.</li>
<li>Hvis din DiskStation kobler seg til nettverket gjennom en ruter, m&aring; du kontrollere at du har angitt en portvideresendingsregel for iSCSI-tjenesten (TCP-port 3260) p&aring; ruteren f&oslash;r du utf&oslash;rer nettverks-LUN-sikkerhetskopiering.</li>
</ul>
</div>


<div class="section">
<h4>Om Fullstendig sikkerhetskopiering og Akkumulerende sikkerhetskopiering:</h4>
<p>
DiskStation vil utf&oslash;re en fullstendig sikkerhetskopiering av de valgte LUN-er f&oslash;rste gang, og deretter akkumulerende sikkerhetskopieringer senere. Men hvis navnet p&aring; den delte mappen eller katalognavnet for sikkerhetskopim&aring;let endres, vil DiskStation utf&oslash;re en fullstendig sikkerhetskopiering for oppgaven igjen.
</p>
</div>
</body></html>
