<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM mobile</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script> <script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>DSM mobile</h1>

<p>DSM mobile erlaubt dem DSM-<b>admin</b> (oder einem Benutzer der Gruppe <b>administrators</b>), die DSM-Einstellungen zu verwalten und DSM-Daten mit einem iOS<sup>&reg;</sup> (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup> oder iPod touch<sup>&reg;</sup>) oder Android<sup>&reg;</sup>-Ger&auml;t zu &uuml;berpr&uuml;fen. In dieser Hilfe zu DSM mobile finden Sie folgende Themen sowie Ressourcen f&uuml;r den Einstieg.</p>

<h2>An- und Abmeldung</h2>

<div name="contents" id="login">
<p>Nachdem Sie sich mit dem Webbrowser auf Ihrem iOS- oder Android-Ger&auml;t mit DSM verbunden haben, erscheint der Anmeldebildschirm, auf dem Sie die Daten f&uuml;r Ihr DSM-Konto eintragen k&ouml;nnen.</p>

<h4>Bei DSM mobile anmelden:</h4>
<p>Geben Sie Ihre Benutzerdaten f&uuml;r DSM ein und tippen Sie auf <b>Anmelden</b>. Wenn Sie Ihre Anmeldedaten speichern und sich beim n&auml;chsten Mal automatisch anmelden m&ouml;chten, aktivieren Sie <b>Merken</b>, ehe Sie sich anmelden.</p>

<h4>Von DSM mobile abmelden:</h4>
<ol>
  <li>Tippen Sie oben rechts auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf die Schaltfl&auml;che &quot;Option&quot;.</li>
  <li>Tippen Sie auf <b>Einstellungen</b> und dann auf <b>Abmelden</b>.</li>
</ol>
</div>

<h2>DSM-Benutzer verwalten</h2>

<div name="contents" id="user">
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <b>Benutzer und Gruppe</b>, um die Benutzerliste anzuzeigen.</p>

<h4>Benutzer erstellen:</h4>
<ol>
  <li>Tippen Sie auf <b>+</b> und geben Sie den Benutzernamen, das Kennwort und die E-Mail-Adresse des neuen Benutzers ein.</li>
  <li>Aktivieren Sie <b>Nachricht senden</b>, um eine Benachrichtungs-E-Mail an die E-Mail-Adresse des Benutzers zu schicken, wenn dessen DSM-Benutzerkonto erstellt worden ist<br><span class="note_head">Hinweis: </span>Ehe Sie eine Benachrichtigung senden, m&uuml;ssen die Benachrichtigungseinstellungen auf Ihrem Synology NAS konfiguriert sein. Melden Sie sich bei der Desktop Edition des DSM &uuml;ber den Webbrowser Ihres Computers an und wechseln Sie nach <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <b>Benachrichtigung</b> &gt; <b>E-Mail</b>, um die Einstellungen zu &auml;ndern.</li>
  <li>Tippen Sie zur Best&auml;tigung auf <b>Fertig stellen</b> oder tippen Sie auf den Linkspfeil, um den Vorgang abzubrechen.</li>
</ol>

<h4>Benutzer schnell finden:</h4>
<p>Geben Sie den Benutzernamen in das Feld &quot;Suche&quot; ein.</p>

<h4>Benutzerinformationen &auml;ndern:</h4>
<ol>
  <li>Tippen Sie auf den Namen des Benutzers und f&uuml;hren Sie folgende Schritte durch:
    <ul>
      <li>&Auml;ndern Sie im Feld <b>Name</b> bzw. <b>Kennwort</b> den Namen oder das Kennwort des Benutzers.</li>
    <li>Aktivieren Sie <b>Deaktivieren</b>, um den Benutzer zu deaktivieren. Sie k&ouml;nnen den Benutzer sp&auml;ter wieder reaktivieren, ohne seine bzw. ihre Einstellungen zu verlieren.</li>
    <li>Aktivieren Sie <b>administrator</b>, um den Benutzer zur <b>admin</b>-Gruppe hinzuzuf&uuml;gen. Benutzer, die der <b>admin</b>-Gruppe angeh&ouml;ren, verf&uuml;gen &uuml;ber Administratorrechte und d&uuml;rfen DSM-Einstellungen mit DSM mobile oder im Webbrowser ihres Computers &auml;ndern.</li>
    </ul>
  </li>
  <li>F&uuml;hren Sie unter <b>Berechtigungen</b> Folgendes aus und tippen Sie anschlie&szlig;end auf <b>Zur&uuml;ck</b>:
    <ul>
      <li>Tippen Sie auf <b>Freigegebener Ordner</b> und tippen Sie auf den Namen eines freigegebenen Ordners, um die Zugriffsberechtigung des Benutzers zu &auml;ndern: <b>Lesen/Schreiben</b>: Der Benutzer kann Dateien und Unterordner im freigegebenen Ordner &auml;ndern; <b>Nur Lesen</b>: Der Benutzer hat Zugriff auf Dateien und Unterordner im freigegebenen Ordner und kann keine &Auml;nderungen vornehmen; <b>Kein Zugriff</b>: Der Benutzer hat keinen Zugriff auf die Dateien und Unterordner im freigegebenen Ordner.<br><span class="note_head">Hinweis: </span>Bei widerspr&uuml;chlichen Berechtigungen gilt folgende Priorit&auml;t: <span class="note_content">Kein Zugriff &gt; Lesen/Schreiben &gt; Nur Lesen</span>.</li>
      <li>Tippen Sie auf <b>Anwendung</b>, um die Zugriffsberechtigung des Benutzers f&uuml;r DSM-Anwendungen zu &auml;ndern.</li>
    </ul>
  </li>
  <li>Tippen Sie zur Best&auml;tigung auf <b>Fertig stellen</b> oder tippen Sie auf den Linkspfeil, um den Vorgang abzubrechen.</li>
</ol>
</div>

<h2>Freigegebene Ordner verwalten</h2>

<div name="contents" id="shared">
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) oder im linken Fenster (iPad oder Android-Tablet) auf <b>Freigegebener Ordner</b>, um die freigegebenen Ordner auf Ihrem Synology NAS anzuzeigen.</p>

<h4>Freigegebenen Ordner erstellen:</h4>
<ol>
  <li>Tippen Sie auf <b>+</b> und geben Sie den Namen f&uuml;r den neuen Ordner ein.</li>
  <li>Tippen Sie zur Best&auml;tigung auf <b>Fertig stellen</b> oder tippen Sie auf den Linkspfeil, um den Vorgang abzubrechen.</li>
</ol>

<h4>Freigegebenen Ordner &auml;ndern:</h4>
<p>Tippen Sie auf den Namen des freigegebenen Ordners und f&uuml;hren Sie folgende Schritte durch:</p>
<ul>
  <li>&Auml;ndern Sie im Feld <b>Name</b> den Namen des freigegebenen Ordners.</li>
  <li>Tippen Sie auf <b>Benutzerberechtigungen</b> und dann auf einen Benutzer, um dessen Berechtigung f&uuml;r den Zugriff auf den freigegebenen Ordner zu &auml;ndern: <b>Lesen/Schreiben</b>: Der Benutzer kann Dateien und Unterordner im freigegebenen Ordner &auml;ndern; <b>Nur Lesen</b>: Der Benutzer hat Zugriff auf Dateien und Unterordner im freigegebenen Ordner und kann keine &Auml;nderungen vornehmen; <b>Kein Zugriff</b>: Der Benutzer hat keinen Zugriff auf die Dateien und Unterordner im freigegebenen Ordner.<br><span class="note_head">Hinweis: </span>Bei widerspr&uuml;chlichen Berechtigungen gilt folgende Priorit&auml;t: <span class="note_content">Kein Zugriff &gt; Lesen/Schreiben &gt; Nur Lesen</span>.</li>
  <li>Sie k&ouml;nnen auch auf <b>Gruppenberechtigungen</b> tippen, um Berechtigungen f&uuml;r Gruppen zu konfigurieren.<br><span class="note_head">Hinweis: </span>Gruppenberechtigungen haben eine h&ouml;here Priorit&auml;t als Benutzerberechtigungen.</li>
</ul>
</div>

<h2>Dienste aktivieren</h2>

<div name="contents" id="services">
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <b>Dienst</b>, um Dienste des Synology NAS zu aktivieren oder zu deaktivieren.</p>

<h4>LAN-Dienste des Synology NAS verwalten:</h4>
<ul>
  <li>Aktivieren oder deaktivieren Sie eine der folgenden M&ouml;glichkeiten:
    <ul>
      <li><b>Windows-Dateidienst</b> erm&ouml;glicht Ihrem Synology NAS, als Windows (CIFS)-Dateiserver im LAN zu fungieren.</li>
      <li><b>Mac-Dateidienst</b> erm&ouml;glicht Ihrem Synology NAS, als Mac (AFP)-Dateiserver im LAN zu fungieren.</li>
      <li><b>NFS-Dienst</b> erm&ouml;glicht dem Linux-Client im LAN den Zugriff auf Synology NAS-Daten.</li>
      <li><b>Bonjour-Drucker</b> erm&ouml;glicht Mac-Clients, auf an Ihren Synology NAS angeschlossenen USB-Druckern auszudrucken.</li>
      <li><b>Medienserver</b> erm&ouml;glicht DLNA/UPnP-Heimger&auml;ten im LAN, Multimediainhalte auf Ihrem Synology NAS zu durchsuchen und wiederzugeben.</li>
      <li><b>iTunes</b> erm&ouml;glicht iTunes-Clients im LAN, Musik und Videos auf Ihrem Synology NAS zu durchsuchen und wiederzugeben.</li>
    </ul>
  </li>
</ul>

<h4>Internetdienste des Synology NAS verwalten:</h4>
<ul>
  <li>Aktivieren oder deaktivieren Sie eine der folgenden M&ouml;glichkeiten:
    <ul>
      <li><b>FTP</b> erm&ouml;glicht Ihrem Synology NAS, als FTP-Server zu fungieren.</li>
      <li><b>Webdienste</b> erm&ouml;glicht Ihnen, Websites (mit PHP+MySQL-Unterst&uuml;tzung) auf Ihrem Synology NAS zu hosten.</li>
      <li><b>WebDAV</b> erm&ouml;glicht Clientprogrammen, Synology NAS-Dateien &uuml;ber das HTTP-Protokoll zu verwalten und zu bearbeiten.</li>
      <li><b>WebDAV (HTTPS)</b> erm&ouml;glicht Clientprogrammen, Synology NAS-Dateien &uuml;ber das HTTPS-Protokoll zu verwalten und zu bearbeiten.</li>
      <li><b><a name="filestationservice"></a>File Station</b> ist eine webbasierte Anwendung, mit der Sie Synology NAS-Dateien &uuml;ber einen benutzerdefinierten Port verwalten k&ouml;nnen, ohne sich bei DSM anzumelden.</li>
      <li><b>File Station (HTTPS)</b> erm&ouml;glicht Ihnen, sich &uuml;ber das HTTPS-Protokoll mit File Station zu verbinden.</li>
      <li><b>Surveillance Station</b> ist eine webbasierte Anwendung, die IP-Kameras verwaltet, um Ihr Haus oder Ihr B&uuml;ro zu sch&uuml;tzen.</li>
      <li><b>Audio Station</b> ist eine webbasierte Anwendung, mit der Sie die Musikbibliothek auf Ihrem Synology NAS &ouml;ffnen k&ouml;nnen.</li>
      <li><b>Photo Station</b> ist ein Online-Fotoalbum mit einem Blog, das auf Ihrem Synology NAS gespeichert wird.</li>
      <li><b><a name="downloadsationservice"></a>Download Station</b> (BT/HTTP/FTP/NZB/RSS) ist eine webbasierte Download-Anwendung, mit der Sie Dateien aus dem Internet auf Ihren Synology NAS herunterladen k&ouml;nnen.</li>
      <li><b>eMule</b> aktiviert den eMule-Support von Download Station.</li>
    </ul>
  </li>
</ul>

<div class="section">
<h4>Hinweis:</h4>
<p>Weitere Informationen &uuml;ber die oben aufgef&uuml;hrten Dienste finden Sie in folgenden Quellen:</p>
	<ul>
		<li><b>Hilfe zu DSM</b> (melden Sie sich dazu im Webbrowser Ihres Computers bei der Desktop Edition von DSM an und gehen Sie zu <b>Hauptmen&uuml;</b> &gt; <b>Hilfe zu DSM</b>)</li>
		<li><b>Synology DSM-Benutzerhandbuch</b> (verf&uuml;gbar im <a href="http://www.synology.com/support/download.php" target="_blank">Download-Zentrum</a> von Synology)</li>
	</ul>
</div>

<h2>Systemressourcen &uuml;berwachen</h2>

<div name="contents" id="resourcemonitor">
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <b>Ressourcen-Monitor</b>, um die CPU- und Volume-Auslastung Ihres Synology NAS anzuzeigen.</p>
</div>

<h2>Systeminformationen anzeigen</h2>

<div name="contents" id="sysinfo">
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <b>System-Info</b>, um eine Status&uuml;bersicht f&uuml;r Ihren Synology NAS anzuzeigen.</p>

<h4>Systeminformationen f&uuml;r Synology NAS anzeigen:</h4>
<ol>
  <li>F&uuml;hren Sie einen der folgenden Schritte durch:
    <ul>
      <li>Tippen Sie auf <b>Allgemein</b>, um grundlegende Informationen &uuml;ber Ihren Synology NAS anzuzeigen, wie Seriennummer, Modellname, Gr&ouml;&szlig;e des physischen Speichers, DSM-Version sowie Uhrzeit und Temperaturstatus.</li>
      <li>Tippen Sie auf <b>Netzwerk</b>, um die Netzwerkkonfiguration Ihres Synology NAS und den Status der einzelnen Netzwerkschnittstellen anzuzeigen.</li>
      <li>Tippen Sie auf <b>Speicher</b>, um die Volume-Auslastung Ihres Synology NAS anzuzeigen.</li>
    </ul>
  </li>
  <li>Tippen Sie oben rechts auf die Schaltfl&auml;che <b>Aktualisieren</b>, um die Systeminformationen auf aktuellem Stand zu halten.</li>
</ol>
</div>

<h2>Firmware</h2>

<div name="contents" id="firmware">
<p>Tippen Sie auf <b>Firmware</b>, um Ihre DSM-Version anzuzeigen und zu aktualisieren.</p>

<h4>DSM-Upgrade-Einstellungen konfigurieren:</h4>
<ol>
  <li>Tippen Sie auf <strong>DSM-Upgrade</strong>.</li>
  <li>W&auml;hlen Sie eine der folgenden Optionen aus:
    <ul>
      <li>Nur wichtige Updates</li>
      <li>Neuester DSM und alle Updates</li>
    </ul>
  </li>
  <li>Tippen Sie auf <strong>Fertig</strong>.</li>
</ol>

<h4>Verf&uuml;gbare Updates herunterladen:</h4>
<ol>
  <li>&Uuml;berpr&uuml;fen Sie Ihre DSM-Version unter <strong>Status</strong>.</li>
  <li>Tippen Sie, wenn Ihre DSM-Version nicht aktuell ist, auf die Schaltfl&auml;che <strong>Herunterladen</strong>, die unter dem Bereich <strong>Status</strong> angezeigt wird, um DSM zu aktualisieren.</li>
</ol>
</div>

<h2>IP-Sperre verwalten</h2>

<div name="contents" id="block">
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <b>IP-Sperre</b>, um unbefugte Anmeldungen zu verhindern.</p>

<h4>IP-Sperre verwalten:</h4>
<ol>
  <li>Tippen Sie oben rechts auf die Konfigurationsschaltfl&auml;che.</li>
  <li>Aktivieren Sie <b>Automatische Blockierung</b> aktivieren, um die IP-Sperre zu aktivieren.</li>
  <li>Geben Sie eine Zahl f&uuml;r <b>Anmeldeversuche</b> und <b>Innerhalb von (Minuten)</b> ein, um eine IP-Adresse nach der eingestellten Anzahl Fehlversuche innerhalb der eingestellten Minutenzahl zu blockieren.</li>
  <li>Sie k&ouml;nnen <b>Verfallen der Blockierung aktivieren</b> einschalten und <b>Blockierung aufheben nach (Tagen)</b>, um die Blockierung einer IP-Adresse nach der angegebenen Anzahl von Tagen aufzuheben. Wenn Sie hier &bdquo;0&ldquo; eingeben, wird die IP-Adresse so lange blockiert, bis Sie sie aus der Blockierungsliste entfernen.</li>
  <li>Tippen Sie auf <b>Fertig stellen</b>.</li>
</ol>

<h4>IP-Adressen zur Freigabe-/Blockierungsliste hinzuf&uuml;gen:</h4>
<ol>
  <li>Tippen Sie, wenn Sie die freigegebene bzw. blockierte IP zur Liste hinzuf&uuml;gen m&ouml;chten, oben rechts auf die Schaltfl&auml;che Hinzuf&uuml;gen und anschlie&szlig;end auf <b>Freigabeliste</b> oder <b>Blockierungsliste</b>.</li>
  <li>Tippen Sie, nachdem Sie die IP-Adresse eingegeben haben, auf <b>Fertig stellen</b>.</li>
</ol>
</div>

<h2>Paketzentrum verwalten</h2>

<div name="contents" id="package">

<p>Synology verf&uuml;gt &uuml;ber integrierte Anwendungen von Drittanbietern oder selbst entwickelte Anwendungen, die auf einfache Weise auf dem Synology NAS installiert und verwaltet werden k&ouml;nnen.</p>

<h4>Paketzentrum verwalten:</h4>
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) oder im linken Feld (iPad oder Android-Tablet) auf <strong>Paketzentrum</strong>, Paketinformationen anzuzeigen, Pakete auszuf&uuml;hren oder zu beenden oder auf die aktuellsten Versionen zu aktualisieren.</p>


<h4>Installierte Pakete ausf&uuml;hren oder beenden:</h4>
<p>Tippen Sie auf den Schalter neben einem Paket, um es auszuf&uuml;hren oder zu beenden.</p>

<h4>Pakete anzeigen: </h4>
<p>Tippen Sie auf ein Paket, um die Informationen anzuzeigen.</p>
     
<h4>Pakete aktualisieren:</h4>
<ol>
	<li>Tippen Sie auf die Registerkarte <strong>Aktualisieren</strong>, um aktuell verf&uuml;gbare Aktualisierungen anzuzeigen.</li>
    <li>Tippen Sie auf die Schaltfl&auml;che rechts von dem Paket, um es auf die aktuellste Version zu aktualisieren.</li>   
</ol>
</div>    

<h2>Protokolle oder aktuelle Verbindungen anzeigen</h2>

<div name="contents" id="log">
<p>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <b>Protokoll</b>, um aktuelle Verbindungen zu &uuml;berwachen oder Protokolle von Synology NAS-Diensten anzuzeigen.</p>

<h4>Aktuelle Verbindungen &uuml;berwachen:</h4>
<ul>
  <li>Tippen Sie im Bereich <b>&Uuml;berblick</b> auf <b>Letzte [number] Protokolle</b>, um eine Liste der Benutzer anzuzeigen, die zuletzt auf Synology NAS-Dienste zugegriffen haben.</li>
</ul>

<h4>Protokolleintr&auml;ge eines bestimmten Dienstes anzeigen:</h4>
<ul>
  <li>Tippen Sie unter <b>Ereignisprotokolle</b> oder <b>Datei&uuml;bertragungsprotokolle</b> auf ein Element, um die Liste mit entsprechenden Protokollen anzuzeigen.</li>
</ul>

</div>
<h2>Mobile Anwendungen starten</h2>
<div name="contents" id="launch">

<p>Mit DSM mobile k&ouml;nnen Sie die auf Ihrem iOS- oder Android-Ger&auml;t installierten mobilen Synology-Anwendungen bequem starten.</p>

<h4>Mobile Synology-Anwendungen mit DSM mobile starten:</h4>
<p>Tippen Sie im unteren Bereich der Startseite (iPhone/iPod touch oder Android-Telefon) oder im linken Feld (iPad oder Android-Tablet) auf eine der folgenden Apps:</p>
<ul>
  <li><b>DS photo </b>(verf&uuml;gbar, wenn der <b>Photo Station</b>-Dienst aktiviert ist)</li>
  <li><b>DS audio</b> (verf&uuml;gbar, wenn der <b>Audio Station</b>-Dienst aktiviert ist)</li>
  <li><b>DS cam</b> (verf&uuml;gbar, wenn der <b>Surveillance Station</b>-Dienst aktiviert ist)</li>
  <li><b>DS file</b> (verf&uuml;gbar, wenn der <b>WebDAV</b>-Dienst aktiviert ist)</li>
</ul>

<div class="section">
<h4>Hinweis:</h4>
	<ul>
		<li>Weitere Informationen zu diesen Apps finden Sie in den Hilfedateien, die Sie zu diesen Apps erhalten.</li>
     </ul> 
</div>

<h2>Synology NAS in Aktion versetzen<br><span style="font-size:80%;">(Neustart, Herunterfahren oder Signalton)</span></h2>

<div name="contents" id="restart">
<p>DSM mobile erm&ouml;glicht Ihnen, Ihren Synology NAS mit Ihrem iOS- oder Android-Ger&auml;t neu zu starten oder herunterzufahren. Zudem k&ouml;nnen Sie, wenn sich mehrere Synology NAS in Ihrer N&auml;he befinden, Ihren eigenen Synology NAS schnell identifizieren, indem Sie sie Signalt&ouml;ne ausgeben lassen.</p>

<h4>Synology NAS in Aktion setzen:</h4>
<ol>
  <li>Tippen Sie oben rechts auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf die Schaltfl&auml;che &quot;Option&quot;.</li>
  <li>F&uuml;hren Sie einen der folgenden Schritte durch:
    <ul>
      <li>Tippen Sie auf <b>Neustart</b> und dann auf <b>Ja</b>, um Ihren Synology NAS neu zu starten.</li>
      <li>Tippen Sie auf <b>Herunterfahren</b> und dann auf <b>Ja</b>, um Ihren Synology NAS herunterzufahren.</li>
      <li>Tippen Sie auf <b>Suchen</b>, damit der Synology NAS einen Signalton ausgibt. Tippen Sie auf <b>OK</b>, um den Signalton auszuschalten.</li>
    </ul>
  </li>
</ol>
</div>

<h2>In den Desktop-Modus von DSM wechseln</h2>

<div name="contents" id="desktopedition">

<p>Tippen Sie auf das Symbol f&uuml;r die Einstellungen und w&auml;hlen Sie den <b>Desktop-Modus</b> aus, um auf den Desktop-Modus von DSM zu wechseln.</p>
</div>



<h2>Den Storage Manager nutzen</h2>
<div name="contents" id="contents12">
<p><strong>Storage Manager</strong> erm&ouml;glicht Ihnen einen raschen &Uuml;berblick &uuml;ber die Nutzung und den Zustand von System-Volumes und Festplatten.</p>

<h4>Volume-Informationen anzeigen:</h4>
	<ol>
		<li>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <strong>Storage Manager</strong>.</li>
		<li>Tippen Sie auf die Registerkarte <strong>Volume</strong>.</li> 
		<li>Tippen Sie auf ein Volume in der Liste, um detaillierte Informationen dar&uuml;ber anzuzeigen.</li>
	</ol>

<h4>Festplatteninformationen anzeigen:</h4>
	<ol>
		<li>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <strong>Storage Manager</strong>.</li>
		<li>Tippen Sie auf die Registerkarte <strong>HDD/SDD</strong>.</li>
		<li>Tippen Sie auf eine Festplatte in der Liste, um ihren Zustand und S.M.A.R.T.-Informationen anzuzeigen.</li>
	</ol>

<h4>S.M.A.R.T.-Test starten oder beenden:</h4>
	<ol>
		<li>Tippen Sie auf der Startseite (iPhone/iPod touch oder Android-Telefon) bzw. im linken Fenster (iPad oder Android-Tablet) auf <strong>Storage Manager</strong>.</li>
		<li>Tippen Sie auf die Registerkarte <strong>HDD/SDD</strong>.</li>
		<li>Tippen Sie auf eine Festplatte in der Liste, um detaillierte Informationen dar&uuml;ber anzuzeigen.</li>
		<li>Tippen Sie auf <strong>S.M.A.R.T. Test</strong>, um einen S.M.A.R.T.-Test zu starten, oder <strong>Stop</strong>, um ihn zu beenden.</li>
     </ol>
     
</div>




<h2>Weitere Informationen</h2>

<div name="contents" id="contents11">
<p>Um Informationen zur Fehlerbehebung zu erhalten oder mehr &uuml;ber Synology zu erfahren, tippen Sie auf einen der folgenden Links, um die Online-Ressourcen von Synology abzurufen:</p>
<ul>
  <li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">FAQ</a>
</li>
  <li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
  <li><a href="http://forum.synology.com" target="_blank">Forum</a></li>
  <li><a href="http://www.synology.com/support/download.php" target="_blank">Download-Zentrum</a></li>
  <li><a href="https://account.synology.com/support/support_form.php" target="_blank">Technischer Support</a></li>
</ul>
</div>

</body>
</html>
