<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>&Eacute;lvezze a Synology NAS-on t&aacute;rolt multim&eacute;di&aacute;s tartalmakat nagy k&eacute;pernyők&ouml;n</title>
</head>

<body class="tutorial-content-box" >

<h1>&Eacute;lvezze a Synology NAS-on t&aacute;rolt multim&eacute;di&aacute;s tartalmakat nagy k&eacute;pernyők&ouml;n</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_media_server/enjoy_multimedia_contents_stored_on_synology_nas_with_big_screens.jpg" width="600" height="301" />
<h2>&Aacute;ttekint&eacute;s</h2>
<p>A Synology NAS multim&eacute;diaszerver szolg&aacute;lhat a helyi h&aacute;l&oacute;zaton, &iacute;gy enged&eacute;lyezi az otthoni eszk&ouml;z&ouml;k sz&aacute;m&aacute;ra, mint p&eacute;ld&aacute;ul a TV/sztere&oacute; rendszerek &eacute;s a Sony PlayStation3/Xbox 360, a multim&eacute;di&aacute;s tartalmak lej&aacute;tsz&aacute;s&aacute;t. Ezek az eszk&ouml;z&ouml;k DLNA/UPnP-kompatibilis <b>digit&aacute;lis m&eacute;dia adapterek</b> (DMA). A multim&eacute;dia tartalmak megjelen&iacute;t&eacute;s&eacute;hez a Synology NAS-r&oacute;l DMA eszk&ouml;z&ouml;kre val&oacute; lej&aacute;tsz&aacute;shoz, be kell &aacute;ll&iacute;tania a m&eacute;dialej&aacute;tsz&aacute;si be&aacute;ll&iacute;t&aacute;sokat. P&eacute;ld&aacute;ul, a m&eacute;diaf&aacute;jlok b&ouml;ng&eacute;sz&eacute;si be&aacute;ll&iacute;t&aacute;s&aacute;nak a kezel&eacute;s&eacute;t, &eacute;s a f&aacute;jlok kompatibilit&aacute;s&aacute;nak a jav&iacute;t&aacute;s&aacute;t. Ez a funkci&oacute; el&eacute;rhető a <strong>M&eacute;diaszerver</strong> csomagban.</p>

<h3 class="list_head">1. A M&eacute;diaszerver telep&iacute;t&eacute;se</h3>
<p>A M&eacute;diaszerver telep&iacute;t&eacute;s&eacute;hez, k&eacute;rj&uuml;k, l&aacute;togasson el a <b>Csomagkezel&eacute;si k&ouml;zpontba</b>, keresse meg a <b>M&eacute;diaszerver</b>, majd kattintson a <b>Telep&iacute;t&eacute;s</b> gombra.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_install_media_server.png" width="640" border="1" />

<h3 class="list_head">2. Multim&eacute;dia f&aacute;jlok felt&ouml;lt&eacute;se a Synology NAS-ra</h3>
<p>Az alap&eacute;rtelmezett megosztott mapp&aacute;k, <b>photo</b>, <b>music</b> &eacute;s <b>video</b>, automatikusan elk&eacute;sz&uuml;lnek &eacute;s indexelve vannak a NAS-on tal&aacute;lhat&oacute; M&eacute;diaszerver telep&iacute;t&eacute;se ut&aacute;n. Azt kell tennie, hogy egyszerűen felt&ouml;ltse a m&eacute;diaf&aacute;jlokat, p&eacute;ld&aacute;ul a k&eacute;peket, dalokat vagy vide&oacute;kat, a megfelelő mapp&aacute;kba, &eacute;s ezek a f&aacute;jlok el&eacute;rhetők lesznek az &Ouml;n DMA eszk&ouml;zeiről.</p>
<div class="code_div"><b>Megjegyz&eacute;s:</b> A t&aacute;voli szervereken tal&aacute;lhat&oacute; csatlakoztatott megosztott mapp&aacute;kat nem lehet indexelt mapp&aacute;kk&eacute;nt hozz&aacute;adni. A Synology NAS-ra hozz&aacute;adhat ak&aacute;r 100 indexelt mapp&aacute;t.</div>

<h3 class="list_head">3. Konfigur&aacute;lja a b&ouml;ng&eacute;sz&eacute;si be&aacute;ll&iacute;t&aacute;sokat a m&eacute;dialej&aacute;tsz&oacute;hoz</h3>
<p>&Ouml;n eld&ouml;ntheti, hogy hogyan b&ouml;ng&eacute;szik a DMA eszk&ouml;z&ouml;k a Synology NAS-on tal&aacute;lhat&oacute; m&eacute;dia f&aacute;jlokat.</p>
<ol>
<li>Menjen a <b>Főmen&uuml; &gt; M&eacute;diaszerver</b> men&uuml;pontra.</li>
<li>Kattintson a <b>B&ouml;ng&eacute;sz&eacute;si be&aacute;ll&iacute;t&aacute;sokra</b> a bal oldali panelen.</li>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_browsing_settings.png" width="640" border="1" />
<li>Tov&aacute;bbi inform&aacute;ci&oacute;k&eacute;rt kattintson a <b>S&uacute;g&oacute;</b> gombra a <b>M&eacute;diaszerver</b> ablak jobb felső sark&aacute;ban.</li>
</ol>
<h3 class="list_head">4. DMA kompatibilit&aacute;s fokoz&aacute;sa</h3>
<p>Ha a DLNA/UPnP TV-nek vagy a DMA eszk&ouml;z&ouml;knek nem siker&uuml;l a multim&eacute;di&aacute;s tartalmak sima lej&aacute;tsz&aacute;sa a t&aacute;rolt NAS-on, akkor pr&oacute;b&aacute;lja meg a M&eacute;diaszerver <b>DMA kompatibilit&aacute;s&aacute;nak</b> a be&aacute;ll&iacute;t&aacute;sainak a konfigur&aacute;l&aacute;s&aacute;t.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_dma_compatibility.png" width="640" border="1" />
<div class="code_div"><b>Megjegyz&eacute;s:</b>
<ol>
  <li>Ha ellenőrizni szeretn&eacute;, hogy a DMA eszk&ouml;z megfelelően telep&iacute;tett &eacute;s, hogy a NAS a helyi h&aacute;l&oacute;zaton meg tudja tal&aacute;lni, kattintson az <b>Eszk&ouml;zlist&aacute;ra</b>. A DMA eszk&ouml;z&ouml;k list&aacute;ja jelenik meg a k&eacute;sz&uuml;l&eacute;kinf&oacute;val egy&uuml;tt.</li>
  <li>Győződj&ouml;n meg r&oacute;la, hogy nem jel&ouml;lte ki a <b>Korl&aacute;tozza a M&eacute;diaszerver val&oacute; hozz&aacute;f&eacute;r&eacute;st az &uacute;jonnan &eacute;szlelt UPnP/DLNA eszk&ouml;z&ouml;k sz&aacute;m&aacute;ra</b>. Ellenkező esetben, a M&eacute;diaszerver nem lesz el&eacute;rhető a DMA eszk&ouml;z&ouml;k sz&aacute;m&aacute;ra.</li>
</ol>
</div>
<p>Tov&aacute;bbi inform&aacute;ci&oacute;k&eacute;rt a technikai t&aacute;mogat&aacute;sr&oacute;l m&aacute;s form&aacute;tum&uacute; multim&eacute;di&aacute;s f&aacute;jlok sz&aacute;m&aacute;ra, kattintson a S&uacute;g&oacute; gombra a M&eacute;diaszerver ablak jobb felső sark&aacute;ban.</p>
<h3 class="list_head">5. A NAS-on t&aacute;rolt m&eacute;diaf&aacute;jlok el&eacute;r&eacute;se DLNA TV &aacute;ltal</h3>
<p>A DLNA/UPnP &eacute;s DMA eszk&ouml;z&ouml;k k&ouml;nnyen csatlakoztathat&oacute;k az otthoni h&aacute;l&oacute;zatra. Miut&aacute;n kapcsolatok keletkeznek az otthoni h&aacute;l&oacute;zatra a Synology NAS-on &eacute;s a DLNA eszk&ouml;z&ouml;k&ouml;n, a NAS-on b&ouml;ng&eacute;szheti a kiv&aacute;lasztott mapp&aacute;kat &eacute;s zen&eacute;t hallgathat, vagy vide&oacute;kat n&eacute;zhet nagy k&eacute;pernyőn.</p>
<div class="code_div"><b>Megjegyz&eacute;s:</b> A t&aacute;mogatott DLNA/UPnP TV-k &eacute;s DMA eszk&ouml;z&ouml;k list&aacute;j&aacute;r&oacute;l, amelyeket igazolta a Synology, k&eacute;rj&uuml;k, olvasson <a href="https://www.synology.com/compatibility?search_by=category&category=dlna_devices&p=1&not_recommend_mode=false" target="_blank">itt</a>.</div>
<p>A be&aacute;ll&iacute;t&aacute;si folyamat a DLNA-kompatibilis DMA eszk&ouml;z&ouml;ktől f&uuml;gg. Tov&aacute;bbi inform&aacute;ci&oacute;k&eacute;rt a NAS-on t&aacute;rolt m&eacute;diaf&aacute;jlokhoz val&oacute; hozz&aacute;f&eacute;r&eacute;shez a DLNA-n kereszt&uuml;l, k&eacute;rj&uuml;k, k&ouml;vesse a kliens eszk&ouml;z&ouml;k utas&iacute;t&aacute;s&aacute;t.</p>
</div>
<div class="page-info">
  <ul>
    <li>Következik a témában: <a href="home_theater_videos.html">Video Station-nal való videók kategorizálása és lejátszása</a> </li>
  </ul>
</div>
</body>

</html>