<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Vide&oacute;k szervez&eacute;se &eacute;s lej&aacute;tsz&aacute;sa Video Station-nal</title>
</head>

<body class="tutorial-content-box" >

<h1>Video Station-nal val&oacute; vide&oacute;k kategoriz&aacute;l&aacute;sa &eacute;s lej&aacute;tsz&aacute;sa</h1>
<div class="tutorials_content">

<img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.jpg"/>


<h2>&Aacute;ttekint&eacute;s</h2>
<p>A Video Station-nal, k&ouml;nnyen szervezheti &eacute;s kategoriz&aacute;lhatja a vide&oacute; gyűjtem&eacute;nyeket k&uuml;l&ouml;nb&ouml;ző alap&eacute;rtelmezett vagy egy&eacute;ni k&ouml;nyvt&aacute;rakba, annak &eacute;rdek&eacute;ben, hogy sokkal hat&eacute;konyabban megtal&aacute;lja a k&iacute;v&aacute;nt vide&oacute;t. Ezen k&iacute;v&uuml;l, a vide&oacute;k lej&aacute;tsz&aacute;sa &eacute;s megoszt&aacute;sa is ugyanolyan k&ouml;nnyű &eacute;s egyszerű, mint n&eacute;h&aacute;ny egyszerű kattint&aacute;s.</p>

<h3 class="list_head">1. A Video Station telep&iacute;t&eacute;se</h3>
<p>A Video Station telep&iacute;t&eacute;s&eacute;hez, k&eacute;rj&uuml;k, l&aacute;togasson el a <b>Csomagkezel&eacute;si k&ouml;zpontba</b>, keresse meg a <b>Video Station</b>-t, majd kattintson a <b>Telep&iacute;t&eacute;s</b> gombra.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/1.png" border="1"/>

<h3 class="list_head">2. T&aacute;rolja &eacute;s kategoriz&aacute;lja a vide&oacute;kat Alap&eacute;rtelmezett k&ouml;nyvt&aacute;rakba</h3>
<p>A Video Station h&aacute;rom alap&eacute;rtelmezett k&ouml;nyvt&aacute;rat biztos&iacute;t, a baloldali panelen: <b>Film</b>, <b>TV-műsor</b> &eacute;s <b>H&aacute;zi vide&oacute;</b>. Annak &eacute;rdek&eacute;ben, hogy a vide&oacute;k helyesen indexeltek &eacute;s kategoriz&aacute;ltak legyenek, minden k&ouml;nyvt&aacute;rhoz vide&oacute;mapp&aacute;kat kell hozz&aacute;adni, majd azut&aacute;n t&aacute;rolni a f&aacute;jlokat a megfelelő vide&oacute;mapp&aacute;kba. Alap&eacute;rtelmez&eacute;s szerint, h&aacute;rom vide&oacute;mapp&aacute;t hoztak l&eacute;tre a <b>video</b> megosztott mappa pont alatt, a h&aacute;rom alap&eacute;rtelmezett k&ouml;nyvt&aacute;r sz&aacute;m&aacute;ra: <b>film</b>, <b>TV-műsor</b> &eacute;s <b>h&aacute;zi vide&oacute;</b>. Azonban, ez a h&aacute;rom mappa mellett, a k&ouml;vetkezőket teheti, hogy t&ouml;bb vide&oacute; mapp&aacute;t adjon a k&ouml;nyvt&aacute;rakhoz.</p>

<div class="code_div">
<b>Megjegyz&eacute;s:</b>
<p>A rendszer automatikusan megkeresi az interneten a kapcsol&oacute;d&oacute; metaadatokat &eacute;s egy&eacute;b inform&aacute;ci&oacute;kat (pl. poszter k&eacute;p) a k&eacute;t vide&oacute; t&iacute;pus sz&aacute;m&aacute;ra (film &eacute;s TV-műsor). Teh&aacute;t, hogy biztos&iacute;tsa azt, hogy a vide&oacute;kat p&aacute;ros&iacute;tani lehet a megfelelő inform&aacute;ci&oacute;kkal, erősen aj&aacute;nlott, hogy a vide&oacute;knak meg kell egyezni&uuml;k a megadott vide&oacute; t&iacute;pusnak a saj&aacute;t k&ouml;nyvt&aacute;r&aacute;val.</p>
</div>

<h4>Vide&oacute; mapp&aacute;k hozz&aacute;ad&aacute;sa az alap&eacute;rtelmezett k&ouml;nyvt&aacute;rak sz&aacute;m&aacute;ra</h4>
<ol>
<li>Nyissa meg a <b>Be&aacute;ll&iacute;t&aacute;sok</b> &gt; <b>K&ouml;nyvt&aacute;rat</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/2.png" border="1"/>

<li>Kattintson a <b>L&eacute;trehoz&aacute;s</b> &gt; <b>Mappa hozz&aacute;ad&aacute;s&aacute;ra</b>, hogy a Synology NAS-on v&aacute;lasszon egy mapp&aacute;t, &eacute;s v&aacute;lassza ki a c&eacute;lk&ouml;nyvt&aacute;rat. Hozz&aacute;adhat ak&aacute;r 100 vide&oacute; mapp&aacute;t is egy k&ouml;nyvt&aacute;rba, de ha egy mappa ki van jel&ouml;lve, t&ouml;bb&eacute; sem a mapp&aacute;t, sem az al-mapp&aacute;kat nem lehet m&aacute;sik k&ouml;nyvt&aacute;r sz&aacute;m&aacute;ra kiv&aacute;lasztani.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/3.png" border="1"/>

<li>T&aacute;rolja a vide&oacute; f&aacute;jlokat a vide&oacute; mapp&aacute;kba, hogy kategoriz&aacute;lhassa a vide&oacute;kat a megfelelő k&ouml;nyvt&aacute;rakba.</li>
<li>Most m&aacute;r a k&ouml;nyvt&aacute;rakb&oacute;l b&ouml;ng&eacute;szheti, &eacute;s n&eacute;zheti a k&iacute;v&aacute;nt vide&oacute;kat!</li>
</ol>

<h3 class="list_head">3. A vide&oacute;k t&aacute;rol&aacute;sa &eacute;s kategoriz&aacute;l&aacute;sa Egy&eacute;ni k&ouml;nyvt&aacute;rakba</h3>
<p>A h&aacute;rom alap&eacute;rtelmezett k&ouml;nyvt&aacute;r mellett, amelyet b&aacute;rki el&eacute;rhet az alap&eacute;rtelmez&eacute;s szerint, &ouml;n mint DSM <B>admin</B> vagy a felhaszn&aacute;l&oacute;k akik a <b>administrators</b> csoportba tartoznak, &uacute;gyszint&eacute;n egy&eacute;ni k&ouml;nyvt&aacute;rakat hozhat l&eacute;tre &eacute;s hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;gokat ny&uacute;jthat a felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra.</p>

<h4>3.1 Egy&eacute;ni k&ouml;nyvt&aacute;rak l&eacute;trehoz&aacute;sa</h4>
<ol>
<li>Nyissa meg a <b>Be&aacute;ll&iacute;t&aacute;sok</b> &gt; <b>K&ouml;nyvt&aacute;rat</b>, &eacute;s kattintson a <b>L&eacute;trehoz</b> &gt; <b>K&ouml;nyvt&aacute;rat l&eacute;trehoz</b> men&uuml;pontot.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/4.png" border="1"/>

<li>Adjon meg egy nevet az &uacute;j k&ouml;nyvt&aacute;rnak, v&aacute;lassza ki, hogy milyen t&iacute;pus&uacute; vide&oacute;kat szeretne a mapp&aacute;ba helyezni, majd v&aacute;lassza ki a <b>Nyilv&aacute;nos</b>men&uuml;pontot ha azt szeretn&eacute;, hogy a k&ouml;nyvt&aacute;r el&eacute;rhető legyen mindenki sz&aacute;m&aacute;ra, vagy v&aacute;lassza ki a <b>Saj&aacute;t</b> men&uuml;pontot, ha korl&aacute;tozni szeretn&eacute; a hozz&aacute;f&eacute;r&eacute;st bizonyos felhaszn&aacute;l&oacute;knak, akik jogosults&aacute;ggal rendelkeznek. K&eacute;rj&uuml;k, vegye figyelembe, hogy a mapp&aacute;ba helyezett vide&oacute;knak meg kell egyezni&uuml;k a kiv&aacute;lasztott t&iacute;pussal, ami pontoss&aacute;got biztos&iacute;t az interneten begyűjt&ouml;tt vide&oacute;k inform&aacute;ci&oacute;j&aacute;val.</li>
<li>Ha <b>Saj&aacute;tot</b> v&aacute;laszt, kattintson a <b>Jogosults&aacute;g hozz&aacute;rendel&eacute;se</b> gombra &eacute;s jel&ouml;lje ki a jel&ouml;lőn&eacute;gyzeteket, hogy hozz&aacute;f&eacute;r&eacute;st biztos&iacute;tson a felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra.</li>
</ol>

<h4>3.2 Vide&oacute; mapp&aacute;k hozz&aacute;ad&aacute;sa az egy&eacute;ni k&ouml;nyvt&aacute;rakba</h4>
<ol>
<li>Nyissa meg a <b>Be&aacute;ll&iacute;t&aacute;sok</b> &gt; <b>K&ouml;nyvt&aacute;rat</b>.</li>
<li>Kattintson a <b>L&eacute;trehoz&aacute;s</b> &gt; <b>Mappa hozz&aacute;ad&aacute;s&aacute;ra</b>, hogy a Synology NAS-on v&aacute;lasszon egy mapp&aacute;t, &eacute;s v&aacute;lassza ki a c&eacute;lk&ouml;nyvt&aacute;rat. Hozz&aacute;adhat ak&aacute;r 100 vide&oacute; mapp&aacute;t is egy k&ouml;nyvt&aacute;rba, de ha egy mappa ki van jel&ouml;lve, t&ouml;bb&eacute; sem a mapp&aacute;t, sem az al-mapp&aacute;kat nem lehet m&aacute;sik k&ouml;nyvt&aacute;r sz&aacute;m&aacute;ra kiv&aacute;lasztani.</li>
<li>T&aacute;rolja a vide&oacute; f&aacute;jlokat a vide&oacute; mapp&aacute;kba, hogy kategoriz&aacute;lhassa a vide&oacute;kat a megfelelő k&ouml;nyvt&aacute;rakba.</li>
<li>Most m&aacute;r a k&ouml;nyvt&aacute;rakb&oacute;l b&ouml;ng&eacute;szheti, &eacute;s n&eacute;zheti a k&iacute;v&aacute;nt vide&oacute;kat!</li>
</ol>

<h3 class="list_head">4. Vide&oacute;k lej&aacute;tsz&aacute;sa</h3>
<p>Ha m&aacute;r k&uuml;l&ouml;nb&ouml;ző k&ouml;nyvt&aacute;rakba kategoriz&aacute;lta a vide&oacute; f&aacute;jlokat, akkor k&ouml;vesse az al&aacute;bbi l&eacute;p&eacute;seket, hogy lej&aacute;tssza a vide&oacute;kat a Video Station-en. Legelősz&ouml;r, erősen aj&aacute;nlott a <a href="http://www.videolan.org/vlc/" target="_blank">VLC media player (Windows, Linux)</a> telep&iacute;t&eacute;se a sz&aacute;m&iacute;t&oacute;g&eacute;pre. Amellett, hogy lej&aacute;tssza a vide&oacute;kat a helyi sz&aacute;m&iacute;t&oacute;g&eacute;pen, akkor is vide&oacute;folymokat k&eacute;sz&iacute;thet a DLNA/UPnP-kompatibilis DMA-ra vagy AirPlay kompatibilis eszk&ouml;z&ouml;kre a vide&oacute; lej&aacute;tsz&aacute;s&aacute;hoz.</p>

<h4>J&aacute;tssza le a vide&oacute;kat a be&aacute;gyazott vide&oacute; lej&aacute;tsz&oacute;val</h4>
<ol>
<li>V&aacute;lassza ki a k&iacute;v&aacute;nt videoklipet, majd kattintson a lej&aacute;tsz&aacute;s ikonra a videok&eacute;pen, vagy kattintson a <b>Művelet</b> &gt; <b>Lej&aacute;tsz&aacute;s</b> men&uuml;pontra.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/5.png" border="1"/>

<li>A vide&oacute; lej&aacute;tsz&aacute;s azonnal kezdődik. Ha nem, k&eacute;rj&uuml;k, győződj&ouml;n meg arr&oacute;l, hogy a webb&ouml;ng&eacute;sző t&aacute;mogatja a vide&oacute; form&aacute;tum&aacute;t vagy, hogy telep&iacute;tett VLC bőv&iacute;tm&eacute;nyt a sz&aacute;m&iacute;t&oacute;g&eacute;pre.</li>
<li>Sz&uuml;ks&eacute;g szerint haszn&aacute;lja a k&eacute;pernyőn megjelenő gombokat &eacute;s a folyamatjelző s&aacute;vot a Video Player alj&aacute;n. &Uacute;gyszint&eacute;n, be&aacute;ll&iacute;thatja a hangerőt, kiv&aacute;laszthatja a vide&oacute; lej&aacute;tsz&aacute;si minős&eacute;get &eacute;s a hangs&aacute;vot, bekapcsolhatja a feliratokat, vagy vide&oacute;folyamot k&eacute;sz&iacute;thet egy m&aacute;sik eszk&ouml;zre (ha van ilyen).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/6.png" border="1"/>

</ol>


<div class="code_div">
<b>Megjegyz&eacute;s:</b>
<p>R&eacute;szletes inform&aacute;ci&oacute;k&eacute;rt a VLC bőv&iacute;tm&eacute;nyről &eacute;s a t&aacute;mogatott eszk&ouml;z&ouml;kről, l&aacute;ssa a <b>DSM S&uacute;g&oacute;</b> &gt; <b>Video Station</b> &gt; <b>Videolej&aacute;tsz&aacute;s</b> men&uuml;pontot.</p>
</div>
 
<h3 class="list_head">5. Vide&oacute;k megoszt&aacute;sa a nyilv&aacute;noss&aacute;ggal</h3> 
<p>A nyilv&aacute;nos megoszt&aacute;s funkci&oacute; seg&iacute;ts&eacute;g&eacute;vel k&ouml;nnyed&eacute;n megoszthatja vide&oacute;it m&aacute;sokkal a Video Station haszn&aacute;lat&aacute;val. A megosztott vide&oacute;k nyilv&aacute;nosan hozz&aacute;f&eacute;rhetőek b&aacute;rki sz&aacute;m&aacute;ra aki hivatkoz&aacute;ssal rendelkezik, &eacute;s ezt kezelni lehet a <b>Gyűjtem&eacute;ny</b> oldalon.</p>

<h4>Vide&oacute;k megoszt&aacute;sa m&aacute;sokkal</h4>
<ol>
<li>Nyissa meg b&aacute;rmelyik vide&oacute; k&ouml;nyvt&aacute;rat, &eacute;s kattintson a <b>Minden</b> gombra a jobb felső sarokban, az &ouml;sszes vide&oacute;k megtekint&eacute;s&eacute;hez ebben a k&ouml;nyvt&aacute;rban.</li>
<li>Kattintson a <b>V&aacute;laszt&aacute;si m&oacute;d</b> ikonra, vagy nyomja meg &eacute;s tartsa lenyomva a <b>Ctrl</b> vagy a <b>Shift</b> billentyűt t&ouml;bb vide&oacute; kiv&aacute;laszt&aacute;s&aacute;hoz. Majd kattintson a <b>Művelet</b> &gt; <b>Megoszt&aacute;s a nyilv&aacute;noss&aacute;ggal</b> men&uuml;pontra.</li>
<ul>
<li>Ha csak egy vide&oacute;t v&aacute;lasztott ki a megoszt&aacute;shoz, a vide&oacute; egy megosztott gyűjtem&eacute;nyhez lesz hozz&aacute;adva, <b>Megosztott vide&oacute;k</b> n&eacute;ven. Ott egyenk&eacute;nt kezelheti a megosztott vide&oacute;kat.</li>
<li>Ha t&ouml;bb kiv&aacute;lasztott vide&oacute;t k&iacute;v&aacute;n megosztani, a vide&oacute;k egy &uacute;j k&ouml;z&ouml;s gyűjtem&eacute;nybe lesznek csoportos&iacute;tva.</li>
</ul>
<li>Alternat&iacute;vak&eacute;nt, kattintson a <b>Művelet</b> &gt; <b>Gyűjtem&eacute;ny</b> men&uuml;pontra, hogy kiv&aacute;lasztott vide&oacute;kat helyezzen egy megl&eacute;vő k&ouml;z&ouml;s gyűjtem&eacute;nybe (ha van ilyen).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/7.png" border="1"/>

<li>Adjon meg egy &eacute;rv&eacute;nyess&eacute;gi időt, ha sz&uuml;ks&eacute;ges.</li>
<li>Egyszerűen m&aacute;solja &eacute;s illessze be a hivatkoz&aacute;st e-mailekbe, azonnali &uuml;zenetekbe &eacute;s weboldalakra, hogy mindenkivel meg tudja osztani a vide&oacute;kat.</li>
</ol> 


<h3 class="list_head">6. Vide&oacute;k szervez&eacute;se &eacute;s megtekint&eacute;se mobileszk&ouml;z&ouml;k&ouml;n</h3>
<p>A Video Station-hoz val&oacute; csatlakoz&aacute;shoz mobil eszk&ouml;z&ouml;k&ouml;n kereszt&uuml;l, let&ouml;ltheti a DS vide&oacute;t iOS/Android eszk&ouml;zzel vagy Windows Phone-al haszn&aacute;lva az al&aacute;bbi QR-k&oacute;dokat a vide&oacute;k lej&aacute;tsz&aacute;s&aacute;hoz &eacute;s a gyűjtem&eacute;nyek megszervez&eacute;s&eacute;hez a mobil eszk&ouml;z&eacute;n, vagy vide&oacute;folyamokat k&eacute;sz&iacute;thet a DMA vagy AirPlay eszk&ouml;z&ouml;kre otthon &eacute;s &uacute;tk&ouml;zben.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/>
<div class="page-info">
  <ul>
    <li>Korábban a témában: <a href="home_theater_media_server.html">Élvezze a Synology NAS-on tárolt multimédiás tartalmakat nagy képernyőkön</a> </li>
    <li>Következik a témában: <a href="home_theater_music.html">Élvezze a Synology NAS-on tárolt zenét Audio Station-nal</a> </li>
  </ul>
</div>
</div>
</body>
</html>