<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Hozzon l&eacute;tre albumokat a Photo Station-nal val&oacute; fot&oacute;k kezel&eacute;s&eacute;hez &eacute;s b&ouml;ng&eacute;sz&eacute;s&eacute;hez</title>
</head>

<body class="tutorial-content-box" >

<h1>Hozzon l&eacute;tre albumokat a Photo Station-nal val&oacute; fot&oacute;k kezel&eacute;s&eacute;hez &eacute;s b&ouml;ng&eacute;sz&eacute;s&eacute;hez</h1>
<div class="tutorials_content">

<img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/>

<h2>&Aacute;ttekint&eacute;s</h2>
<p>A Photo Station egy web-alap&uacute; alkalmaz&aacute;s amely azzal a c&eacute;llal lett megtervezve, hogy az interneten, a Synology NAS-on t&aacute;rolt f&eacute;nyk&eacute;peket seg&iacute;tsen megszervezni &eacute;s megtekinteni. A Photo Station kifinomult &eacute;s felhaszn&aacute;l&oacute;bar&aacute;t fel&uuml;lete, lehetőv&eacute; teszi, hogy felt&ouml;ltse, b&ouml;ng&eacute;ssze, kezelje, &eacute;s megossza a fot&oacute;albumait mind&ouml;ssze n&eacute;h&aacute;ny kattint&aacute;ssal.</p>

<h3 class="list_head">1. A Photo Station telep&iacute;t&eacute;se</h3>
<p>A Photo Station telep&iacute;t&eacute;s&eacute;hez, k&eacute;rj&uuml;k, l&aacute;togasson el a <b>Csomagkezel&eacute;si k&ouml;zpontba</b>, keresse meg a <b>Photo Station</b>-t, majd kattintson a <b>Telep&iacute;t&eacute;s</b> gombra.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/>

<h3 class="list_head">2. F&eacute;nyk&eacute;pek felt&ouml;lt&eacute;se</h3>
<p>Mielőtt f&eacute;nyk&eacute;peket b&ouml;ng&eacute;szne &eacute;s kezelne a Photo Station-ben, elősz&ouml;r is albumokat kell l&eacute;trehoznia &eacute;s f&eacute;nyk&eacute;peket kell felt&ouml;ltenie, az al&aacute;bbi m&oacute;dszerek b&aacute;rmelyik&eacute;vel.</p>

<h4>2.1 T&ouml;lts&ouml;n fel f&eacute;nyk&eacute;peket a Photo Station Uploader seg&iacute;ts&eacute;g&eacute;vel (Windows &eacute;s Mac sz&aacute;m&aacute;ra)</h4>
<p>Javasoljuk a Photo Station Uploader haszn&aacute;lat&aacute;t mivel minden egyes f&eacute;nyk&eacute;p megjelen&iacute;t&eacute;sekor indexk&eacute;pek &aacute;llnak elő a felt&ouml;lt&eacute;si folyamat alatt. A Photo Station Uploader &aacute;ltal felt&ouml;lt&ouml;tt f&aacute;jlok serkentik a sz&aacute;m&iacute;t&oacute;g&eacute;p sz&aacute;m&iacute;t&aacute;si k&eacute;pess&eacute;g&eacute;t, ami felgyors&iacute;tja az &aacute;talak&iacute;t&aacute;st.</p>
<ol>
<li>T&ouml;ltse le &eacute;s telep&iacute;tse a <b>Photo Station Uploader</b>-t (el&eacute;rhető a <a href="https://www.synology.com/support/download/DS713+" target="_blank">Synology Let&ouml;ltők&ouml;zpontj&aacute;ban</a>).</li>
<li>A sz&aacute;m&iacute;t&oacute;g&eacute;pen kattintson jobb gombbal a felt&ouml;lteni k&iacute;v&aacute;nt fot&oacute;kra, &eacute;s v&aacute;lassza ki a <b>Felt&ouml;lt&eacute;s Photo Station-ra</b> &gt; <b>&Uacute;j profil l&eacute;trehoz&aacute;sa</b>, a var&aacute;zsl&oacute; megnyit&aacute;s&aacute;hoz.</li>
<li>Adjon meg egy nevet a saj&aacute;t v&aacute;laszt&aacute;sa szerint &eacute;s a c&eacute;l Synology NAS kiszolg&aacute;l&oacute; nev&eacute;t/IP-c&iacute;m&eacute;t az &uacute;j profilhoz.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/>

<div class="code_div">
<b>Megjegyz&eacute;s:</b>
<p>A megadott kiszolg&aacute;l&oacute; adatok &eacute;s a felhaszn&aacute;l&oacute;i hiteles&iacute;tő adatok mentve lesznek ezen a profilon k&eacute;sőbbi haszn&aacute;latra. Be&aacute;ll&iacute;that t&ouml;bb profilt k&uuml;l&ouml;nb&ouml;ző szab&aacute;lyok vagy c&eacute;lok szerint. Ahelyett, hogy &uacute;jra kiszolg&aacute;l&oacute;i adatokat biztos&iacute;t a k&ouml;vetkező alkalommal amikor a Photo Station Uploader-t haszn&aacute;lja, v&aacute;lasszon ki egy megl&eacute;vő profilt &eacute;s haszn&aacute;lja a kor&aacute;bban be&aacute;ll&iacute;tott konfigur&aacute;ci&oacute;kat, hogy felt&ouml;lthesse a f&eacute;nyk&eacute;peket ugyanarra a c&eacute;lra.</p>
</div>

<li>V&aacute;lassza ki, hogy a f&aacute;jlokat a Photo Station-ra vagy a Szem&eacute;lyes Photo Station-ra szeretn&eacute; felt&ouml;lteni.</li>

<li>Adja meg a felhaszn&aacute;l&oacute;i hiteles&iacute;t&eacute;si adatokat a c&eacute;l Synology NAS-hoz.</li>

<li>Kattintson a <b>Tall&oacute;z&aacute;s</b> gombra egy c&eacute;lmappa kiv&aacute;laszt&aacute;s&aacute;hoz, vagy hozzon l&eacute;tre egy alk&ouml;nyvt&aacute;rat a <b>photo</b> megosztott mapp&aacute;ba.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/>

<li>Ha v&eacute;ge a felt&ouml;lt&eacute;snek, akkor a Synology NAS-on elind&iacute;thatja a Photo Station-t, &eacute;s tekintse meg a felt&ouml;lt&ouml;tt f&aacute;jlokat k&uuml;l&ouml;nb&ouml;ző m&oacute;dokban vagy szerkeszthet egy&eacute;b inform&aacute;ci&oacute;kat, mint az album tulajdons&aacute;gai &eacute;s a hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;gok.</li>
</ol>


<h4>2.2 Hozzon l&eacute;tre albumokat &eacute;s t&ouml;lts&ouml;n fel f&eacute;nyk&eacute;peket a Photo Station seg&iacute;ts&eacute;g&eacute;vel</h4>
<p>Ind&iacute;tsa meg a <b>Photo Station</b>-t, &eacute;s kattintson a <b>Hozz&aacute;ad&aacute;s</b> gombra, hogy l&eacute;trehozzon egy &uacute;j albumot vagy, hogy felt&ouml;lthessen f&eacute;nyk&eacute;peket a sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;ről vagy a Synology NAS-r&oacute;l m&aacute;r megl&eacute;vő albumokba.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/>

<div class="code_div">
<b>Megjegyz&eacute;s:</b>
<p>Ha a fot&oacute;k felt&ouml;lt&eacute;se ink&aacute;bb a Photo Station fel&uuml;leten kereszt&uuml;l t&ouml;rt&eacute;nik, akkor erősen aj&aacute;nlott a QuickConnect szolg&aacute;ltat&aacute;s enged&eacute;lyez&eacute;se. Ak&aacute;r otthon, ak&aacute;r &uacute;tk&ouml;zben, a QuickConnect lehetőv&eacute; teszi a Synology NAS &eacute;s a Photo Station hozz&aacute;f&eacute;r&eacute;s&eacute;t b&aacute;rhonnan az interneten kereszt&uuml;l egy egyedi azonos&iacute;t&oacute; seg&iacute;ts&eacute;g&eacute;vel, bonyolult h&aacute;l&oacute;zati konfigur&aacute;ci&oacute;k l&eacute;trehoz&aacute;sa n&eacute;lk&uuml;l, mint amilyenek p&eacute;ld&aacute;ul a porttov&aacute;bb&iacute;t&aacute;si szab&aacute;lyok. A QuickConnect-ről val&oacute; tov&aacute;bbi inform&aacute;ci&oacute;k&eacute;rt k&eacute;rj&uuml;k, l&aacute;togasson el <a class="launch-app" href="cloud_set_up_quickconnect.html">erre az oktat&oacute;anyagra</a>.</p>
</div>

<h3 class="list_head">3. F&eacute;nyk&eacute;pek megoszt&aacute;sa</h3>
<p>A megoszt&aacute;s funkci&oacute; seg&iacute;ts&eacute;g&eacute;vel k&ouml;nnyed&eacute;n megoszthatja a bar&aacute;taival a t&aacute;rolt f&eacute;nyk&eacute;peket a Photo Station-en, vagy t&ouml;ltse fel a f&eacute;nyk&eacute;peket a n&eacute;pszerű k&ouml;z&ouml;ss&eacute;gi h&aacute;l&oacute;zatokra, mint a Facebook, Picasa &eacute;s Flickr.</p>

<h4>3.1 Ossza meg a f&eacute;nyk&eacute;peit a nyilv&aacute;noss&aacute;ggal</h4>
<ol>
<li>Az album tall&oacute;z&aacute;sakor v&aacute;lassza ki a megosztani k&iacute;v&aacute;nt fot&oacute;kat.</li>
<li>Kattintson a <b>Megoszt&aacute;s</b> &gt; <b>Megoszt&aacute;s nyilv&aacute;noss&aacute;ggal</b>, a hivatkoz&aacute;s megszerz&eacute;s&eacute;hez.</li>
<ul>
<li>Ha csak egy f&eacute;nyk&eacute;pet v&aacute;lasztott ki a megoszt&aacute;shoz, a f&eacute;nyk&eacute;p egy alap&eacute;rtelmezett megosztott albumhoz lesz hozz&aacute;adva, <b>Megosztott f&eacute;nyk&eacute;pek</b> n&eacute;ven. Ott egyenk&eacute;nt kezelheti a megosztott f&eacute;nyk&eacute;peket.</li>
<li>Ha t&ouml;bb kiv&aacute;lasztott f&eacute;nyk&eacute;pet k&iacute;v&aacute;n megosztani, a f&eacute;nyk&eacute;pek egy &uacute;j k&ouml;z&ouml;s albumba lesznek csoportos&iacute;tva.</li>
</ul>
<li>Alternat&iacute;vak&eacute;nt, kattintson a <b>Megoszt&aacute;s</b> &gt; <b>Hozz&aacute;ad&aacute;s k&ouml;z&ouml;s albumhoz</b> men&uuml;pontra, hogy kiv&aacute;lasztott f&eacute;nyk&eacute;peket helyezzen egy megl&eacute;vő k&ouml;z&ouml;s albumba (ha van ilyen).</li>
<img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/>
<li>Adja meg az &uacute;j k&ouml;z&ouml;s album nev&eacute;t, &eacute;s adja meg az &eacute;rv&eacute;nyess&eacute;gi időt, ha sz&uuml;ks&eacute;ges.</li>
<li>M&aacute;solja &eacute;s illessze be a hivatkoz&aacute;st e-mailekbe, azonnali &uuml;zenetekbe &eacute;s weboldalakra, hogy mindenkivel meg tudja osztani a kiv&aacute;lasztott f&eacute;nyk&eacute;peket.</li>
</ol>

<div class="code_div">
<b>Megjegyz&eacute;s:</b>
<ul>
<li>A megosztott f&eacute;nyk&eacute;pek nyilv&aacute;nosan hozz&aacute;f&eacute;rhetőek b&aacute;rki sz&aacute;m&aacute;ra aki hivatkoz&aacute;ssal rendelkezik.</li>
<li>Megadhatja, hogy mely felhaszn&aacute;l&oacute;k rendelkeznek azzal a kiv&aacute;lts&aacute;ggal, hogy megossz&aacute;k a Photo Station elemeket a nyilv&aacute;noss&aacute;ggal a <b>Be&aacute;ll&iacute;t&aacute;sok</b> &gt; <b>Megoszt&aacute;s</b> men&uuml;pont alatt.</li>
</ul>
</div>

<h4>3.2 F&eacute;nyk&eacute;pek megoszt&aacute;sa a k&ouml;z&ouml;ss&eacute;gi h&aacute;l&oacute;zatokon</h4>
<ol>
<li>V&aacute;lassza ki a felt&ouml;lteni k&iacute;v&aacute;nt f&eacute;nyk&eacute;peket, majd v&aacute;lassza a <b>Megoszt&aacute;s</b> &gt; <b>Felt&ouml;lt&eacute;s a [k&ouml;z&ouml;ss&eacute;gi oldalakra]</b> men&uuml;pontot.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/>

<li>A megjelenő ablakban kattintson a <b>Csatlakoz&aacute;s a [k&ouml;z&ouml;ss&eacute;gi oldalakkal]</b> &eacute;s enged&eacute;lyezze a saj&aacute;t k&ouml;z&ouml;ss&eacute;gi oldal fi&oacute;kj&aacute;val. V&aacute;laszthat, hogy a f&eacute;nyk&eacute;peket felt&ouml;lti egy &uacute;j vagy egy megl&eacute;vő albumra.</li>
</ol>

<h3 class="list_head">4. F&eacute;nyk&eacute;pek szervez&eacute;se &eacute;s b&ouml;ng&eacute;sz&eacute;se mobileszk&ouml;z&ouml;k&ouml;n</h3>
<p>A Photo Station-hoz val&oacute; csatlakoz&aacute;shoz vagy a f&eacute;nyk&eacute;pek mobil eszk&ouml;z&ouml;k&ouml;n kereszt&uuml;li felt&ouml;lt&eacute;s&eacute;hez, telep&iacute;tse a <b>DS photo+</b> alkalmaz&aacute;st a mobil eszk&ouml;z&eacute;re, haszn&aacute;lva az al&aacute;bbi QR k&oacute;dokat.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/>


</div>

</body>
</html>