<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>A NAS biztons&aacute;ga</title>
</head>

<body class="tutorial-content-box" >

<h1>A Synology NAS biztons&aacute;ga</h1>
<div class="tutorials_content">
<p><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/Intro.jpg" /></p>
<h2>Áttekintés</h2>
<p>A DSM egy &uacute;j szolg&aacute;ltat&aacute;ssal rendelkezik, a Biztons&aacute;gi tan&aacute;csad&oacute;val, amely seg&iacute;t megőrizni a Synology NAS biztons&aacute;g&aacute;t. A Biztons&aacute;gi tan&aacute;csad&oacute; ellenőrzi a Synology NAS teljes konfigur&aacute;ci&oacute;j&aacute;t &eacute;s r&eacute;szletes jelent&eacute;st ny&uacute;jt annak biztons&aacute;gi &aacute;llapot&aacute;r&oacute;l. Ezen k&iacute;v&uuml;l, a Biztons&aacute;gi tan&aacute;csad&oacute; megmutatja, hogyan kell kezelni az azonos&iacute;tott biztons&aacute;gi kock&aacute;zatokat. Nyissa meg a Biztons&aacute;gi tan&aacute;csad&oacute;t &eacute;s tanulja meg, hogyan kell:</p>
<ul>
  <li>Biztons&aacute;gi vizsg&aacute;lat futtat&aacute;sa</li>
  <li>Biztons&aacute;gi szab&aacute;ly jelent&eacute;seket megtekinteni</li>
  <li>Biztons&aacute;gi tan&uacute;s&iacute;tv&aacute;nyok kezel&eacute;se</li>
</ul>

<h3 class="list_head">1. Biztons&aacute;gi vizsg&aacute;lat futtat&aacute;sa </h3>
<ol>
	<li>Az első alkalommal, amikor megnyitja a Biztons&aacute;gi tan&aacute;csad&oacute;t, a rendszer majd k&eacute;rdezi, hogy mire haszn&aacute;lja a Synology NAS-t. V&aacute;lasszon az <strong>Otthon</strong> vagy a <strong>Munka</strong> k&ouml;z&ouml;tt, a helyzettől f&uuml;ggően &eacute;s kattintson az <strong>OK</strong> gombra. B&aacute;rmikor m&oacute;dos&iacute;thatja ezt a be&aacute;ll&iacute;t&aacute;st k&eacute;sőbb a <strong>Speci&aacute;lis</strong> oldalon.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/01.png" />
	<li>A Biztons&aacute;gi tan&aacute;csad&oacute; vizsg&aacute;lni kezdi a Synology NAS konfigur&aacute;ci&oacute;t. Megtekintheti az &aacute;ltal&aacute;nos biztons&aacute;gi &aacute;llapotot, a vizsg&aacute;lat folyamat&aacute;t. &eacute;s az eredm&eacute;nyek &ouml;sszefoglal&aacute;s&aacute;t az <strong>&Aacute;ttekint&eacute;s</strong> oldalon.</li><img alt="" style="display:block;"   width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/02.png" />
	<li>Amint a vizsg&aacute;lat befejeződik, megjelennek az egyes kateg&oacute;ri&aacute;kra vonatkoz&oacute; biztons&aacute;gi szab&aacute;lyok. A Biztons&aacute;gi tan&aacute;csad&oacute; minden kateg&oacute;ria &aacute;ltal&aacute;nos &aacute;llapot&aacute;t biztos&iacute;tja &eacute;s &ouml;sszefoglalja b&aacute;rmilyen biztons&aacute;gi kock&aacute;zatok meg&aacute;llap&iacute;t&aacute;s&aacute;t. </li><img alt="" style="display:block;" width="680" height="391"  src="../../images/SecureNAS/1x/Secure_NAS/03.png" />
</ol>
<h3 class="list_head">2. Biztons&aacute;gi szab&aacute;ly jelent&eacute;seket megtekinteni</h3>
<ol>
<li>Kattintson az <strong>Eredm&eacute;nyek megtekint&eacute;s&eacute;hez</strong> az <strong>&Aacute;ttekint&eacute;s</strong> oldalon.<strong></strong>R&eacute;szletes inform&aacute;ci&oacute;kat tekinthet meg a v&eacute;grehajtott vizsg&aacute;latr&oacute;l az egyedi jelent&eacute;sek alapj&aacute;n.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/04.png" />
<li>Kattintson dupl&aacute;n b&aacute;rmely biztons&aacute;gi szab&aacute;lyra a r&eacute;szletes jelent&eacute;s megnyit&aacute;s&aacute;hoz. Minden jelent&eacute;s tartalmazhat inform&aacute;ci&oacute;kat minden biztons&aacute;gi szab&aacute;ly <strong>S&uacute;lyoss&aacute;g&aacute;r&oacute;l</strong>, <strong>Le&iacute;r&aacute;s&aacute;r&oacute;l</strong>, <strong>Adatair&oacute;l</strong> &eacute;s <strong>Javasolt műveleteiről</strong>.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/05.png" />
</ol>

<h3 class="list_head">3. Biztons&aacute;gi tan&uacute;s&iacute;tv&aacute;nyok kezel&eacute;se</h3>
<p>Vess&uuml;nk pillant&aacute;st egy sikertelen biztons&aacute;gi szab&aacute;ly p&eacute;ld&aacute;j&aacute;ra &eacute;s hogyan kell azt kezelni.</p>
<ol>
<li>A Biztons&aacute;gi tan&aacute;csad&oacute; azonos&iacute;tja a lehets&eacute;ges biztons&aacute;gi kock&aacute;zatokat b&aacute;rmely sikertelen biztons&aacute;gi szab&aacute;ly sz&aacute;m&aacute;ra.  Itt a Biztons&aacute;gi tan&aacute;csad&oacute; azt &eacute;rz&eacute;keli, hogy az &quot;Automatikus blokkol&aacute;s ki van kapcsolva&quot;.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/06.png" />
<li>Nyissa meg a sikertelen biztons&aacute;gi szab&aacute;lyt, a r&eacute;szletes inform&aacute;ci&oacute;k megtekint&eacute;s&eacute;hez. A <strong>Javasolt művelet</strong> alatt, a Biztons&aacute;gi tan&aacute;csad&oacute; &uacute;tmutat&aacute;st ad, hogyan kell kezelni ezt a biztons&aacute;gi kock&aacute;zatot.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/07.png" />
<li>Kattintson a <strong>Megnyit&aacute;sra</strong>, hogy k&ouml;zvetlen&uuml;l a megfelelő be&aacute;ll&iacute;t&aacute;sokra ugorjon, &eacute;s k&ouml;vesse a <strong>Javasolt műveletet</strong>.</li>
<li>A <strong>Tal&aacute;latok</strong> oldalon vizsg&aacute;lja &uacute;jra a sikertelen biztons&aacute;gi szab&aacute;lyt a szab&aacute;ly kiv&aacute;laszt&aacute;sa &aacute;ltal, &eacute;s kattintson a <strong>Vizsg&aacute;latra</strong>.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/08.png" />
<li>Ehhez a biztons&aacute;gi szab&aacute;lyhoz nincs biztons&aacute;gi kock&aacute;zat &eacute;szlelve. A Biztons&aacute;gi tan&aacute;csad&oacute; tov&aacute;bbra is seg&iacute;t azonos&iacute;tani a potenci&aacute;lis biztons&aacute;gi kock&aacute;zatokat &eacute;s a javasolt int&eacute;zked&eacute;seket ezen kock&aacute;zatok kezel&eacute;s&eacute;re. Tartsa a Synology NAS-t biztons&aacute;gban a Biztons&aacute;gi tan&aacute;csad&oacute; rendszeres vizsg&aacute;latai &aacute;ltal!</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/09.png" />
</ol>
</div>

</body>

</html>
