<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Synology NAS-ra val&oacute; f&aacute;jlok t&aacute;rol&aacute;sa Windows sz&aacute;m&iacute;t&oacute;g&eacute;pről a helyi h&aacute;l&oacute;zaton bel&uuml;l</title>
</head>

<body class="tutorial-content-box" >

<h1>Synology NAS-ra val&oacute; f&aacute;jlok t&aacute;rol&aacute;sa Windows sz&aacute;m&iacute;t&oacute;g&eacute;pről a helyi h&aacute;l&oacute;zaton bel&uuml;l</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_windows/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Windows.jpg"/>
<h2>&Aacute;ttekint&eacute;s</h2>
<p>A Synology NAS a f&aacute;jlok gyors &eacute;s egyszerű t&aacute;rol&aacute;s&aacute;ra &eacute;s megoszt&aacute;s&aacute;ra a helyi h&aacute;l&oacute;zaton bel&uuml;lre lett tervezve, ami lehetőv&eacute; teszi, hogy k&ouml;zvetlen&uuml;l el&eacute;rje a megosztott mapp&aacute;kat &eacute;s f&aacute;jlokat a Synology NAS-on, ami &aacute;ltal elker&uuml;lheti, hogy mindig bejelentkezzen a DSM-re. P&eacute;ld&aacute;ul, akkor k&eacute;pes lesz arra, hogy a Windows Int&eacute;ző seg&iacute;ts&eacute;g&eacute;vel a Synology NAS-ra t&aacute;rolja a f&aacute;jlokat, mint b&aacute;rmely m&aacute;s h&aacute;l&oacute;zati eszk&ouml;zzel.</p>

<h3 class="list_head">Csatlakoztat&aacute;s Windows Int&eacute;zővel</h3>
<ol>
<li>Nyissa meg a Windows Int&eacute;zőt, &eacute;s menjen a <b>Sz&aacute;m&iacute;t&oacute;g&eacute;p</b>-re.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image1.png"/>
<li>Kattintson a <b>H&aacute;l&oacute;zati meghajt&oacute; csatlakoztat&aacute;s&aacute;ra</b>. Ez a művelet megjelen&iacute;ti H&aacute;l&oacute;zati meghajt&oacute; csatlakoztat&aacute;s ablak&aacute;t.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image2.png"/>
<li>A H&aacute;l&oacute;zati meghajt&oacute; csatlakoztat&aacute;s ablakban v&aacute;lasszon egy meghajt&oacute;betűjelet a <b>Meghajt&oacute;</b> leg&ouml;rd&uuml;lő men&uuml;j&eacute;ből.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image3.png"/>
<li>A <b>Mappa</b> mezőbe &iacute;rja be a Synology NAS kiszolg&aacute;l&oacute;nev&eacute;t &eacute;s a megosztott mappa nev&eacute;t amelyet ford&iacute;tott t&ouml;rtvonalak előznek meg &eacute;s v&aacute;lasztanak el. P&eacute;ld&aacute;ul, ha a Synology NAS kiszolg&aacute;l&oacute;neve &quot;DiskStation&quot;, &eacute;s a megosztott mappa neve &quot;Share1&quot;, akkor adja meg &quot;\\DiskStation\Share1&quot;. Kattintson a <b>Befejez&eacute;s</b> gombra, amikor k&eacute;szen &aacute;ll.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image4.png"/>
<li>Adja meg a DSM felhaszn&aacute;l&oacute;nev&eacute;t &eacute;s jelszav&aacute;t.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image5.png"/>
<div class="code_div"><b>Nem lehet hozz&aacute;f&eacute;rni a megosztott mapp&aacute;hoz?</b> Az itt megadott felhaszn&aacute;l&oacute;i fi&oacute;knak hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;ggal kell rendelkeznie a megosztott mapp&aacute;hoz amelyhez hozz&aacute; szeretne f&eacute;rni.</div>
<li>V&eacute;g&uuml;l, megjelenik a Windows Int&eacute;ző ablak. A megosztott mappa most csatlakoztatva lesz &eacute;s el&eacute;rhető a <b>Sz&aacute;m&iacute;t&oacute;g&eacute;p</b> ter&uuml;leten.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image6.png"/>
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Következik a témában: <a href="store_with_mac.html">Synology NAS-ra való fájlok tárolása Mac számítógépről a helyi hálózaton belül</a> </li>
  </ul>
</div>

</body>

</html>
