<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Synology NAS-ra val&oacute; f&aacute;jlok t&aacute;rol&aacute;sa Mac sz&aacute;m&iacute;t&oacute;g&eacute;pről a helyi h&aacute;l&oacute;zaton bel&uuml;l</title>
</head>

<body class="tutorial-content-box" >

<h1>Synology NAS-ra val&oacute; f&aacute;jlok t&aacute;rol&aacute;sa Mac sz&aacute;m&iacute;t&oacute;g&eacute;pről a helyi h&aacute;l&oacute;zaton bel&uuml;l</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_mac/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Mac.jpg"/>
<h2>&Aacute;ttekint&eacute;s</h2>
<p>A Synology NAS a f&aacute;jlok gyors &eacute;s egyszerű t&aacute;rol&aacute;s&aacute;ra &eacute;s megoszt&aacute;s&aacute;ra a helyi h&aacute;l&oacute;zaton bel&uuml;lre lett tervezve, ami lehetőv&eacute; teszi, hogy k&ouml;zvetlen&uuml;l el&eacute;rje a megosztott mapp&aacute;kat &eacute;s f&aacute;jlokat a Synology NAS-on, ami &aacute;ltal elker&uuml;lheti, hogy mindig bejelentkezzen a DSM-re. P&eacute;ld&aacute;ul, akkor k&eacute;pes lesz arra, hogy a Kereső seg&iacute;ts&eacute;g&eacute;vel a Synology NAS-ra t&aacute;rolja a f&aacute;jlokat, mint b&aacute;rmely m&aacute;s h&aacute;l&oacute;zati eszk&ouml;zzel.</p>

<h3 class="list_head">A Megosztott mapp&aacute;k el&eacute;r&eacute;se Mac OS-on</h3>
<ol>
<li>Nyissa meg a Keresőt a Mac sz&aacute;m&iacute;t&oacute;g&eacute;pen.</li>
<li>Keresse meg a men&uuml;sort a k&eacute;pernyő felső r&eacute;sz&eacute;ben.</li>
<li>Kattintson az <b>Ugr&aacute;s</b> gombra, &eacute;s v&aacute;lassza ki a <b>Csatlakozz a kiszolg&aacute;l&oacute;hoz</b> men&uuml;pontot.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image1.png" border="1"/>
<li>Adja meg a Synology NAS IP-c&iacute;met, amelyet az &quot;afp://&quot; előz meg P&eacute;ld&aacute;ul, &quot;afp://192.168.59.121&quot;. A folytat&aacute;shoz kattintson a <b>Csatlakoztat&aacute;sra</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image2.png" border="1">
<div class="code_div"><b>Kedvenc kiszolg&aacute;l&oacute;k:</b> A plusz jel <b>(+)</b> gomb megnyom&aacute;sa kijel&ouml;li az IP-c&iacute;meket, mint a kedvenc kiszolg&aacute;l&oacute;kat k&eacute;sőbbi haszn&aacute;latra. &Uacute;gyszint&eacute;n, kattintson az &oacute;ra gombra, a k&ouml;zelm&uacute;ltban csatlakozott kiszolg&aacute;l&oacute;k list&aacute;ja megtekint&eacute;s&eacute;hez.</div>
<li>Adja meg a DSM felhaszn&aacute;l&oacute;nev&eacute;t &eacute;s jelszav&aacute;t. Az &Ouml;n felhaszn&aacute;l&oacute;i fi&oacute;kja megfelelő olvas&aacute;si/&iacute;r&aacute;si jogosults&aacute;gokkal kell, hogy rendelkezzen, a megosztott mappa el&eacute;r&eacute;s&eacute;hez. A folytat&aacute;shoz kattintson a <b>Csatlakoztat&aacute;sra</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image3.png" border="1"/>
<li>V&eacute;g&uuml;l, ha a felhaszn&aacute;l&oacute;i n&eacute;v hiteles&iacute;tő adatai helyesek, akkor most l&aacute;tni fogja a Synology NAS-t, felsorolva a Kereső ablak ​​<b>Megosztott</b> r&eacute;sz&eacute;ben. Kattintson dupl&aacute;n a megosztott mapp&aacute;ra, hogy megvizsg&aacute;lja annak tartalm&aacute;t.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image4.png" border="1" />
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Korábban a témában: <a href="store_with_windows.html">Synology NAS-ra való fájlok tárolása Windows számítógépről a helyi hálózaton belül</a> </li>
  </ul>
</div>
</body>

</html>
