<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Mediaindexeringstj&auml;nst</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Konverteringsinst&auml;llningar</h2>
<p>N&auml;r du laddar upp bilder eller videor f&ouml;r anv&auml;ndning med Media Server eller Photo Station kommer miniatyrbilder att skapas f&ouml;r att underl&auml;tta s&ouml;kningen. Du kan st&auml;lla in miniatyrbildens kvalitet och &ouml;vervaka konverteringsf&ouml;rloppet.</p>
<p>Om du vill titta p&aring; videor i den delade mappen <strong>photo</strong> i Photo Station p&aring; dina mobila enheter kan du aktivera videokonvertering och &auml;ven se konverteringsf&ouml;rloppet.</p>
<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att st&auml;lla in miniatyrbildens kvalitet:</h4>
<ol>
<li>
V&auml;lj en kvalitet fr&aring;n rullgardinsmenyn.
</li>
<li>
Klicka p&aring; <b>Till&auml;mpa</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Obs! </span>
<ul>
<li>Det tar l&auml;ngre tid att skapa miniatyrbilder av h&ouml;g kvalitet.</li>
</ul>
</div>
<h4>Aktivera videokonvertering f&ouml;r mobila enheter:</h4>
<ol>
<li>Markera <strong>Aktivera videokonvertering f&ouml;r mobila enheter</strong>.</li>
<li>Klicka p&aring;<strong> Till&auml;mpa</strong> s&aring; kommer du &auml;ven att kunna se dina videor p&aring; mobila enheter i en handv&auml;ndning.
</li>
</ol>

<div class="section">
<span class="note_head">Obs! </span>
<ul>
<li>Endast de videor som laddats upp till den delade mappen <strong>photo</strong> i Photo Station kan konverteras till det format som st&ouml;ds av mobila enheter.</li>
<li>MP4-filer kommer inte att konverteras.</li>
</ul>
</div>
<h4>S&aring; h&auml;r g&ouml;r du f&ouml;r att visa foto-/videokonverteringsf&ouml;rloppet:</h4>
<ol>
<li>N&auml;r bilder och videor laddas upp till DiskStation, klicka p&aring; ikonen <strong>Konverteringsf&ouml;rlopp</strong> som finns i det &ouml;vre h&ouml;gra h&ouml;rnet av aktivitetsf&auml;ltet. </li>
<li>
G&ouml;r n&aring;got av f&ouml;ljande i f&ouml;nstret som visas:
</li>
<ul>
<li>
I avsnittet <b>Konverteringsf&ouml;rlopp</b>, &ouml;vervaka f&ouml;rlopp och status f&ouml;r miniatyrbilder som skapas i bakgrunden.
</li>
<li>
G&ouml;r f&ouml;ljande f&ouml;r att pausa konverteringen:
</li>
<ol>
<li>
V&auml;lj <b>F&ouml;rdr&ouml;jning f&ouml;r [antal] timme (timmar)</b> fr&aring;n rullgardinsmenyn och klicka p&aring; <b>Paus</b> f&ouml;r att pausa f&ouml;rloppet. (Som standard v&auml;ljs <b>F&ouml;rdr&ouml;jning i 1 timme</b> (timmar).)
</li>
<li>Konverteringen forts&auml;tter efter den angivna f&ouml;rdr&ouml;jningstiden eller s&aring; kan du klicka p&aring; <b>Forts&auml;tt</b> f&ouml;r att forts&auml;tta med processen meddetsamma.
</li>
</ol>
<div class="section">
<span class="note_head">Obs! </span>
<ul>
<li>Eftersom konvertering kr&auml;ver mer processorresurser kan en paus i processen spara systemresurser f&ouml;r andra p&aring;g&aring;ende uppgifter.</li>
</ul>
</div>
</ul>
<li>
N&auml;r konverteringsprocessen &auml;r slutf&ouml;rd kommer ikonen p&aring; aktivitetsf&auml;ltet att f&ouml;rsvinna.
</li>
</ol>

<div class="section">
<span class="note_head">Obs! </span>
<ul>
<li>Eftersom Photo Station Uploader tillhandah&aring;ller b&auml;ttre prestandan f&ouml;r att skapa miniatyrbilder, rekommenderar vi anv&auml;ndandet av Photo Station Uploader om du vill ladda upp m&aring;nga bilder/videor till ditt Photo Station-galleri.</li>
</ul>
</div>

</body>
</html>