<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Multimediadatabas</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Systemdatabas</h1>
<p> DiskStation anv&auml;nder en systemdatabas f&ouml;r att h&aring;lla reda p&aring; filpaketdata och poster i systemloggar, lagrade p&aring; de delade mappar som skapats p&aring; dina externa lagringsenheter s&aring;som <b>usbshare1</b>.</p>
<p> <span class="note_head">Viktigt: </span>Om du vill f&aring; &aring;tkomst till filpaketdata lagrat p&aring; den externa lagringsenheten ansluten till din DiskStation eller om du vill se DSM:s loggposter i <b>Huvudmeny</b> &gt; <strong>Loggcentral</strong>, m&aring;ste systemdatabasen aktiveras f&ouml;rst. Annars kommer alla relaterade tj&auml;nster vara o&aring;tkomliga. </p>
<h4>Att aktivera systemdatabasen:</h4>
<ol>
  <li> Markera <b>Aktivera systemdatabas</b>. </li>
  <li> G&ouml;r n&aring;got av f&ouml;ljande:
    <ul>
      <li> V&auml;lj <b>Automatisk konfiguration</b> om du vill att DSM automatisk ska v&auml;lja en delad mapp f&ouml;r lagring i systemdatabasen. Om den externa lagringsenhet som inneh&aring;ller den delade mappen tas bort kommer DSM automatiskt att v&auml;lja en annan delad mapp f&ouml;r att lagra databasen. </li>
      <li> V&auml;lj <b>Flytta den aktuella databasen till den valda delade mappen</b> och v&auml;lj sedan fr&aring;n rullgardinsmenyn att flytta den aktuella databasen till en annan delad mapp som skapats p&aring; din externa enhet. </li>
      <li>V&auml;lj <strong>V&auml;lj en av de befintliga databaserna</strong> och v&auml;lj sedan fr&aring;n rullgardinsmenyn f&ouml;r att v&auml;lja en befintlig databas om det finns mer &auml;n en extern enhet ansluten till din DiskStation.</li>
    </ul>
  </li>
  <li> Klicka p&aring; <b>Till&auml;mpa</b>. </li>
</ol>
<p> <span class="note_head">Varning: </span>F&ouml;r att f&ouml;rhindra att databasen blir korrupt, tillse att du har matat ut lagringsenheten i <b>Huvudmeny</b> &gt; <b>Kontrollpanel</b> &gt; <strong>Externa enheter</strong> &gt; <strong>Externa enheter</strong> eller genom att h&ouml;gerklicka p&aring; de externa enheternas ikon i det &ouml;vre h&ouml;gra h&ouml;rnet innan borttagning fr&aring;n DiskStation. </p>
</body>
</html>
