<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Auto Block</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Auto Block</h2>

<p>Med Auto Block kan du f&ouml;rhindra oauktoriserad inloggning. Efter att tj&auml;nsten aktiverats, kommer en IP-adress att blockas om den har f&ouml;r m&aring;nga misslyckade inloggningsf&ouml;rs&ouml;k. Misslyckade inloggningsf&ouml;rs&ouml;k via SSH, Telnet, rsync, N&auml;tverksbackup, Synkronisera delade mappar, FTP, WebDAV, Synology mobilprogram, File Station eller DSM l&auml;ggs alla till. Du kan ocks&aring; ha en till&aring;ten lista som inkluderar IP-adress som aldrig blockeras.</p>

<h4>Installera auto block:</h4>
<ol>
<li>G&aring; till fliken <strong>Allm&auml;nt</strong> och markera <b>Aktivera auto block</b>.</li>
<li>Ange ett nummer f&ouml;r <b>Inloggningsf&ouml;rs&ouml;k</b> och <b>Inom (minuter)</b> f&ouml;r att blockera en IP-adress efter fastst&auml;llt antal inloggningsf&ouml;rs&ouml;k inom angivet antal minuter.</li>
<li>Markera <b>Aktivera f&ouml;rfallotid f&ouml;r blockering</b> och ange en siffra f&ouml;r att ta bort en blockerad IP-adress efter angivet antal dagar.  Blockerade IP-adresser kommer alltid att finnas p&aring; blockeringslistan s&aring;vida den inte tas bort manuellt fr&aring;n listan om detta alternativ inte v&auml;ljs eller om <b>Ta bort blockering efter (dagar)</b> &auml;r inst&auml;llt till 0.</li>

<li>Klicka p&aring; <b>Till&auml;mpa.</b></li>
</ol>

<h4>L&auml;gga till blockerade IP-adresser:</h4>
<p>Klicka p&aring; fliken <strong>Blockeringslista</strong> och v&auml;lj n&aring;gon av f&ouml;ljande fr&aring;n rullgardinsmenyn <strong>Skapa</strong>:</p>
<ul>
<li><strong>L&auml;gg till IP-adress</strong></li>
<p>Ange en IP-adress och st&auml;ll in utg&aring;ngstid.<p/>
<li><strong>Importera lista med IP-adresser</strong></li>
<p>Importera en textfil som listar IP-adresser f&ouml;r att l&auml;gga till ett antar IP-adresser och s&auml;tt upp utg&aring;ngstiden p&aring; en g&aring;ng. Markera relevant kryssruta om du vill skriva &ouml;ver befintliga IP-adresser. Om detta alternativ inte &auml;r vald kommer dubbletter av IP-adress att hoppas &ouml;ver.</p>
<p>F&ouml;r att importera en fil m&aring;ste filen uppfylla f&ouml;ljande kritera:</p>
<ul>
<li>Filen m&aring;ste vara en enkel textfil.</li>
<li>Varje rad i filen kan endast inneh&aring;llen en IP-adress.</li>
<li>Linjer som kommenterats ut b&ouml;rjar med en # (br&auml;dg&aring;rdstecknet).</li>
<p>Om filen du valt har ett korrekt format kommer du att se alla IP-adresser i omr&aring;det f&ouml;r f&ouml;rhandsgranskning. Klicka p&aring; <strong>OK</strong> f&ouml;r att importera.</p>
</ul>
</ul>

<h4>Radera blockerade IP-adresser:</h4>
<ol>
<li>
Klicka p&aring; fliken <b>Blockeringslista</b> f&ouml;r att se en lista &ouml;ver blockerade IP-adresser.
</li>
<li>
V&auml;lj de IP-adresser som du vill ta bort fr&aring;n listan och klicka p&aring; <b>Radera</b>.
</li>
</ol>


<h4>L&auml;gga till till&aring;tna IP-adresser:</h4>
<p>Klicka p&aring; fliken <strong>Till&aring;ten lista</strong> och v&auml;lj n&aring;gon av f&ouml;ljande fr&aring;n rullgardinsmenyn <strong>Skapa</strong>:</p>
<ul>
<li><strong>L&auml;gg till IP-adress</strong></li>
<p>Ange en IP-adress.<p/>
<li><strong>Importera lista med IP-adresser</strong></li>
<p>Importera en textfil som listar IP-adresser f&ouml;r att l&auml;gga till ett antar IP-adresser p&aring; en g&aring;ng. Markera relevant kryssruta om du vill skriva &ouml;ver befintliga IP-adresser. Om detta alternativ inte &auml;r vald kommer dubbletter av IP-adress att hoppas &ouml;ver.</p>
<p>F&ouml;r att importera en fil m&aring;ste filen uppfylla f&ouml;ljande kritera:</p>
<ul>
<li>Filen m&aring;ste vara en enkel textfil.</li>
<li>Varje rad i filen kan endast inneh&aring;llen en IP-adress.</li>
<li>Linjer som kommenterats ut b&ouml;rjar med en # (br&auml;dg&aring;rdstecknet).</li>
<p>Om filen du valt har ett korrekt format kommer du att se alla IP-adresser i omr&aring;det f&ouml;r f&ouml;rhandsgranskning. Klicka p&aring; <strong>OK</strong> f&ouml;r att importera.</p>
</ul>
</ul>

<h4>Radera till&aring;tna IP-adresser:</h4>
<ol>
<li>
Klicka p&aring; fliken <b>Till&aring;ten lista</b> f&ouml;r att se en lista &ouml;ver till&aring;tna IP-adresser.
</li>
<li>
V&auml;lj de IP-adresser som du vill ta bort fr&aring;n listan och klicka p&aring; <b>Radera</b>. </li>
</ol>


</body>
</html>
