<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bl&aring;tand</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bl&aring;tand</h1>
<p>Denna sida tillhandah&aring;ller alternativ f&ouml;r att hantera bl&aring;tandadapter och ansluta bl&aring;tandsenheter till din DiskStation. V&auml;l anslutna kan en del bl&aring;tandsenheter, s&aring;som h&ouml;gtalare eller h&ouml;rlurar v&auml;ljas som ljudutg&aring;ng f&ouml;r Audio Station, vilket g&ouml;r det enkelt f&ouml;r dig att lyssna p&aring; musik som lagrats p&aring; din DiskStation.</p>
<h2>Komma ig&aring;ng</h2>
<p>Ansluta en USB-bl&aring;tandadapter till en USB-port p&aring; din DiskStation. En lista med bl&aring;tandadaptrar visas p&aring; den v&auml;nstra sidan av huvudsidan f&ouml;r bl&aring;tand. Information och alternativ om bl&aring;tandsenheter visas till h&ouml;ger.</p>
<h4>Aktivera eller inaktivera bl&aring;tandadaptrar:</h4>
<ol>
<li>V&auml;lj en bl&aring;tandadapter.</li>
<li>Klicka p&aring; <strong>Avancerade inst&auml;llningar</strong>.</li>
<li>Markera kryssrutan <strong>Aktivera bl&aring;tand</strong>.</li>
<li>Klicka p&aring; <strong>OK</strong> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>
<h2>Hantera bl&aring;tandsenheter</h2>
<p>Vid anslutning av en ny bl&aring;tandenhet, tillse att den g&aring;r att uppt&auml;cka och befinner sig inom 10 meter fr&aring;n DiskStation samt anv&auml;nder A2DP (Advanced Audio Distribution Profile). Se din anv&auml;ndarhandbok f&ouml;r bl&aring;tandenheten f&ouml;r mer detaljer om installation.</p>
<h4>Ansluta en bl&aring;tandenhet:</h4>
<ol>
<li>P&aring; huvudsidan f&ouml;r <strong>Bl&aring;tand</strong>, v&auml;lj den bl&aring;tandenhet du vill ansluta till DiskStation. Om enheten inte visas, prova att klicka p&aring; <strong>Uppdatera</strong> f&ouml;r att s&ouml;ka efter enheter i n&auml;rheten.</li>
<li>V&auml;lj enheten n&auml;r den visas.</li>
<li>Klicka p&aring; <strong>Anslut</strong>.</li>
<li>Ange PIN f&ouml;r din enhet om det beh&ouml;vs.</li>
</ol>
<h4>Se information om en bl&aring;tandenhet:</h4>
<ol>
<li>V&auml;lj en ansluten bl&aring;tandenhet.</li>
<li>Klicka p&aring; <strong>Info</strong>.</li>
<li>Ett f&ouml;nster visas och inneh&aring;ller information s&aring;som bl&aring;tandadress, namn, typ och status.</li>
</ol>
<h4>Ta bort en bl&aring;tandenhet:</h4>
<ol>
<li>V&auml;lj en bl&aring;tandenehet som du inte vill anv&auml;nda med din DiskStation l&auml;ngre.</li>
<li>Klicka p&aring; <strong>Ta bort</strong>.</li>
</ol>
<div class="section">
<h4>Obs:</h4>
<ul>
<li>N&auml;r musik spelas genom Bl&aring;tandh&ouml;gtalare eller -h&ouml;rlurar kan du uppleva problem med uppspelningen om inst&auml;llningarna f&ouml;r din bl&aring;tandadapter &auml;r modifierad eller om du ansluter till f&ouml;r m&aring;nga bl&aring;tandenheter p&aring; samma g&aring;ng.</li>
<li>Beroende p&aring; enheten, om ett par bl&aring;tandh&ouml;gtalare som varit anslutna till din DiskStation senare ansluts till en annan DiskStation (eller bl&aring;tandmusikspelare) kan h&ouml;gtalarna gl&ouml;mma din DiskStation. N&auml;r detta h&auml;nder upptr&auml;der ett fel n&auml;r du f&ouml;rs&ouml;ker spela upp musik med h&ouml;gtalarna. F&ouml;r att l&ouml;sa detta problem, v&auml;nligen ta bort h&ouml;gtalarna och f&ouml;rs&ouml;k att ansluta dem igen.</li>
</ul>

</div>
</body>
</html>
