<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Delad mapp</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Hantera avancerade beh&ouml;righeter f&ouml;r Delad mapp</h2>

<p>Sida i <strong>Kontrollpanel</strong> &gt; <strong>Delad mapp</strong> &gt; <strong>Redigera</strong> &gt; <strong>Avancerad</strong> inkluderar nedanst&aring;ende alternativ f&ouml;r att ytterligare finjustera &aring;tkomstbeh&ouml;righeterna f&ouml;r en delad mapp.</p>

<h3>Avancerade resursbeh&ouml;righeter</h3>
<p>Avancerade resursbeh&ouml;righeter tillf&ouml;r ett extra lager av kontroll f&ouml;r att hantera &aring;tkomstbeh&ouml;righeterna f&ouml;r delade mappar. N&auml;r aktiverad kan anv&auml;ndare och grupper visa eller &auml;ndra inneh&aring;llet i en delad mapp endast om anv&auml;ndaren eller gruppen har tilldelats b&aring;de resursbeh&ouml;righeter <em>och</em> Windows ACL-beh&ouml;righeter (finns i <strong>Delad mapp</strong> &gt; <strong>Redigera</strong> &gt; <strong>Beh&ouml;righeter</strong>).</p>

<h4>Att aktivera avancerade resursbeh&ouml;righeter:</h4>

<ol>
<li>Markera rutan <strong>Aktivera avancerade resursbeh&ouml;righeter</strong>.</li>
<li>Klicka p&aring; <strong>Avancerade resursbeh&ouml;righeter</strong> f&ouml;r att &auml;ndra de avancerade resursbeh&ouml;righeterna f&ouml;r den delade mappen. </li>
</ol>

<div class="section">
  <h4>Obs!</h4>
<ul>
<li>Avancerade resursbeh&ouml;righeter till&auml;mpas n&auml;r en anv&auml;ndare har &aring;tkomst till en delad mapp via f&ouml;ljande filtj&auml;nster: Windows File Sharing, Apple File Sharing, File Station, FTP och WebDAV.</li>
</ul>
</div>

<h3>Avancerade inst&auml;llningar</h3>

<p>Om n&ouml;dv&auml;ndigt kan du st&auml;lla in ytterligare restriktioner f&ouml;r anv&auml;ndare n&auml;r de har &aring;tkomst till den delade mappen via File Station, FTP eller WebDAV.</p>
	<ul>
    <li><strong>Inaktivera mappbl&auml;ddring:</strong> Att aktivera detta alternativ f&ouml;rhindrar anv&auml;ndare fr&aring;n att se inneh&aring;llet i den delade mappen.</li>
    <li><strong>Inaktivera &auml;ndring av befintliga filer:</strong> Att aktivera detta alternativ f&ouml;rhindrar anv&auml;ndare fr&aring;n att flytta, ta bort, eller &auml;ndra filer i den delade mappen. V&auml;nligen observera att anv&auml;ndare fortfarande kommer kunna se, ladda ned/ladda upp, kopiera eller extrahera inneh&aring;llet i den delade mappen.</li>
    <li><strong>Inaktivera nedladdning av filer:</strong> Att aktivera detta alternativ f&ouml;rhindrar anv&auml;ndare fr&aring;n att ladda ned inneh&aring;llet fr&aring;n den delade mappen.</li>
    </ul>

<div class="section">
<h4>Obs!</h4>
<p>Dessa restriktioner till&auml;mpas inte p&aring; anv&auml;ndare som h&ouml;r till gruppen <strong>administrators</strong>.</p>
</div>
</body>
</html>
