<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Delad mapp</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Delad mapp</h1>
<p>Delade mappar &auml;r de grundl&auml;ggande mapparna d&auml;r du kan lagra filer och mappar p&aring; din DiskStation. Innan du lagrar n&aring;gra filer p&aring; din DiskStation m&aring;ste du skapa minst en delad mapp. Data som lagras i delade mappar kan h&aring;llas privata eller delas med specifika anv&auml;ndare eller grupper beroende p&aring; de anpassningsbara &aring;tkomstr&auml;ttigheter. Dessutom kan delade mappar krypteras n&auml;r de skapas vilket tillf&ouml;r ett extra lager av skydd.</p>

<h3>Delade mappar som &auml;r standard</h3>

<p>H&auml;r nedanf&ouml;r finns en listan &ouml;ver delade mappar som skapas automatiskt n&auml;r s&auml;rskilda applikationer, tj&auml;nster eller filpaket installeras eller aktiveras.</p> 

<table>
<tr>
<th>Namn</th>
<th>Beskrivning</th>
</tr>
<tr>
<th>public</th>
<td>Mappen <strong>public</strong> skapas automatiskt n&auml;r din DiskStation initialt installeras.*</td>
</tr>
<tr>
<th>web</th>
<td>Mappen <strong>web</strong> &auml;r den lagringsplats som &auml;r standard f&ouml;r inneh&aring;llet hos en webbplats som DiskStation &auml;r v&auml;rd &aring;t. Den skapas automatiskt n&auml;r funktionen <strong>Web Station</strong> aktiveras.</td>
</tr>
<tr>
<th>photo</th>
<td>Mappen <strong>photo</strong> anv&auml;nds f&ouml;r att lagra bilder och videor som du vill dela med Photo&nbsp;Station. Den skapas automatiskt n&auml;r <strong>Photo Station</strong> eller<strong> DLNA/UPnP Media Server</strong> aktiveras.</td>
</tr>
<tr>
<th>music</th>
<td>Mappen <strong>music</strong> anv&auml;nds f&ouml;r att lagra musik du vill lyssna p&aring; med Audio Station. Den skapas automatiskt n&auml;r <strong>Audio Station</strong> aktiveras.</td>
</tr>
<tr>
<th>video</th>
<td>Mappen <strong>video</strong> anv&auml;nds f&ouml;r att lagra de videor som du vill bl&auml;ddra bland med DLNA/UPnP-enheter. Den skapas automatiskt n&auml;r <strong>Media Server</strong> aktiveras.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Mappen <strong>surveillance</strong> anv&auml;nds f&ouml;r att lagra inspelningar fr&aring;n Surveillance Station. Den skapas automatiskt n&auml;r <strong>Surveillance Station</strong> aktiveras. Den &auml;r skrivskyddad och kan endast kommas &aring;t av systemadministrat&ouml;ren.</td>
</tr>
<tr>
<th>home</th>
<td>Mappen <strong>home</strong> ger ett privat utrymme f&ouml;r varje anv&auml;ndare att lagra data p&aring; en plats som endast anv&auml;ndaren kommer &aring;t. Den skapas automatiskt n&auml;r funktionen <strong>Anv&auml;ndarhem</strong> aktiveras.</td>
</tr>
<tr>
<th>homes</th>
<td>Mappen <strong>homes</strong> inneh&aring;ller alla anv&auml;ndares home-mappar. Den skapas automatiskt n&auml;r funktionen <strong>Anv&auml;ndarhem</strong> aktiveras. Endast systemadministrat&ouml;ren kan komma &aring;t och hantera alla anv&auml;ndares home-mappar.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Mappen <strong>NetBackup</strong>skapas automatiskt n&auml;r <strong>N&auml;tverkss&auml;kerhetskopiering</strong> aktiveras.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Mappen <strong>usbshare[nummer]</strong> skapas automatiskt n&auml;r du ansluter en extern USB-diskenhet till USB-porten p&aring; DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Mappen <strong>satashare</strong> skapas automatiskt n&auml;r du ansluter en extern eSATA-diskenhet till eSATA-porten p&aring; DiskStation.*</td>
</tr>
</table>

<p>____<br>* Endast tillg&auml;ngligt f&ouml;r vissa modeller.</p>

</body>
</html>
