<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Anv&auml;ndare</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>L&ouml;senordsinst&auml;llningar</h2>
<p>Klicka p&aring; knappen <strong>L&ouml;senordsinst&auml;llningar</strong> f&ouml;r att titta p&aring; och &auml;ndra de inst&auml;llningar som beskrivs h&auml;r nedanf&ouml;r.</p>

<h3>&Aring;terst&auml;lla gl&ouml;mt l&ouml;senord</h3>
<p>Detta avsnitt inneh&aring;ller ett alternativ med texten <strong>Till&aring;t anv&auml;ndare som inte &auml;r admin att &aring;terst&auml;lla gl&ouml;mda l&ouml;senord via e-post</strong>. N&auml;r detta alternativ &auml;r aktiverat finns en l&auml;nk, med texten <strong>Gl&ouml;mt l&ouml;senordet?</strong> p&aring; inloggningssidan till DSM. Om en anv&auml;ndare gl&ouml;mmer sitt l&ouml;senord, kan denne klicka p&aring; denna l&auml;nk och ange sitt anv&auml;ndarnamn. I s&aring; fall kommer systemet att skicka ett meddelande till anv&auml;ndaren, med en l&auml;nk till &aring;terst&auml;llning av det gl&ouml;mda l&ouml;senordet. </p>

<div class="section">
<h4>Obs:</h4>
<ul>
<li>Innan aktivering av detta alternativ, v&auml;nlig tillse att du redan aktiverat SMTP f&ouml;r e-postmeddelanden. F&ouml;r att g&ouml;ra detta, g&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Meddelande</strong> &gt; <strong>Allm&auml;nt</strong>. Om meddelanden inte &auml;r aktiverade kan inte systemet skicka meddelanden till anv&auml;ndare som &ouml;nskar &aring;terst&auml;lla sitt l&ouml;senord.</li>
<li>F&ouml;r att erh&aring;lla meddelande fr&aring;n systemet, m&aring;ste anv&auml;ndare ha angett en e-postadress i avsnittet f&ouml;r anv&auml;ndarinformation i sitt konto.</li>
<li>Anv&auml;ndare som h&ouml;r till gruppen <strong>administrators</strong> kan inte &aring;terst&auml;lla l&ouml;senord med detta alternativ.</li>
<li>Dom&auml;nanv&auml;ndare kan inte &aring;terst&auml;lla l&ouml;senord med detta alternativ.</li>
<li>LDAP-anv&auml;ndare kan &aring;terst&auml;lla l&ouml;senord med detta alternativ, s&aring; l&auml;nge som DiskStation agerar server f&ouml;r LDAP-katalogen.</li>

</ul>
</div>


<h3>L&ouml;senordsstyrka</h3>
<p>Du kan st&auml;lla in regler f&ouml;r l&ouml;senordsstyrka f&ouml;r anv&auml;ndare av din DiskStation.</p>

<div class="section">
<h4>Obs:</h4>
<p>Regler f&ouml;r l&ouml;senordsstyrka g&auml;ller endast nya l&ouml;senord. Till exempel, nya regler f&ouml;r l&ouml;senordsstyrka appliceras bara n&auml;r n&auml;r ett nytt konto skapas eller n&auml;r en befintligt anv&auml;ndare byter sitt l&ouml;senord. Befintliga l&ouml;senord och de som h&ouml;r till importerade anv&auml;ndarkontot exkluderas fr&aring;n de nya l&ouml;senordsreglerna.</p>
</div>
<h4>Aktivera regler f&ouml;r l&ouml;senordsstyrka:</h4>
<ol>
<li>Markera kryssrutan <b>Till&auml;mpa regler f&ouml;r l&ouml;senordsstyrka</b> f&ouml;r att aktivera l&ouml;senordsskydd.</li>
<li>V&auml;lj fler &auml;n ett av dessa l&ouml;senordsskydd, fr&aring;n reglerna h&auml;r nedanf&ouml;r:</li>
<ul>
<li><b>Uteslut namn och beskrivning av anv&auml;ndaren fr&aring;n l&ouml;senordet</b>: L&ouml;senordet f&aring;r inte inneh&aring;lla anv&auml;ndarens namn eller anv&auml;ndarens beskrivning. UTF-8-kodade tecken &auml;r uteslutna.</li>
<li><b>Till&aring;t b&aring;de gemener och versaler</b>: B&aring;de gemener och versaler &auml;r till&aring;tna i l&ouml;senord.</li>
<li><b>Inkludera numeriskt tecken</b>: L&ouml;senordet m&aring;ste inneh&aring;lla minst ett numeriskt tecken (0~9).</li>
<li><b>Inkludera specialtecken</b>: L&ouml;senordet m&aring;ste inneh&aring;lla minst ett ASCII specialtecken (dvs. ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Minsta l&auml;ngd p&aring; l&ouml;senord</b>: L&ouml;senordet m&aring;ste vara minst det v&auml;rde som specificeras i textf&auml;ltet. L&ouml;senordets l&auml;ngd ska vara mellan 6 och 127 tecken.</li>
</ul>
<li>Klicka p&aring; <b>Till&auml;mpa</b> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>
 
</body>
</html>

