<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Supporttj&auml;nster</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>Supporttj&auml;nster</h2>
<p>
Supporttj&auml;nster inkluderar verktyg f&ouml;r b&aring;de fj&auml;rr&aring;tkomst och loggframst&auml;llning, vilket l&aring;ter v&aring;ra tekniska supporttekniker att snabbt granska, diagnostisera och l&ouml;sa tekniska problem p&aring; din DiskStation, fr&aring;n ett Synologykontor. F&ouml;r att g&ouml;ra detta, g&aring; till <b>Supportcenter</b> &gt; <b>Supporttj&auml;nster</b>.
</p>

<h4>F&ouml;r att aktivera fj&auml;rr&aring;tkomst: </h4>
<p>
Aktivera fj&auml;rr&aring;tkomst p&aring; din DiskStation endast n&auml;r du blir ombedd att g&ouml;ra s&aring; av teknisk supporttekniker fr&aring;n Synology.
</p>
<ol>
<li>Markera kryssrutan <b>Aktivera fj&auml;rr&aring;tkomst</b> och klicka sedan p&aring; <b>Till&auml;mpa</b> f&ouml;r att &auml;ndringen ska b&ouml;rja g&auml;lla.
</li>
<li>Ge teknisk supporttekniker fr&aring;n Synology l&ouml;senordet f&ouml;r admin och identifieringsnyckeln f&ouml;r support per e-post.
</li>
</ol>

<div class="section">
<h4>Obs!</h4>
<ul>
<li>Fj&auml;rr&aring;tkomst kommer att automatiskt inaktiveras efter 14 dagar. Den ska inte manuellt inaktiveras s&aring;vida inte en teknisk supporttekniker fr&aring;n Synology ber dig g&ouml;ra detta.
</li>
<li>V&auml;nligen avl&auml;gsna allt inneh&aring;ll som du anser vara privat fr&aring;n din DiskStation. 
</li>
<li>&Auml;ven om Synology inte kan garantera att &aring;tg&auml;rden fj&auml;rr&aring;tkomst kommer att l&ouml;sa ditt problem kommer Synology att vidta rimliga &aring;tg&auml;rder f&ouml;r att utf&ouml;ra supporttj&auml;nster p&aring; ett professionellt s&auml;tt.
</li>	
</ul>
</div>

<h4>F&ouml;r att generera loggfiler: </h4>
<p>
Generera och tillhandah&aring;ll loggfiler endast till teknisk supporttekniker fr&aring;n Synology.
</p>
<ol>
<li>Klicka p&aring; <b>Generera loggfiler</b> och v&auml;nta sedan i fem minuter, tills nedladdningen &auml;r slutf&ouml;rd.
</li>
<li>Ge teknisk supporttekniker fr&aring;n Synology loggfilerna per e-post.
</li>
</ol>

<div class="section">
<h4>Saker du b&ouml;r veta om v&aring;ra Supporttj&auml;nster</h4>
<ul>
<li>Vi respekterar din DiskStation som vore den v&aring;r egen.</li>
<li>Din DiskStation kommer endast att anv&auml;ndas i syfte att diagnostisera systemet. Synology kommer inte att anv&auml;nda eller yppa n&aring;gon annan personlig information p&aring; din DiskStation. </li> 

</ul>
</div>

</body>
</html>
