<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Cartella condivisa</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Cartella condivisa</h1>
<p>Le cartelle condivise sono directory di base dove &egrave; possibile salvare i file e le cartelle sulla DiskStation. Prima di salvare i file su DiskStation, &egrave; necessario creare almeno una cartella condivisa. I dati salvati sulle cartelle condivise possono essere privati o condivisi con utenti specifici o gruppi di utenti in base alle autorizzazioni di accesso personalizzabili. Inoltre, le cartelle condivise possono essere crittografate durante la creazione, aggiungendo un ulteriore livello di protezione.</p>

<h3>Cartelle condivise predefinite</h3>

<p>Di seguito un elenco delle cartelle condivise che sono create automaticamente quando alcune applicazioni, servizi o pacchetti sono installati o abilitati.</p> 

<table>
<tr>
<th>Nome</th>
<th>Descrizione</th>
</tr>
<tr>
<th>public</th>
<td>La cartella <strong>public</strong> verr&agrave; creata automaticamente dopo la prima configurazione di DiskStation.*</td>
</tr>
<tr>
<th>web</th>
<td>La cartella <strong>web</strong> &egrave; la posizione di archiviazione predefinita per i contenuti di un sito web ospitato su DiskStation. Essa &egrave; creata automaticamente quando la <strong>Web Station</strong> &egrave; abilitata.</td>
</tr>
<tr>
<th>photo</th>
<td>La cartella <strong>photo</strong> &egrave; usata per archiviare foto e video che si desiderano condividere su Photo&nbsp;Station. Verr&agrave; creata automaticamente all'attivazione di <strong>Photo Station</strong> o del <strong> Server media DLNA/UPnP</strong>.</td>
</tr>
<tr>
<th>music</th>
<td>La cartella <strong>music</strong> &egrave; usata per archiviare la musica che si desidera ascoltare con Audio Station. Essa &egrave; creata automaticamente quando la <strong>Audio Station</strong> &egrave; abilitata.</td>
</tr>
<tr>
<th>video</th>
<td>La cartella <strong>video</strong> &egrave; usata per archiviare i file video che si desidera sfogliare attraverso i dispositivi DLNA/UPnP. Essa &egrave; creata automaticamente quando il <strong>Server Media</strong> &egrave; abilitato.</td>
</tr>
<tr>
<th>surveillance</th>
<td>La cartella <strong>surveillance</strong> &egrave; usata per archiviare le registrazioni di Surveillance&nbsp;Station. Essa &egrave; creata automaticamente quando la <strong>Surveillance Station</strong> &egrave; abilitata. &Egrave; una cartella di sola lettura alla quale pu&ograve; accedere solo l'amministratore di sistema.</td>
</tr>
<tr>
<th>home</th>
<td>Le cartelle <strong>home</strong> forniscono spazi privati per ciascun utente per archiviare i dati a cui solo tale utente pu&ograve; accedere. Essa &egrave; creata automaticamente quando la funzione <strong>Sede utente</strong> &egrave; abilitata.</td>
</tr>
<tr>
<th>homes</th>
<td>La cartella <strong>homes</strong> contiene le cartelle home di tutti gli utenti. Essa &egrave; creata automaticamente quando la funzione <strong>Sede utente</strong> &egrave; abilitata. Solo l'amministratore di sistema pu&ograve; accedere e gestire tutte le cartelle home degli utenti.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>La cartella <strong>NetBackup</strong> &egrave; creata automaticamente all'attivazione del <strong>Backup di rete</strong>.</td>
</tr>
<tr>
<th>usbshare</th>
<td>La cartella <strong>usbshare[numero]</strong> viene creata automaticamente quando si connette un dispositivo esterno USB alla porta USB di DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>La cartella <strong>satashare</strong> viene creata automaticamente quando si connette un dispositivo esterno eSATA alla porta eSATA di DiskStation.*</td>
</tr>
</table>

<p>____<br> * Disponibile solo su alcuni modelli.</p>

</body>
</html>
