<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Cartella condivisa</h2>
<p>Le cartelle condivise sono directory di base dove &egrave; possibile salvare i file e le cartelle sulla DiskStation. Prima di salvare i file su DiskStation, &egrave; necessario creare almeno una cartella condivisa in DSM. I dati salvati sulle cartelle condivise possono essere privati o condivisi con utenti specifici o gruppi di utenti in base alle autorizzazioni di accesso personalizzabili.</p>



<p>Di seguito un elenco delle cartelle condivise predefinite che sono create automaticamente quando alcune applicazioni, servizi o pacchetti sono installati o abilitati.</p> 
<table>
<tr>
<th>Nome</th>
<th>Descrizione</th>
</tr>
<tr>
<th>public</th>
<td>La cartella <strong>public</strong> verr&agrave; creata automaticamente dopo la prima configurazione di DiskStation.*</td>
</tr>
<tr>
<th>web</th>
<td>La cartella <strong>web</strong> &egrave; la posizione di archiviazione predefinita per i contenuti di un sito web ospitato su DiskStation. Essa &egrave; creata automaticamente quando la <strong>Web Station</strong> &egrave; abilitata.</td>
</tr>
<tr>
<th>photo</th>
<td>La cartella <strong>photo</strong> &egrave; usata per archiviare foto e video che si desiderano condividere su Photo&nbsp;Station. Verr&agrave; creata automaticamente all&apos;attivazione di <strong>Photo Station</strong> o del <strong> Server media DLNA/UPnP</strong>.</td>
</tr>
<tr>
<th>music</th>
<td>La cartella <strong>music</strong> &egrave; usata per archiviare la musica che si desidera ascoltare con Audio Station. Verr&agrave; creata automaticamente all&apos;attivazione di <strong>Audio Station</strong> o del <b> Server media DLNA/UPnP</b>.</td>
</tr>
<tr>
<th>video</th>
<td>La cartella <strong>video</strong> &egrave; usata per archiviare i file video che si desidera sfogliare attraverso i dispositivi DLNA/UPnP. Verr&agrave; creata automaticamente all&apos;attivazione di <b>Video Station</b> o del <strong> Server media DLNA/UPnP</strong>.</td>
</tr>
<tr>
<th>surveillance</th>
<td>La cartella <strong>surveillance</strong> &egrave; usata per archiviare le registrazioni di Surveillance&nbsp;Station. Essa &egrave; creata automaticamente quando la <strong>Surveillance Station</strong> &egrave; abilitata. &Egrave; una cartella di sola lettura alla quale pu&ograve; accedere solo l&apos;amministratore di sistema.</td>
</tr>
<tr>
<th>home</th>
<td>Le cartelle <strong>home</strong> forniscono spazi privati per ciascun utente per archiviare i dati a cui solo tale utente pu&ograve; accedere. Essa &egrave; creata automaticamente quando la funzione <strong>Sede utente</strong> &egrave; abilitata.</td>
</tr>
<tr>
<th>homes</th>
<td>La cartella <strong>homes</strong> contiene le cartelle home di tutti gli utenti. Essa &egrave; creata automaticamente quando la funzione <strong>Sede utente</strong> &egrave; abilitata. Solo l&apos;amministratore di sistema pu&ograve; accedere e gestire tutte le cartelle home degli utenti.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>La cartella <strong>NetBackup</strong> &egrave; creata automaticamente all&apos;attivazione del <strong>Backup di rete</strong>.</td>
</tr>
<tr>
<th>usbshare</th>
<td>La cartella <strong>usbshare[numero]</strong> viene creata automaticamente quando si connette un dispositivo esterno USB alla porta USB di DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>La cartella <strong>satashare</strong> viene creata automaticamente quando si connette un dispositivo esterno eSATA alla porta eSATA di DiskStation.*</td>
</tr>
</table>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>&Egrave; possibile solo modificare permessi cartella condivisa degli utenti in modalit&agrave; semplice. Se si vogliono creare gruppi utente o gestire privilegi di accesso dei gruppi a cartelle condivise, andare su <b>Pannello di controllo (Modalit&agrave; avanzata)</b> &gt; <b>Gruppo</b>.</li>
</ul>
</div>

<h4>Per creare una cartella condivisa:</h4>
<ol>
<li>Andare su <b>Pannello di controllo (Modalit&agrave; semplice)</b> &gt; <b>Cartella condivisa</b> e fare clic sull&apos;icona <b>+</b> sul pannello di sinistra.</li>
<li>Specificare un nome e selezionare un volume su cui creare la cartella condivisa.</li>
<li>Spuntare <b>Abilita cestino</b>, se necessario. Se questa opzione &egrave; abilitata, quando i file nella cartella condivisa sono cancellati, essi sono spostati in una cartella chiamata <b>#recycle</b>. L&apos;accesso al cestino pu&ograve; essere limitato agli utenti appartenenti al gruppo <b>administrators</b>.</li>
<li>Selezionare o deselezionare le caselle appropriate per ciascun utente per personalizzare i permessi di accesso alla cartella condivisa:</li>
<ul>
<li><b>Lettura/Scrittura:</b> l&apos;utente pu&ograve; accedere e apportare modifiche ai file e alle sottocartelle nella cartella condivisa.</li>
<li><b>Sola lettura:</b> l&apos;utente pu&ograve; accedere a file e sottocartelle nella cartella condivisa.</li>
<li><b>Nessun accesso:</b> l&apos;utente non pu&ograve; accedere a file o sottocartelle nella cartella condivisa.</li>
</ul>
<li>Fare clic su <b>Applica</b> per salvare le impostazioni.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>I nomi della cartella condivisa non fanno la distinzione tra lettere minuscole e maiuscole e possono comprendere tra 1-32 caratteri. I nomi non possono contenere i seguenti caratteri:<br> <strong>! &quot; # $ % &amp; &apos; ( ) * + , / : ; <= > ? @ [ ] \ ^ ` { } | ~</strong></li>
<li>I seguenti nomi sono riservati per il sistema:<br> <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong></li>
<li>Il primo carattere di una cartella condivisa non pu&ograve; essere un segno meno o uno spazio; l&apos;ultimo carattere non pu&ograve; essere uno spazio.</li>
<li>quando si incontrano conflitti di permessi, la priorit&agrave; di permessi &egrave; la seguente: <b>Nessun accesso</b> &gt; <b>Lettura/Scrittura</b> &gt; <b>Sola lettura</b>.</li>
<li>Quando si crea una nuova cartella condivisa, se i permessi per gli utenti che appartengono al gruppo <b>administrators</b> sono impostati su <b>Nessun accesso</b>, questi utenti potranno vedere solo la cartella condivisa in <b>Pannello di controllo</b> &gt; <b>Cartella condivisa</b>.</li>
<li>&Egrave; possibile configurare le impostazioni dei privilegi della cartella Cestino in File Station facendo clic sulla cartella <b>#recycle</b>. Scegliere <b>Priorit&agrave;</b> e fare clic sulla scheda <b>Autorizzazioni</b>.</li>
</ul>
</div>

<h4>Per modificare una cartella condivisa:</h4>
<ol>
<li>Andare su <b>Pannello di controllo (Modalit&agrave; semplice)</b> &gt; <b>Cartella condivisa</b>.</li>
<li>Selezionare la cartella condivisa desiderata sul pannello di sinistra.</li>
<li>Modificare le informazioni generali di una cartella condivisa, come nome, localit&agrave; e permessi utente.</li>
<li>Se <b>Abilita cestino</b> &egrave; stato gi&agrave; selezionato, &egrave; possibile fare clic su <b>Svuota cestino</b> per rimuovere tutti i file cancellati dal cestino in modo permanente.</li>
<li>Fare clic su <b>Applica</b> per salvare le impostazioni.</li>
</ol>

<h4>Per eliminare una cartella condivisa:</h4>
<ol>
<li>Andare su <b>Pannello di controllo (Modalit&agrave; semplice)</b> &gt; <b>Cartella condivisa</b>.</li>
<li>Selezionare la cartella condivisa desiderata sul pannello di sinistra.</li>
<li>Fare clic sull&apos;icona <b>Cestino</b> sul pannello di sinistra per cancellare la cartella condivisa selezionata.</li>

</ol>


<p>____<br> * Disponibile solo su alcuni modelli.</p>
</body>
</html>