<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Del filkoblinger</h2>

<p>Filer eller mapper som er lagret p&aring; din DiskStation kan deles raskt og enkelt. Bare h&oslash;yreklikk p&aring; en fil eller en mappe og velg <strong>Del filkoblinger</strong>. Dette vil generere en kobling og en QR-kode, som kan sendes til venner eller andre brukere. De kan f&oslash;lge koblingen for &aring; laste ned den valgte filen eller mappen, enten de eier en DSM-konto eller ikke.</p>


<h4>Slik deler du filkoblinger:</h4>
<ol>
<li>Velg filene eller mappene du vil dele.</li>
<li>H&oslash;yreklikk p&aring; en av de valgte filene eller mappene, eller h&oslash;yreklikk p&aring; menyen <b>Handling</b>. Deretter velger du <b>Del filkoblinger</b>.</li>
<li>Delte koblinger og QR-koder vises i vinduet som &aring;pnes.</li>
<li>F&oslash;lgende alternativer kan ogs&aring; endres:
<ul>
 <li><strong>Gyldighetsperiode</strong>: Du kan egendefinere gyldige tilgangsperioder og tilgangsantall for delte koblinger. 
  <ul>
<li><strong>Tilpass gyldighetsperiode</strong>: Du kan bestemme hvor lenge en delt kobling skal v&aelig;re aktiv etter oppretting. Koblingen vil bli ugyldig n&aring;r den spesifiserte perioden er omme.</li>
<li><strong>Tilpass gyldig tilgangsantall</strong>: Du kan bestemme hvor mange ganger en delt kobling skal kunne aksesseres. Koblingen vil bli ugyldig n&aring;r det spesifiserte antallet er n&aring;dd.</li>
</ul>
</li>
<li><strong>Del med DSM-brukere</strong>: Du kan dele koblingen med DSM-brukere eller -grupper ved &aring; velge dem fra rullegardinlisten. V&aelig;r oppmerksom p&aring; at du ikke kan dele med guest-kontoen og brukergruppen.</li>

<li><strong>Del med andre</strong>: Du kan dele passordbeskyttede koblinger med andre personer, inkludert ikke-DSM-brukere.</li>

</ul>
</li>
</ol>

<h4> Slik aktiverer du gofile.me-koblinger: </h4> 
<ol>
<li>G&aring; til <strong>Kontrollpanel</strong> &gt; <strong>QuickConnect</strong> og kontroller at det er merket av for <strong>Aktiver QuickConnect</strong>. Hvis du ikke har satt opp QuickConnect, kan du gj&oslash;re dette p&aring; denne siden.</li>
<li>Klikk p&aring; <strong>Avansert</strong> og kontroller at det er merket av for <strong>Fildeling</strong>.</li>
<li>Delte filer kan lastes ned uten en DSM-konto ved &aring; aksessere gofile.me-delekoblingen.</li> 
</ol>
<h3>Egendefiner delingskoblingsside</h3>
<p>File Station tilbyr ulike alternativer for &aring; stilsette delingskoblingssiden.</p>
<ol>
<li>G&aring; til <strong>File Station</strong> &gt; <strong>Innstillinger</strong> &gt; <strong>Delte koblinger</strong> &gt; <strong>Egendefinert</strong>.</li>
<li>Velg <strong>Egendefiner delingskoblingsside</strong> og klikk p&aring; <strong>Egendefinerte innstillinger</strong>.</li>
<li>Du kan egendefinere siden med alternativene nedenfor:
  <ul>
<li><strong>Mal</strong>: Velg en standardmal.</li>
<li><strong>Bakgrunn</strong>: Klikk p&aring; miniatyrbildet eller <strong>+</strong> for &aring; velge et standard bakgrunnsbilde, et bilde p&aring; din DiskStation eller et tidligere brukt bilde.</li>
<li><strong>Logo</strong>: Klikk p&aring; miniatyrbildet eller <strong>+</strong> for &aring; velge et opplastet bilde (mindre enn 1 MB), et bilde p&aring; din DiskStation eller et tidligere brukt bilde. Logoen kan plasseres i et av de fire hj&oslash;rnene.</li>
</ul>
</li>
<li>Klikk p&aring; <strong>Forh&aring;ndsvisning</strong> for &aring; kontrollere om det er behov for justeringer.</li>
<li>Klikk p&aring; <strong>OK</strong> for &aring; ta i bruk innstillingene.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ol>
<li>De egendefinerte innstillingene tas i bruk for alle delte koblinger, uansett opprettingstidspunkt.</li>
<li>Du kan kun bruke bilder av f&oslash;lgende formater som bakgrunnsbilde/logo: .jpe, jpeg, .jpg, .bmp, .gif, and .png</li></ol>
</div>

<h3>Administrere delte koblinger</h3>
<p>Eksisterende delte koblinger kan administreres ved &aring; g&aring; til <strong>Verkt&oslash;y</strong> &gt; <strong>Delt koblingsadministrator</strong>. I vinduet som &aring;pnes finner du alternativer for &aring; redigere, dele eller fjerne eksisterende delte koblinger.</p>

<div class="section">
<h4>Merk:</h4>
<ol>
  <li>Du kan opprette opptil 1000 delingskoblinger.</li>
  <li>Seksjonen <strong>Status</strong> for hver delte kobling vises ett av f&oslash;lgende:
<ul>
<li><b>Gyldig</b>: Den delte koblingen fungerer.</li>
<li><b>Utl&oslash;pt</b>: Gyldighetsperioden for den delte koblingen er utl&oslash;pt.</li>
<li><b>Ugyldig</b>: Den delte filen eller mappen eksisterer ikke lenger, eller du har ikke den n&oslash;dvendige rettigheten til &aring; &aring;pne filen eller mappen.</li>
<li><b>Ikke aktiv enn&aring;</b>: Den delte koblingen er ikke aktiv enn&aring;.</li>
</ul>
</li>
</ol>

</div>
</body>
</html>
