<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Laste opp filer eller mapper</h2>
<p>Du kan bruke en av metodene nedenfor for &aring; laste opp filer eller mapper fra datamaskinen til DiskStation.</p>
<p>For &aring; f&aring; full tilgang til opplastingsfunksjonene som er vist nedenfor, m&aring; du f&oslash;rst installere den nyeste Java Runtime Environment (JRE) og Flash Player. </p>


<h4>Metode 1:</h4>
<ol>
<li>
Fra den &oslash;vre delen av venstre panel velger du en m&aring;lmappe p&aring; DiskStation. 
</li>
<li>
Klikk p&aring; <b>Last opp</b>, Velg <strong>Last opp - Hopp over</strong> eller <strong>Last opp - Overskriv</strong> og velg filer ellermapper fra din lokale datamaskin. </li>
</ol>
<h4>Metode 2:</h4>
<ol>
	<li>G&aring; til <strong>Innstillinger</strong>, merk av for <strong>Bla gjennom filer fra lokal datamaskin med File Station</strong> og oppdater nettsiden for &aring; vise mapper p&aring; din lokale datamaskin nederst p&aring; det venstre panelet.</li>
<div class="section">
<h4>Merk:</h4>
<p>Alternativet <strong>Bla gjennom filer fra lokal datamaskin med File Station</strong> tas i bruk etter at du har installert og aktivert JRE p&aring; datamaskinen din.</p>
</div>
	<li>Fra den nedre del av venstre panel velger du en mappe p&aring; din lokale datamaskin. Hoveddelen viser n&aring; innholdet i den valgte mappen.
	</li>
	<li>Velg filene eller mappene du &oslash;nsker i hoveddelen, og klikk deretter p&aring; <b>Last opp</b>. 
</li>
	<li>Velg en m&aring;lmappe p&aring; DiskStation i vinduet som vises.
	</li>
	<li>&Oslash;verst i h&oslash;yre av vinduet velger du <b>Overskriv</b> hvis du vil overskrive filer eller mapper med samme navn i m&aring;lmappen. Hvis ikke, velg <b>Hopp over</b>.
</li>
	<li>Klikk p&aring; <b>OK</b> for &aring; starte opplastingen.
</li>
</ol>
<h4>Metode 3:</h4>
<ol>
<li>G&aring; til <strong>Innstillinger</strong>, merk av for <strong>Bla gjennom filer fra lokal datamaskin med File Station</strong> og oppdater nettsiden for &aring; vise mapper p&aring; din lokale datamaskin nederst p&aring; det venstre panelet.</li>
<li>
P&aring; det venstre panelet drar du mappen fra din datamaskin (den nedre delen) til en mappe p&aring; DiskStation (den &oslash;vre delen).
</li>
<li>
I menyen som &aring;pnes velger du om du vil overskrive eller hoppe over filer/mapper med samme navn i m&aring;lmappen.
</li>
</ol>
<h4>Metode 4:</h4>
<ol>
<li>
Fra den &oslash;vre delen av venstre panel velger du en m&aring;lmappe p&aring; DiskStation.
</li>

<li>
Velg filene p&aring; datamaskinens skrivebord eller i filutforskeren (for eksempel Windows Utforsker eller Mac Finder), og dra og slipp dem deretter til File Station i nettleseren.
</li>

<li>
I dialogboksen som &aring;pnes velger du om du vil overskrive eller hoppe over filer med samme navn i m&aring;lmappen.</li>
<div class="section">
<h4>Merk:</h4>
<ul>
<li><b>Metode 4</b> st&oslash;ttes bare p&aring; bestemte nettlesere: Chrome, Firefox, Safari 5.1 eller nyere. Men den st&oslash;ttes ikke for Mac n&aring;r det er merket av for <strong>Bla gjennom filer fra lokal datamaskin med File Station</strong>.</li>
<li>
Du kan ogs&aring; dra og slippe mapper eller tomme filer, men kun n&aring;r det er merket av for <strong>Bla gjennom filer fra lokal datamaskin med File Station</strong> for lesere som er listet opp ovenfor. Ellers kan du ikke laste opp mapper og tomme filer med <strong>Metode 4</strong>.</li>
	<li>
Dersom du bruker Chrome for Linux og er logget inn p&aring; DSM via HTTPS-protokollen, m&aring; du importere et p&aring;litelig sertifikat (i <b>Kontrollpanel</b> &gt; <b>Sikkerhet</b> &gt; <strong>Sertifikat</strong>) for &aring; kunne laste opp ved hjelp av <b>Metode 4</b>.
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Merk:</h4>
<ol>
<li>
Du kan legge til opptil 1000 filer i opplastingsk&oslash;en.
</li>
	<li>
	Du kan laste opp filer med st&oslash;rrelser p&aring; over 4 GB hvis du bruker Google Chrome, Firefox, Safari 5.1 eller nyere, eller n&aring;r det er merket av for <strong>Bla gjennom filer fra lokal datamaskin med File Station</strong>. Hvis ikke, kan du bare laste opp opptil 2 GB med filer samtidig.</li>
	<li>
I en delt mappe som ikke er kryptert, m&aring; fil-/mappe-navnet ikke v&aelig;re mer enn 255 tegn (inntil omtrent 80 tegn for ikke-latinske spr&aring;k). I en delt mappe som er kryptert, m&aring; det ikke v&aelig;re mer enn 143 tegn (inntil omtrent 47 tegn for ikke-latinske spr&aring;k).
</li>
<li>
Fil-/mappenavnene m&aring; ikke inneholde f&oslash;lgende tegn: \ / : * ? &quot; &gt; |.
</li>
<li>
Fil-/mappenavn kan ikke starte med &quot;._&quot;.
</li>
<li>Du kan laste opp filer som har st&oslash;rrelse p&aring; 0 KB kun n&aring;r du har installert JRE.</li>
</ol>
</div>


<div class="section">
<h4>Feils&oslash;king</h4>
<p>Hvis du ikke kan bla gjennom lokale elementer som er lagret p&aring; din Mac med Safari, gj&oslash;r du f&oslash;lgende:</p>
<ol>
<li>P&aring; din Mac &aring;pner du Safari og velger <strong>Preferanser</strong> i Safari-menyen.</li>
<li>Klikk p&aring; <strong>Administrer innstillinger for nettsted</strong> i fanen <strong>Sikkerhet</strong>.</li>
<li>Under <strong>Java</strong> velger du ditt DSM-&quot;nettsted&quot;.</li>
<li>Velg <strong>Kj&oslash;r i usikkermodus</strong>.</li>
</ol>
</div>



</body>
</html>
