<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Limitaciones y requisitos del sistema - Ayuda de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article explains the limitations of the Synology High Availability package.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 </head>
 <body>
 
 
<h2>Limitaciones y requisitos del sistema</h2>

 <p>La implementaci&oacute;n de Synology High Availability necesita dos servidores Synology id&eacute;nticos que act&uacute;en como servidores activo y pasivo. Antes de que los dos servidores se combinen formando un cl&uacute;ster high-availability, el sistema comprobar&aacute; las siguientes limitaciones de hardware y software para garantizar que puede crearse un cl&uacute;ster high-availability.</p>
 
  
 <h3>Requisitos del sistema</h3>
 
  <p>Tenga en cuenta las siguientes directrices sobre software y hardware:</p>
  <ul>
   <li><b>Servidor Synology:</b> los servidores activo y pasivo deben ser modelos id&eacute;nticos.</li>
   <li><b>Unidades de expansi&oacute;n:</b> tanto el servidor activo como el pasivo deben estar conectados a las mismas unidades de expansi&oacute;n correctamente.</li>
   <li><b>N&uacute;mero y tipo de discos:</b> el tipo de discos debe ser SAS solo. Antes de instalar DSM tiene que instalar al menos 3 discos en las unidades de expansi&oacute;n.</li>
   <li><b>Dispositivo USB externo:</b> solo el almacenamiento USB es compatible. Otros dispositivos USB externos (por ejemplo, SAI, dongles de Wi-Fi, altavoces, impresoras, dongle de Bluetooth y dongle de DVB) no son compatibles. El almacenamiento USB se puede utilizar solo en el servidor activo y no se puede cambiar al servidor pasivo.</li>

  </ul>

  <h3>Entorno de red</h3>
  <p>Observe las siguientes directrices referentes a las configuraciones de red cuando intente formar un cl&uacute;ster de high-availability.</p>
  <ul>
    <li><b>Configuraci&oacute;n de red:</b> la conexi&oacute;n Heartbeat entre los dos servidores se debe configurar correctamente. Ambos servidores deben pertenecer a la misma subred y es necesario configurar las direcciones IP est&aacute;ticas despu&eacute;s de la instalaci&oacute;n.</li>
    <li><b>N&uacute;mero de puertos LAN:</b> Ambos servidores deben tener el mismo n&uacute;mero de puertos LAN. Si uno de los modelos de DiskStation est&aacute; equipado con interfaces de tarjeta de red, el otro debe estar equipado con las mismas interfaces de tarjeta de red. </li>
    <li><b>Restricciones de conexi&oacute;n:</b> el cl&uacute;ster de high-availability no es compatible con la red Wi-Fi.</li>

  </ul>
  <div class="section">
    <h4>Nota:</h4>
    <ul>
      <li>el servidor NTP se habilitar&aacute; autom&aacute;ticamente en el servidor activo.</li>
    </ul>
  </div>

<h3>Limitaciones del software y de paquetes</h3> 

<p>Vea las limitaciones relacionadas con los paquetes y el software a continuaci&oacute;n:</p>
	<ul>
	<li>la funci&oacute;n de cl&uacute;ster high-availability no es compatible con los siguientes paquetes y caracter&iacute;sticas:<ul><li>DVBLink Server</li>
		<li>La caracter&iacute;stica para reiniciar/apagar el cl&uacute;ster de high-availability en CMS</li>
		<li>Time Backup</li>
		</ul>
	</li>
	<li>El cl&uacute;ster high-availability con almacenamiento compartido no se puede configurar como un cl&uacute;ster high-availability basado en la replicaci&oacute;n ni se puede utilizar en combinaci&oacute;n con un cl&uacute;ster de ese tipo.</li>
    </ul>

<h3>Unidades de expansi&oacute;n espec&iacute;ficas</h3>
  <p>Tanto el servidor activo como el pasivo deben estar conectados a unidades de expansi&oacute;n espec&iacute;ficas. Existen dos m&oacute;dulos en cada unidad de expansi&oacute;n.</p>
  <h4>Para configurar/agregar unidades de expansi&oacute;n:</h4>
  <ul>
    <li>un m&oacute;dulo contiene dos puertos; el puerto de entrada est&aacute; en el lado izquierdo y el de salida en el lado derecho. Conecte un cable SAS desde el puerto de salida de un m&oacute;dulo hasta el puerto de entrada del m&oacute;dulo de la siguiente unidad de expansi&oacute;n.</li>
	<li>Las unidades de expansi&oacute;n deben estar conectadas en serie con los m&oacute;dulos en los lados correspondientes para cada servidor.</li>
    <li>Tanto el servidor activo como el pasivo deben estar conectados a unidades de expansi&oacute;n compartidas en el mismo orden.</li>
  </ul>


<div class="section">
<h4>Notas:</h4>
<p>para obtener informaci&oacute;n detallada sobre la instalaci&oacute;n de unidades de expansi&oacute;n, no olvide consultar la Gu&iacute;a de instalaci&oacute;n r&aacute;pida de los servidores y las unidades de expansi&oacute;n.</p>
</div>

   
 </body>
</html>
