<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 <meta charset="utf-8">
</head>
 <body>
<h2>Split brain</h2>

<p>Cuando un cl&uacute;ster high-availability funciona normalmente, solo uno de los servidores deber&iacute;a asumir el papel de servidor activo. En este caso, el servidor pasivo detecta la presencia del servidor activo a trav&eacute;s de la conexi&oacute;n Heartbeat, adem&aacute;s de la conexi&oacute;n de datos con las unidades de expansi&oacute;n compartidas, de manera que no se activar&aacute; el cambio. Adem&aacute;s, el servidor pasivo detecta el estado del almacenamiento compartido para evitar asumir el papel de servidor activo de manera incorrecta cuando el servidor activo actual todav&iacute;a accede de manera normal las unidades de expansi&oacute;n compartidas.</p>

<p>Cuando se pierde la conexi&oacute;n Heartbeat y todas las conexiones de datos o cuando el estado del sistema y del almacenamiento compartido es inestable, cada uno de los dos servidores se puede considerar a s&iacute; mismo como el servidor activo. Esta situaci&oacute;n se denomina &quot;split brain&quot; (cerebro dividido). En este caso, para evitar da&ntilde;os en los datos debido al acceso simult&aacute;neo de los dos servidores, uno de ellos intentar&aacute; continuar proporcionando servicios, mientras que el otro se reiniciar&aacute; y ser&aacute; necesario comprobar su conexi&oacute;n m&aacute;s tarde. En esta situaci&oacute;n, la conexi&oacute;n de los usuarios cliente puede ser estable durante unos momentos.</p>
        
 </body>
</html>
