<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Netzwerkeinstellungen</h2>
	<p>Diese Seite enth&auml;lt drei Registerkarten, welche die Netzwerkeinstellungen des high-availability Cluster, den aktiven Mitgliedsserver und den passiven Mitgliedsserver anzeigen.</p>
  
	<h3>HA Cluster Registerkarte</h3>
  	<p>Wenn Sie einen high-availability Cluster erstellen, erstellt das System eine gemeinsame IP-Adresse f&uuml;r den high-availability Cluster IP, um eingehende Verbindungen zu empfangen. Zus&auml;tzliche high-availability Cluster IP-Adresse k&ouml;nnen nach Bedarf erzeugt werden. Die IP-Adressen aktivierter Netzwerkschnittstellen auf dem aktiven Server werden auf dieser Registerkarte angezeigt (die von der Heartbeat-Verbindung angezeigte Schnittstelle wird nicht auf dieser Seite angezeigt, da die entsprechende Schnittstelle f&uuml;r die Datenreplikation zwischen den beiden Servern verwendet wird). Diese Registerkarte zeigt die unten stehenden Informationen:</p>
    	<ul>
        	<li><b>Netzwerk-Schnittstelle:</b> Die aktivierte(n) Netzwerk-Schnittstelle(n) auf dem aktiven Server.</li>
            <li><b>Verbindung:</b> Zeigt an, ob diese Schnittstelle angeschlossen ist oder nicht.</li>
            <li><b>IP-Adresse:</b> Wenn Sie einen High-availability Cluster erstellen, erstellt das System eine gemeinsame IP-Adresse f&uuml;r die High-availability Cluster-IP, um eingehende Verbindungen zu empfangen. Sie k&ouml;nnen die Verbindung mit dem High-availability Cluster &uuml;ber diese IP-Adresse herstellen, wenn Sie sich bei DiskStation Manager (DSM) anmelden m&ouml;chten, unabh&auml;ngig davon, welcher Synology Server der aktive Server ist. Dies vermeidet die Verbindung zu anderen IP-Adressen, wenn eine &Uuml;bergabe stattfindet.</li>
            <li><b>Teilnetzmaske: </b>Die entsprechende Teilnetzmaske f&uuml;r die zugewiesene Teilnetzmaske high-availability Cluster IP-Adresse.</li>
		</ul>
<h4>Bearbeiten von IP-Adressen und Teilnetzmaske:</h4>
	<ol>
		<li>W&auml;hlen Sie die IP-Adresse oder Teilnetzmaske, die Sie bearbeiten m&ouml;chten, und klicken Sie auf <b>Bearbeiten</b> oder klicken Sie doppelt auf das Feld, um mit der Bearbeitung zu beginnen.</li>
		
        
   <li>Markieren Sie die Option <b>Aktivieren</b>, um jede Schnittstelle zu aktivieren oder deaktivieren. Sie k&ouml;nnen mehr als eine Cluster Netzwerkschnittstelle aktivieren, aber die w&auml;hrend der Cluster Erstellung konfigurierte Netzwerkschnittstelle kann nicht deaktiviert werden.</li>
    
    
    </ol>
<h4>&Auml;nderung des high-availability Cluster Servernamens:</h4>
 	<ol>
    	<li>Klicken Sie auf <b>Netzwerkeinstellungen &auml;ndern</b>, um den high-availability Cluster Namen anzuzeigen und die Einstellungen zu &auml;ndern.</li>
   		<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um den aktuellen high-availability Cluster Namen und die IP-Adresseinstellungen zu speichern.</li>
   		<li>Wenn Sie die aktuellen &Auml;nderungen verwerfen m&ouml;chten, klicken Sie auf <b>Abbrechen</b>. </li>
  </ol>

<h3>Aktiver und Passiver Server Registerkarten (angezeigt mit ihrem Servernamen)</h3>
<p>Diese Registerkarten zeigen den aktuellen Nutzungsstatus der Netzwerkschnittstellen auf dem aktiven oder passiven Server an. Unter ihnen wird die Heartbeat-Verbindung jeweils eine Netzwerkschnittstelle auf dem aktiven und passiven Server belegen. Diese Registerkarten zeigen die folgenden Informationen an:</p>
	<ul>
    	<li><b>Netzwerk-Schnittstelle:</b> Die physische Netzwerk-Schnittstelle am Server.</li>
    	<li><b>IP Adresse:</b> Die der Netzwerkschnittstelle zugewiesene IP-Adresse.</li>
    	<li><b>Teilnetzmaske:</b> Die entsprechende Teilnetzmaske f&uuml;r die zugewiesene IP-Adresse.</li>
    	<li><b>Beschreibung:</b> Zeigt Informationen &uuml;ber die entsprechende Netzwerkschnittstelle und die Verf&uuml;gbarkeit der zugewiesenen IP-Adresse an. Diese Feld wird die folgenden m&ouml;glichen Bedingungen anzeigen:</li>
		<ol>
			<li><b>Erreichbare originale IP-Adresse</b>: Die originale IP-Adresse, die dieser Schnittstelle am aktiven Server zugewiesen wurde, ist f&uuml;r Daten und Dienste verf&uuml;gbar.</li>
			<li><b>Nicht erreichbare originale IP-Adresse</b>: Die originale IP-Adresse, die dieser Schnittstelle am passiven Server zugewiesen wurde, ist nicht verf&uuml;gbar.</li>
			<li><b>Heartbeat-Verbindung IP, nicht erreichbar aus dem Intranet</b>: Die originale IP-Adresse, die automatisch der Heartbeat-Verbindung zugewiesen wurde, ist nicht f&uuml;r Daten und Dienste verf&uuml;gbar.</li>
		</ol>
	</ul>
</body>
</html>