<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Service-Monitor</h2>

<p>Diese Seite erm&ouml;glicht es, bestimmte Dienste zu &uuml;berwachen. Falls ein &uuml;berwachter Dienst auf dem aktiven Server ausf&auml;llt, , f&uuml;hrt das System einen Failover zu dem bereitstehenden, passiven Server durch (soweit der passive Server normal funktioniert). Die folgenden Bereiche werden auf dieser Seite angezeigt:</p>

<ul>
  <li><b>Dienst:</b> Zeigt die Dienste an, die &uuml;berwacht werden k&ouml;nnen.</li>
  <li><b>Status: </b> Zeigt an, ob die Dienste aktiv sind oder nicht.</li>
  <li><b>Failover wenn Dienst fehlschl&auml;gt: </b>Markieren Sie das Kontrollk&auml;stchen neben einem Dienst, um die &Uuml;berwachung zu starten. Das System f&uuml;hrt einen Failover aus, wenn Dienst ausf&auml;llt.</li>
</ul>

<h4>So wird ein Dienst &uuml;berwacht:</h4>

<ol>
<li>W&auml;hlen Sie den Dienst aus, der &uuml;berwacht werden soll. Markieren Sie das Kontrollk&auml;stchen daneben.</li>
<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um die Einstellungen zu speichern.</li>
</ol>

<div class="section">
<h4>Unterst&uuml;tzte Dienste</h4>
<p>Folgende Dienste k&ouml;nnen &uuml;berwacht werden: Windows Dateidienst, iSCSI Target, FTP, Mac Dateidienst, NFS-Dienst.</p>
</div>

<div class="section">
<h4>Failover, wenn Netzwerkverbindung ausf&auml;llt</h4>
<p>Wenn diese Option aktiviert ist, wird das System einen Failover zum passiven Server ausf&uuml;hren, wenn die Netzwerkverbindung des aktiven Servers ausf&auml;llt oder Fehlfunktionen aufweist, und die Netzwerkverbindung des passiven Server noch normal funktioniert.</p>

<ul>
<li>Der Failover wird nur ausgel&ouml;st, wenn der passive Server mehr korrekt funktionierende Verbindungen aufweist. Wenn zum Beispiel der aktive Server drei Verbindungen besitzt und eine ausf&auml;llt, wird das System den Failover nur ausl&ouml;sen, wenn der passive Server drei oder mehr korrekt funktionierende Verbindungen besitzt.</li>
<li>Verbindungen in Kombination mit Link Aggregation z&auml;hlen als eine Verbindung. Wenn zum Beispiel zwei Verbindungen kombiniert werden, und eine von ihnen ausf&auml;llt, die andere aber noch funktioniert, z&auml;hlt die Verbindung immer noch als In Ordnung.</li>
</ul>

</div>

</body>
</html>
