<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
  <h2>Herunterfahren und Zur&uuml;cksetzen</h2>
  <p>Die unten stehenden Anweisungen f&uuml;hren Sie durch den Prozess, einen High-availability Cluster herunterzufahren, zu entfernen oder zur&uuml;ckzusetzen.</p>

  <h4> High-availability Cluster mit Synology High Availability herunterfahren:</h4>
  <p>Wenn Sie einen High-availability Cluster herunterfahren m&ouml;chten, um die Server zu einem neuen Standort zu transportieren oder eine Wartung durchzuf&uuml;hren, aber nicht die High-availability Cluster-Konfigurationen entfernen m&ouml;chten, folgen Sie bitte diesen Anweisungen.</p>
  <ol>
   <li>Melden Sie sich bei DSM an.</li>
   <li>&Ouml;ffnen Sie Synology High Availability.</li>
   <li>Klicken Sie auf die Schaltfl&auml;che <b>Verwaltung</b>.</li>
   <li>W&auml;hlen Sie <b>HA Cluster herunterfahren</b>.</li>
   <li>Eine Best&auml;tigungsmeldung wird angezeigt. Klicken Sie zur Best&auml;tigung auf <b>Ja</b>.</li>
  </ol>

  <h4>So fahren Sie einen High-availability Cluster manuell herunter:</h4>
  <p> Der High-availability Cluster kann auch &uuml;ber die Ein/Aus-Tasten an jedem Server manuell heruntergefahren werden. </p>
  <ol>
   <li>Halten Sie die Ein/Aus-Taste an einem Server (aktiv oder passiv) gedr&uuml;ckt, bis ein Signalton ausgegeben wird.</li>
   <li>Warten Sie nach dem vollst&auml;ndigen Herunterfahren eines Servers mindestens 30 Sekunden lang (der Server, der noch online ist, ben&ouml;tigt diese Zeit zum Speichern der Einstellungen).</li>
   <li>Halten Sie die Ein/Aus-Taste am anderen Server gedr&uuml;ckt, bis ein Signalton ausgegeben wird.</li>
   <li>Warten Sie, bis der Server vollst&auml;ndig heruntergefahren ist.</li>
  </ol>
<div class="section">
<h4>Server einschalten:</h4>   
<p>Wenn Sie die Server wieder einschalten m&ouml;chten, m&uuml;ssen der aktive und passive Server zur selben Zeit eingeschaltet werden (oder innerhalb von 5 Minuten). Wenn Sie nur einen der Server einschalten, wird er versuchen, den anderen Server durch Senden der Meldung &quot;Aufwachen bei LAN-Verbindung&quot; einzuschalten.</p>
<h4>Anormales Herunterfahren:</h4>
<p>Wenn ein High-availability Cluster erstellt wird, ist die Funktion f&uuml;r den Neustart nach einem Stromausfall in der Systemsteuerung automatisch aktiviert. Wenn die Server aufgrund eines Stromausfalls nicht normal herunterfahren, werden sie automatisch neu gestartet, wenn die Stromversorgung wiederhergestellt ist.</p>
</div>

<h4>So entfernen Sie einen High-availability Cluster:</h4>
 <p>Wenn Sie beide Server und den High-availability Cluster entfernen m&ouml;chten, um einen anderen Server einzubinden, folgen Sie bitte diesen Anweisungen.</p>
  <ol>
   <li>Gehen Sie zur Seite <b>&Uuml;berblick</b>.</li>
   <li>Klicken Sie auf die Schaltfl&auml;che <b>Verwaltung</b>.</li> 
   <li>W&auml;hlen Sie <b>HA Cluster entfernen</b>.</li>
  </ol>
  <p>Nach der Best&auml;tigung entfernt das System den High-availability Cluster. Das Statusfeld zeigt den Fortschritt des Vorgangs an. Wenn der High-availability Cluster erfolgreich entfernt wurde, werden Sie zur urspr&uuml;nglichen IP-Adresse des aktiven Servers geleitet. Der Status der beiden Servern &auml;ndert sich zu <b>Einzeln</b>.</li>
  
 <h4>So setzen Sie einen fehlerhaften High-availability Cluster zur&uuml;ck:</h4>
  <p>Wenn Sie aufgrund eines Split Brain-Fehlers oder einer anderen Fehlfunktion nicht mehr auf DSM oder Synology High Availability zugreifen k&ouml;nnen, k&ouml;nnen Sie versuchen, ein Entfernen des High-availability Clusters zu erzwingen, indem Sie auf die <b>Reset</b>-Taste an den Servern dr&uuml;cken.</p>
  <ol>
   <li>Halten Sie die <b>Reset</b>-Taste (gew&ouml;hnlich an der R&uuml;ckseite eines Servers) gedr&uuml;ckt, bis der Server einen Signalton ausgibt.
   <li>Das System entfernt den High-availability Cluster und der Status der beiden Server &auml;ndert sich zu <b>Einzeln.</b></li>
   <li>Wenn Sie auf die <b>Reset</b>-Taste dr&uuml;cken, werden einige Einstellungen, z. B. IP-Adresse, DNS und Admin-Passwort zus&auml;tzlich zu folgenden Optionen auf die Standardwerte zur&uuml;ckgesetzt:</li>
   <ul>
    <li>Das Admin-Passwort wird gel&ouml;scht.</li>
    <li>Das Gastkonto wird deaktiviert.</li>
    <li>DHCP wird in den IP, DNS, Gateway und anderen Netzwerkschnittstellen aktiviert.</li>
    <li>JumboFrames werden deaktiviert und der MTU-Wert auf 1500 eingestellt.</li>
    <li>Der Verwaltungs-Port wird auf 5000/5001 zur&uuml;ckgesetzt.</li>
    <li>PPPoE wird auf Standard zur&uuml;ckgesetzt.</li>
    <li>Automatische IP-Blockierung wird deaktiviert (die blockierte IP-Adresse wird nicht gel&ouml;scht).</li>
    <li>Link Aggregation wird deaktiviert.</li>
    <li>Firewall-Regeln werden deaktiviert (die Regeln werden nicht gel&ouml;scht).</li>
   </ul>
  </ol>

<div class="section">
<h4>Hinweis:</h4>
<p>W&auml;hrend des Entfernens eines High-availability Clusters k&ouml;nnten einige unvollst&auml;ndige Datenschreibvorg&auml;nge stattfinden. Um die Vollst&auml;ndigkeit der Daten zu gew&auml;hrleisten, f&uuml;hren Sie bitte eine Datenreplikation basierend auf dem aktiven Server aus, da der passive Server einige Datenaktualisierungen verpassen k&ouml;nnte.</p>
</div>
 </body>
</html>
