<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Copia de seguridad y replicaci&oacute;n</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Copia de seguridad LUN</h2>
<p>En la pesta&ntilde;a <b>Copia de seguridad</b> de <b>Copia de seguridad y replicaci&oacute;n</b>, puede utilizar <b>Copia de seguridad LUN local</b> para hacer copia de seguridad de los iSCSI LUN de su DiskStation en carpetas locales compartidas. Tambi&eacute;n puede utilizar <b>Copia de seguridad LUN de red</b> para hacer copia de seguridad en otro DiskStation.</p>

<h4>Para hacer copia de seguridad de un iSCSI LUN:</h4>
<ol>
<li>
Elija <b>Crear</b> &gt; <b>Tarea de copia de seguridad del LUN</b> para abrir el <b>Asistente de copia de seguridad del LUN</b> y haga clic en <b>Siguiente</b>.
</li>
<li>
Cuando se le pida que elija un tipo de destino, elija cualquiera de los siguientes:
</li>
<ul>
<li>
<b>Copia de seguridad de LUN local</b>: Elija esta opci&oacute;n para hacer copia de seguridad del LUN desde su DiskStation en una carpeta compartida o un almacenamiento externo que est&aacute; conectado al USB o puerto eSATA de su DiskStation.
</li>
<li><b>Copia de seguridad del LUN de la red</b>: Elija esta opci&oacute;n para hacer copia de seguridad del LUN desde su DiskStation en otro DiskStation.
</li>
</ul>
<li>
Cuando se le pregunte, especifique el LUN de destino y origen de la copia de seguridad y configure el programa de copia de seguridad.
</li>
<li>
Siga el asistente para completar la configuraci&oacute;n.
</li>
</ol>
<p>Despu&eacute;s de crear la tarea de copia de seguridad, DiskStation realizar&aacute; la tarea de copia de seguridad de acuerdo con el programa y restaurar&aacute; el LUN de copia de seguridad en el destino. El LUN de copia de seguridad se utilizar&aacute; s&oacute;lo para fines de copia de seguridad. Para acceder el LUN de copia de seguridad, consulte <a href="restore.html">Para restaurar el LUN de copia de seguridad</a> para obtener m&aacute;s informaci&oacute;n.</p>

<div class="section">
<h4>Nota:</h4>
<ul>

<li>Se realizar&aacute;n copias de seguridad tanto de los archivos normales como de los LUN de nivel de bloques, en forma de archivos de im&aacute;genes en el destino. Si se restauran, todos los LUN a nivel de bloque cambiar&aacute;n a LUNs de archivo.</li>
<li>Cada tarea de copia de seguridad puede incluir s&oacute;lo un LUN como origen de la copia de seguridad.</li>
<li>No se pueden realizar copias de seguridad de los LUN a discos externos con formatos FAT, FAT32, HFS, HFS Plus ni NTFS.</li>
<li>Antes de realizar Copia de seguridad LUN de red, inicie sesi&oacute;n en DiskStation de destino para asegurarse de que su Servicio de copia de seguridad de red est&aacute; habilitado en <b>Copia de seguridad y replicaci&oacute;n</b> &gt; <b>Servicios de copia de seguridad</b>.</li>
<li>Si su DiskStation se conecta a la red a trav&eacute;s de un enrutador, compruebe que ha especificado una regla de reenv&iacute;o de puerto para el servicio iSCSI (puerto TCP 3260) en el enrutador antes de realizar la Copia de seguridad LUN de red.</li>
</ul>
</div>


<div class="section">
<h4>Acerca de la copia de seguridad completa y copia de seguridad por incrementos:</h4>
<p>
DiskStation realizar&aacute; una copia de seguridad completa del LUN seleccionado por primera vez y luego realizar&aacute; copias de seguridad por incrementos. Sin embargo, si el nombre de la carpeta compartida o el nombre del directorio del destino de la copia de seguridad se modifica, DiskStation realizar&aacute; de nuevo una copia de seguridad completa de la tarea.
</p>
</div>
</body></html>
