<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>N&auml;tverksinst&auml;llningar</h2>
	<p>Denna sida inneh&aring;ller tre flikar som visar n&auml;tverksinst&auml;llningar f&ouml;r high-availability-klustret, den aktiva medlemsservern och den passiva medlemsservern.</p>
  
	<h3>Fliken HA-kluster</h3>
  	<p>N&auml;r ett high-availability-kluster skapas genererar systemet en gemensam IP-adress f&ouml;r high-availability-klustrets IP f&ouml;r inkommande anslutningar. Ytterligare IP-adresser f&ouml;r high-availability-klustret kan skapas vid behov. IP-adresserna f&ouml;r de aktiverade n&auml;tverkskorten p&aring; den aktiva servern visas p&aring; denna flik (n&auml;tverkskortet som anv&auml;nds av Heartbeat-anslutningen visas inte p&aring; denna sida och n&auml;mnda gr&auml;nssnitt kommer att anv&auml;ndas f&ouml;r datareplikering mellan de tv&aring; servrarna). Denna flik visar information enligt nedanst&aring;ende:</p>
    	<ul>
        	<li><b>N&auml;tverksgr&auml;nssnitt:</b> Aktiverat/aktiverade n&auml;tverkskort p&aring; den aktiva servern.</li>
            <li><b>Anslutning:</b> Visar huruvida detta gr&auml;nssnitt &auml;r anslutet.</li>
            <li><b>IP-adress:</b> N&auml;r ett high-availability-kluster skapas genererar systemet en gemensam IP-adress f&ouml;r high-availability-klustrets IP f&ouml;r inkommande anslutningar. Du kan ansluta till high-availability-klustret genom att anv&auml;nda denna IP-adress om du vill logga in p&aring; DiskStation Manager (DSM), oavsett vilken Synology-server som &auml;r aktiv server. Detta g&ouml;r att anslutning inte beh&ouml;ver ske till annan IP-adress n&auml;r en &ouml;verg&aring;ng g&ouml;rs.</li>
            <li><b>Subn&auml;tmask: </b>Den subn&auml;tmask som &auml;r associerad med aktuellt high-availability-klustrets IP-adress.</li>
		</ul>
<h4>F&ouml;r att redigera IP-adress eller subn&auml;tmask:</h4>
	<ol>
		<li>V&auml;lj den IP-adress eller subn&auml;tmask du vill redigera och klicka p&aring; <b>Redigera</b> eller dubbelklicka p&aring; f&auml;ltet f&ouml;r att utf&ouml;ra redigering.</li>
   <li>Bocka f&ouml;r kryssrutorna <b>Aktivera</b> f&ouml;r att aktivera eller inaktivera respektive gr&auml;nssnitt. Du kan aktivera mer &auml;n ett n&auml;tverkskort p&aring; klustret men n&auml;tverkskort som ursprungligen anv&auml;ndes n&auml;r klustret skapades kan inte inaktiveras.</li>
    </ol>
<h4>&Auml;ndra servernamn f&ouml;r high-availability-klustret:</h4>
 	<ol>
    	<li>Klicka p&aring;<b> &Auml;ndra n&auml;tverksinst&auml;llningar</b> f&ouml;r att se namnet p&aring; high-availability-klustret och &auml;ndra dess inst&auml;llningar.</li>
   		<li>Klicka p&aring; <b>Till&auml;mpa</b> f&ouml;r att spara inst&auml;llningar med nuvarande namn och IP-adress f&ouml;r high-availability-klustret.</li>
   		<li>F&ouml;r att kasta bort nuvarande &auml;ndringar klicka p&aring; <b>Avbryt</b>. </li>
  </ol>

<h3>Fliken Aktiv och Passiv Server (visas som servernamn)</h3>
<p>Dessa flikar visas status f&ouml;r n&auml;tverkskort p&aring; den aktiva eller passiva servern. Av dessa, anv&auml;nder Heartbeat-anslutningen ett n&auml;tverkskort vardera p&aring; den aktiva och den passiva servern. Dessa flikar visar f&ouml;ljande information:</p>
	<ul>
    	<li><b>N&auml;tverkskort:</b> Aktiverat/aktiverade n&auml;tverkskort p&aring; servern.</li>
    	<li><b>IP-adress:</b> Den IP-adress som tilldelats aktuellt n&auml;tverkskort.</li>
    	<li><b>Subn&auml;tmask:</b> Den subn&auml;tmask som &auml;r associerad med aktuell IP-adress.</li>
    	<li><b>Beskrivning:</b> Visar information om aktuellt n&auml;tverkskort och &aring;tkomsten till dess tilldelade IP-adress. Detta f&auml;lt kan visa f&ouml;ljande m&ouml;jliga tillst&aring;nd:</li>
		<ol>
			<li><b>&Aring;tkomst till ursprunglig IP-adress</b>: Den IP-adress som ursprungligen tilldelades gr&auml;nssnittet p&aring; den aktiva servern &auml;r tillg&auml;nglig f&ouml;r data och tj&auml;nster.</li>
			<li><b>Ingen &aring;tkomst till ursprunglig IP-adress</b>: Den IP-adress som ursprungligen tilldelades gr&auml;nssnittet p&aring; den aktiva servern &auml;r tillg&auml;nglig f&ouml;r data och tj&auml;nster.</li>
			<li><b>IP-anslutning f&ouml;r Heartbeat, inte tillg&auml;nglig fr&aring;n intran&auml;tet</b>: Den ursprungliga IP-adressen som automatiskt tilldelats Heartbeat-anslutningen &auml;r inte tillg&auml;nglig f&ouml;r data och tj&auml;nster.</li>
		</ol>
	</ul>
</body>
</html>