<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Tj&auml;nst&ouml;vervakning</h2>

<p>Denna sida l&aring;ter dig &ouml;vervaka speciella tj&auml;nster. Om det uppst&aring;r en felfunktion p&aring; en &ouml;vervakad tj&auml;nst p&aring; den aktiva servern, kommer systemet att utf&ouml;ra redundans till den passiva servern som &auml;r i beredskapsl&auml;ge (f&ouml;rutsatt att den passiva servern fungerar normalt). F&ouml;ljande avsnitt finns p&aring; denna sida:</p>

<ul>
  <li><b>Tj&auml;nst:</b> Visar tj&auml;nster som kan &ouml;vervakas.</li>
  <li><b>Status: </b> Visar huruvida tj&auml;nsterna k&ouml;rs.</li>
  <li><b>Felhanteringsrutin n&auml;r tj&auml;nst misslyckas: </b>Markera kryssrutan bredvid en tj&auml;nst f&ouml;r att b&ouml;rja &ouml;vervaka den. Systemet utf&ouml;r redundans om det uppst&aring;r en felfunktion f&ouml;r den valda tj&auml;nsten.</li>
</ul>

<h4>&Ouml;vervaka en tj&auml;nst:</h4>

<ol>
<li>Lokalisera den tj&auml;nst du vill &ouml;vervaka. Markera kryssrutan bredvid den.</li>
<li>Klicka p&aring; <b>Till&auml;mpa</b> f&ouml;r att spara inst&auml;llningarna.</li>
</ol>

<div class="section">
<h4>Tj&auml;nster som st&ouml;ds</h4>
<p>Tj&auml;nster som kan &ouml;vervakas &auml;r f&ouml;ljande: Windows File Service, iSCSI Target, FTP, Mac File Service, NFS Service.</p>
</div>

<div class="section">
<h4>Redundans vid fel p&aring; n&auml;tverksanslutning</h4>
<p>Om detta alternativ &auml;r aktiverat kommer systemet utf&ouml;ra redundans till den passiva servern om det uppst&aring;r en felfunktion p&aring; eller om n&auml;tverksanslutningen slutar fungera f&ouml;r den aktiva servern och n&auml;tverksanslutningen p&aring; den passiva servern fungerar normalt.</p>

<ul>
<li>Redundans kommer att utl&ouml;sas endast om den passiva servern har fler anslutningar vid god h&auml;lsa. Till exempel, om den aktiva servern har tre anslutningar och en slutar fungera, kommer systemet att utl&ouml;sa redundans endast om den passiva servern har tre eller fler anslutningar vid god h&auml;lsa.</li>
<li>Anslutningar som kombinerats med Link Aggregation r&auml;knas som en anslutning. Till exempel om tv&aring; anslutningar &auml;r kombinerade och en av den slutar fungera, medan den andra fortfarande fungerar, kommer anslutningen fortfarande att betraktas som vid god h&auml;lsa.</li>
</ul>

</div>

</body>
</html>
