<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
  <h2>St&auml;nga av och &aring;terst&auml;lla</h2>
  <p>Instruktionerna h&auml;r nedanf&ouml;r kommer att v&auml;gleda dig genom f&ouml;rfaranden f&ouml;r att st&auml;nga av, ta bort eller &aring;terst&auml;lla ett high-availability-kluster.</p>

  <h4> St&auml;nga av high-availability-klustret med Synology High Availability:</h4>
  <p>N&auml;r du vill st&auml;nga av ett high-availability-kluster f&ouml;r att transportera servrar till en ny fysisk plats eller utf&ouml;ra underh&aring;ll men inte vill ta bort konfigurationen f&ouml;r high-availability-klustret, f&ouml;lj dessa instruktioner.</p>
  <ol>
   <li>Logga in p&aring; DSM.</li>
   <li>&Ouml;ppna Synology High Availability.</li>
   <li>Klicka p&aring; knappen med texten <b>Hantering</b>.</li>
   <li>V&auml;lj <b>St&auml;ng av HA-kluster</b>.</li>
   <li>Ett meddelande f&ouml;r att bekr&auml;fta visas. Klicka p&aring; <b>Ja</b> f&ouml;r att bekr&auml;fta.</li>
  </ol>

  <h4>St&auml;nga av ett high-availability-kluster manuellt:</h4>
  <p> High-availability-kluster kan ocks&aring; st&auml;ngas av manuellt genom att anv&auml;nda str&ouml;mbrytaren som finns p&aring; vardera server. </p>
  <ol>
   <li>Tryck och h&aring;ll inne str&ouml;mbrytaren p&aring; en av servrarna (aktiv eller passiv), tills ett pipljud h&ouml;rs.</li>
   <li>Efter att en server st&auml;ngts av helt och h&aring;ller, v&auml;nta &aring;tminstone 30 sekunder (servern som fortfarande &auml;r online beh&ouml;ver tid f&ouml;r att spara inst&auml;llningarna).</li>
   <li>Tryck och h&aring;ll inne str&ouml;mbrytaren p&aring; den andra servern, tills ett pipljud h&ouml;rs.</li>
   <li>V&auml;nta till servern &auml;r helt avst&auml;ngd.</li>
  </ol>
<div class="section">
<h4>Sl&aring; p&aring; servrar:</h4>   
<p>N&auml;r du vill sl&aring; p&aring; servrarna igen ska du s&aring; p&aring; b&aring;de den aktiva och den passiva servern samtidigt (inom fem minuter efter att n&aring;gon av dem slagits p&aring; skall den andra ocks&aring; sl&aring;s p&aring;). Om du bara sl&aring;r p&aring; en av servrarna kommer den att f&ouml;rs&ouml;ka sl&aring; p&aring; den andra servern genom att skicka ett Wake-on-LAN-meddelande.</p>
<h4>Avvikande avst&auml;ngning:</h4>
<p>N&auml;r ett high-availability-kluster skapas &auml;r alternativet starta om efter str&ouml;mavbrott automatisk aktiverat i kontrollpanelen. Om servrarna st&auml;ngs av avvikande p&aring; grund av str&ouml;mavbrott kommer de automatiskt att sl&aring;s p&aring; n&auml;r str&ouml;mmen kommer tillbaka.</p>
</div>

<h4>Ta bort ett high-availability-kluster:</h4>
 <p>N&auml;r du &ouml;nskar h&auml;va bindningen av de b&aring;da servrarna och ta bort ett high-availability-kluster f&ouml;r att binda en annan server, v&auml;nligen f&ouml;lj dessa instruktioner.</p>
  <ol>
   <li>G&aring; till sidan <b>&Ouml;versikt</b>.</li>
   <li>Klicka p&aring; knappen <b>Hantering</b>.</li> 
   <li>V&auml;lj <b>Ta bort HA-kluster</b>.</li>
  </ol>
  <p>Efter bekr&auml;ftelse tar systemet bort high-availability-klustret. Statusf&auml;ltet visar hur processen f&ouml;r borttagning fortl&ouml;per. N&auml;r lyckad borttagning av high-availability-klustret genomf&ouml;rts kommer du att omdirigeras till den ursprungliga IP-adressen f&ouml;r den aktiva servern. B&aring;da servrarnas status kommer att &auml;ndras till <b>Frist&aring;ende</b>.</li>
  
 <h4>G&ouml;ra en &aring;terst&auml;llning p&aring; icke fungerande high-availability-kluster:</h4>
  <p>Om du inte har &aring;tkomst till DSM eller Synology High Availability Manager, beroende p&aring; split-brain-fel eller annan funktionsst&ouml;rning kan du f&ouml;rs&ouml;ka tvinga high-availability-klustret att h&auml;va bindningen genom att trycka p&aring; knappen <b>Reset</b> som finns p&aring; dina servrar.</p>
  <ol>
   <li>Tryck och h&aring;ll inne knappen <b>Reset</b> (&aring;terfinns vanligtvis p&aring; baksidan av servern) tills servern ger ifr&aring;n sig ett pipljud.
   <li>Systemet kommer att ta bort befintligt high-availability-kluster och status f&ouml;r b&aring;da servrarna kommer att &auml;ndras till <b>Frist&aring;ende</b></li>
   <li>Att trycka p&aring; knappen <b>Reset</b> &aring;terst&auml;ller ocks&aring; n&aring;gra andra inst&auml;llningar till standard, s&aring;som IP-adress, DNS och l&ouml;senord f&ouml;r anv&auml;ndaren admin, enligt f&ouml;ljande:</li>
   <ul>
    <li>Admin-l&ouml;senordet &aring;terst&auml;lls till blankt.</li>
    <li>G&auml;stkontot blir inaktiverat.</li>
    <li>DHCP aktiveras f&ouml;r IP, DNS, Gateway och andra n&auml;tverksgr&auml;nssnitt.</li>
    <li>JumboFrames inaktiveras och MTU s&auml;tts till 1500.</li>
    <li>Hanteringsporten &aring;terst&auml;lls till 5000/5001.</li>
    <li>PPPoE &aring;terst&auml;lls till standard.</li>
    <li>IP autoblockering inaktiveras (de blockerade IP-adresserna raderas inte).</li>
    <li>Link Aggregation blir inaktiverat.</li>
    <li>Brandv&auml;ggsregler blir inaktiverade (reglerna blir inte raderade).</li>
   </ul>
  </ol>

<div class="section">
<h4>Obs:</h4>
<p>Under proceduren f&ouml;r att ta bort ett high-availability-kluster kan det f&ouml;rekomma ofullst&auml;ndiga skrivoperationer. F&ouml;r att tillse att data &auml;r komplett, v&auml;nligen genomf&ouml;r datareplikering fr&aring;n den aktiva servern eftersom den passiva servern kan sakna delar av aktuella data.</p>
</div>
 </body>
</html>
