<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Auf dem Synology NAS gespeicherte Multimediainhalte auf gro&szlig;en Bildschirmen genie&szlig;en</title>
</head>

<body class="tutorial-content-box" >

<h1>Auf dem Synology NAS gespeicherte Multimediainhalte auf gro&szlig;en Bildschirmen genie&szlig;en</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_media_server/enjoy_multimedia_contents_stored_on_synology_nas_with_big_screens.jpg" width="600" height="301" />
<h2>&Uuml;bersicht</h2>
<p>Das Synology NAS kann als Multimedia-Server im lokalen Netzwerk eingesetzt werden, &uuml;ber den Ger&auml;te wie Fernseher/Stereoanlagen und Sony PlayStation3/Xbox 360 Multimediainhalte wiedergeben k&ouml;nnen. Diese Ger&auml;te sind DLNA/UPnP-konforme <b>Digitale Medien-Adapter</b> (DMA). Wenn Sie Multimediainhalte von Ihrem Synology NAS auf DMA Ger&auml;te f&uuml;r die Wiedergabe streamen m&ouml;chten, m&uuml;ssen Sie die Medien Wiedergabeeinstellungen konfigurieren. Zum Beispiel die Einstellungen zum Durchsuchen von Mediendateien verwalten und die Kompatibilit&auml;t von Dateien verbessern. Diese Funktion ist im Paket <strong>Medienserver</strong> verf&uuml;gbar.</p>

<h3 class="list_head">1. Medienserver installieren</h3>
<p>Um Medienserver zu installieren, wechseln Sie bitte zu <b>Paketzentrum</b>, suchen Sie nach <b>Medienserver</b> und klicken Sie anschlie&szlig;end auf <b>Installieren</b>.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_install_media_server.png" width="640" border="1" />

<h3 class="list_head">2. Multimediadateien auf das Synology NAS hochladen</h3>
<p>Die Standardfreigabeordner <b>photo</b>, <b>music</b> und <b>video</b> werden automatisch nach der Installation von Medienserver auf dem NAS erstellt und indiziert. Sie m&uuml;ssen einfach nur Mediendateien wie z.B. Bilder, Lieder oder Videos in die entsprechenden Ordner hochladen. Diese Dateien werden anschlie&szlig;end &uuml;ber Ihre DMA Ger&auml;te verf&uuml;gbar sein.</p>
<div class="code_div"><b>Hinweis:</b> Gemeinsame Ordner, die von Remote-Servern zur Verf&uuml;gung gestellt werden, k&ouml;nnen nicht als indizierte Ordner hinzugef&uuml;gt werden. Sie k&ouml;nnen bis zu 100 indizierte Ordner auf Ihrer Synology NAS hinzuf&uuml;gen.</div>

<h3 class="list_head">3. Einstellungen zum Durchsuchen f&uuml;r Ihren Medienplayer konfigurieren</h3>
<p>Sie k&ouml;nnen entscheiden, wie Mediendateien auf dem Synology NAS von Ihren DMA Ger&auml;ten durchsucht werden k&ouml;nnen.</p>
<ol>
<li>Wechseln Sie zu <b>Hauptmen&uuml; &gt; Medienserver</b>.</li>
<li>Klicken Sie auf der linken Seite auf <b>Sucheinstellungen</b>.</li>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_browsing_settings.png" width="640" border="1" />
<li>Klicken Sie f&uuml;r weitere Informationen auf die <b>Hilfe</b> Schaltfl&auml;che oben rechts im <b>Medienserver</b> Fenster.</li>
</ol>
<h3 class="list_head">4. DMA-Kompatibilit&auml;t verbessern</h3>
<p>Wenn Ihre DLNA/UPnP Fernseher oder DMA Ger&auml;te die Multimediainhalte vom NAS nicht fl&uuml;ssig wiedergeben k&ouml;nnen, k&ouml;nnen Sie versuchen, die Einstellungen unter <b>DMA-Kompatibilit&auml;t</b> in Medienserver zu konfigurieren.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_dma_compatibility.png" width="640" border="1" />
<div class="code_div"><b>Hinweis:</b>
<ol>
  <li>Wenn Sie &uuml;berpr&uuml;fen m&ouml;chten, ob Ihr DMA Ger&auml;t richtig installiert und von Ihrem NAS innerhalb des lokalen Netzwerks erkannt wird, klicken Sie auf <b>Ger&auml;teliste</b>. Eine Liste von DMA Ger&auml;ten mit ihren Ger&auml;teinformationen wird angezeigt.</li>
  <li>Stellen Sie sicher, dass <b>Zugriff auf Media Server f&uuml;r neu erkannte UPnP/DLNA Ger&auml;te einschr&auml;nken</b> nicht aktiviert ist. Anderenfalls kann auf Ihren DMA Ger&auml;te nicht auf Medienserver zugegriffen werden.</li>
</ol>
</div>
<p>F&uuml;r weitere Informationen &uuml;ber technische Details von Multimediadateien anderer Formate klicken Sie auf die Hilfe Schaltfl&auml;che oben rechts im Medienserver Fenster.</p>
<h3 class="list_head">5. Auf dem NAS gespeicherte Mediendateien mit einem DLNA Fernseher zugreifen</h3>
<p>DLNA/UPnP und DMA Ger&auml;te k&ouml;nnen sich ganz einfach mit Ihrem Heimnetzwerk verbinden. Nach der Herstellung der Verbindungen von Ihrem Synology NAS und DLNA Ger&auml;ten zu Ihrem Heimnetzwerk k&ouml;nnen Sie ausgew&auml;hlte Ordner durchsuchen und auf dem NAS gespeicherte Musik h&ouml;ren oder Video auf einem gro&szlig;en Bildschirm ansehen.</p>
<div class="code_div"><b>Hinweis:</b> Eine Liste von DLNA/UPnP Fernsehern und DMA Ger&auml;ten, die von Synology verifiziert wurden, finden Sie <a href="https://www.synology.com/compatibility?search_by=category&category=dlna_devices&p=1&not_recommend_mode=false" target="_blank">hier</a>.</div>
<p>Der Einstellungsvorgang h&auml;ngt von Ihren DLNA-konformen DMA Ger&auml;ten ab. F&uuml;r weitere Informationen &uuml;ber den Zugriff via DLNA auf Mediendateien, die auf dem NAS gespeichert sind, folgen Sie bitte den Anweisungen Ihrer Client Ger&auml;te.</p>
</div>
<div class="page-info">
  <ul>
    <li>Nächstes in diesem Thema: <a href="home_theater_videos.html">Videos mit Video Station kategorisieren und wiedergeben</a> </li>
  </ul>
</div>
</body>

</html>