<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Videos mit Video Station organisieren und wiedergeben</title>
</head>

<body class="tutorial-content-box" >

<h1>Videos mit Video Station kategorisieren und wiedergeben</h1>
<div class="tutorials_content">

<img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.jpg"/>


<h2>&Uuml;bersicht</h2>
<p>Mit Video Station k&ouml;nnen Sie Ihre Videosammlungen ganz einfach in verschiedene Standard oder benutzerdefinierte Bibliotheken organisieren und kategorisieren, so dass Sie ein Video weitaus effizienter finden k&ouml;nnen. Zus&auml;tzlich ist die Wiedergabe und Freigabe so einfach und selbsterkl&auml;rend wie einige wenige Mausklicks.</p>

<h3 class="list_head">1. Video Station installieren</h3>
<p>Um Video Station zu installieren, wechseln Sie bitte zu <b>Paketzentrum</b>, suchen Sie nach <b>Video Station</b> und klicken Sie anschlie&szlig;end auf <b>Installieren</b>.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/1.png" border="1"/>

<h3 class="list_head">2. Videos in Standardbibliotheken speichern und kategorisieren</h3>
<p>Video Station bietet drei Standardbibliotheken wie auf der linken Seite gezeigt: <b>Film</b>, <b>TV-Serie</b> und <b>Privatvideo</b>. Um sicherzustellen, dass Ihre Videos richtig indiziert und kategorisiert werden k&ouml;nnen, m&uuml;ssen Sie Video-Ordner f&uuml;r jede Bibliothek angeben und Ihre Dateien anschlie&szlig;end in den entsprechenden Video-Ordnern speichern. Standardm&auml;&szlig;ig wurden im gemeinsamen Order <b>video</b> drei Ordner f&uuml;r die drei Standardbibliotheken erstellt: <b>Film</b>, <b>TV-Serie</b> und <b>Privatvideo</b>. Zus&auml;tzlich zu diesen drei Ordnern k&ouml;nnen Sie auch Folgendes tun, um weitere Video-Ordner f&uuml;r die Bibliotheken hinzuzuf&uuml;gen.</p>

<div class="code_div">
<b>Hinweis:</b>
<p>Das System wird automatisch nach entsprechenden Metadaten und anderen Informationen (z.B. Poster) f&uuml;r zwei Videotypen (Film und TV-Serie) aus dem Internet suchen. Um sicherzustellen, dass Ihre Videos mit den korrekten Informationen versehen werden k&ouml;nnen, empfehlen wir dringend, dass die Videos zu den entsprechenden Videotypen der jeweiligen Bibliotheken passen.</p>
</div>

<h4>Video-Ordner f&uuml;r Standardbibliotheken hinzuf&uuml;gen</h4>
<ol>
<li>Gehen Sie zu <b>Einstellungen</b> &gt; <b>Bibliothek</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/2.png" border="1"/>

<li>Klicken Sie auf <b>Erstellen</b> &gt; <b>Ordner hinzuf&uuml;gen</b>, um einen Ordner auf Ihrem Synology NAS auszuw&auml;hlen und die entsprechende Bibliothek zuzuweisen. Sie k&ouml;nnen bis zu 100 Video-Ordner f&uuml;r eine Bibliothek hinzuf&uuml;gen. Nach der Auswahl eines Ordners kann weder der Ordner noch seine Unterordner f&uuml;r eine andere Bibliothek ausgew&auml;hlt werden.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/3.png" border="1"/>

<li>Speichern Sie Videodateien in Video-Ordner, um Video in die entsprechenden Bibliotheken einzuordnen.</li>
<li>Sie k&ouml;nnen jetzt Ihre gew&uuml;nschten Videos in den Bibliotheken durchsuchen und ansehen!</li>
</ol>

<h3 class="list_head">3. Videos in benutzerdefinierten Bibliotheken speichern und kategorisieren</h3>
<p>Zus&auml;tzlich zu den drei Standardbibliotheken, auf die jeder standardm&auml;&szlig;ig zugreifen kann, k&ouml;nnen Sie als DSM <B>admin</B> oder Benutzer der Gruppe <b>administrators</b> auch benutzerdefinierte Bibliotheken erstellen und Zugriffsrechte zuweisen.</p>

<h4>3.1 Benutzereigene Bibliotheken erstellen</h4>
<ol>
<li>Wechseln Sie zu <b>Einstellungen</b> &gt; <b>Bibliothek</b> und klicken Sie auf <b>Erstellen</b> &gt; <b>Bibliothek erstellen</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/4.png" border="1"/>

<li>Geben Sie einen Namen f&uuml;r die neue Bibliothek an, w&auml;hlen Sie, welchen Typ von Videos Sie im Ordner ablegen m&ouml;chten und w&auml;hlen Sie anschlie&szlig;end <b>&Ouml;ffentlich</b>, wenn jeder auf die Bibliothek zugreifen soll oder <b>Privat</b>, um den Zugang auf Benutzer mit Berechtigungen einzuschr&auml;nken. Bitte beachten Sie, dass die in diesem Ordner abgelegten Videos dem hier ausgew&auml;hlten Typ entsprechen m&uuml;ssen, um die Genauigkeit der aus dem Internet gesammelten Informationen zu gew&auml;hrleisten.</li>
<li>Wenn Sie <b>Privat</b> ausw&auml;hlen, klicken Sie auf <b>Berechtigungen zuweisen</b> und markieren Sie die K&auml;stchen, um den Benutzern den Zugriff zu gew&auml;hren.</li>
</ol>

<h4>3.2 Video-Ordner f&uuml;r benutzerdefinierte Bibliotheken hinzuf&uuml;gen</h4>
<ol>
<li>Gehen Sie zu <b>Einstellungen</b> &gt; <b>Bibliothek</b>.</li>
<li>Klicken Sie auf <b>Erstellen</b> &gt; <b>Ordner hinzuf&uuml;gen</b>, um einen Ordner auf Ihrem Synology NAS auszuw&auml;hlen und die entsprechende Bibliothek zuzuweisen. Sie k&ouml;nnen bis zu 100 Video-Ordner zu einer Bibliothek hinzuf&uuml;gen. Nach der Auswahl eines Ordners kann weder der Ordner noch seine Unterordner f&uuml;r eine andere Bibliothek ausgew&auml;hlt werden.</li>
<li>Speichern Sie Videodateien in Video-Ordner, um Video in die entsprechenden Bibliotheken einzuordnen.</li>
<li>Sie k&ouml;nnen jetzt Ihre gew&uuml;nschten Videos in den Bibliotheken durchsuchen und ansehen!</li>
</ol>

<h3 class="list_head">4. Videos wiedergeben</h3>
<p>Nach der Kategorisierung Ihrer Videodateien in unterschiedliche Bibliotheken k&ouml;nnen Sie den nachstehenden Schritten folgen, um Ihre Video in Video Station wiederzugeben. Es wird dringend empfohlen, dass Sie den <a href="http://www.videolan.org/vlc/" target="_blank">VLC Media Player (Windows, Linux)</a> auf Ihrem Computer installieren. Zus&auml;tzlich zur Wiedergabe von Videos auf Ihrem lokalen Computer k&ouml;nnen Sie auch Videos an DLNA/UPnP-kompatible DMAs oder AirPlay-kompatible Ger&auml;te f&uuml;r die Videowiedergabe streamen.</p>

<h4>Videos mit eingebettetem Video Player wiedergeben</h4>
<ol>
<li>W&auml;hlen Sie einen Videoclip aus, den Sie wiedergeben m&ouml;chten, und klicken Sie anschlie&szlig;end auf das Wiedergabesymbol auf dem Videobild oder klicken Sie auf <b>Aktion</b> &gt; <b>Wiedergabe</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/5.png" border="1"/>

<li>Das Video sollte sofort wiedergegeben werden. Falls nicht, stellen Sie bitte sicher, dass das Format Ihres Videos von Ihrem Webbrowser unterst&uuml;tzt wird, oder dass Sie das VLC Plugin auf Ihrem Computer installiert ist.</li>
<li>Verwenden Sie die Bildschirmtasten und die Navigationsleiste an der Unterseite des Video Players. Sie k&ouml;nnen auch die Lautst&auml;rke einstellen, die Qualit&auml;t der Videowiedergabe und die Tonspur ausw&auml;hlen, Untertitel aktivieren oder das Video auf ein anderes Ger&auml;t streamen (falls verf&uuml;gbar).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/6.png" border="1"/>

</ol>


<div class="code_div">
<b>Hinweis:</b>
<p>Detaillierte Informationen &uuml;ber das VLC Plugin und unterst&uuml;tzte Ger&auml;te finden Sie in der <b>DSM Hilfe</b> &gt; <b>Video Station</b> &gt; <b>Videowiedergabe</b>.</p>
</div>
 
<h3 class="list_head">5. Videos mit der &Ouml;ffentlichkeit teilen</h3> 
<p>Mit der Funktion f&uuml;r das &ouml;ffentliche Teilen k&ouml;nnen Sie Ihre Videos mit der Video Station ganz einfach mit anderen Personen teilen. S&auml;mtliche geteilte Videos sind &uuml;ber den Link f&uuml;r jeden &ouml;ffentlich zug&auml;nglich und k&ouml;nnen &uuml;ber die Seite <b>Sammlung</b> verwaltet werden.</p>

<h4>Videos mit anderen teilen</h4>
<ol>
<li>Wechseln Sie zu einer Videobibliothek und klicken Sie oben rechts auf <b>Alle</b>, um s&auml;mtliche Videos in dieser Bibliothek anzuzeigen.</li>
<li>Klicken Sie auf das <b>Auswahlmodus</b> Symbol oder halten Sie <b>Strg</b> oder die <b>Umsch</b>, um mehrere Videos auszuw&auml;hlen. Klicken Sie anschlie&szlig;end auf <b>Aktion</b> &gt; <b>Mit der &Ouml;ffentlichkeit teilen</b>.</li>
<ul>
<li>Wenn Sie nur ein Video zum Teilen ausgew&auml;hlt haben, wird das Video zu einer gemeinsamen Sammlung mit dem Namen <b>Geteilte Videos</b> hinzugef&uuml;gt. Dort k&ouml;nnen Sie s&auml;mtliche Videos verwalten, die Sie geteilt haben.</li>
<li>Wenn Sie mehrere Videos teilen, werden die Videos in einer neuen geteilten Sammlung angeordnet.</li>
</ul>
<li>Alternativ k&ouml;nnen Sie auch auf <b>Aktion</b> &gt; <b>Sammlung</b> klicken, um die ausgew&auml;hlten Videos zu einer bestehenden geteilten Sammlung (falls vorhanden) hinzuzuf&uuml;gen.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/7.png" border="1"/>

<li>Geben Sie ggf. eine G&uuml;ltigkeitsdauer ein.</li>
<li>Sie k&ouml;nnen den Link einfach in E-Mails, Sofortnachrichten und Webseiten kopieren und einf&uuml;gen, um die Videos mit jedem zu teilen.</li>
</ol> 


<h3 class="list_head">6. Videos auf Mobilger&auml;ten organisieren und ansehen</h3>
<p>Um die Video Station &uuml;ber Mobilger&auml;te zu erreichen, k&ouml;nnen Sie DS video mit iOS/Android Ger&auml;ten oder Windows Phone &uuml;ber den unten stehenden QR Code herunterladen, um Videos auf Ihrem Mobilger&auml;t wiederzugeben und Ihre Sammlungen zu organisieren, oder Videos an Ihre DMAs oder AirPlay Ger&auml;te sowohl zu Hause als auch unterwegs zu streamen.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/>

</div>
<div class="page-info">
  <ul>
    <li>Vorheriges in diesem Thema: <a href="home_theater_media_server.html">Auf dem Synology NAS gespeicherte Multimediainhalte auf großen Bildschirmen genießen</a> </li>
    <li>Nächstes in diesem Thema: <a href="home_theater_music.html">Auf dem Synology NAS gespeicherte Musik mit Audio Station genießen</a> </li>
  </ul>
</div>
</body>
</html>