<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Alben erstellen, um Fotos mit Photo Station zu verwalten und zu durchsuchen</title>
</head>

<body class="tutorial-content-box" >

<h1>Alben erstellen, um Fotos mit Photo Station zu verwalten und zu durchsuchen</h1>
<div class="tutorials_content">

<img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/>

<h2>&Uuml;bersicht</h2>
<p>Photo Station ist eine webbasierte Anwendung, mit der Sie auf dem Synology NAS gespeicherte Fotos &uuml;ber das Internet organisieren und anzeigen k&ouml;nnen. Mit der modernen und benutzerfreundlichen Oberfl&auml;che erm&ouml;glicht Ihnen Photo Station den Upload, das Durchsuchen, die Verwaltung und das Teilen Ihrer Fotoalben mit nur einigen wenigen Schritten.</p>

<h3 class="list_head">1. Photo Station installieren</h3>
<p>Um Photo Station zu installieren, wechseln Sie bitte zu <b>Paketzentrum</b>, suchen Sie nach <b>Photo Station</b> und klicken Sie anschlie&szlig;end auf <b>Installieren</b>.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/>

<h3 class="list_head">2. Fotos hochladen</h3>
<p>Bevor Sie Fotos in Photo Station durchsuchen und verwalten k&ouml;nnen, m&uuml;ssen Sie Alben erstellen und Fotos mit einer der folgenden Methoden hochladen.</p>

<h4>2.1 Fotos &uuml;ber Photo Station Uploader hochladen (f&uuml;r Windows und Mac)</h4>
<p>Wir empfehlen die Nutzung von Photo Station Uploader, da Miniaturbilder f&uuml;r jedes Foto w&auml;hrend des Hochladens erstellt werden. Das Hochladen von Dateien &uuml;ber den Photo Station Uploader nutzt die Rechenf&auml;higkeiten Ihres Computers, um die Umwandlung zu beschleunigen.</p>
<ol>
<li>Laden Sie <b>Photo Station Uploader</b> (verf&uuml;gbar unter im <a href="https://www.synology.com/support/download/DS713+" target="_blank">Synology Download-Zentrum</a>) herunter und installieren Sie das Programm.</li>
<li>Klicken Sie auf Ihrem Computer auf ein Foto, das Sie hochladen m&ouml;chten und w&auml;hlen Sie <b>Zu Photo Station hochladen</b> &gt; <b>Neues Profil erstellen</b>, um den Assistenten zu &ouml;ffnen.</li>
<li>Geben Sie einen Namen Ihrer Wahl ein, sowie den Servernamen/die IP-Adresse des Ziel Synology NAS f&uuml;r das neue Profil.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/>

<div class="code_div">
<b>Hinweis:</b>
<p>Die angegebenen Server-Informationen und Benutzer-Zugangsdaten werden f&uuml;r dieses Profil gespeichert. Sie k&ouml;nnen f&uuml;r unterschiedliche Regeln oder Ziele verschiedene Profile anlegen. Anstatt bei der n&auml;chsten Nutzung von Photo Station Uploader die Server-Informationen erneut eingeben zu m&uuml;ssen, k&ouml;nnen Sie ein bestehendes Profil ausw&auml;hlen und die zuvor eingestellten Konfigurationen f&uuml;r das Hochladen von Fotos zum selben Ziel verwenden.</p>
</div>

<li>W&auml;hlen Sie aus, ob Sie die Dateien zu Photo Station oder Personal Photo Station hochladen m&ouml;chten.</li>

<li>Geben Sie die Benutzerdaten f&uuml;r das Ziel Synology NAS ein.</li>

<li>Klicken Sie auf <b>Durchsuchen</b>, um einen Zielordner auszuw&auml;hlen oder erstellen Sie einen Unterordner unter dem gemeinsamen Ordner <b>photo</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/>

<li>Nach dem Hochladen k&ouml;nnen Sie Photo Station auf dem Synology NAS ausf&uuml;hren und die hochgeladenen Dateien in verschiedenen Modi ansehen oder andere Informationen wie z.B. Albumeigenschaften und Zugriffsberechtigungen bearbeiten.</li>
</ol>


<h4>2.2 Alben erstellen und Fotos via Photo Station hochladen</h4>
<p>F&uuml;hren Sie <b>Photo Station</b> aus und klicken Sie auf <b>Hinzuf&uuml;gen</b>, um ein neues Album zu erstellen oder Dateien von Ihrem Computer oder Synology NAS in bestehende Alben hochzuladen.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/>

<div class="code_div">
<b>Hinweis:</b>
<p>Wenn Sie Fotos lieber &uuml;ber die Photo Station Oberfl&auml;che hochladen m&ouml;chten, empfehlen wir dringend, den QuickConnect Dienst zu aktivieren. Egal ob Sie zu Hause oder unterwegs sind, mit QuickConnect k&ouml;nnen Sie von &uuml;berall &uuml;ber das Internet auf Ihre Synology NAS und Photo Station mit einer benutzereigenen ID zugreifen, ohne sich Gedanken &uuml;ber komplizierte Netzwerkkonfigurationen wie z.B. Port-Weiterleitungsregeln machen zu m&uuml;ssen. F&uuml;r weitere Informationen &uuml;ber QuickConnect lesen Sie bitte <a class="launch-app" href="cloud_set_up_quickconnect.html">diese Anleitung</a>.</p>
</div>

<h3 class="list_head">3. Fotos teilen</h3>
<p>Mit der Teilen-Funktion k&ouml;nnen Sie ganz einfach in Photo Station gespeicherte Fotos mit Freunden teilen oder die Fotos in beliebte soziale Netzwerke wie z.B. Facebook, Picasa und Flickr hochladen.</p>

<h4>3.1 Fotos mit der &Ouml;ffentlichkeit teilen</h4>
<ol>
<li>Rufen Sie ein Album auf und w&auml;hlen Sie die Fotos aus, die Sie teilen m&ouml;chten.</li>
<li>Klicken Sie auf <b>Teilen</b> &gt; <b>Mit der &Ouml;ffentlichkeit teilen</b>, um den Link zu erhalten.</li>
<ul>
<li>Wenn Sie nur ein Foto zum Teilen ausgew&auml;hlt haben, wird das Foto zu einem gemeinsamen Album mit dem Namen <b>Geteilte Fotos</b> hinzugef&uuml;gt. Dort k&ouml;nnen Sie s&auml;mtliche Fotos verwalten, die Sie geteilt haben.</li>
<li>Wenn Sie mehrere Fotos teilen, werden die Fotos in einem neuen geteilten Album angeordnet.</li>
</ul>
<li>Alternativ k&ouml;nnen Sie auch auf <b>Teilen</b> &gt; <b>Zu einem geteilten Album hinzuf&uuml;gen</b> klicken, um die ausgew&auml;hlten Fotos zu einem bestehenden geteilten Album (falls vorhanden) hinzuzuf&uuml;gen.</li>
<img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/>
<li>Geben Sie einen Namen f&uuml;r das neu geteilte Album ein und geben Sie die ggf. den G&uuml;ltigkeitszeitraum an.</li>
<li>Sie k&ouml;nnen den Link in E-Mails, Sofortnachrichten und Webseiten kopieren und einf&uuml;gen, um die ausgew&auml;hlten Fotos mit jedem zu teilen.</li>
</ol>

<div class="code_div">
<b>Hinweis:</b>
<ul>
<li>S&auml;mtliche freigegeben Fotos sind von jedem mit dem Link &ouml;ffentlich zug&auml;nglich.</li>
<li>Sie k&ouml;nnen unter <b>Einstellungen</b> &gt; <b>Teilen</b> angeben, welche Benutzer die Berechtigung besitzen, Photo Station Elemente mit der &Ouml;ffentlichkeit zu teilen.</li>
</ul>
</div>

<h4>3.2 Fotos mit sozialen Netzwerken teilen</h4>
<ol>
<li>W&auml;hlen Sie die Fotos, die Sie hochladen m&ouml;chten, und w&auml;hlen Sie <b>Freigabe</b> &gt; <b>Zu [sozialen Netzwerkseiten] hochladen</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/>

<li>Klicken Sie im dann angezeigten Fenster auf <b>Mit [sozialen Netzwerkseiten] verbinden</b> und f&uuml;hren Sie die Autorisierung mit Ihrem sozialen Netzwerkkonto durch. Sie k&ouml;nnen die Fotos entweder in ein neues oder in ein bestehendes Album hochladen.</li>
</ol>

<h3 class="list_head">4. Fotos auf Mobilger&auml;ten organisieren und durchsehen</h3>
<p>Sie k&ouml;nnen <b>DS photo+</b> auf Ihren Mobilger&auml;ten mit den unten stehenden QR Codes installieren, um sich &uuml;ber Mobilger&auml;te mit Photo Station zu verbinden oder Fotos hochzuladen.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/>


</div>

</body>
</html>