<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Sicherung Ihres NAS</title>
</head>

<body class="tutorial-content-box" >

<h1>Sicherung Ihres Synology NAS</h1>
<div class="tutorials_content">
<p><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/Intro.jpg" /></p>
<h2>Übersicht</h2>
<p>DSM verf&uuml;gt &uuml;ber eine Funktion mit dem Namen Security Advisor, der Ihnen dabei hilft, das Synology NAS sicher zu halten. Security Advisor scannt die Gesamtkonfiguration des Synology NAS und bietet genaue Berichte &uuml;ber den Sicherheitsstatus. Zus&auml;tzlich wird Ihnen Security Advisor zeigen, wie Sie mit erkannten Sicherheitsrisiken umgehen sollten. &Ouml;ffnen Sie Security Advisor, um die folgenden Dinge zu lernen:</p>
<ul>
  <li>Einen Sicherheits-Scan durchf&uuml;hren</li>
  <li>Berichte &uuml;ber Sicherheitsregeln anzeigen</li>
  <li>Sicherheitsrisiken verwalten</li>
</ul>

<h3 class="list_head">1. Einen Sicherheits-Scan durchf&uuml;hren </h3>
<ol>
	<li>Wenn Sie Security Advisor das erste Mal &ouml;ffnen, werden Sie danach gefragt, f&uuml;r was Sie das Synology NAS nutzen. W&auml;hlen Sie <strong>Privat</strong> oder <strong>Gesch&auml;ftlich</strong> und klicken Sie auf <strong>OK</strong>. Sie k&ouml;nnen diese Einstellung sp&auml;ter jederzeit auf der Seite <strong>Erweitert</strong> &auml;ndern.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/01.png" />
	<li>Security Advisor wird mit dem Scan Ihrer Synology NAS Konfiguration beginnen. Sie k&ouml;nnen den Gesamt-Sicherheitsstatus, den Scan-Verlauf und eine Zusammenfassung der Ergebnisse auf der Seite <strong>&Uuml;bersicht</strong> anzeigen.</li><img alt="" style="display:block;"   width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/02.png" />
	<li>Nach dem Ende des Scans werden Ergebnisse f&uuml;r jede Kategorie von Sicherheitsregeln angezeigt. Security Advisor wird einen Gesamtstatus f&uuml;r jede Kategorie und eine Zusammenfassung von gefundenen Sicherheitsrisiken anzeigen. </li><img alt="" style="display:block;" width="680" height="391"  src="../../images/SecureNAS/1x/Secure_NAS/03.png" />
</ol>
<h3 class="list_head">2. Berichte &uuml;ber Sicherheitsregeln anzeigen</h3>
<ol>
<li>Klicken Sie auf der Seite <strong>&Uuml;bersicht</strong> auf <strong>Berichte anzeigen</strong>. <strong></strong>Sie k&ouml;nnen detaillierte Informationen &uuml;ber den abgeschlossenen Scan auf einer Bericht-nach-Bericht Basis anzeigen.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/04.png" />
<li>Klicken Sie doppelt auf eine Sicherheitsregel, um einen detaillierten Bericht zu &ouml;ffnen. Jeder Bericht k&ouml;nnte Informationen &uuml;ber die <strong>Schwere</strong>, <strong>Beschreibung</strong>, <strong>Details</strong> und <strong>Empfohlene Aktion</strong> f&uuml;r jede Sicherheitsregel enthalten.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/05.png" />
</ol>

<h3 class="list_head">3. Sicherheitsrisiken verwalten</h3>
<p>Werfen wir einen Blick auf ein Beispiel einer fehlgeschlagenen Sicherheitsregel und wie wir damit umgehen sollten.</p>
<ol>
<li>Security Advisor wird potentielle Sicherheitsrisiken f&uuml;r jede fehlgeschlagene Sicherheitsregel erkennen.  Hier hat Security Advisor entdeckt, dass &quot;Automatische Blockierung deaktiviert ist&quot;.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/06.png" />
<li>&Ouml;ffnen Sie eine fehlgeschlagene Sicherheitsregel, um detaillierte Informationen anzuzeigen. Unter <strong>Empfohlene Aktion</strong> zeigt Security Advisor Hinweise zum Umgang mit diesem Sicherheitsrisiko.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/07.png" />
<li>Klicken Sie auf <strong>&Ouml;ffnen</strong>, um direkt zur entsprechenden Einstellungsseite zu wechseln und befolgen Sie den Hinweis unter <strong>Empfohlene Aktion</strong>.</li>
<li>Auf der Seite <strong>Ergebnisse</strong> k&ouml;nnen Sie die fehlgeschlagene Sicherheitsregel erneut scannen, indem Sie die Regel ausw&auml;hlen und auf <strong>Scan</strong> klicken.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/08.png" />
<li>F&uuml;r diese Sicherheitsregel wurden keine Sicherheitsrisiken entdeckt. Security Advisor wird Ihnen weiterhin dabei helfen, potentielle Sicherheitsrisiken zu erkennen und Aktionen f&uuml;r den Umgang mit diesen Risiken empfehlen. Halten Sie Ihr Synology NAS durch regelm&auml;&szlig;ige Scans in Security Advisor sicher!</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/09.png" />
</ol>
</div>

</body>

</html>
