<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<title>High Availability kezelő - Synology DSM Súgó</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology High Availability uses two servers to form a high-availability cluster in which one server assumes the role of active server and another server acts as a standby passive server.">


 </head>
 <body>
  <h1>High Availability kezelő</h1>

  <p>A High Availability kifejezés egy olyan szerverelrendezési megoldásra utal, melynek célja az, hogy csökkentse a szolgáltatásoknak a kiszolgáló meghibásodása által okozott megszakításait. A Synology High Availability két kiszolgáló felhasználásával egy olyan "high-availability klasztert" alakít ki, melyben az egyik kiszolgáló játssza az "aktív kiszolgáló" szerepét, egy másik kiszolgáló pedig készenléti "passzív kiszolgálóként" vesz részt. Egy high-availability klaszter telepítéséhez és létrehozásához két kompatibilis Synology kiszolgálóra van szükség.</p>
  <p>A high-availability klaszter a k&ouml;vetkező elemekből &eacute;s elvekből &eacute;p&iacute;tkezik:</p>

  <ul>
   <li><b>Elv: </b>A Synology High Availability telep&iacute;t&eacute;sekor k&eacute;t Synology kiszolg&aacute;l&oacute;ra van sz&uuml;ks&eacute;g egy high-availability klaszter l&eacute;trehoz&aacute;s&aacute;hoz. Az egyik kiszolg&aacute;l&oacute; &quot;akt&iacute;v kiszolg&aacute;l&oacute;k&eacute;nt&quot;, a m&aacute;sik pedig &quot;passz&iacute;v kiszolg&aacute;l&oacute;k&eacute;nt&quot; műk&ouml;dik. A high-availability klaszter l&eacute;trehoz&aacute;s&aacute;t k&ouml;vetően folyamatosan folyik az adatok m&aacute;sol&aacute;sa az akt&iacute;v kiszolg&aacute;l&oacute;r&oacute;l a passz&iacute;v kiszolg&aacute;l&oacute;ra. Az akt&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; &ouml;sszes adat l&eacute;tezni fog m&aacute;solatban a passz&iacute;v kiszolg&aacute;l&oacute;n. Az akt&iacute;v kiszolg&aacute;l&oacute; meghib&aacute;sod&aacute;sa eset&eacute;n a passz&iacute;v kiszolg&aacute;l&oacute; k&eacute;szen &aacute;ll, hogy az akt&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; adatok hi&aacute;nytalan t&uuml;k&ouml;rm&aacute;solat&aacute;val &aacute;tvegye az &ouml;sszes szolg&aacute;ltat&aacute;st. A high-availability klaszter &iacute;gy norm&aacute;l m&oacute;don folytatja a szolg&aacute;ltat&aacute;sok ny&uacute;jt&aacute;s&aacute;t, &eacute;s minimaliz&aacute;lja a kiszolg&aacute;l&oacute; le&aacute;ll&aacute;si idej&eacute;t. Az &aacute;tkapcsol&aacute;sra vonatkoz&oacute; tov&aacute;bbi r&eacute;szleteket l&aacute;sd az <a href="switchover_fail.html">&Aacute;tkapcsol&aacute;s</a> c. r&eacute;szben</li>
   <li><b>Akt&iacute;v kiszolg&aacute;l&oacute;:</b> Az akt&iacute;v kiszolg&aacute;l&oacute; kezeli az &ouml;sszes szolg&aacute;ltat&aacute;s ny&uacute;jt&aacute;s&aacute;t. Amennyiben az akt&iacute;v kiszolg&aacute;l&oacute;n hib&aacute;k forduln&aacute;nak elő, &ouml;n vagy a rendszer kezdem&eacute;nyezheti a passz&iacute;v kiszolg&aacute;l&oacute;ra t&ouml;rt&eacute;nő &aacute;tkapcsol&aacute;st. Ebben az esetben a szolg&aacute;ltat&aacute;sok ny&uacute;jt&aacute;s&aacute;t &aacute;tveszi a passz&iacute;v kiszolg&aacute;l&oacute;, &eacute;s ettől kezdve az eddigi akt&iacute;v kiszolg&aacute;l&oacute; lesz a passz&iacute;v kiszolg&aacute;l&oacute;.</li>
   <li><b>Passz&iacute;v kiszolg&aacute;l&oacute;:</b> Norm&aacute;l k&ouml;r&uuml;lm&eacute;nyek k&ouml;z&ouml;tt a passz&iacute;v kiszolg&aacute;l&oacute; k&eacute;szenl&eacute;ti &uuml;zemm&oacute;dban marad. Az akt&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; adatok folyamatosan m&aacute;sol&oacute;dnak &aacute;t a passz&iacute;v kiszolg&aacute;l&oacute;ra. Amennyiben az akt&iacute;v kiszolg&aacute;l&oacute; nem k&eacute;pes a szolg&aacute;ltat&aacute;sok ny&uacute;jt&aacute;s&aacute;ra, &ouml;n vagy a rendszer kezdem&eacute;nyezheti a passz&iacute;v kiszolg&aacute;l&oacute;ra t&ouml;rt&eacute;nő &aacute;tkapcsol&aacute;st. </li>
   <li><b>Sz&iacute;vver&eacute;s kapcsolat:</b> A high-availability klaszter akt&iacute;v &eacute;s passz&iacute;v kiszolg&aacute;l&oacute;j&aacute;t egy &quot;Sz&iacute;vver&eacute;s kapcsolatnak&quot; nevezett k&uuml;l&ouml;n, saj&aacute;t h&aacute;l&oacute;zati kapcsolat k&ouml;ti &ouml;ssze. A high-availability klaszter l&eacute;trehoz&aacute;s&aacute;t k&ouml;vetően a sz&iacute;vver&eacute;s kapcsolat teszi lehetőv&eacute; adatok szinkroniz&aacute;l&aacute;s&aacute;t &eacute;s replik&aacute;ci&oacute;j&aacute;t az akt&iacute;v &eacute;s passz&iacute;v kiszolg&aacute;l&oacute; k&ouml;z&ouml;tt. Ha megadott időtartamra elveszik a kiszolg&aacute;l&oacute;k k&ouml;zti kapcsolat, a rendszer az &aacute;tkapcsol&aacute;s sz&uuml;ks&eacute;gess&eacute;ge mellett fog d&ouml;nteni.</li>
   <li><b>High-availability klaszter fő t&aacute;rol&oacute;k&ouml;tet:</b> Az akt&iacute;v kiszolg&aacute;l&oacute; t&aacute;rol&oacute;k&ouml;tete lesz a high-availability klaszter fő t&aacute;rol&oacute;k&ouml;tete. Az adatok a sz&iacute;vver&eacute;s kapcsolaton kereszt&uuml;l ker&uuml;lnek &aacute;tm&aacute;sol&aacute;sra a passz&iacute;v kiszolg&aacute;l&oacute; t&aacute;rol&oacute;k&ouml;tet&eacute;re.</li>
   <li><b>High-availability klaszter tartal&eacute;k t&aacute;rol&oacute;k&ouml;tet: </b>A passz&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; t&aacute;rol&oacute;k&ouml;tet lesz a high-availability klaszter tartal&eacute;k t&aacute;rol&oacute;k&ouml;tete. Az adatok a sz&iacute;vver&eacute;s kapcsolaton kereszt&uuml;l folyamatosan ker&uuml;lnek &aacute;tm&aacute;sol&aacute;sra az akt&iacute;v kiszolg&aacute;l&oacute; t&aacute;rol&oacute;k&ouml;tet&eacute;ről a passz&iacute;v t&aacute;rol&oacute;k&ouml;tetre. &Aacute;tkapcsol&aacute;s eset&eacute;n ez biztos&iacute;tja a f&aacute;jltartalom egys&eacute;gess&eacute;g&eacute;t.</li>
   <li><b>High-availability klaszter kiszolg&aacute;l&oacute;neve:</b> A high-availability klaszterben tal&aacute;lhat&oacute; kiszolg&aacute;l&oacute;k egy kiszolg&aacute;l&oacute;n&eacute;ven osztoznak. A h&aacute;l&oacute;zatba ennek a kiszolg&aacute;l&oacute;n&eacute;vnek a haszn&aacute;lat&aacute;val csatlakozhat be, a szolg&aacute;ltat&aacute;sokat pedig az akt&iacute;v kiszolg&aacute;l&oacute; fogja ny&uacute;jtani. </li>
   <li><b>High-availability klaszter IP: </b>Mivel a high-availability klaszterben tal&aacute;lhat&oacute; akt&iacute;v &eacute;s passz&iacute;v kiszolg&aacute;l&oacute; mindegyike saj&aacute;t IP-c&iacute;mmel rendelkezik, &aacute;tkapcsol&aacute;s v&eacute;grehajt&aacute;sakor egy m&aacute;sik IP-c&iacute;mre t&ouml;rt&eacute;nő v&aacute;lt&aacute;s sz&uuml;ks&eacute;gess&eacute;g&eacute;t elker&uuml;lendő, a high-availability klaszter a hozz&aacute;f&eacute;r&eacute;shez k&ouml;z&ouml;s IP-c&iacute;meket gener&aacute;l. Ha b&aacute;rmilyen DSM-szolg&aacute;ltat&aacute;shoz szeretne hozz&aacute;f&eacute;rni, ezeken az IP-c&iacute;meken kereszt&uuml;l csatlakozhat, tekintet n&eacute;lk&uuml;l arra, hogy melyik Synology kiszolg&aacute;l&oacute; műk&ouml;dik akt&iacute;v kiszolg&aacute;l&oacute;k&eacute;nt. </li>
  </ul>



 </body>
</html>
