<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>H&aacute;l&oacute;zati be&aacute;ll&iacute;t&aacute;sok</h2>
	<p>Ez az oldal h&aacute;rom olyan f&uuml;let tartalmaz, amelyek a high-availability klaszter, az akt&iacute;v tag-kiszolg&aacute;l&oacute;, &eacute;s a passz&iacute;v tag-kiszolg&aacute;l&oacute; h&aacute;l&oacute;zati be&aacute;ll&iacute;t&aacute;sait jelen&iacute;tik meg.</p>
  
	<h3>HA klaszter f&uuml;l</h3>
  	<p>Egy high-availability klaszter l&eacute;trehoz&aacute;sakor a rendszer k&ouml;z&ouml;s IP-c&iacute;met gener&aacute;l a high-availability klaszter IP-je sz&aacute;m&aacute;ra a bej&ouml;vő kapcsolatok fogad&aacute;s&aacute;hoz. Sz&uuml;ks&eacute;g eset&eacute;n tov&aacute;bbi high-availability klaszter IP-c&iacute;mek hozhat&oacute;k l&eacute;tre. Ezen a f&uuml;l&ouml;n az akt&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; aktiv&aacute;lt h&aacute;l&oacute;zati interf&eacute;szek IP-c&iacute;mei ker&uuml;lnek megjelen&iacute;t&eacute;sre (a sz&iacute;vver&eacute;s kapcsolat &aacute;ltal haszn&aacute;lt h&aacute;l&oacute;zati interf&eacute;sz nem ker&uuml;l megjelen&iacute;t&eacute;sre ezen az oldalon, mivel az eml&iacute;tett interf&eacute;sz a k&eacute;t kiszolg&aacute;l&oacute; k&ouml;zti adatreplik&aacute;ci&oacute;hoz ker&uuml;l felhaszn&aacute;l&aacute;sra). Ez a f&uuml;l az al&aacute;bbi inform&aacute;ci&oacute;kat mutatja:</p>
    	<ul>
    	  <li><b>H&aacute;l&oacute;zati interf&eacute;sz:</b> Az akt&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; aktiv&aacute;lt h&aacute;l&oacute;zati interf&eacute;sz(ek).</li>
          <li><b>Kapcsolat:</b> Megjelen&iacute;ti, hogy ez az interf&eacute;sz csatlakoztatva van-e, vagy sem.</li>
          <li><b>IP-c&iacute;m:</b> Egy high-availability klaszter l&eacute;trehoz&aacute;sakor a rendszer k&ouml;z&ouml;s IP-c&iacute;met gener&aacute;l a high-availability klaszter IP-je sz&aacute;m&aacute;ra a bej&ouml;vő kapcsolatok fogad&aacute;s&aacute;hoz. Ennek az IP-c&iacute;mnek a haszn&aacute;lat&aacute;val csatlakozhat a high-availability klaszterhez, ha be szeretne jelentkezni a DiskStation Managerbe (DSM), tekintet n&eacute;lk&uuml;l arra, hogy melyik Synology kiszolg&aacute;l&oacute; az akt&iacute;v kiszolg&aacute;l&oacute;. Ez megakad&aacute;lyozza, hogy m&aacute;sik IP-c&iacute;mekhez kelljen csatlakozni, miut&aacute;n &aacute;tkapcsol&aacute;s t&ouml;rt&eacute;nik.</li>
            <li><b>Alh&aacute;l&oacute;zati maszk: </b>Az adott high-availability klaszter IP-c&iacute;mhez rendelt alh&aacute;l&oacute;zati maszk.</li>
		</ul>
<h4>IP-c&iacute;m &eacute;s Alh&aacute;l&oacute;zati maszk szerkeszt&eacute;se:</h4>
	<ol>
		<li>V&aacute;lassza ki a szerkeszteni k&iacute;v&aacute;nt IP-c&iacute;met vagy alh&aacute;l&oacute;zati maszkot, majd a szerkeszt&eacute;s megkezd&eacute;s&eacute;hez kattintson a <b>Szerkeszt&eacute;s</b> gombra, vagy kattintson dupl&aacute;n a mezőre.</li>
        
   <li>Az egyes interf&eacute;szek enged&eacute;lyez&eacute;s&eacute;hez vagy letilt&aacute;s&aacute;hoz jel&ouml;lje be az <b>Enged&eacute;lyez</b> jel&ouml;lőn&eacute;gyzeteket. Egyn&eacute;l t&ouml;bb klaszter h&aacute;l&oacute;zati interf&eacute;sz is enged&eacute;lyezhető, de a klaszter l&eacute;trehoz&aacute;sa k&ouml;zben konfigur&aacute;lt eredeti h&aacute;l&oacute;zati interf&eacute;sz nem tilthat&oacute; le.</li>
        
    </ol>
<h4>A high-availability klaszter kiszolg&aacute;l&oacute;nev&eacute;nek megv&aacute;ltoztat&aacute;sa:</h4>
 	<ul>
    	<li>A high-availability klaszter nev&eacute;nek megtekint&eacute;s&eacute;hez &eacute;s a be&aacute;ll&iacute;t&aacute;sainak megv&aacute;ltoztat&aacute;s&aacute;hoz kattintson a <b>H&aacute;l&oacute;zati be&aacute;ll&iacute;t&aacute;sok megv&aacute;ltoztat&aacute;sa</b> lehetős&eacute;gre.</li>
   		<li>A jelenlegi high-availability klaszter nev&eacute;nek &eacute;s IP-c&iacute;m be&aacute;ll&iacute;t&aacute;sainak elment&eacute;s&eacute;hez kattintson az <b>Alkalmaz</b> lehetős&eacute;gre.</li>
   		<li>A jelenlegi v&aacute;ltoztat&aacute;sok elvet&eacute;s&eacute;hez kattintson a <b>M&eacute;gse</b> lehetős&eacute;gre. </li>
  </ul>

<h3>Akt&iacute;v &eacute;s passz&iacute;v kiszolg&aacute;l&oacute; f&uuml;lek (kiszolg&aacute;l&oacute;n&eacute;vk&eacute;nt megjelen&iacute;tve)</h3>
<p>Ezek a f&uuml;lek az akt&iacute;v vagy passz&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; h&aacute;l&oacute;zati interf&eacute;szek &aacute;llapot&aacute;t mutatj&aacute;k. Ezek k&ouml;z&uuml;l a Sz&iacute;vver&eacute;s kapcsolat mind az akt&iacute;v, mind pedig a passz&iacute;v kiszolg&aacute;l&oacute;n lefoglal egy-egy h&aacute;l&oacute;zati interf&eacute;szt. Ezek a f&uuml;lek a k&ouml;vetkező inform&aacute;ci&oacute;kat jelen&iacute;tik meg:</p>
	<ul>
    	<li><b>H&aacute;l&oacute;zati interf&eacute;sz:</b> A kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; fizikai h&aacute;l&oacute;zati interf&eacute;sz.</li>
    	<li><b>IP-c&iacute;m:</b> Az adott h&aacute;l&oacute;zati interf&eacute;szhez rendelt IP-c&iacute;m.</li>
    	<li><b>Alh&aacute;l&oacute;zati maszk:</b> Az adott IP-c&iacute;mhez rendelt alh&aacute;l&oacute;zati maszk.</li>
    	<li><b>Le&iacute;r&aacute;s:</b> Az adott h&aacute;l&oacute;zati interf&eacute;sz inform&aacute;ci&oacute;j&aacute;t &eacute;s a hozz&aacute;rendelt IP-c&iacute;m el&eacute;rhetős&eacute;g&eacute;t jelen&iacute;ti meg. Ez a mező a k&ouml;vetkező lehets&eacute;ges &aacute;llapotokat mutatja:</li>
		<ol>
			<li><b>Hozz&aacute;f&eacute;rhető eredeti IP-c&iacute;m</b>: Az akt&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; interf&eacute;szhez rendelt eredeti IP-c&iacute;m el&eacute;rhető az adatok vagy szolg&aacute;ltat&aacute;sok sz&aacute;m&aacute;ra.</li>
			<li><b>Nem hozz&aacute;f&eacute;rhető eredeti IP-c&iacute;m</b>: A passz&iacute;v kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; interf&eacute;szhez rendelt eredeti IP-c&iacute;m nem el&eacute;rhető.</li>
			<li><b>Sz&iacute;vver&eacute;s kapcsolat IP, intranetről nem el&eacute;rhető</b>: A sz&iacute;vver&eacute;s kapcsolathoz automatikusan hozz&aacute;rendelt eredeti IP-c&iacute;m nem el&eacute;rhető az adatok vagy szolg&aacute;ltat&aacute;sok sz&aacute;m&aacute;ra.</li>
		</ol>
	</ul>
</body>
</html>