<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Szolg&aacute;ltat&aacute;s-fel&uuml;gyelet</h2>

<p>Ez az oldal lehetőv&eacute; teszi bizonyos szolg&aacute;ltat&aacute;sok fel&uuml;gyelet&eacute;t. Ha egy fel&uuml;gyelt szolg&aacute;ltat&aacute;s nem műk&ouml;dik az akt&iacute;v kiszolg&aacute;l&oacute;n, a rendszer &aacute;tadja a feladatot a k&eacute;szenl&eacute;ti, passz&iacute;v kiszolg&aacute;l&oacute;nak (amennyiben a passz&iacute;v kiszolg&aacute;l&oacute; rendesen műk&ouml;dik). Ezen az oldalon a k&ouml;vetkező szekci&oacute;k tűnnek fel:</p>

<ul>
  <li><b>Szolg&aacute;ltat&aacute;s:</b> A fel&uuml;gyelhető szolg&aacute;ltat&aacute;sokat jelen&iacute;ti meg.</li>
  <li><b>&Aacute;llapot: </b> Jelzi, hogy a szolg&aacute;ltat&aacute;sok futnak-e vagy sem.</li>
  <li><b>Feladat&aacute;tad&aacute;s szolg&aacute;ltat&aacute;si hiba eset&eacute;n: </b>Fel&uuml;gyelet&eacute;nek elind&iacute;t&aacute;s&aacute;hoz jel&ouml;lje be a szolg&aacute;ltat&aacute;s melletti jel&ouml;lőn&eacute;gyzetet. Ha a kijel&ouml;lt szolg&aacute;ltat&aacute;s nem műk&ouml;dik, a rendszer &aacute;tadja a feladatot.</li>
</ul>

<h4>Szolg&aacute;ltat&aacute;s fel&uuml;gyelete:</h4>

<ol>
<li>Keresse meg a fel&uuml;gyelni k&iacute;v&aacute;nt szolg&aacute;ltat&aacute;st. Jel&ouml;lje be a mellette l&eacute;vő jel&ouml;lőn&eacute;gyzetet.</li>
<li>Kattintson az <b>Alkalmaz</b> gombra a be&aacute;ll&iacute;t&aacute;sok ment&eacute;s&eacute;hez.</li>
</ol>

<div class="section">
<h4>T&aacute;mogatott szolg&aacute;ltat&aacute;sok</h4>
<p>A fel&uuml;gyelhető szolg&aacute;ltat&aacute;sok a k&ouml;vetkezők: Windows f&aacute;jlszolg&aacute;ltat&aacute;s, iSCSI Target, FTP, Mac f&aacute;jlszolg&aacute;ltat&aacute;s, NFS szolg&aacute;ltat&aacute;s.</p>
</div>

<div class="section">
<h4>Feladat&aacute;tv&eacute;tel sikertelen h&aacute;l&oacute;zati csatlakoz&aacute;s eset&eacute;n</h4>
<p>Ha ez a lehetős&eacute;g enged&eacute;lyezve van, a rendszer &aacute;tadja a feladatot a passz&iacute;v kiszolg&aacute;l&oacute;nak, amikor az akt&iacute;v kiszolg&aacute;l&oacute; h&aacute;l&oacute;zati csatlakoz&aacute;sa nem műk&ouml;dik vagy hib&aacute;s, &eacute;s a passz&iacute;v kiszolg&aacute;l&oacute; h&aacute;l&oacute;zati csatlakoz&aacute;sa m&eacute;g mindig rendesen műk&ouml;dik.</p>

<ul>
<li>A feladat&aacute;tad&aacute;s csak akkor v&aacute;lt&oacute;dik ki, ha a passz&iacute;v kiszolg&aacute;l&oacute; t&ouml;bb j&oacute;l műk&ouml;dő csatlakoz&aacute;ssal rendelkezik. Ha p&eacute;ld&aacute;ul az akt&iacute;v kiszolg&aacute;l&oacute; h&aacute;rom csatlakoz&aacute;ssal rendelkezik &eacute;s egy nem műk&ouml;dik, a rendszer csak akkor v&aacute;ltja ki a feladat&aacute;tad&aacute;st, ha a passz&iacute;v kiszolg&aacute;l&oacute; h&aacute;rom vagy t&ouml;bb j&oacute;l műk&ouml;dő kapcsolattal rendelkezik.</li>
<li>A Link Aggregationnel kombin&aacute;lt kapcsolatok egy kapcsolatnak sz&aacute;m&iacute;tanak. Ha p&eacute;ld&aacute;ul k&eacute;t kapcsolat van kombin&aacute;lva, &eacute;s az egyik&uuml;k nem műk&ouml;dik, de a m&aacute;sik m&eacute;g mindig műk&ouml;dik, a kapcsolat tov&aacute;bbra is j&oacute;l műk&ouml;dőnek fog sz&aacute;m&iacute;t&oacute;dni.</li>
</ul>

</div>

</body>
</html>
