<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
  <h2>Lekapcsol&aacute;s &eacute;s reset</h2>
  <p>Az al&aacute;bbi inform&aacute;ci&oacute;k &uacute;tmutat&aacute;st adnak a high-availability klaszter le&aacute;ll&iacute;t&aacute;s&aacute;nak, elt&aacute;vol&iacute;t&aacute;s&aacute;nak vagy alaphelyzetbe &aacute;ll&iacute;t&aacute;s&aacute;nak folyamat&aacute;r&oacute;l.</p>

  <h4> High-availability klaszter le&aacute;ll&iacute;t&aacute;sa a Synology High Availability haszn&aacute;lat&aacute;val:</h4>
  <p>Ha a kiszolg&aacute;l&oacute;k &uacute;j fizikai helyre t&ouml;rt&eacute;nő &aacute;tsz&aacute;ll&iacute;t&aacute;sa vagy karbantart&aacute;s v&eacute;grehajt&aacute;sa c&eacute;lj&aacute;b&oacute;l le szeretn&eacute; &aacute;ll&iacute;tani a high-availability klasztert, de a high-availability klaszter konfigur&aacute;ci&oacute;kat nem szeretn&eacute; elt&aacute;vol&iacute;tani, k&ouml;vesse ezeket az utas&iacute;t&aacute;sokat.</p>
  <ol>
   <li>Jelentkezzen be a DSM alkalmaz&aacute;sba.</li>
   <li>Nyissa meg a Synology High Availability programot.</li>
   <li>Kattintson a <b>Kezel&eacute;s</b> felirat&uacute; gombra.</li>
   <li>V&aacute;lassza ki a <b>HA klaszter le&aacute;ll&iacute;t&aacute;sa</b> lehetős&eacute;get.</li>
   <li>Megjelenik egy megerős&iacute;t&eacute;sre felsz&oacute;l&iacute;t&oacute; &uuml;zenet. A megerős&iacute;t&eacute;shez kattintson az <b>Igen</b> lehetős&eacute;gre.</li>
  </ol>

  <h4>A high-availability klaszter manu&aacute;lis le&aacute;ll&iacute;t&aacute;sa:</h4>
  <p> A high-availability klaszter az egyes kiszolg&aacute;l&oacute;kon tal&aacute;lhat&oacute; t&aacute;pfesz&uuml;lts&eacute;g gombok haszn&aacute;lat&aacute;val manu&aacute;lisan is le&aacute;ll&iacute;that&oacute;. </p>
  <ol>
   <li>Tartsa lenyomva az egyik (akt&iacute;v vagy passz&iacute;v) kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; t&aacute;pfesz&uuml;lts&eacute;g gombot, am&iacute;g s&iacute;pol&oacute; hangot nem hall.</li>
   <li>Az egyik kiszolg&aacute;l&oacute; teljes le&aacute;ll&aacute;s&aacute;t k&ouml;vetően v&aacute;rjon legal&aacute;bb 30 m&aacute;sodpercig (a m&eacute;g mindig online &aacute;llapotban l&eacute;vő kiszolg&aacute;l&oacute;nak időre van sz&uuml;ks&eacute;ge a be&aacute;ll&iacute;t&aacute;sok elment&eacute;s&eacute;hez).</li>
   <li>Tartsa lenyomva a m&aacute;sik kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; t&aacute;pfesz&uuml;lts&eacute;g gombot, am&iacute;g s&iacute;pol&oacute; hangot nem hall.</li>
   <li>V&aacute;rja meg a kiszolg&aacute;l&oacute; teljes le&aacute;ll&aacute;s&aacute;t.</li>
  </ol>
<div class="section">
<h4>Kiszolg&aacute;l&oacute;k bekapcsol&aacute;sa:</h4>   
<p>Ha ism&eacute;t be szeretn&eacute; kapcsolni a kiszolg&aacute;l&oacute;kat, mind az akt&iacute;v, mind pedig a passz&iacute;v kiszolg&aacute;l&oacute;t egyidejűleg (vagy egym&aacute;shoz k&eacute;pest &ouml;t percen bel&uuml;l) kell bekapcsolni. Ha csak az egyik kiszolg&aacute;l&oacute;t kapcsolja be, akkor az egy Wake-on-LAN &uuml;zenet sug&aacute;rz&aacute;s&aacute;val megpr&oacute;b&aacute;lja bekapcsolni a m&aacute;sik kiszolg&aacute;l&oacute;t.</p>
<h4>Rendellenes le&aacute;ll&iacute;t&aacute;s:</h4>
<p>Egy high-availability klaszter l&eacute;trehoz&aacute;sakor automatikusan enged&eacute;lyez&eacute;sre ker&uuml;l a Vez&eacute;rlőpulton az &aacute;ramkimarad&aacute;st k&ouml;vető &uacute;jraind&iacute;t&aacute;s lehetős&eacute;ge. Ha a kiszolg&aacute;l&oacute;k &aacute;ramkimarad&aacute;s miatt rendellenesen &aacute;llnak le, akkor az &aacute;ramkimarad&aacute;s megszűnt&eacute;t k&ouml;vetően automatikusan bekapcsol&oacute;dnak.</p>
</div>

<h4>High-availability klaszter elt&aacute;vol&iacute;t&aacute;sa:</h4>
 <p>Ha egy m&aacute;sik kiszolg&aacute;l&oacute; csatlakoztat&aacute;sa c&eacute;lj&aacute;b&oacute;l mindk&eacute;t kiszolg&aacute;l&oacute;t le szeretn&eacute; csatlakoztatni, &eacute;s el szeretn&eacute; t&aacute;vol&iacute;tani a high-availability klasztert, k&ouml;vesse ezeket az utas&iacute;t&aacute;sokat.</p>
  <ol>
   <li>Menjen az <b>&Aacute;ttekint&eacute;s</b> oldalra.</li>
   <li>Kattintson a <b>Kezel&eacute;s</b> gombra.</li> 
   <li>V&aacute;lassza ki a <b>HA klaszter elt&aacute;vol&iacute;t&aacute;sa</b> lehetős&eacute;get.</li>
  </ol>
  <p>A megerős&iacute;t&eacute;st k&ouml;vetően a rendszer elt&aacute;vol&iacute;tja a high-availability klasztert. Az &aacute;llapotmező jelzi az elt&aacute;vol&iacute;t&aacute;si folyamat előrehaladt&aacute;t. Amikor a high-availability klaszter sikeresen elt&aacute;vol&iacute;t&aacute;sra ker&uuml;lt, &aacute;tir&aacute;ny&iacute;t&aacute;sra ker&uuml;l az akt&iacute;v kiszolg&aacute;l&oacute; eredeti IP-c&iacute;m&eacute;re. Mindk&eacute;t kiszolg&aacute;l&oacute; &aacute;llapota megv&aacute;ltozik, <b>&Ouml;n&aacute;ll&oacute;</b> lesz.</li>
  
 <h4>Hib&aacute;s high-availability klaszter alaphelyzetbe &aacute;ll&iacute;t&aacute;sa:</h4>
  <p>Abban az esetben, ha tudathasad&aacute;sos hiba vagy egy&eacute;b &uuml;zemzavarok miatt k&eacute;ptelen el&eacute;rni a DSM vagy Synology High Availability szolg&aacute;ltat&aacute;sokat, akkor a kiszolg&aacute;l&oacute;kon tal&aacute;lhat&oacute; <b>Reset</b> gomb megnyom&aacute;s&aacute;val megk&iacute;s&eacute;relheti lecsatlakoz&aacute;sra k&eacute;nyszer&iacute;teni a high-availability klasztert.</p>
  <ol>
   <li>Tartsa lenyomva a <b>Reset</b> gombot (ami &aacute;ltal&aacute;ban a kiszolg&aacute;l&oacute; h&aacute;toldal&aacute;n helyezkedik el), am&iacute;g a kiszolg&aacute;l&oacute; s&iacute;pol&oacute; hangot nem hallat.
   <li>A rendszer elt&aacute;vol&iacute;tja a high-availability klasztert, &eacute;s mindk&eacute;t kiszolg&aacute;l&oacute; &aacute;llapota megv&aacute;ltozik, <b>&Ouml;n&aacute;ll&oacute;</b> lesz</li>
   <li>A <b>Reset</b> gomb megnyom&aacute;sa egyes be&aacute;ll&iacute;t&aacute;sokat is alaphelyzetbe &aacute;ll&iacute;t vissza, p&eacute;ld&aacute;ul az IP-c&iacute;met, DNS-t &eacute;s rendszer-jelsz&oacute;t, ezent&uacute;l pedig a k&ouml;vetkezőket okozza:</li>
   <ul>
    <li>Az admin jelsz&oacute; &uuml;res lesz.</li>
    <li>A guest fi&oacute;k letilt&aacute;sra ker&uuml;l.</li>
    <li>DHCP enged&eacute;lyez&eacute;sre ker&uuml;l IP, DNS, Gateway &eacute;s egy&eacute;b h&aacute;l&oacute;zati interf&eacute;szeken.</li>
    <li>JumboFrames letilt&aacute;sra ker&uuml;l, az MTU pedig 1500 lesz.</li>
    <li>A kezelőport vissza&aacute;ll&iacute;t&aacute;sra ker&uuml;l 5000/5001 &eacute;rt&eacute;kre.</li>
    <li>PPPoE vissza&aacute;ll alap&eacute;rt&eacute;kre.</li>
    <li>IP auto-blokkol&aacute;s letilt&aacute;sra ker&uuml;l (a blokkolt IP-c&iacute;m nem ker&uuml;l t&ouml;rl&eacute;sre).</li>
    <li>Link Aggregation letilt&aacute;sra ker&uuml;l.</li>
    <li>A tűzfalszab&aacute;lyok letilt&aacute;sra ker&uuml;lnek (a szab&aacute;lyok nem t&ouml;rlődnek).</li>
   </ul>
  </ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>Egy high-availability klaszter elt&aacute;vol&iacute;t&aacute;s&aacute;nak folyamata k&ouml;zben befejezetlen adat&iacute;r&aacute;si műveletek fordulhatnak elő. Az adatok teljess&eacute;g&eacute;nek biztos&iacute;t&aacute;sa &eacute;rdek&eacute;ben hajtson v&eacute;gre az akt&iacute;v kiszolg&aacute;l&oacute;ra alapul&oacute; adatreplik&aacute;ci&oacute;t, mert a passz&iacute;v kiszolg&aacute;l&oacute; h&iacute;j&aacute;n lehet egyes adatok friss&iacute;t&eacute;s&eacute;nek.</p>
</div>
 </body>
</html>
