
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Op&ccedil;&otilde;es para Gerir a File Station - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Learn how to customize File Station settings related to file management, shared links, and security.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Enviar Ficheiros como Anexos de E-mail</h2>

<p>Pode enviar ficheiros diretamente como anexos de e-mail em <strong>File Station </strong>ao clicar com o bot&atilde;o direito nos ficheiros selecionados e escolher a op&ccedil;&atilde;o <strong>Enviar como anexos de e-mail</strong>. Aparecer&aacute; ent&atilde;o uma janela de e-mail com algumas funcionalidades &uacute;teis:</p>
<ul>
<li>Para: Se tiver sincronizado contactos para a conta de e-mail, aparecer&aacute; uma lista com os contactos sincronizados associados &agrave; conta de e-mail.</li>
<li>De: Pode selecionar a conta de e-mail predefinida ou outra conta de e-mail. A lista de contactos mudar&aacute; automaticamente para a lista da conta de e-mail selecionada.</li>
<li>Anexos: Os anexos selecionados aparecem no fundo do e-mail. Pode acrescentar outros anexos atrav&eacute;s do bot&atilde;o de anexos.</li>
</ul>

<div class="section">
  <h4>Nota:</h4>
  <ul>
    <li>S&oacute; podem ser adicionados ficheiros como anexos.</li>
    <li>Pode anexar at&eacute; 10 ficheiros num &uacute;nico e-mail.</li>
    <li>O tamanho m&aacute;ximo total dos ficheiros anexados a um &uacute;nico e-mail depender&aacute; do seu fornecedor de e-mail. Caso n&atilde;o tenha a certeza, recomendamos que limite o tamanho total dos ficheiros de todos os anexos a 25MB. </li>
  </ul>
</div>
</body>
</html>
