<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Criar atalhos Os Meus Favoritos ou Ambiente de Trabalho</h2>
<p>
Com a File Station, pode adicionar pastas DiskStation aos Meus Favoritos, ou criar atalhos de ambiente de trabalho para ficheiros ou pastas DiskStation.
</p>
<h3>Adicionar Pastas aos Meus Favoritos</h3>
<p>
Para subpastas usadas frequentemente na sua DiskStation, pode adicionar os respetivos atalhos &agrave; sec&ccedil;&atilde;o <b>Os meus favoritos</b> no topo do painel esquerdo, para acesso mais r&aacute;pido.
</p>
<h4>Para adicionar uma pasta DiskStation aos Meus Favoritos:</h4>
<ol>
<li>
Selecione a pasta, e depois fa&ccedil;a qualquer dos seguintes:
</li>
<ul>
<li>
Escolha o menu <b>Ac&ccedil;&atilde;o</b> ou clique com o bot&atilde;o direito na pasta, e depois escolha <b>Criar atalho</b> &gt; <b>Os meus favoritos</b>.
</li>
<li>
Se j&aacute; tiver adicionado outra pasta aos Meus Favoritos, ver&aacute; a sec&ccedil;&atilde;o <b>Os meus favoritos</b> no canto superior esquerdo. Arraste a pasta at&eacute; essa sec&ccedil;&atilde;o para criar um atalho.
</li>
</ul>
<li>
Na janela que aparece, atribua um nome ao atalho e clique em <b>OK</b>.
</li>
</ol>

<h4>Para reordenar um atalho dos Meus Favoritos:</h4>
<p>
Arraste e largue o atalho na sec&ccedil;&atilde;o <b>Os meus favoritos</b> para reordenar.
</p>
<h4>Para mudar o nome de um atalho:</h4>
<ol>
<li>
Clique com o bot&atilde;o direito do rato no atalho e escolha <b>Renomear</b>.
</li>
<li>
Na janela que aparece, mude o nome do seu favorito e clique em <b>OK</b>.
</li>
</ol>
<h4>Para eliminar um atalho:</h4>
<p>
Clique com o bot&atilde;o direito num atalho, escolha <b>Remover dos Meus Favoritos</b>, e depois clique em <b>Sim</b>.
</p>
</li>
</ol>
<h4>Para limpar todos os favoritos que apontam a caminhos de pastas inexistentes:</h4>
<p>
Clique com o bot&atilde;o direito em <b>Os Meus Favoritos</b> no topo do painel esquerdo, e depois escolha <b>Limpar favoritos inv&aacute;lidos</b>.
</p>
<h3>Criar Atalhos no Ambiente de Trabalho para Ficheiros ou Pastas</h3>
<p>Para ficheiros ou subpastas DiskStation usados frequentemente, pode criar atalhos no ambiente de trabalho para acesso mais r&aacute;pido.</p>
<h4>Para criar um atalho no ambiente de trabalho para um ficheiro ou pasta DiskStation:</h4>
<p>
Clique com o bot&atilde;o direito no ficheiro ou pasta na &aacute;rea principal, e depois fa&ccedil;a qualquer dos seguintes:
</p>
<ul>
<li>
Se estiver a criar um atalho no ambiente de trabalho para um ficheiro, escolha <b>Criar atalho no ambiente de trabalho</b>.
</li>
<li>
Se estiver a criar um atalho no ambiente de trabalho para uma pasta, escolha <b>Criar atalho</b> &gt; <b>Ambiente de trabalho DSM</b>.
</li>
</ul>
</body>
</html>
