<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Criar Pedidos de ficheiros</h2>

<p>Pedidos de ficheiros s&atilde;o convites de carregamento de ficheiros enviados a utilizadores n&atilde;o DSM. Com liga&ccedil;&otilde;es de pedidos de ficheiros, utilizadores n&atilde;o DSM podem carregar diretamente m&uacute;ltiplos ficheiros para File Station no seu DiskStation, sem precisar de deter privil&eacute;gios correspondentes sore contas de utilizador e carregamento de ficheiros.</p>

<h4>Para criar liga&ccedil;&otilde;es de pedidos de ficheiros:</h4>
<ol>
<li>Aceda a <strong>File Station</strong> e selecione uma pasta como destino de carregamento.</li>
<li>Clique em <strong>A&ccedil;&atilde;o</strong> ou clique com o bot&atilde;o direito na pasta de destino, e selecione <strong>Criar pedido de ficheiro</strong>.</li>
<li>Na janela que surge, pode encontrar/modificar as informa&ccedil;&otilde;es que se seguem:
<ul>
<li><strong>Caminho de ficheiro</strong>: Listar o caminho do diret&oacute;rio de destino.</li>
<li><strong>Liga&ccedil;&atilde;o</strong>: Listar a liga&ccedil;&atilde;o de pedido de ficheiro a partilhar com utilizadores de destino.</li>
<li><strong>O seu nome</strong>: Introduza um nome para indicar a identidade de quem solicita. O valor predefinido &eacute; o seu nome de utilizador.</li>
<li><strong>Mensagem</strong>: Personalizar a mensagem para utilizadores de destino.</li>
<li><strong>Ativar protec&ccedil;&atilde;o por palavra-passe</strong>: Selecione esta op&ccedil;&atilde;o para que apenas utilizadores com a palavra-passe possam carregar ficheiros atrav&eacute;s da liga&ccedil;&atilde;o criada. Especifique a palavra-passe na caixa abaixo.</li>
<li><strong>Per&iacute;odo de validade</strong>: Clique neste bot&atilde;o para personalizar a dura&ccedil;&atilde;o desta liga&ccedil;&atilde;o de pedido de ficheiro:
<ul>
<li><strong>Configurar hora de fim</strong>: Selecione esta op&ccedil;&atilde;o para determinar pela data e hora quando a liga&ccedil;&atilde;o para de funcionar para carregar ficheiros. </li>
<li><strong>Configurar hora de in&iacute;cio</strong>: Selecione esta op&ccedil;&atilde;o para determinar pela data e hora quando a liga&ccedil;&atilde;o come&ccedil;a a funcionar para carregar ficheiros. </li>
<li><strong>N&uacute;mero de acesso permitido</strong>: Selecione esta op&ccedil;&atilde;o para determinar quantas vezes pode ser acedida a liga&ccedil;&atilde;o.</li>
</ul>

</li>

</ul>


</li>
<li>Clique em <strong>Guardar</strong> para concluir as defini&ccedil;&otilde;es.</li>
</ol>


<h4>Para partilhar liga&ccedil;&otilde;es de pedidos de ficheiros:</h4>
<p>Para encontrar o URL de pedido de ficheiro, aceda <strong>File Station</strong> &gt; <strong>Ferramentas</strong> &gt; <strong>Gestor de Liga&ccedil;&otilde;es Partilhadas</strong> e fa&ccedil;a duplo clique na liga&ccedil;&atilde;o desejada. Pode partilhar a liga&ccedil;&atilde;o de uma das formas abaixo:</p>

<ul>
<li>Basta copiar o URL para utilizadores de destino.</li>
<li>Envie a liga&ccedil;&atilde;o atrav&eacute;s do <strong>Email Predefinido</strong> (a sua conta de email DSM) ou atrav&eacute;s de <strong>Correio</strong> (uma aplica&ccedil;&atilde;o de email de terceiros). Para quem utiliza pela primeira vez, siga as instru&ccedil;&otilde;es do assistente para configurar uma conta de email para utiliza&ccedil;&atilde;o.</li>
</ul>

<h4>Para carregar ficheiros:</h4>
<p>Se lhe for pedido que carregue ficheiros atrav&eacute;s da liga&ccedil;&atilde;o, fa&ccedil;a o seguinte:</p>
<ol>
<li>Abra o URL dado no computador local ou dispositivo m&oacute;vel (Android ou iOS). Introduza a palavra-passe se necess&aacute;rio.</li>
<li>Na p&aacute;gina de carregamento, introduza um nome que indica a sua identidade.</li>
<li>Basta arrastar e largar o(s) ficheiro(s) a carregar, ou clique em <strong>Adicionar Ficheiros</strong> para selecionar o(s) ficheiro(s).</li>
<li>Clique em <strong>Carregar</strong> para terminar o epdido.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>N&atilde;o pode carregar pastas atrav&eacute;s de uma liga&ccedil;&atilde;o de pedido de ficheiro.</li>
<li>Pastas dentro da pasta partilhada &quot;web&quot; n&atilde;o podem ser especificadas como pasta de destino.</li>
<li>A fun&ccedil;&atilde;o de carregamento varia consoante navegadores web:
<ul>
<li>Internet Explorer 8 e Internet Explorer 9 n&atilde;o suportam o carregamento de ficheiros atrav&eacute;s de arrastar e largar.</li>
<li>Chrome em dispositivos iOS apenas &eacute; compat&iacute;vel com o carregamento de imagens.</li>
<li>Safari em dispositivos iOS apenas &eacute; compat&iacute;vel com o carregamento de imagens e v&iacute;deo.</li>
<li>Navegadores web em dispositivos Android n&atilde;o est&atilde;o sujeitos a qualquer tipo de limite de ficheiros.</li>
</ul>
</li>

</ul>

</div>


<h4>Para encontrar ficheiros carregados:</h4>
<p>Ficheiros carregados pelo mesmo utilizador aparecem todos numa pasta id&ecirc;ntica dentro do destino. Por predefini&ccedil;&atilde;o, o nome da pasta ser&aacute; <strong>Nome_Carregador (Nome_Solicitador)</strong>.</p>
<p>Por exemplo, se os ficheiros forem carregados por <strong>Watson</strong> para <strong>Holmes</strong>, pode encontrar os ficheiros na pasta com o nome <strong>Watson (Holmes)</strong>.</p>


<h3>Gerir Liga&ccedil;&otilde;es de Pedido de Ficheiros</h3>

<h4>Para modificar liga&ccedil;&otilde;es de pedidos de ficheiros:</h4>
<p>Depois de criar uma liga&ccedil;&atilde;o de pedido de ficheiro, pode modificar as suas defini&ccedil;&otilde;es na <strong>File Station</strong> &gt; <strong>Ferramentas</strong> &gt; <strong>Gestor de Liga&ccedil;&otilde;es Partilhadas</strong>.</p>

<ol>
<li>Clique duas vezes na liga&ccedil;&atilde;o desejada, ou seleccione a liga&ccedil;&atilde;o e clique em <strong>Editar</strong>.</li>
<li>Na janela de contexto, modifique as defini&ccedil;&otilde;es relevantes.</li>
<li>Clique em <strong>Guardar</strong> para aplicar as novas defini&ccedil;&otilde;es.</li>
</ol>

<h4>Para eliminar liga&ccedil;&otilde;es de pedidos de ficheiros:</h4>
<ol>
<li>Aceda a <strong>File Station</strong> &gt; <strong>Ferramentas</strong> <strong>Gestor de Liga&ccedil;&otilde;es Partilhadas</strong>.</li>
<li>Selecione a(s) liga&ccedil;&atilde;o(&otilde;es) partilhada(s) desejada e clique em <strong>Eliminar</strong>. O(s) URL correspondente(s) ao pedido de ficheiro param imediatamente de funcionar.</li>
</ol>

<h4>Para atribuir privil&eacute;gios de arquivamento de pedido:</h4>
<p>Como <strong>admin</strong> ou utilizador pertencente ao grupo <strong>administrators</strong>, pode atribuir privil&eacute;gios a utilizadores para que possam criar liga&ccedil;&otilde;es de pedidos de ficheiros.</p>


<ol>
<li>Aceda a <strong>File Station</strong> &gt; <strong>Defini&ccedil;&otilde;es</strong> &gt; <strong>Liga&ccedil;&otilde;es Partilhadas</strong> &gt; <strong>Liga&ccedil;&otilde;es de Pedido de Ficheiros</strong>.</li>
<li>Selecione o tipo de utilizadores para lhe conferir privil&eacute;gios de arquivamento de pedidos.</li>
<li>Clique em <strong>OK </strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>





</body>
</html>
