<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Ver documentos, fotos ou v&iacute;deos</h2>

<p>
Com o File Station voc&ecirc; pode ver documentos, v&iacute;deos ou fotos facilmente.
</p>

<h4>Para mudar a forma como os itens s&atilde;o exibidos:</h4>
<p>
Voc&ecirc; pode mudar entre a visualiza&ccedil;&atilde;o de lista e visualiza&ccedil;&atilde;o de &iacute;cone para mudar a forma como os itens s&atilde;o exibidos na &aacute;rea principal. Clique no bot&atilde;o Visualiza&ccedil;&atilde;o de lista no canto superior direito para organizar os arquivos em uma lista ou clique no bot&atilde;o Visualizar &iacute;cone para exibi-los com &iacute;cones e texto. 
</p>
<p>Voc&ecirc; ver&aacute; miniaturas de fotos no &iacute;cone de visualiza&ccedil;&atilde;o nas condi&ccedil;&otilde;es a seguir:</p>
<ul>
<li>As fotos est&atilde;o localizadas nas pastas indexadas listadas em <strong>Painel de controle</strong> &gt; <strong>Servi&ccedil;o de indexa&ccedil;&atilde;o</strong> &gt; <strong>Indexa&ccedil;&atilde;o de m&iacute;dia</strong> &gt; <strong>Pasta indexada</strong> e voc&ecirc; j&aacute; instalou o Photo Station ou o Servidor de M&iacute;dia em seu dispositivo DiskStation.</li>
<li>Os dados da miniatura armazenados nas entradas EXIF criados por sua c&acirc;mera digital est&atilde;o dispon&iacute;veis.</li>
</ul>



<h4>Para ver os documentos no Google docs:</h4>
<p>Basta clicar com o bot&atilde;o direito no documento que deseja abrir e selecionar <b>Ver no Google docs</b>.</p>

<div class="section">
<h4>Formatos suportados:</h4>
<p>O Visualizador do Google docs suporta os seguintes formatos: doc, docx, ppt, xlsx, pdf, tif</p>

<h4>Nota:</h4>
<p>
Para visualizar documentos no Google docs, verifique se o dispositivo DiskStation est&aacute; totalmente acess&iacute;vel atrav&eacute;s da Internet. Se o DiskStation estiver localizado atr&aacute;s de um roteador, verifique se foi especificada uma regra de encaminhamento de portas para o DSM em <b>Painel de controle</b> &gt; <strong>Acesso Externo</strong> &gt; <b>Configura&ccedil;&atilde;o do Roteador</b>. Os n&uacute;meros de porta padr&atilde;o para o DSM s&atilde;o 5000 (HTTP) e 5001 (HTTPS). Caso ainda tenha problemas para ver documentos no Google docs, voc&ecirc; pode ter de especificar a porta do roteador para DSM em <b>Painel de controle</b> &gt; <b>Acesso externo</b> &gt; <b>Avan&ccedil;ado</b>.
</p>
</div>


<h4>Para ver os documentos no Office Online:</h4>
<p>Basta clicar com o bot&atilde;o direito no documento que deseja abrir e selecionar <b>Visualizar no Office Online</b>.</p>
<p>Ao usar o Office Viewer para visualizar documentos do Microsoft Office hospedados no dispositivo DiskStation, voc&ecirc; pode acessar esses documentos com recursos do Office intactos em um navegador da Web, sem a necessidade de ter o Office instalado no computador.</p>

<div class="section">
<h4>Formatos suportados:</h4>
<p>O Office Viewer suporta os seguintes formatos:</p>
<ul>
<li>Word: docx, docm, dotm, dotx</li>
<li>Excel: xlsx, xlsb, xls, xlsm</li>
<li>PowerPoint: pptx, ppsx, ppt, pps, pptm, potm, ppam, potx, ppsm</li>
</ul>

<h4>Nota:</h4>
<ul>
<li>Para visualizar documentos do Office online, certifique-se de ter ativado o QuickConnect. Caso contr&aacute;rio, fa&ccedil;a login no DSM como um usu&aacute;rio pertencente ao grupo <strong>administrators</strong> e v&aacute; para <b>Painel de Controle</b> &gt; <strong>QuickConnect</strong>.</li>
<li>Os documentos do Word e do PowerPoint devem ser inferiores a 10 MB; do Excel devem ser inferiores a 5 MB.</li>
<li>O nome do arquivo do documento deve conter apenas letras e n&uacute;meros.</li>
</ul>
</div>



<h4>Para visualizar fotos:</h4>
<ol>
<li>
Clique com o bot&atilde;o direito em foto e selecione <b>Visualizar</b> para abrir a janela do Visualizador de fotos.
</li>

<li>
Passe o cursor do mouse sobre a parte inferior do Visualizador de fotos para mostrar a barra deslizante de miniaturas para navega&ccedil;&atilde;o r&aacute;pida.</li>
</ol>
<div class="section">
<h4>Formatos suportados:</h4>
<p>O Visualizador de fotos suporta os seguintes formatos: jpg, jpeg, jpe, bmp, gif, png, tiff, tif, arw, srf, sr2, dcr, k25, kdc, cr2, crw, nef, mrw, ptx, pef, raf, 3fr, erf, mos, orf, rw2, raw, psd</p>
</div>

<h4>Para reproduzir (visualizar) arquivos de som:</h4>
<ul>
<li>Para reproduzir arquivos de som: Clique duas vezes em um ou mais arquivos de som para abri-los com o Reprodutor de &Aacute;udio. Como alternativa, voc&ecirc; tamb&eacute;m pode reproduzir arquivos de som clicando com o bot&atilde;o direito do mouse em um arquivo de som e selecionando <strong>Reproduzir</strong>.*</li>
<li>Para reproduzir arquivos de som por pasta: Clique em uma &uacute;nica pasta ou pressione Ctrl (para usu&aacute;rios Windows)/command (para usu&aacute;rios Mac) e clique em v&aacute;rias pastas. Em seguida clique com o bot&atilde;o direito nas pastas selecionadas e escolha <strong>Reproduzir</strong> para abri-las com o Reprodutor de &aacute;udio.*</li>

</ul>

<div class="section">
<h4>Formatos suportados:</h4>
<p>O Reprodutor de &Aacute;udio aceita os seguintes formatos: </p>
<ul>
<li>mp3, m4a, m4b, aac, ogg, wav, flac, ape, aiff, aif, wma</li>
</ul>

<h4>Nota:</h4>
<p>Voc&ecirc; pode reproduzir at&eacute; 1024 arquivos de som por vez.</p>
</div>

<h4>Para reproduzir v&iacute;deos:</h4>
<ol>
<li>
Clique com o bot&atilde;o direito no v&iacute;deo e selecione <b>Reproduzir</b> para abrir a janela do Reprodutor de v&iacute;deo.
</li>

<li>
O v&iacute;deo deve come&ccedil;ar a ser exibido imediatamente. Se isso n&atilde;o acontecer, verifique se o <a href="http://www.videolan.org/vlc/" target="_blank">VLC Player (Windows)</a> foi instalado no computador local.
</li>
<div class="section">
<h4><a name="VLC"></a>Nota:</h4>
<ul>
<li>
Durante a instala&ccedil;&atilde;o do VLC Player, certifique-se de marcar o plugin Mozilla e o plugin ActiveX.
</li>
<li>
O VLC &eacute; compat&iacute;vel com os seguintes navegadores: <br> <b>Windows: </b>Internet Explorer, Firefox, Google Chrome
</li>

<li>
  Se o VLC estiver instalado no computador e voc&ecirc; estiver se conectando ao DSM com um navegador da web compat&iacute;vel, o Reprodutor de v&iacute;deo suporta os seguintes formatos: avi, dat, mkv, vob, asf, wmv, mov, qt, divx, flv, swf, rm, rmvb, mpg, mpeg, mpeg1, m1v, mpeg2, m2v, mp2, dvr-ms, m2ts, mts, m2t, ts, tp, trp, mpeg4, m4v, mp4, 3g2, 3gp, 3gp2, webm, mpe, xvid
</li>
<li>
Se o VLC n&atilde;o estiver instalado no computador local, o reprodutor de v&iacute;deo reproduzir&aacute; os v&iacute;deos suportados pelo HTML5. Veja <a href="http://en.wikipedia.org/wiki/HTML5_video" target="_blank">aqui</a> para saber quais v&iacute;deos HTML5 s&atilde;o suportados pelos diversos navegadores da web.
</li>

<li>
Se tiver se conectado ao DSM atrav&eacute;s do protocolo HTTPS, voc&ecirc; dever&aacute; importar um certificado confi&aacute;vel (no <b>Painel de controle</b> &gt; <b>Seguran&ccedil;a</b> &gt; <strong>Certificado</strong>) para poder reproduzir v&iacute;deos com o File Station.
</li>

<li>O VLC n&atilde;o suporta a transmiss&atilde;o HTTPS.</li>
</ul>
</div>

<li>
Se voc&ecirc; tiver um arquivo de legenda com o mesmo nome e na mesma pasta que o v&iacute;deo, ou se o v&iacute;deo tiver legendas incorporadas, poder&aacute; ver as legendas durante a reprodu&ccedil;&atilde;o do v&iacute;deo. Se quiser usar outra legenda, selecione-a no menu suspenso.
</li>
</ol>
<p>____<br>

* Indispon&iacute;vel em alguns modelos.</p>

</body>
</html>
