<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Visualizar ou Alterar Permiss&otilde;es dos Ficheiros/Pastas</h2>
<p>Com a File&nbsp;Station, pode definir privil&eacute;gios de acesso a ficheiros e subpastas. Esta fun&ccedil;&atilde;o &eacute; especialmente &uacute;til quando pretende permitir que diferentes grupos de utilizadores acedam a diferentes subpastas numa pasta partilhada.</p>

<h4>Para permitir o acesso de utilizadores e grupos a ficheiros e subpastas:</h4>
<ol>
<li>Selecione os ficheiros e pastas aos quais pretende definir privil&eacute;gios de acesso.</li>
<li>Clique com o bot&atilde;o direito nos ficheiros ou pastas ou escolha o menu <b>A&ccedil;&atilde;o</b> e, de seguida, <b>Propriedades</b>.</li>

<img src="about:blank" class="help_image"/>

<li>Na sec&ccedil;&atilde;o <b>Propriet&aacute;rio</b>, escolha o propriet&aacute;rio dos ficheiros e das pastas selecionados a partir do menu pendente <b>Propriet&aacute;rio</b>.</li>

<img src="about:blank" class="help_image"/>

<li class="disable-eds14">Clique na tabela <b>Permiss&otilde;es</b> e selecione um utilizador ou grupo. Clique em <strong>Editar</strong> para abrir o <strong>Inspetor de Permiss&otilde;es<strong>.</strong></strong><br>

<li class="disable-eds14">Proceda de qualquer uma das formas seguintes na janela <b>Editor de Permiss&otilde;es</b> para gerir as permiss&otilde;es ACL para o ficheiro ou pasta:

<ol class="disable-eds14">
        <li><b>Utilizador ou grupo:</b> Especifique o utilizador ou grupo cujas permiss&otilde;es deseja personalizar.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Herdado de:</b> Apenas para visualiza&ccedil;&atilde;o. Veja aqui as informa&ccedil;&otilde;es para verificar se a permiss&atilde;o &eacute; herdada (de uma pasta superior) ou expl&iacute;cita (mostrada como <b>Nenhuma</b>). </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Tipo:</b> Escolha <b>Permitir</b> ou <b>Negar</b> para conceder ou negar a permiss&atilde;o para o utilizador ou grupo.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Aplicar a:</b> Se estiver a criar uma entrada de permiss&atilde;o para uma pasta, assinale as caixas de verifica&ccedil;&atilde;o para aplicar a entrada nesta pasta, nas pastas (ou <b>Pastas Inferiores</b>) ou ficheiros (ou <b>Ficheiros Inferiores</b>) nesta pasta ou em todos os ficheiros e pastas contidos nesta pasta (ou <b>Todos os descendentes</b>). </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Administra&ccedil;&atilde;o:</b> Assinale <b>Ler permiss&otilde;es</b>, <b>Alterar permiss&otilde;es</b> ou <b>Assumir propriedade</b> para especificar as defini&ccedil;&otilde;es de permiss&atilde;o de acesso do utilizador ou grupo para a entrada. </li>
        <li><b>Leitura</b> ou <b>Escrita</b>: Assinale as caixas de verifica&ccedil;&atilde;o nestas sec&ccedil;&otilde;es para modificar as defini&ccedil;&otilde;es de permiss&atilde;o do utilizador ou grupo para o ficheiro ou pasta. </li>
      </ol>    
  <li> Clique em <b>OK</b>.</li>
</ol>

<p><span class="note_head">Nota: </span>N&atilde;o lhe &eacute; permitido editar os privil&eacute;gios de acesso a ficheiros e subpastas na pasta partilhada <b>photo</b> aqui.</p>
</body>
</html>
