<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Partilhar Liga&ccedil;&otilde;es de Ficheiros</h2>

<p>Os ficheiros ou pastas armazenados em DiskStation podem ser partilhados de forma r&aacute;pida e f&aacute;cil. Basta clicar com o bot&atilde;o direito do rato num ficheiro ou numa pasta e selecionar <strong>Partilhar liga&ccedil;&otilde;es de ficheiros</strong>. Isto gera uma liga&ccedil;&atilde;o e o c&oacute;digo QR, que pode ser enviado para amigos ou outros utilizadores. Eles podem seguir a liga&ccedil;&atilde;o para transferir a pasta ou ficheiro selecionado, independentemente de terem uma conta DSM.</p>


<h4>Para partilhar liga&ccedil;&otilde;es de ficheiros:</h4>
<ol>
<li>Selecione os ficheiros ou pastas que pretende partilhar.</li>
<li>Clique com o bot&atilde;o direito do rato numa das pastas ou ficheiros selecionados ou clique no menu <b>A&ccedil;&atilde;o</b>. Em seguida, escolha <b>Partilhar liga&ccedil;&otilde;es de ficheiros</b>.</li>
<li>As liga&ccedil;&otilde;es partilhadas e os c&oacute;digos QR s&atilde;o apresentados na janela que aparece.</li>
<li>As seguintes op&ccedil;&otilde;es tamb&eacute;m podem ser modificadas:
<ul>
 <li><strong>Per&iacute;odo de validade</strong>: Pode personalizar per&iacute;odos v&aacute;lidos de acesso e horas de acesso para liga&ccedil;&otilde;es partilhadas. 
  <ul>
<li><strong>Personalizar per&iacute;odo de validade</strong>: Pode determinar por quanto tempo fica activa uma liga&ccedil;&atilde;o partilhada ap&oacute;s a sua cria&ccedil;&atilde;o. A liga&ccedil;&atilde;o ficar&aacute; inv&aacute;lida assim que ultrapasse o per&iacute;odo especificado.</li>
<li><strong>Personalizar horas de acesso v&aacute;lidas</strong>: Pode determinar quantas vezes pode ser acedida uma liga&ccedil;&atilde;o partilhada. A liga&ccedil;&atilde;o ficar&aacute; inv&aacute;lida assim que ultrapasse o n&uacute;mero de vezes especificado.</li>
</ul>
</li>
<li><strong>Partilhar com utilizadores DSM</strong>: Pode partilhar a liga&ccedil;&atilde;o com utilizadores ou grupos DSM ao selecion&aacute;-los na lista do menu pendente. Note que n&atilde;o pode partilhar com a conta de convidados nem com o grupo de utilizadores.</li>

<li><strong>Partilhar com outros</strong>: Pode partilhar liga&ccedil;&otilde;es protegidas por palavra-passe com outras pessoas, incluindo utilizadores n&atilde;o DSM.</li>

</ul>
</li>
</ol>

<h4> Para ativar links gofile.me: </h4> 
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>QuickConnect</strong> e certifique-se de que a op&ccedil;&atilde;o <strong>Ativar QuickConnect</strong> est&aacute; assinalada. Se n&atilde;o tiver configurado o QuickConnect, pode faz&ecirc;-lo nesta p&aacute;gina.</li>
<li>De seguida, clique em <strong>Avan&ccedil;adas</strong> e certifique-se de que a op&ccedil;&atilde;o <strong>Partilha de Ficheiros</strong> est&aacute; assinalada.</li>
<li>Os ficheiros partilhados podem ser transferidos sem uma conta DSM, acedendo ao link de partilha gofile.me.</li> 
</ol>
<h3>Personalizar p&aacute;gina de liga&ccedil;&atilde;o partilhada</h3>
<p>File Station proporciona v&aacute;rias op&ccedil;&otilde;es para estilizar a p&aacute;gina de liga&ccedil;&atilde;o partilhada.</p>
<ol>
<li>Aceda a <strong>File Station</strong> &gt; <strong>Defini&ccedil;&otilde;es</strong> &gt; <strong>Liga&ccedil;&otilde;es Partilhadas</strong> &gt; <strong>Personalizada</strong>.</li>
<li>Selecione <strong>Personalizar p&aacute;gina de liga&ccedil;&atilde;o partilhada</strong> e clique em <strong>Defini&ccedil;&otilde;es personalizadas</strong>.</li>
<li>Pode personalizar a p&aacute;gina das seguintes formas:
  <ul>
<li><strong>Modelo</strong>: Escolha qualquer modelo predefinido.</li>
<li><strong>Fundo</strong>: Clique na miniatura ou <strong>+</strong> para escolher uma imagem de fundo predefinida, imagem no seu DiskStation, ou imagem aplicada anteriormente.</li>
<li><strong>Log&oacute;tipo</strong>: Clique na miniatura ou <strong>+</strong> para escolher uma imagem carregada (inferior a 1 MB), imagem no seu DiskStation, ou imagem aplicada anteriormente. O log&oacute;tipo pode ser posicionado em qualquer dos quatro cantos.</li>
</ul>
</li>
<li>Clique em <strong>Pr&eacute;-visualizar</strong> para ver se s&atilde;o necess&aacute;rios quaisquer ajustes.</li>
<li>Clique em <strong>OK</strong> para aplicar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ol>
<li>As defini&ccedil;&otilde;es personalizadas s&atilde;o aplicadas as todas as liga&ccedil;&otilde;es partilhadas, independentemente da hora de cria&ccedil;&atilde;o.</li>
<li>Pode apenas aplicar imagens dos seguintes formatos, como imagem de fundo/log&oacute;tipo: .jpe, jpeg, .jpg, .bmp, .gif, e .png</li></ol>
</div>

<h3>Gerir Liga&ccedil;&otilde;es Partilhadas</h3>
<p>As liga&ccedil;&otilde;es partilhadas existentes podem ser geridas acedendo a <strong>Ferramentas</strong> &gt; <strong>Gestores de Liga&ccedil;&otilde;es Partilhadas</strong>. Na janela que &eacute; apresentada, existem op&ccedil;&otilde;es para editar, partilhar ou remover as liga&ccedil;&otilde;es partilhadas existentes.</p>

<div class="section">
<h4>Nota:</h4>
<ol>
  <li>Pode criar at&eacute; 1000 liga&ccedil;&otilde;es partilhadas.</li>
  <li>A sec&ccedil;&atilde;o <strong>Estado</strong> de cada liga&ccedil;&atilde;o partilhada apresenta uma das seguintes:
<ul>
<li><b>V&aacute;lida</b>: A liga&ccedil;&atilde;o partilhada est&aacute; a funcionar correctamente.</li>
<li><b>Expirada</b>: O per&iacute;odo de validade da liga&ccedil;&atilde;o partilhada expirou.</li>
<li><b>Inv&aacute;lido</b>: O ficheiro ou pasta partilhada j&aacute; n&atilde;o existe ou n&atilde;o tem privil&eacute;gios adequados para aceder ao ficheiro ou &agrave; pasta.</li>
<li><b>Ainda n&atilde;o em vigor</b> A liga&ccedil;&atilde;o partilhada ainda n&atilde;o est&aacute; ativa.</li>
</ul>
</li>
</ol>

</div>
</body>
</html>
