<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Carregar Ficheiros ou Pastas</h2>
<p>Utilize um dos m&eacute;todos seguintes para carregar ficheiros ou pastas do seu computador para a DiskStation.</p>
<p>Para ter acesso total &agrave;s fun&ccedil;&otilde;es de carregamento abaixo mostradas, instale primeiro o Java Runtime Environment (JRE) e Flash Player mais recente. </p>


<h4>M&eacute;todo 1:</h4>
<ol>
<li>
A partir da parte superior do painel esquerdo, seleccione uma pasta de destino na DiskStation. 
</li>
<li>
Clique em <b>Carregar</b>, escolha <strong>Carregar - Ignorar</strong> ou <strong>Carregar - Sobrepor</strong> e seleccione os ficheiros ou pastas do seu computador local. </li>
</ol>
<h4>M&eacute;todo 2:</h4>
<ol>
	<li>Aceda a <strong>Defini&ccedil;&otilde;es</strong>, assinale <strong>Percorrer ficheiros do computador local com a File Station</strong> e actualize a p&aacute;gina web para ver pastas do seu computador local na parte inferior do painel esquerdo.</li>
<div class="section">
<h4>Nota:</h4>
<p>A op&ccedil;&atilde;o <strong>Percorrer ficheiros do computador local com a File Station</strong> tem efeito apenas depois de instalar e activar JRE no seu computador.</p>
</div>
	<li>A partir da parte inferior do painel esquerdo, selecione uma pasta no seu computador local. A sec&ccedil;&atilde;o principal exibe agora o conte&uacute;do da pasta selecionada.
	</li>
	<li>Selecione os ficheiros ou pastas que pretende na &aacute;rea principal e de seguida selecione <b>Carregar</b>. 
</li>
	<li>Seleccione uma pasta de destino na DiskStation, a partir da janela que aparece.
	</li>
	<li>No canto superior direito da janela, selecione <b>Sobrepor</b> se pretender substituir ficheiros ou pastas com o mesmo nome na pasta de destino. Caso contr&aacute;rio, selecione <b>Ignorar</b>.
</li>
	<li>Clique em <b>OK</b> para come&ccedil;ar a carregar.
</li>
</ol>
<h4>M&eacute;todo 3:</h4>
<ol>
<li>Aceda a <strong>Defini&ccedil;&otilde;es</strong>, assinale <strong>Percorrer ficheiros do computador local com a File Station</strong> e actualize a p&aacute;gina web para ver pastas do seu computador local na parte inferior do painel esquerdo.</li>
<li>
No painel esquerdo, arraste uma pasta do seu computador (na parte inferior) para qualquer pasta na DiskStation (na parte superior).
</li>
<li>
No menu de selec&ccedil;&atilde;o que aparece, escolha entre substituir ou ignorar os ficheiros/pastas com o mesmo nome na pasta de destino.
</li>
</ol>
<h4>M&eacute;todo 4:</h4>
<ol>
<li>
A partir da parte superior do painel esquerdo, seleccione uma pasta de destino na DiskStation.
</li>

<li>
Selecione os ficheiros no ambiente de trabalho do seu computador ou atrav&eacute;s do explorador de ficheiros (por exemplo, Explorador do Windows ou Mac Finder) e de seguida arraste e largue-os na File Station no navegador web.
</li>

<li>
Na janela de di&aacute;logo que aparece, escolha entre substituir ou ignorar os ficheiros com o mesmo nome na pasta de destino.</li>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>O <b>M&eacute;todo 4</b> apenas &eacute; suportado por navegadores espec&iacute;ficos: Chrome, Firefox, Safari 5.1 ou superior. No entanto, n&atilde;o &eacute; suportado para Mac quando <strong>Percorrer ficheiros do computador local com a File Station</strong> est&aacute; assinalado.</li>
<li>
Pode tamb&eacute;m arrastar e largar pastas ou ficheiros vazios, mas apenas quando <strong>Percorrer ficheiros do computador local com a File Station</strong> est&aacute; assinalado para os navegadore listados acima. Caso contr&aacute;rio, n&atilde;o pode carregar pastas e ficheiros vazios usando o <strong>M&eacute;todo 4</strong>.</li>
	<li>
Se estiver a utilizar o Chrome para Linux e tiver iniciado sess&atilde;o no DSM atrav&eacute;s do protocolo HTTPS, &eacute; necess&aacute;rio importar um certificado de confian&ccedil;a (em <b>Painel de Controlo</b> &gt; <b>Seguran&ccedil;a</b> &gt; <strong>Certificado</strong>) para ser poss&iacute;vel carregar atrav&eacute;s do <b>M&eacute;todo 4</b>.
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Nota:</h4>
<ol>
<li>
Pode adicionar at&eacute; 1000 ficheiros &agrave; sua fila de upload.
</li>
	<li>
	Pode carregar ficheiros com mais de 4GB se estiver a usar o Google Chrome, Firefox, Safari 5.1 ou superior, ou quando <strong>Percorrer ficheiros do computador local com a File Station</strong> est&aacute; assinalado. Caso contr&aacute;rio, apenas pode carregar at&eacute; 2GB de ficheiros de cada vez.</li>
	<li>
Numa pasta partilhada n&atilde;o encriptada, o nome do ficheiro/pasta deve ter entre 255 caracteres (at&eacute; cerca de 80 caracteres para idiomas n&atilde;o Latinos); numa pasta partilhada encriptada, deve ser composto pelo m&aacute;ximo de 143 caracteres (at&eacute; cerca de 47 caracteres para idiomas n&atilde;o Latinos).
</li>
<li>
O nome do Ficheiro/Pasta deve excluir os seguintes caracteres: \ / : * ? &quot; &gt; |.
</li>
<li>
O nome do ficheiro/pasta n&atilde;o pode come&ccedil;ar com &quot;._&quot;.
</li>
<li>Pode carregar ficheiross que tenham 0KB de tamanho apenas quando tiver instalado JRE.</li>
</ol>
</div>


<div class="section">
<h4>Resolu&ccedil;&atilde;o de problemas</h4>
<p>Se n&atilde;o for poss&iacute;vel pesquisar os itens locais guardados no seu Mac utilizando adequadamente o Safari, proceda da seguinte forma:</p>
<ol>
<li>No seu Mac, abra o Safari e escolha <strong>Prefer&ecirc;ncias</strong> no menu do Safari.</li>
<li>Clique em <strong>Gerir Defini&ccedil;&otilde;es do Website</strong> no separador <strong>Seguran&ccedil;a</strong>.</li>
<li>Em <strong>Java</strong>, escolha o seu &quot;website&quot; do DSM.</li>
<li>Seleccione <strong>Executar em Modo n&atilde;o Seguro</strong>.</li>
</ol>
</div>



</body>
</html>
