
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Gerenciar op&ccedil;&otilde;es do File Station - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Learn how to customize File Station settings related to file management, shared links, and security.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Enviando arquivos como anexos de e-mail</h2>

<p>&Eacute; poss&iacute;vel enviar arquivos diretamente como anexos de e-mail no <strong>File Station </strong>clicando com o bot&atilde;o direito nos arquivos selecionados e depois selecionando <strong>Enviar como anexos de e-mail</strong>. Uma janela de e-mail aparecer&aacute; com alguns recursos &uacute;teis:</p>
<ul>
<li>Para: Se voc&ecirc; sincronizou contatos para sua conta de e-mail, uma lista de contatos aparecer&aacute;, exibindo os contatos sincronizados associados &agrave; sua conta de e-mail.</li>
<li>De: Voc&ecirc; pode selecionar a conta de e-mail padr&atilde;o ou outra conta de e-mail adicionada. A lista de contatos ser&aacute; alternada automaticamente para a conta de e-mail selecionada.</li>
<li>Anexos: Os anexos selecionados aparecem na parte inferior do e-mail. Voc&ecirc; pode adicionar mais anexos usando o bot&atilde;o de anexos.</li>
</ul>

<div class="section">
  <h4>Observa&ccedil;&atilde;o:</h4>
  <ul>
    <li>Somente arquivos podem ser adicionados como anexos.</li>
    <li>Voc&ecirc; pode anexar at&eacute; 10 arquivos em um &uacute;nico e-mail.</li>
    <li>O tamanho m&aacute;ximo total do arquivo de todos os anexos em um &uacute;nico e-mail depender&aacute; do seu servi&ccedil;o de e-mail. Caso n&atilde;o tenha certeza, recomendamos limitar o tamanho total do arquivo de todos os anexos para 25 MB. </li>
  </ul>
</div>
</body>
</html>
