<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Criar solicita&ccedil;&atilde;o de arquivo</h2>
<p>As solicita&ccedil;&otilde;es de arquivo s&atilde;o convites de carregamento de arquivo enviados para usu&aacute;rios n&atilde;o DSM. Com a solicita&ccedil;&atilde;o de links de arquivos, os usu&aacute;rios n&atilde;o DSM podem carregar v&aacute;rios arquivos diretamente no File Station em seu DiskStation, sem a necessidade de possuir contas correspondentes de usu&aacute;rio e privil&eacute;gios de carregamento de arquivo.</p>
<h4>Para criar links de solicita&ccedil;&atilde;o de arquivos:</h4>
<ol>
<li>V&aacute; para <strong>File Station</strong> e selecione uma pasta como destino do carregamento.</li>
<li>Clique em <strong>A&ccedil;&atilde;o</strong> ou clique com o bot&atilde;o direito na pasta de destino e selecione <strong>Criar solicita&ccedil;&atilde;o de arquivo</strong>.</li>
<li>Na janela pop-up, voc&ecirc; pode encontrar/modificar as informa&ccedil;&otilde;es abaixo:
<ul>
<li><strong>Caminho do arquivo</strong>: Liste o caminho do diret&oacute;rio de destino.</li>
<li><strong>Link</strong>: Liste o link de solicita&ccedil;&atilde;o de arquivo para compartilhar com usu&aacute;rios alvo.</li>
<li><strong>Seu nome</strong>: Digite um nome para indicar a identidade do solicitante. O valor padr&atilde;o &eacute; seu nome de usu&aacute;rio.</li>
<li><strong>Mensagem</strong>: Personalize a mensagem para usu&aacute;rios alvo.</li>
<li><strong>Habilitar prote&ccedil;&atilde;o por senha</strong>: Selecione essa op&ccedil;&atilde;o para que apenas usu&aacute;rios com a senha possam carregar arquivos atrav&eacute;s do link criado. Especifique a senha na caixa abaixo.</li>
<li><strong>Per&iacute;odo de validade</strong>: Clique nesse bot&atilde;o para personalizar a dura&ccedil;&atilde;o desse link de solicita&ccedil;&atilde;o de arquivo:
<ul>
<li><strong>Configurar hora de parada</strong>: Selecione essa op&ccedil;&atilde;o para determinar por data e hora quando o link para de funcionar para o carregamento do arquivo.</li>
<li><strong>Configurar hora de in&iacute;cio</strong>: Selecione essa op&ccedil;&atilde;o para determinar por data e hora quando o link come&ccedil;a de funcionar para o carregamento do arquivo.</li>
<li><strong>N&uacute;mero de acessos permitidos</strong>: Selecione essa op&ccedil;&atilde;o para determinar quantas vezes o link pode ser acessado.</li>
</ul>
</li>
</ul>
</li>
<li>Clique em <strong>Salvar</strong> para concluir as configura&ccedil;&otilde;es.</li>
</ol>
<h4>Para compartilhar links de solicita&ccedil;&atilde;o de arquivo:</h4>
<p>Para localizar o URL de solicita&ccedil;&atilde;o do arquivo, v&aacute; para <strong>File Station</strong> &gt; <strong>Ferramentas</strong> &gt; <strong>Gerenciador de links compartilhados</strong> e clique duas vezes no link desejado. Voc&ecirc; pode compartilhar o link de uma das maneiras abaixo:</p>
<ul>
<li>Basta copiar o URL para os usu&aacute;rios alvo.</li>
<li>Envie o link atrav&eacute;s do <strong>E-mail padr&atilde;o</strong> (sua conta de e-mail do DSM) ou atrav&eacute;s do <strong>Mail</strong> (um aplicativo de e-mail de terceiros). Para usu&aacute;rios de primeira vez, siga as instru&ccedil;&otilde;es do assistente para configurar uma conta de e-mail para usar.</li>
</ul>
<h4>Para carregar arquivos:</h4>
<p>Se for necess&aacute;rio carregar arquivos atrav&eacute;s do link, fa&ccedil;a o seguinte:</p>
<ol>
<li>Abra o URL dado no computador local ou em um dispositivo m&oacute;vel (Android ou iOS). Digite a senha se ela for exigida.</li>
<li>Na p&aacute;gina de carregamento digite um nome que indique sua identidade.</li>
<li>Basta arrastar e soltar os arquivos para carregar ou clicar em <strong>Adicionar arquivos</strong> para selecionar arquivos.</li>
<li>Clique em <strong>Carregar</strong> para concluir a solicita&ccedil;&atilde;o.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>As pastas n&atilde;o podem ser carregadas atrav&eacute;s de um link de solicita&ccedil;&atilde;o de arquivo.</li>
<li>As pastas dentro da pasta compartilhada &quot;web&quot; n&atilde;o podem ser especificadas como pasta de destino.</li>
<li>A fun&ccedil;&atilde;o de carregamento varia com os navegadores de Internet:
<ul>
<li>Internet Explorer 8 e Internet Explorer 9 n&atilde;o suporta o carregamento de arquivo atrav&eacute;s do recurso arrastar e soltar.</li>
<li>O Chrome em dispositivos iOS suporta apenas carregamento de imagem.</li>
<li>O Safari em dispositivos iOS suporta apenas carregamento de imagem e v&iacute;deo.</li>
<li>Os navegadores de Internet e dispositivos Android n&atilde;o est&atilde;o sujeitos a nenhum tipo de limita&ccedil;&atilde;o de arquivo.</li>
</ul>
</li>
</ul>
</div>
<h4>Para localizar arquivos carregados:</h4>
<p>Os arquivos carregados pelo mesmo usu&aacute;rio aparecer&atilde;o em uma pasta id&ecirc;ntica dentro do destino. Por padr&atilde;o, o nome da pasta ser&aacute; <strong>Carregador_Nome (Solicitante_Nome)</strong>.</p>
<p>Por exemplo se os arquivos forem carregados por <strong>Watson</strong> para <strong>Holmes</strong>, voc&ecirc; pode localizar os arquivos na pasta nomeada <strong>Watson (Holmes)</strong>.</p>
<h3>Gerenciamento de links de solicita&ccedil;&atilde;o de arquivo</h3>
<h4>Para modificar links de solicita&ccedil;&atilde;o de arquivos:</h4>
<p>Ap&oacute;s criar um link de solicita&ccedil;&atilde;o de arquivo, voc&ecirc; pode modificar as configura&ccedil;&otilde;es em <strong>File Station</strong> &gt; <strong>Ferramentas</strong> &gt; <strong>Gerenciar links compartilhados</strong>.</p>
<ol>
<li>Clique duas vezes no link desejado ou selecione o link e clique em <strong>Editar</strong>.</li>
<li>Na janela pop-up, modifique as configura&ccedil;&otilde;es relevantes.</li>
<li>Clique em <strong>Salvar</strong> para aplicar as novas configura&ccedil;&otilde;es.</li>
</ol>
<h4>Para excluir links de solicita&ccedil;&atilde;o de arquivos:</h4>
<ol>
<li>V&aacute; para <strong>File Station</strong> &gt; <strong>Ferramentas</strong> &gt; <strong>Gerenciador de links compartilhados</strong>.</li>
<li>Selecione os links desejados indesejado e clique em <strong>Excluir</strong>. O URL de solicita&ccedil;&atilde;o de arquivo correspondente parar&aacute; de funcionar imediatamente.</li>
</ol>
<h4>Para atribuir privil&eacute;gios de arquivamento de solicita&ccedil;&atilde;o:</h4>
<p>Como <strong>admin</strong> ou um usu&aacute;rio que perten&ccedil;a ao grupo <strong>administrators</strong>, voc&ecirc; pode atribuir privil&eacute;gios para usu&aacute;rios para que eles possam criar links de solicita&ccedil;&atilde;o de arquivo.</p>
<ol>
<li>V&aacute; para <strong>File Station</strong> &gt; <strong>Configura&ccedil;&otilde;es</strong> &gt; <strong>Links compartilhados</strong> &gt; <strong>Arquivar links de solicita&ccedil;&atilde;o</strong>.</li>
<li>Selecione o tipo de usu&aacute;rio para permitir privil&eacute;gios de arquivamento de solicita&ccedil;&atilde;o.</li>
<li>Clique em <strong>OK</strong> para salvar as configura&ccedil;&otilde;es.</li>
</ol>
</body>
</html>
