<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Ver ou alterar permiss&otilde;es de arquivos/pastas</h2>
<p>Com o File&nbsp;Station, voc&ecirc; pode definir privil&eacute;gios de acesso a arquivos e subpastas. Esta fun&ccedil;&atilde;o &eacute; especialmente &uacute;til quando voc&ecirc; quer permitir que diferentes grupos de usu&aacute;rios acessem sub pastas diferentes em uma pasta compartilhada.</p>

<h4>Para permitir o acesso dos usu&aacute;rios ou grupos a pastas e sub pastas:</h4>
<ol>
<li>Selecione os arquivos ou pastas para os quais deseja definir privil&eacute;gios de acesso.</li>
<li>Clique com o bot&atilde;o direito em um arquivo ou pasta ou selecione o menu <b>A&ccedil;&atilde;o</b> e selecione <b>Propriedades</b>.</li>

<img src="about:blank" class="help_image"/>

<li>Na se&ccedil;&atilde;o <b>Propriet&aacute;rio</b>, selecione o propriet&aacute;rio dos arquivos e pastas selecionados no menu suspenso <b>Propriet&aacute;rio</b>.</li>

<img src="about:blank" class="help_image"/>

<li class="disable-eds14">Clique na guia <b>Permiss&atilde;o</b> e selecione um usu&aacute;rio ou grupo. Clique em <strong>Editar</strong> para abrir o <strong>Inspetor de Permiss&otilde;es<strong>.</strong></strong><br><li class="disable-eds14">Siga um dos procedimentos a seguir na janela <b>Editor de Permiss&otilde;es</b> para gerenciar as permiss&otilde;es do ACL do arquivo ou pasta:<ol class="disable-eds14">
        <li><b>Usu&aacute;rio ou grupo:</b> Especifica o usu&aacute;rio ou grupo cujas permiss&otilde;es deseja personalizar.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Herdar de:</b> Apenas para visualiza&ccedil;&atilde;o. Visualize as informa&ccedil;&otilde;es aqui para ver se a permiss&atilde;o foi herdada (de uma pasta superior) ou expl&iacute;cita (exibida como <b>Nenhum</b>). </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Tipo:</b> Selecione <b>Permitir</b> ou <b>Negar</b> para conceder ou negar a permiss&atilde;o para o usu&aacute;rio ou grupo.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Aplicar a:</b> Se voc&ecirc; estiver criando uma entrada de permiss&atilde;o para uma pasta, marque as caixas de sele&ccedil;&atilde;o para aplicar a entrada a essa pasta, &agrave;s pastas (ou <b>Pastas filhas</b>) ou arquivos (ou <b>Arquivos filhos</b>) nessa pasta ou a todos os arquivos e pastas contidos nessa pasta (ou <b>Todos os descendentes</b>). </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Administra&ccedil;&atilde;o:</b> Marque <b>Ler permiss&otilde;es</b>, <b>Alterar permiss&otilde;es</b> ou <b>Assumir propriedade</b> para especificar as configura&ccedil;&otilde;es de permiss&atilde;o de acesso do usu&aacute;rio ou do grupo para entrada. </li>
        <li><b>Leitura</b> ou <b>Grava&ccedil;&atilde;o:</b> Marque as caixas de sele&ccedil;&atilde;o nessas se&ccedil;&otilde;es para modificar as configura&ccedil;&otilde;es de permiss&atilde;o do usu&aacute;rio ou grupo para o arquivo ou pasta. </li>
      </ol>    
  <li> Clique em <b>OK</b>.</li>
</ol>

<p><span class="note_head">Observa&ccedil;&atilde;o: </span>Voc&ecirc; n&atilde;o tem permiss&atilde;o para editar os privil&eacute;gios de acesso a arquivos e subpastas na pasta compartilhada <b>photo</b> aqui.</p>
</body>
</html>
