<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2>Paket-Zentrum konfigurieren</h2>
<h4>So verwalten Sie, welche Pakete installiert werden d&uuml;rfen:</h4>
<ol>
<li>W&auml;hlen Sie unter der Registerkarte <strong>Allgemein</strong> die folgenden Optionen, um Ihre gew&uuml;nschte <strong>Vertrauensebene</strong> festzulegen:</li>
<ul>
<li><strong>Synology Inc.</strong>: Nur die Installation von Paketen erlauben, die von Synology Inc. ver&ouml;ffentlicht wurden.</li>
<li><strong>Synology Inc. und vertrauensw&uuml;rdige Herausgeber</strong>: Nur die Installation von Paketen erlauben, die von Synology Inc. und vertrauensw&uuml;rdigen Herausgebern ver&ouml;ffentlicht wurden. Vertrauensw&uuml;rdige Herausgeber sind Herausgeber, die das Vertrauen von Drittanbietern &uuml;ber das Hinzuf&uuml;gen einer Paketquelle erhalten haben oder denen Benutzer Vertrauen entgegenbringen, indem sie das Zertifikat des Herausgebers importieren.</li>
<li><strong>Jeder Herausgeber</strong>: Installation von jedem Paket, unabh&auml;ngig vom Herausgeber und der Integrit&auml;t, zulassen.</li>
</ul>
<li>Klicken Sie auf <strong>OK</strong>.</li>
</ol>

<h4>Ein vertrauensw&uuml;rdiges Herausgeber-Zertifikat importieren:</h4>
<ol>
<li>Klicken Sie unter der Registerkarte <strong>Zertifikat</strong> auf <b>Importieren</b>. </li>
<li>Klicken Sie auf <strong>Durchsuchen</strong>, und w&auml;hlen Sie das vertrauensw&uuml;rdige Zertifikat des Herausgebers.</li>
<li>Klicken Sie auf <strong>OK</strong>. </li>
</ol>

<h4>Synology Inc.-Zertifikat aktualisieren:</h4>
<p>Wenn Sie mit dem Internet verbunden sind, wird das Zertifikat von Synology Inc. automatisch w&auml;hrend der Paketinstallation aktualisiert. Manuell aktualisieren:</p>
<ol>
<li>Klicken Sie unter der Registerkarte <strong>Zertifikat</strong> auf <b>Importieren</b>. </li>
<li>Klicken Sie auf <strong>Durchsuchen</strong>, und w&auml;hlen Sie das Zertifikat von Synology Inc., das von der <a href="http://www.synology.com/support/download" target="_blank">Synology-Website</a>heruntergeladen werden kann.</li>
<li>Klicken Sie auf <strong>OK</strong>. </li>
</ol>
<h4>Benachrichtigungen &uuml;ber Paketaktualisierungen aktivieren:</h4>
<ol>
<li>Klicken Sie auf die Registerkarte <b>Benachrichtigung</b> und anschlie&szlig;end auf <b>E-Mail-Benachrichtigung aktivieren</b> und/oder <b>Desktop-Benachrichtigung aktivieren</b>. Die erste Option erm&ouml;glicht DSM, Ihnen E-Mails zuzusenden, wenn neue Updates vorhanden sind. Bei der zweiten Option zeigt DSM eine Benachrichtigung oben rechts auf dem DSM-Desktop an.</li>
<li>Klicken Sie auf <b>OK</b>.</li>
</ol>
<div class="section">
<h4>Hinweis:</h4>
<p>Damit E-Mail-Benachrichtigungen wirksam werden, konfigurieren Sie zuerst die E-Mail-Benachrichtigungseinstellungen von DSM (unter <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <b>Benachrichtigung</b>).</p></div>

<h4>So f&uuml;gen Sie eine Paket-Ressource eines Drittanbieters hinzu:</h4>
<ol>
<li>Klicken Sie auf die Registerkarte <b>Paketquellen</b>, klicken Sie auf <strong>Hinzuf&uuml;gen</strong> und geben Sie anschlie&szlig;end den Namen und den Ort Ihrer Paketquellen ein. <br>Der Speicherort kann eine URL aus dem Internet sein, die von einem Drittanbieter-Entwickler oder einer Community zur Verf&uuml;gung gestellt wird.</li>
<li>Klicken Sie auf <b>OK</b>. Nachdem Sie die Paketquelle erfolgreich hinzugef&uuml;gt haben, wird eine Liste mit Paketen auf der Registerkarte <strong>Community</strong> angezeigt. </li>
</ol>

</body>
</html>
