<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Pakete verwalten</h2>
<p>Nach der manuellen oder Online-Installation von Paketen k&ouml;nnen Sie sie im Paket-Zentrum verwalten, damit sie immer aktualisiert sind. Die unten stehenden Anweisungen erkl&auml;ren die Ausf&uuml;hrung, Aktualisierung, Deinstallation, das Starten und Stoppen von Paketen und die Fehlerbehebung bei Paketproblemen.</p>

<h4>Gehen Sie auf eine der folgenden Weisen vor, um Pakete zu aktualisieren: </h4>
<p>Halten Sie Ihre Pakete immer auf dem aktuellen Stand, um den guten Zustand von DiskStation zu bewahren.</p>
<ul>
<li>Klicken Sie im linken Feld auf <strong>Aktualisieren</strong>, um verf&uuml;gbare Aktualisierungen anzuzeigen. Klicken Sie auf die Schaltfl&auml;chen <strong>Aktualisieren</strong> oder <strong>Alle aktualisieren</strong>, um Pakete zu aktualisieren. </li>
<li>Klicken Sie auf <b>Manuelle Installation</b>, um ein Paket durch Hochladen einer <b>.spk</b>-Datei (im Synology <a href="http://www.synology.com/support/download.php" target="_blank">Download-Zentrum</a> oder auf Websites von Drittanbietern verf&uuml;gbar) zu installieren.</li>
<li>Die Paketaktualisierungen werden gem&auml;&szlig; den Optionen unter <strong>Einstellungen</strong> &gt; <strong>Automatische Updates</strong> angezeigt. Weitere Informationen finden Sie <a href="configure.html">hier</a>.</li>
</ul>
<p><span class="note_head">Hinweis: </span>Wenn Sie eine E-Mail- oder Desktop-Benachrichtigung erhalten m&ouml;chten, sobald neue Aktualisierungen verf&uuml;gbar sind, klicken Sie auf <b>Einstellungen</b> &gt; <strong>Allgemein</strong> &gt; <strong>Benachrichtigung</strong>, markieren Sie die Kontrollk&auml;stchen und klicken Sie anschlie&szlig;end auf <b>OK</b>.</p>

<h4>Gehen Sie auf eine der folgenden Weisen vor, um Pakete zu reparieren:</h4>
<p>Wenn Fehler in einem Paket auf DiskStation aufgetreten sind, m&uuml;ssen Sie sie reparieren, um es wieder nutzen zu k&ouml;nnen. Manchmal treten diese auf, weil das Paket zu alt ist und nicht mehr mit der aktuellen Version von DSM kompatibel ist. Andere Ursachen k&ouml;nnten sein, dass die Programmdateien des Paketes fehlen oder besch&auml;digt sind.&nbsp; Pakete, die repariert werden m&uuml;ssen, werden unter der Kategorie <strong>Installiert</strong> angezeigt. </p>
<ul>
	<li>Klicken Sie auf die Schaltfl&auml;chen <strong>Reparieren</strong>, um Pakete zu reparieren.</li>
	<li>Klicken Sie auf <b>Manuelle Installation</b>, um ein Paket durch Hochladen einer <b>.spk</b>-Datei (im Synology <a href="http://www.synology.com/support/download.php" target="_blank">Download-Zentrum </a>oder auf Websites von Drittanbietern verf&uuml;gbar) erneut zu installieren und zu reparieren. </li>
</ul>
<p><span class="note_head">Hinweis: </span>Durch Anklicken von <strong>Reparieren</strong> wird die aktuelle Version dieses Paketes installiert, anstatt die Alte zu reparieren. Bitte kontaktieren Sie den Herausgeber oder Entwickler dieses Paketes, wenn Sie Probleme bei der Installation des Paketes haben.</p>
<h4>So deinstallieren Sie vorhandene Pakete:</h4>
<p>Klicken Sie auf ein installiertes Paket und w&auml;hlen Sie <b>Deinstallieren</b> aus dem Drop-down-Men&uuml; <b>Aktion</b>, um das Paket zu deinstallieren.</p>

<h4>So f&uuml;hren Sie Paketdienste aus oder halten sie an:</h4>
<p>Klicken Sie auf ein installiertes Paket und w&auml;hlen Sie <b>Ausf&uuml;hren</b> oder <b>Anhalten</b> aus dem Drop-down-Men&uuml; <b>Aktion</b>, um das Paket auszuf&uuml;hren oder anzuhalten.</p>


<h4>Paketprobleme beheben:</h4>
<p>Wenn Sie bei einem Paket auf ein Problem sto&szlig;en, versuchen Sie bitte Folgendes:</p>
<ul>
	<li>Aktualisieren Sie das Paket auf die neueste Version. </li>
	<li>Entfernen Sie sowohl das Paket als auch seine Datenbank (falls vorhanden), und installieren Sie es neu.</li>
	<li>Kontaktieren Sie den Herausgeber oder Entwickler, um Hilfe und Support zu erhalten. </li>
</ul>

<h4>So finden Sie die Kontaktinformationen eines Paketherausgebers:</h4>
<p>Einige Pakete im Synology Paketzentrum werden von Drittentwicklern zusammengestellt und herausgegeben. Synology bietet daher keinen technischen Support f&uuml;r solche Anwendungen an. Bitte kontaktieren Sie die Herausgeber oder Entwickler der jeweiligen Anwendung, um neue Funktionen vorzuschlagen, wenn Sie Fragen haben oder ein Feedback geben m&ouml;chten. Einige Pakete haben neben einem Entwickler noch einen Herausgeber. Der Herausgeber stellt das Paket zusammen und macht es f&uuml;r Synology-Produkte verf&uuml;gbar, w&auml;hrend die Grundfunktionen des Paketes mit Genehmigung des Entwicklers angeboten werden.&nbsp; Wenn ein Herausgeber angegeben ist, wenden Sie sich f&uuml;r Support bitte an den Herausgeber. </p>
<ol>
<li>Gehen Sie zur Detailseite eines installierten Paketes.</li>
	<li>Links auf der Detailseite finden Sie die Kontaktinformationen des Herausgebers oder Entwicklers.</li>
	<li>&nbsp;Wenn Sie f&uuml;r von Synology entwickelte Pakete Vorschl&auml;ge zu weiteren Funktionen oder Fragen haben sowie Feedback geben m&ouml;chten, besuchen Sie unsere <a href="https://www.synology.com/company/contact_us" target="_blank">Synology Website</a> und kontaktieren Sie uns direkt.</li>
</ol>

<h3>Anwendungen ausf&uuml;hren</h3>
<p>Nachdem Sie Pakete installiert und ausgef&uuml;hrt haben, k&ouml;nnen Sie die aktivierten Anwendungen auf unterschiedliche Weisen starten.</p>
<h4>Gehen Sie folgenderma&szlig;en vor, um eine installierte und aktivierte Anwendung zu starten:</h4>
<ul>
<li>Gehen Sie zu <b>Hauptmen&uuml;</b> &gt; <b>[Anwendungsname]</b>.</li>
<li>&Ouml;ffnen Sie das <b>Hauptmen&uuml;</b> und ziehen Sie die Miniaturansicht der Anwendung auf den DSM-Desktop. Klicken Sie anschlie&szlig;end auf <b>[Anwendungsname]</b> auf dem Desktop.</li>
<li>Gehen Sie zu <b>Hauptmen&uuml;</b> &gt; <b>[Anwendungsname]</b>. Rechtsklicken Sie auf das Anwendungssymbol in der Taskleiste und w&auml;hlen <b>Zur Taskleiste legen</b>. Wird die Anwendung geschlossen, verbleibt das Symbol in der Taskleiste und Sie k&ouml;nnen es anklicken, um die Anwendung wieder zu starten.</li>
</ul>

</body>
</html>
