<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>
 </head>
 <body>
  <h2> Status do disco</h2>
 <p>Essa p&aacute;gina cont&eacute;m guias que exibem o status dos discos do conjunto de high-availability. A guia respectiva de cada servidor exibe as seguintes informa&ccedil;&otilde;es.</p>
 	<ul>
    	<li><b>N&uacute;mero:</b> Indica que slot cada disco ocupa. Os discos dos servidores ativo e passivo que ocupam os slots correspondentes devem ter a mesma capacidade.</li>
        <li><b>Tamanho do disco:</b> Indica a capacidade de cada disco.</li>
        <li><b>Temperatura:</b> Indica a temperatura do disco.</li>
        <li><b>Status S.M.A.R.T.:</b> Indica o status S.M.A.R.T. de cada disco.</li>
        <li><b>Status:</b> Exibe informa&ccedil;&otilde;es do disco e notifica&ccedil;&otilde;es de erro.</li>
	</ul>
<h4>Para substituir discos com defeito: </h4>
	<ol>
  		<li>Verifique o n&uacute;mero do disco.</li>
  		<li>Substitua o disco com defeito por um novo. Para informar-se sobre os passos da instala&ccedil;&atilde;o do disco r&iacute;gido, consulte o <i>Guia de instala&ccedil;&atilde;o r&aacute;pida</i> do seu produto Synology.</li>
  		<li>V&aacute; para <b>Status do armazenamento</b>.</li>
        <li>Selecione o volume danificado.</li>
        <li>Clique em <b>Reparar</b> para reparar o volume.</li>
	</ol>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>A capacidade dos discos r&iacute;gidos de substitui&ccedil;&atilde;o deve ser igual ou maior do que o disco r&iacute;gido com defeito.</p>
</div>
<h3>Para adicionar novos discos a um conjunto de high-availability:</h3>
<p>Os discos r&iacute;gidos podem ser adicionados ao conjunto de high-availability para expandir a capacidade. Antes de adicionar qualquer disco r&iacute;gido, veja abaixo.</p>
<ul>
<li>Recomendamos adicionar discos quando os servidores ativo e passivo estiverem on-line.</li>
<li>A capacidade dos discos r&iacute;gidos do servidor passivo deve ser igual ou maior do que a dos discos do servidor ativo.</li>
</ul>
<h4>Para adicionar discos r&iacute;gidos:</h4>
<ol>
<li>Insira os discos r&iacute;gidos nos slots correspondentes dos servidores ativo e passivo. Por exemplo, se voc&ecirc; inserir um disco r&iacute;gido no slot 1 do servidor ativo, dever&aacute; inserir o disco r&iacute;gido correspondente no slot 1 do servidor passivo.</li>
<li>V&aacute; para <b>Gerenciador de armazenamento</b> &gt; <b>Volume</b> (or <b>Grupo de discos</b>/<b>iSCSI LUN</b>/<b>RAID Group</b> dependendo de sua situa&ccedil;&atilde;o e modelo). Selecione o volume que deseja expandir, clique no bot&atilde;o <b>Gerenciar</b> e siga as instru&ccedil;&otilde;es para adicionar os discos r&iacute;gidos.</li>
<li>Quando os discos r&iacute;gidos forem adicionados com sucesso, volte para <strong>Gerenciador de High Availability</strong> &gt; <strong>Status do armazenamento</strong> para verificar se o status est&aacute; <strong>Normal</strong>.</li>
</ol>
 </body>
</html>
