<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Configura&ccedil;&otilde;es da rede</h2>
	<p>Essa p&aacute;gina cont&eacute;m tr&ecirc;s guias que exibem as configura&ccedil;&otilde;es de rede do conjunto de high-availability, o servidor do membro ativo e o servidor do membro passivo.</p>
  
	<h3>Guia do conjunto HA</h3>
  	<p>Ao criar um conjunto de high-availability, o sistema gera um endere&ccedil;o IP comum para que o IP do conjunto de high-availability receba conex&otilde;es de entrada. Podem ser criados endere&ccedil;os IP adicionais para o conjunto de high-availability, se necess&aacute;rio. Os endere&ccedil;os IP das interfaces de rede ativadas no servidor ativo ser&atilde;o exibidos nessa guia (a interface de rede usada pela conex&atilde;o de Pulsa&ccedil;&atilde;o n&atilde;o ser&aacute; exibida nessa p&aacute;gina, pois tal interface ser&aacute; usada para a replica&ccedil;&atilde;o de dados entre os dois servidores). Essa guia mostra as informa&ccedil;&otilde;es abaixo:</p>
    	<ul>
        	<li><b>Interface de rede:</b> A interface de rede ativada no servidor ativo.</li>
            <li><b>Conex&atilde;o:</b> Exibe se a interface est&aacute; conectada ou n&atilde;o.</li>
            <li><b>Endere&ccedil;o IP:</b> Ao criar um conjunto de high-availability, o sistema gera um endere&ccedil;o IP comum para que o IP do conjunto de high-availability receba conex&otilde;es de entrada. Voc&ecirc; pode se conectar ao conjunto de high-availability usando esse endere&ccedil;o IP quando quiser entrar no DiskStation Manager (DSM), independente de qual servidor Synology for o servidor ativo. Isso evita a necessidade de se conectar a endere&ccedil;os IP diferentes quando ocorre uma mudan&ccedil;a.</li>
            <li><b>M&aacute;scara de Sub-rede: </b>A m&aacute;scara de sub-rede associada com o endere&ccedil;o IP dado do conjunto de high-availability.</li>
		</ul>
<h4>Para editar o Endere&ccedil;o IP e a M&aacute;scara sub-rede:</h4>
	<ol>
		<li>Selecione o endere&ccedil;o IP ou a m&aacute;scara de sub-rede que deseja editar e clique em <b>Editar</b> ou clique duas vezes no campo para iniciar a edi&ccedil;&atilde;o.</li>
   <li>Marque as caixas de sele&ccedil;&atilde;o <b>Habilitar</b> para habilitar ou desabilitar cada interface. Voc&ecirc; pode habilitar mais de uma interface de rede de conjunto, mas a interface de rede original que foi configurada durante a cria&ccedil;&atilde;o do conjunto n&atilde;o pode ser desabilitada.</li>
    </ol>
<h4>Para alterar o nome do servidor do conjunto de high-availability:</h4>
 	<ol>
    	<li>Clique em <b>Alterar configura&ccedil;&otilde;es de rede</b> para visualizar o nome do conjunto de high-availability e alterar suas configura&ccedil;&otilde;es.</li>
   		<li>Clique em <b>Aplicar</b> para salvar o nome do conjunto de high-availability atual e as configura&ccedil;&otilde;es do endere&ccedil;o IP.</li>
   		<li>Para descartar as configura&ccedil;&otilde;es atuais clique em <b>Cancelar</b>. </li>
  </ol>
<h3>Guias do servidor ativo e passivo (exibidas como nome de servidor)</h3>
<p>Essas guias mostram o status das interfaces de rede do servidor ativo ou passivo. Desses, a Conex&atilde;o de pulsa&ccedil;&atilde;o ocupar&aacute; uma interface de rede em cada um dos servidores ativo e passivo. Essas guias exibem as seguintes informa&ccedil;&otilde;es:</p>
	<ul>
    	<li><b>Interface de rede:</b> A interface de rede f&iacute;sica no servidor.</li>
    	<li><b>Endere&ccedil;o IP:</b> O endere&ccedil;o IP atribu&iacute;do para dada interface de rede.</li>
    	<li><b>M&aacute;scara de Sub-rede:</b> A m&aacute;scara de sub-rede associada com o endere&ccedil;o IP dado.</li>
    	<li><b>Descri&ccedil;&atilde;o:</b> Exibe informa&ccedil;&otilde;es de dada interface de rede e acessibilidade de seu endere&ccedil;o IP atribu&iacute;do. Esse campo mostrar&aacute; as seguintes condi&ccedil;&otilde;es poss&iacute;veis:</li>
		<ol>
			<li><b>Endere&ccedil;o IP original acess&iacute;vel</b>: O endere&ccedil;o IP original atribu&iacute;do &agrave; interface do servidor ativo &eacute; acess&iacute;vel para dados e servi&ccedil;os.</li>
			<li><b>Endere&ccedil;o IP original n&atilde;o acess&iacute;vel</b>: O endere&ccedil;o IP original atribu&iacute;do &agrave; interface no servidor passivo n&atilde;o est&aacute; acess&iacute;vel.</li>
			<li><b>IP da conex&atilde;o de pulsa&ccedil;&atilde;o, n&atilde;o acess&iacute;vel da Intranet</b>: O endere&ccedil;o IP original atribu&iacute;do automaticamente &agrave; conex&atilde;o de pulsa&ccedil;&atilde;o n&atilde;o &eacute; acess&iacute;vel para dados e servi&ccedil;os.</li>
		</ol>
	</ul>
</body>
</html>
