<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Monitoramento de servi&ccedil;os</h2>

<p>Essa p&aacute;gina permite o monitoramento de determinados servi&ccedil;os. Se um servi&ccedil;o monitorado falhar no servidor ativo, o sistema acionar&aacute; o failover para o modo de espera, servidor passivo (desde que o servidor passivo esteja funcionando normalmente). As seguintes se&ccedil;&otilde;es aparecem nesse p&aacute;gina:</p>

<ul>
  <li><b>Servi&ccedil;o:</b> Exibe os servi&ccedil;os que podem ser monitorados.</li>
  <li><b>Status: </b> Exibe se os servi&ccedil;os est&atilde;o funcionando ou n&atilde;o.</li>
  <li><b>Failover quando o servi&ccedil;o falhar: </b>Marque a caixa de sele&ccedil;&atilde;o do lado de um servi&ccedil;o para come&ccedil;ar a monitor&aacute;-lo. O sistema ativar&aacute; o failover se o servi&ccedil;o selecionado apresentar uma falha.</li>
</ul>

<h4>Para monitorar um servi&ccedil;o:</h4>

<ol>
<li>Encontre o servi&ccedil;o que deseja monitorar. Marque a caixa de sele&ccedil;&atilde;o ao lado dele.</li>
<li>Clique em <b>Aplicar</b> para salvar as configura&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Servi&ccedil;os Suportados</h4>
<p>Os servi&ccedil;os que podem ser monitorados s&atilde;o os seguintes: Servi&ccedil;o de Arquivos Windows, iSCSI Target, FTP, Servi&ccedil;o de Arquivos Mac, Servi&ccedil;o NFS.</p>
</div>

<div class="section">
<h4>Failover para Falhas de Conex&atilde;o de Rede</h4>
<p>Se essa op&ccedil;&atilde;o estiver ativada, o sistema ativar&aacute; o failover para o servidor passivo quando a conex&atilde;o de rede do servidor ativo apresentar falhas ou mau funcionamento, e a conex&atilde;o de rede do servidor passivo ainda estiver funcionando normalmente.</p>

<ul>
<li>O failover ser&aacute; acionado apenas se o servidor passivo tiver conex&otilde;es em bom estado. Por exemplo, se o servidor ativo tiver tr&ecirc;s conex&otilde;es e uma delas falhar, o sistema acionar&aacute; um failover apenas se o servidor passivo tiver tr&ecirc;s ou mais conex&otilde;es saud&aacute;veis.</li>
<li>Conex&otilde;es combinadas com Link Aggregation contam como uma conex&atilde;o. Por exemplo, se duas conex&otilde;es forem combinadas e uma delas falhar, mas a outra ainda estiver funcionando, a conex&atilde;o ainda ser&aacute; considerada saud&aacute;vel.</li>
</ul>

</div>

</body>
</html>
