<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
  <h2>Desligamento e restabelecimento</h2>
  <p>As instru&ccedil;&otilde;es abaixo o guiar&atilde;o atrav&eacute;s do processo de desligamento, remo&ccedil;&atilde;o ou restabelecimento de um conjunto de high-availability.</p>

  <h4> Para desligar o conjunto de high-availability usando o Synology High Availability:</h4>
  <p>Quando voc&ecirc; desejar desligar um conjunto de high-availability para transportar os servidores para um novo local f&iacute;sico ou realizar manuten&ccedil;&atilde;o, mas voc&ecirc; n&atilde;o desejar remover as configura&ccedil;&otilde;es do conjunto de high-availability, siga essas instru&ccedil;&otilde;es.</p>
  <ol>
   <li>Fa&ccedil;a login no DSM.</li>
   <li>Abra o Synology High Availability.</li>
   <li>Clique no bot&atilde;o marcado <b>Gerenciamento</b>.</li>
   <li>Selecione <b>Desligar conjunto de HA</b>.</li>
   <li>Uma mensagem de confirma&ccedil;&atilde;o aparece. Clique em <b>Sim</b> para confirmar.</li>
  </ol>

  <h4>Para desligar manualmente um conjunto de high-availability:</h4>
  <p> O conjunto de high-availability tamb&eacute;m pode ser desligado manualmente usando-se os bot&otilde;es liga/desliga localizados em cada servidor. </p>
  <ol>
   <li>Pressione e segure o bot&atilde;o liga/desliga do servidor (ativo ou passivo) at&eacute; que ele emita um bipe.</li>
   <li>Depois de um servidor ter se desligado totalmente, aguarde pelo menos 30 segundos (o servidor que ainda est&aacute; on-line requer tempo para salvar as configura&ccedil;&otilde;es).</li>
   <li>Pressione e segure o bot&atilde;o liga/desliga do outro servidor at&eacute; que ele emita um bipe.</li>
   <li>Aguarde o servidor concluir o desligamento.</li>
  </ol>
<div class="section">
<h4>Liga&ccedil;&atilde;o dos servidores:</h4>   
<p>Quando desejar ligar os servidores novamente, os servidores ativo e passivo devem ser ligados ao mesmo tempo (ou em cinco minutos um em rela&ccedil;&atilde;o ao outro). Se voc&ecirc; ligar apenas um dos servidores, ele tentar&aacute; ligar o outro servidor transmitindo uma mensagem Wake on LAN.</p>
<h4>Desligamento anormal:</h4>
<p>Quando um conjunto de high-availability &eacute; criado, a op&ccedil;&atilde;o de rein&iacute;cio ap&oacute;s a falha na liga&ccedil;&atilde;o &eacute; habilitada automaticamente no Painel de controle. Se os servidores desligarem anormalmente devido a uma falha de energia, eles tentar&atilde;o ligar automaticamente quando a energia for restaurada.</p>
</div>

<h4>Para remover o conjunto de high-availability.</h4>
 <p>Quando voc&ecirc; quiser desvincular os dois servidores e remover um conjunto de high-availability para vincular um servidor diferente, siga essas instru&ccedil;&otilde;es.</p>
  <ol>
   <li>V&aacute; para a p&aacute;gina <b>Vis&atilde;o geral</b>.</li>
   <li>Clique no bot&atilde;o <b>Gerenciamento</b>.</li> 
   <li>Selecione <b>Remover conjunto de HA</b>.</li>
  </ol>
  <p>Ap&oacute;s a confirma&ccedil;&atilde;o o sistema remove o conjunto de high-availability. O campo status exibir&aacute; o andamento do processo de remo&ccedil;&atilde;o. Quando o conjunto de high-availability tiver sido removido com sucesso, voc&ecirc; ser&aacute; direcionado para o endere&ccedil;o IP original do servidor ativo. O status dos dois servidores mudar&aacute; para <b>Independente</b>.</li>
  
 <h4>Para restabelecer um conjunto de high-availability com defeito:</h4>
  <p>Caso voc&ecirc; n&atilde;o consiga acessar o DSM ou o Synology High Availability devido a um erro de redes separadas ou outros defeitos, voc&ecirc; pode tentar for&ccedil;ar o conjunto de high-availability a se desvincular pressionando o bot&atilde;o <b>Restabelecer</b> em seus servidores.</p>
  <ol>
   <li>Pressione e segure o bot&atilde;o <b>Restabelecer</b> (localizado geralmente no painel traseiro do servidor) at&eacute; que o servidor emita um bipe.
   <li>O sistema remover&aacute; o conjunto de high-availability e o status dos dois servidores mudar&aacute; para <b>Independente</b></li>
   <li>Pressionar o bot&atilde;o <b>Restabelecer</b> tamb&eacute;m restaura algumas configura&ccedil;&otilde;es para o padr&atilde;o tais como o endere&ccedil;o IP, DNS e senha de administrador al&eacute;m do seguinte:</li>
   <ul>
    <li>A senha do administrador ser&aacute; restabelecida para em branco.</li>
    <li>A conta de convidado ser&aacute; desabilitada.</li>
    <li>O DHCP ser&aacute; habilitado no IP, DNS, Gateway e outras interfaces de rede.</li>
    <li>O JumboFrames ser&aacute; desabilitado e o MTU ser&aacute; definido como 1500.</li>
    <li>A porta de gerenciamento ser&aacute; restabelecida para 5000/5001.</li>
    <li>O PPPoE ser&aacute; restabelecido para o padr&atilde;o.</li>
    <li>O bloqueio autom&aacute;tico de IP ser&aacute; desabilitado (o endere&ccedil;o IP bloqueado n&atilde;o ser&aacute; apagado).</li>
    <li>Link Aggregation ser&aacute; desabilitada.</li>
    <li>As regras do firewall ser&atilde;o desabilitadas (as regras n&atilde;o ser&atilde;o apagadas).</li>
   </ul>
  </ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Durante o procedimento de remo&ccedil;&atilde;o de um conjunto de high-availability, deve haver algumas opera&ccedil;&otilde;es de grava&ccedil;&atilde;o de dados incompletas. Para garantir a inteireza dos dados, execute a replica&ccedil;&atilde;o dos dados com base no servidor ativo porque o servidor passivo pode estar sem algumas atualiza&ccedil;&otilde;es de dados.</p>
</div>
 </body>
</html>
