<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Multimediadatabase</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Systemdatabase</h1>
<p> DiskStation bruker en systemdatabase til &aring; holde oversikt over pakkedata og systemloggoppf&oslash;ringer lagret p&aring; de delte mappene som er opprettet p&aring; de eksterne lagringsenhetene dine, slik som <b>usbshare1</b>.</p>
<p> <span class="note_head">Viktig: </span>Hvis du vil f&aring; tilgang til pakkedata som er lagret p&aring; den eksterne lagringsenheten tilkoblet din DiskStation, eller om du vil se DSMs loggoppf&oslash;ringer i <b>Hovedmeny</b> &gt; <strong>Loggsenter</strong>, m&aring; systemdatabasen aktiveres f&oslash;rst. I motsatt fall vil alle tilh&oslash;rende tjenester v&aelig;re utilgjengelige. </p>
<h4>Slik aktiverer du systemdatabasen:</h4>
<ol>
  <li> Merk av for <b>Aktiver systemdatabase</b>. </li>
  <li> Gj&oslash;r ett av f&oslash;lgende:
    <ul>
      <li> Velg <b>Automatisk konfigurasjon</b> dersom du &oslash;nsker at DSM automatisk skal velge en delt mappe for lagring av systemdatabasen. Dersom den eksterne lagringsenheten som inneholder den delte mappen fjernes, vil DSM automatisk velge en annen delt mappe for lagring av databasen. </li>
      <li> Velg <b>Flytt den gjeldende databasen til den valgte delte mappen</b> og velg deretter fra rullegardinmenyen for &aring; flytte gjeldende database til en annen delt mappe som er opprettet p&aring; din eksterne enhet. </li>
      <li>Velg <strong>Velg en av de eksisterende databasene</strong> og velg deretter fra rullegardinmenyen for &aring; velge en eksisterende database hvis flere enn &eacute;n ekstern enhet er tilkoblet din DiskStation.</li>
    </ul>
  </li>
  <li> Klikk p&aring; <b>Bruk</b>. </li>
</ol>
<p> <span class="note_head">Advarsel: </span>For &aring; unng&aring; at databasen blir &oslash;delagt, kontrollerer du at du har l&oslash;st ut lagringsenheten i <b>Hovedmeny</b> &gt; <b>Kontrollpanel</b> &gt;<strong> Eksterne enheter</strong> &gt; <strong>Eksterne enheter</strong> eller ved &aring; klikke p&aring; ikonet for den eksterne enheten &oslash;verst til h&oslash;yre f&oslash;r du fjerner den fra DiskStation. </p>
</body>
</html>
