<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Medieindekseringstjeneste</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Konverteringsinnstillinger</h2>
<p>N&aring; du laster opp fotografier eller videoer for bruk med mediaserver eller Photo Station, vil det bli opprettet miniatyrbilder for &aring; gi en bedre leseropplevelse. Du kan angi kvalitet for miniatyrbildene og overv&aring;ke konverteringsfremdriften her.</p>
<p>Hvis du vil vise videoer i den delte mappen <strong>photo</strong> i Photo Station p&aring; mobilenheter, kan du aktivere videokonvertering og vise konverteringsfremdriften ogs&aring;.</p>
<h4>Slik angir du kvalitet p&aring; miniatyrbilder:</h4>
<ol>
<li>
Velg en kvalitet fra rullegardinmenyen.
</li>
<li>
Klikk p&aring; <b>Bruk</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Merk: </span>
<ul>
<li>Det vil ta lenger &aring; opprette miniatyrbilder av h&oslash;y kvalitet.</li>
</ul>
</div>
<h4>Slik aktiverer du videokonvertering for mobilenheter:</h4>
<ol>
<li>Merk av for <strong>Aktiver videokonvertering for mobilenheter</strong>.</li>
<li>Klikk p&aring;<strong> Bruk</strong>, s&aring; vil du kunne se videoer p&aring; dine mobilenheter n&aring;r du er p&aring; farten.
</li>
</ol>

<div class="section">
<span class="note_head">Merk: </span>
<ul>
<li>Bare videoer som er lastet opp til den delte mappen <strong>photo</strong> i Photo Station kan konverteres til et format som st&oslash;ttes av mobilenheter.</li>
<li>MP4-filer vil ikke bli konvertert.</li>
</ul>
</div>
<h4>Slik viser du konverteringsfremdriften for fotografi/video:</h4>
<ol>
<li>N&aring;r bilder eller videoer lastes opp til DiskStation, klikker du p&aring; ikonet for <strong>Konverteringsfremdrift</strong> som vises &oslash;verst til h&oslash;yre i oppgavelinjen. </li>
<li>
I vinduet som &aring;pnes, gj&oslash;r du ett av f&oslash;lgende:
</li>
<ul>
<li>
I delen <b>Konverteringsfremdrift</b> overv&aring;ker du fremdriften og statusen til opprettelsen av miniatyrbilder som utf&oslash;res i bakgrunnen.
</li>
<li>
Gj&oslash;r f&oslash;lgende for &aring; ta pause i konverteringsfremdriften:
</li>
<ol>
<li>
Velg <b>Forsinkelse i [antall] time(r)</b> fra rullegardinmenyen, og klikk p&aring; <b>Pause</b> for &aring; ta pause i fremdriften. (Som standard er <b>Forsinkelse i 1 time(r)</b> valgt.)
</li>
<li>Konverteringsfremdriften gjenopptas etter angitt tidsforsinkelse, eller du kan klikke p&aring; <b>Fortsett</b> for &aring; gjenoppta prosessen umiddelbart.
</li>
</ol>
<div class="section">
<span class="note_head">Merk: </span>
<ul>
<li>Siden konverteringsfremdriften krever st&oslash;rre CPU-ressurser, kan det spare systemressurser for eventuelle p&aring;g&aring;ende oppgaver &aring; ta pause.</li>
</ul>
</div>
</ul>
<li>
N&aring;r konverteringsprosessen er fullf&oslash;rt, vil ikonet i oppgavelinjen forsvinne.
</li>
</ol>

<div class="section">
<span class="note_head">Merk: </span>
<ul>
<li>Siden Photo Station Uploader leverer bedre ytelse for oppretting av miniatyrbilder, anbefaler vi bruk av Photo Station Uploader n&aring;r du skal laste opp et stort antall bilder/videoer til Photo Station-biblioteket ditt.</li>
</ul>
</div>

</body>
</html>