<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Denne siden gir deg alternativer for &aring; administrere Bluetooth-adaptere og koble Bluetooth-enheter til din DiskStation. N&aring;r de er tilkoblet, kan noen Bluetooth-enheter, som h&oslash;yttalere eller hodetelefoner, velges som lydutgang for Audio Station slik at du enkelt kan h&oslash;re p&aring; musikk som er lagret p&aring; din DiskStation.</p>
<h2>Komme igang</h2>
<p>Koble en USB Bluetooth-adapter til en USB-port p&aring; din DiskStation. En liste over Bluetooth-adaptere blir vist p&aring; venstre side p&aring; hovedsiden til Bluetooth. Informasjon og alternativer vedr&oslash;rende Bluetooth-enheter blir vist p&aring; h&oslash;yre side.</p>
<h4>Slik aktiverer eller deaktiverer du Bluetooth-adaptere:</h4>
<ol>
<li>Velg en Bluetooth-adapter.</li>
<li>Klikk p&aring; <strong>Avanserte innstillinger</strong>.</li>
<li>Merk av i boksen <strong>Aktiver Bluetooth</strong>.</li>
<li>Klikk p&aring; <strong>OK</strong> for &aring; lagre innstillinger.</li>
</ol>
<h2>Administrere Bluetooth-enheter</h2>
<p>N&aring;r du kobler til en ny Bluetooth-enhet, m&aring; du s&oslash;rge for at den kan oppdages, at den er innen 10 meter unna DiskStation og bruker A2DP (Advanced Audio Distribution Profile). Se i brukerh&aring;ndboken til Bluetooth-enheten for mer informasjon om oppsett.</p>
<h4>Slik kobler du til en Bluetooth-enhet:</h4>
<ol>
<li>P&aring; hovedsiden til <strong>Bluetooth</strong> velger du Bluetooth-enheten du vil koble til DiskStation. Hvis enheten ikke oppdages, pr&oslash;ver du &aring; klikke p&aring; <strong>Oppdater</strong> for &aring; s&oslash;ke etter enheter i n&aelig;rheten.</li>
<li>Velg enheten n&aring;r den blir oppdaget.</li>
<li>Klikk <strong>Koble til</strong>.</li>
<li>Angi PIN for enheten din om n&oslash;dvendig.</li>
</ol>
<h4>Slik viser du informasjon om Bluetooth-enhet:</h4>
<ol>
<li>Velg en tilkoblet Bluetooth-enhet.</li>
<li>Klikk p&aring; <strong>Info</strong>.</li>
<li>Et vindu &aring;pnes med informasjon, som Bluetooth-adresse, navn, type og status.</li>
</ol>
<h4>Slik fjerner du en Bluetooth-enhet:</h4>
<ol>
<li>Velg en Bluetooth-enhet som du ikke lenger vil bruke med DiskStation.</li>
<li>Klikk p&aring; <strong>Fjern</strong>.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>N&aring;r du spiller av musikk gjennom Bluetooth-h&oslash;yttalere eller hodetelefoner, kan du oppleve avspillingsproblemer hvis innstillingene for Bluetooth-adapteren din endres, eller hvis du kobler til for mange Bluetooth-enheter samtidig.</li>
<li>Avhengig av enheten, kan Bluetooth-h&oslash;yttalerne glemme din DiskStation hvis h&oslash;yttalerne som er tilkoblet din DiskStation senere kobles til en annen DiskStation (eller Bluetooth-musikkspiller). I dette tilfellet, vil det oppst&aring; en feil n&aring;r du pr&oslash;ver &aring; spille av musikk med h&oslash;yttalerne. For &aring; l&oslash;se dette problemet, kan du fjerne h&oslash;yttalerne og pr&oslash;ve &aring; koble dem til p&aring; nytt.</li>
</ul>

</div>
</body>
</html>
