<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Automatisk blokkering</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Automatisk blokkering</h2>

<p>Med automatisk blokkering kan du forhindre uautorisert p&aring;logging. N&aring;r du har aktivert tjenesten, vil en IP-adresse bli blokkert hvis det er for mange mislykkede p&aring;loggingsfors&oslash;k. Mislykkede p&aring;loggingsfors&oslash;k via SSH, Telnet, rsync, Nettverkssikkerhetskopi, Synkronisering av delt mappe, FTP, WebDAV, mobile Synology-applikasjoner, File Station eller DSM vil alle bidra til antallet. Du kan ogs&aring; ha en Liste over tillatte som inkluderer IP-adressene som aldri skal blokkeres.</p>

<h4>For &aring; sette opp automatisk blokkering:</h4>
<ol>
<li>G&aring; til fanen <strong>Generelt</strong> og merk av for <b>Aktiver automatisk blokkering</b>.</li>
<li>Angi et antall for <b>P&aring;loggingsfors&oslash;k</b> og <b>Innenfor (minutter)</b> for &aring; blokkere en IP-adress etter et angitt antall mislykte p&aring;loggingsfors&oslash;k innenfor angitt antall minutter.</li>
<li>Merk av <b>Aktiver utl&oslash;psdato for blokkering</b> og angi et tall for &aring; fjerne en blokkert IP-adresse etter et angitt antall dager.  Blokkerte IP-adresser vil forbli p&aring; blokkeringslisten p&aring; ubestemt tid hvis den ikke fjernes fra listen manuelt, hvis dette alternativet ikke er valgt, eller hvis <b>Opphev blokkering etter (dager)</b> er angitt til 0.</li>

<li>Klikk p&aring; <b>Bruk</b>.</li>
</ol>

<h4>Slik legger du til blokkerte IP-adresser:</h4>
<p>Klikk p&aring; <strong>Blokkeringsliste</strong>-fanen og velg ett av f&oslash;lgende fra rullegardinmenyen <strong>Opprett</strong>: </p>
<ul>
<li><strong>Legg til IP-adresse</strong></li>
<p>Angi en IP-adresse og still inn utl&oslash;pstiden.<p/>
<li><strong>Importer liste over IP-adresser</strong></li>
<p>Importer en tekstfil som lister opp IP-adresser for &aring; legge til flere IP-adresser og stille inn utl&oslash;pstiden samtidig. Merk av i den egnede boksen hvis du vil overskrive eksisterende IP-adresser. Hvis dette alternativet ikke velges, vil dupliserte IP-adresser bli hoppet over.</p>
<p>For &aring; importere en fil, m&aring; filen m&oslash;te f&oslash;lgende kriterier:</p>
<ul>
<li>Filen m&aring; v&aelig;re en vanlig tekstfil.</li>
<li>Hver linje i filen kan inneholde kun &eacute;n IP-adresse.</li>
<li>Kommentarlinjer begynner med et # (pundtegn).</li>
<p>Hvis filen du velger har korrekt format, vil du se alle IP-adressene i omr&aring;det for forh&aring;ndsvisning. Klikk p&aring; <strong>OK</strong> for &aring; importere.</p>
</ul>
</ul>

<h4>Slik fjerner du blokkerte IP-adresser:</h4>
<ol>
<li>
Klikk p&aring; fanen <b>Blokkeringsliste</b> for &aring; se de blokkerte IP-adressene.
</li>
<li>
Velg IP-adressene du vil fjerne fra listen og klikk p&aring; <b>Fjern</b>.
</li>
</ol>


<h4>Slik legger du til tillatte IP-adresser:</h4>
<p>Klikk p&aring; <strong>Liste over tillatte</strong>-fanen og velg ett av f&oslash;lgende fra rullegardinmenyen <strong>Opprett</strong>: </p>
<ul>
<li><strong>Legg til IP-adresse</strong></li>
<p>Angi en IP-adresse.<p/>
<li><strong>Importer liste over IP-adresser</strong></li>
<p>Importer en tekstfil som lister opp IP-adresser for &aring; legge til flere IP-adresser samtidig. Merk av i den egnede boksen hvis du vil overskrive eksisterende IP-adresser. Hvis dette alternativet ikke velges, vil dupliserte IP-adresser bli hoppet over.</p>
<p>For &aring; importere en fil, m&aring; filen m&oslash;te f&oslash;lgende kriterier:</p>
<ul>
<li>Filen m&aring; v&aelig;re en vanlig tekstfil.</li>
<li>Hver linje i filen kan inneholde kun &eacute;n IP-adresse.</li>
<li>Kommentarlinjer begynner med et # (pundtegn).</li>
<p>Hvis filen du velger har korrekt format, vil du se alle IP-adressene i omr&aring;det for forh&aring;ndsvisning. Klikk p&aring; <strong>OK</strong> for &aring; importere.</p>
</ul>
</ul>

<h4>Slik fjerner du tillatte IP-adresser:</h4>
<ol>
<li>
Klikk p&aring; fanen <b>Liste over tillatte</b> for &aring; se de tillatte IP-adressene.
</li>
<li>
Velg IP-adressene du vil fjerne fra listen og klikk p&aring; <b>Fjern</b>. </li>
</ol>


</body>
</html>
