<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Delt mappe</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Delt mappe</h1>
<p>Delte mapper er grunnleggende kataloger hvor du kan lagre filer og mapper p&aring; din DiskStation. F&oslash;r du lagrer filer p&aring; din DiskStation, m&aring; du opprette minst &eacute;n delt mappe. Data som lagres i delte mapper kan holdes privat eller deles med spesifikke brukere eller brukergrupper i henhold til egendefinerbare tilgangstillatelser. I tillegg kan du kryptere delte mapper under oppretting, og dermed legge til et ytterligere lag med beskyttelse. </p>

<h3>Standard delte mapper</h3>

<p>Nedenfor er en liste over delte mapper som opprettes automatisk n&aring;r bestemte programmer, tjenester eller pakker installeres eller aktiveres.</p> 

<table>
<tr>
<th>Navn</th>
<th>Beskrivelse</th>
</tr>
<tr>
<th>public</th>
<td>Mappen <strong>public</strong> opprettes automatisk n&aring;r din DiskStation er satt opp for f&oslash;rste gang.*</td>
</tr>
<tr>
<th>web</th>
<td>Mappen <strong>web</strong> er standard lagringsplassering for innholdet til et webomr&aring;de som vertes p&aring; DiskStation. Den opprettes automatisk n&aring;r <strong>Web Station</strong> aktiveres.</td>
</tr>
<tr>
<th>photo</th>
<td>Mappen <strong>photo</strong> brukes til fotografier og videoer du vil dele med Photo&nbsp;Station. Den opprettes automatisk n&aring;r <strong>Photo Station</strong> eller <strong>DLNA/UPnP-mediaserver</strong> aktiveres.</td>
</tr>
<tr>
<th>music</th>
<td>Mappen <strong>music</strong> brukes til &aring; lagre musikk du vil lytte til med Audio Station. Den opprettes automatisk n&aring;r <strong>Audio Station</strong> aktiveres.</td>
</tr>
<tr>
<th>video</th>
<td>Mappen <strong>video</strong> brukes til &aring; lagre videofiler du vil bla gjennom med DLNA/UPnP-enheter. Den opprettes automatisk n&aring;r <strong>Mediaserver</strong> aktiveres.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Mappen <strong>surveillance</strong> brukes til &aring; lagre Surveillance&nbsp;Station-opptak. Den opprettes automatisk n&aring;r <strong>Surveillance Station</strong> aktiveres. Den er skrivebeskyttet og bare systemadministratoren f&aring;r tilgang til den.</td>
</tr>
<tr>
<th>home</th>
<td>Mappen <strong>home</strong> gir deg et privat sted hvor hver bruker kan lagre data der ingen andre brukere har tilgang. Den opprettes automatisk n&aring;r funksjonen <strong>Brukerhjem</strong> aktiveres.</td>
</tr>
<tr>
<th>homes</th>
<td>Mappen <strong>homes</strong> inneholder home-mappene for alle brukere. Den opprettes automatisk n&aring;r funksjonen <strong>Brukerhjem</strong> aktiveres. Bare systemadministratoren har tilgang til og kan administrere alle brukeres home-mapper.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Mappen <strong>NetBackup</strong> opprettes automatisk n&aring;r <strong>Nettverkssikkerhetskopi</strong> aktiveres.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Mappen <strong>usbshare[nummer]</strong> opprettes automatisk n&aring;r du kobler til en ekstern USB-diskenhet i USB-porten til DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Mappen <strong>satashare</strong> opprettes automatisk n&aring;r du kobler til en ekstern eSATA-diskenhet i eSATA-porten til DiskStation.*</td>
</tr>
</table>

<p>____<br> * Kun tilgjengelig p&aring; visse modeller.</p>

</body>
</html>
