<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bruker</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Passordinnstillinger</h2>
<p>Klikk p&aring; knappen <strong>Passordinnstillinger</strong> for &aring; vise og endre innstillingene som er beskrevet nedenfor.</p>

<h3>Tilbakestill glemte passord</h3>
<p>Denne seksjonen inkluderer et alternativ som er merket med <strong>Tillat at brukere som ikke er admin kan tilbakestille glemte passord via e-post</strong>. N&aring;r dette alternativet er aktivert, vil en kobling som er merket med <strong>Har du glemt passordet ditt?</strong> vises p&aring; innloggingssiden for DSM. Hvis en bruker glemmer passordet sitt, kan han klikke p&aring; denne koblingen og angi brukernavnet sitt. I s&aring; tilfelle, vil systemet sende en melding til brukeren med en kobling for &aring; tilbakestille det glemte passordet. </p>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>F&oslash;r du aktiverer dette alternativet, m&aring; du forsikre deg om at du allerede har aktivert SMTP-e-postvarslinger. For &aring; gj&oslash;re dette, g&aring;r du til <strong>Kontrollpanel</strong> &gt; <strong>Varsling</strong> &gt; <strong>Generelt</strong>. Hvis varslinger ikke er aktivert, vil ikke systemet kunne sende meldinger til brukere som &oslash;nsker &aring; tilbakestille passordene sine.</li>
<li>For &aring; motta meldinger fra systemet, m&aring; brukere oppgi en e-postadresse i kontoseksjonen for brukerinformasjon.</li>
<li>Brukere som tilh&oslash;rer gruppen <strong>administrators</strong> kan ikke tilbakestille passord med dette alternativet.</li>
<li>Domenebrukere kan ikke tilbakestille passord med dette alternativet.</li>
<li>LDAP-brukere kan tilbakestille passord med dette alternativet, s&aring; lenge DiskStation tjener som LDAP-katalogserver.</li>

</ul>
</div>


<h3>Passordstyrke</h3>
<p>Du kan sette opp regler for passordstyrke for brukere p&aring; din DiskStation.</p>

<div class="section">
<h4>Merk:</h4>
<p>Regler for passordstyrke gjelder kun for nye passord. For eksempel, nye regler for passordstyrke gjelder kun n&aring;r man oppretter en ny brukerkonto eller n&aring;r en eksisterende bruker endrer passordet sitt. Eksisterende passord og de som tilh&oslash;rer importerte brukerkontoer er unntatt de nye passordreglene.</p>
</div>
<h4>Slik aktiverer du regler for passordstyrke:</h4>
<ol>
<li>Merk av for <b>Bruk regler for passordstyrke</b> for &aring; aktivere passordbegrensninger.</li>
<li>Velg mer enn &eacute;n av passordbegrensningene fra reglene nedenfor:</li>
<ul>
<li><b>Ekskluder navn og beskrivelse av bruker fra passord</b>: Passordet m&aring; ikke inneholde brukernavnet eller brukerbeskrivelsen. Men UTF-8 utvidede tegn er ekskludert.</li>
<li><b>Tillatt blanding av sm&aring; og store bokstaver</b>: En blanding av store og sm&aring; bokstaver er tillatt i passord.</li>
<li><b>Inkluder numerisk tegn</b>: Passordet m&aring; inneholde minst ett numerisk tegn (0~9).</li>
<li><b>Inkluder spesialtegn</b>: Passordet m&aring; inneholde minst ett ASCII-spesialtegn (f.eks. ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Minimal passordlengde</b>: Passordet m&aring; minst v&aelig;re verdien som er spesifisert i tekstfeltet. Lengden m&aring; v&aelig;re et tall mellom 6 og 127.</li>
</ul>
<li>Klikk p&aring; <b>Bruk</b> for &aring; lagre innstillingene.</li>
</ol>
 
</body>
</html>

