<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Z&aacute;lohov&aacute;n&iacute; a&nbsp;replikace</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Z&aacute;loha&nbsp;LUN</h2>
<p>Na kartě <b>Z&aacute;lohov&aacute;n&iacute;</b> v&nbsp;č&aacute;sti <b>Z&aacute;lohov&aacute;n&iacute; &amp; replikace</b> můžete pomoc&iacute; funkce <b>M&iacute;stn&iacute; z&aacute;loha&nbsp;LUN</b> z&aacute;lohovat jednotky iSCSI&nbsp;LUN zař&iacute;zen&iacute; DiskStation do m&iacute;stn&iacute;ch sd&iacute;len&yacute;ch složek. Pomoc&iacute; možnosti <b>S&iacute;ťov&aacute; z&aacute;loha&nbsp;LUN</b> můžete prov&aacute;dět z&aacute;lohu na dal&scaron;&iacute; zař&iacute;zen&iacute; DiskStation.</p>

<h4>Postup z&aacute;lohov&aacute;n&iacute; jednotky iSCSI&nbsp;LUN:</h4>
<ol>
<li>
Vyberte možnost <b>Vytvořit</b> &gt; <b>&Uacute;loha z&aacute;lohov&aacute;n&iacute;&nbsp;LUN</b>, otevřete <b>Průvodce z&aacute;lohov&aacute;n&iacute;m&nbsp;LUN</b> a&nbsp;klikněte na možnost <b>Dal&scaron;&iacute;</b>.
</li>
<li>
Pokud budete vyzv&aacute;n&iacute; k&nbsp;zad&aacute;n&iacute; typu c&iacute;lov&eacute; jednotky, vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch akc&iacute;:
</li>
<ul>
<li>
<b>M&iacute;stn&iacute; z&aacute;loha&nbsp;LUN</b>: Pomoc&iacute; t&eacute;to možnosti provedete z&aacute;lohov&aacute;n&iacute; jednotky&nbsp;LUN ze zař&iacute;zen&iacute; DiskStation do m&iacute;stn&iacute; sd&iacute;len&eacute; složky nebo na extern&iacute; &uacute;loži&scaron;tě, kter&eacute; je připojeno k&nbsp;portu&nbsp;USB nebo eSATA zař&iacute;zen&iacute; DiskStation.
</li>
<li><b>S&iacute;ťov&aacute; z&aacute;loha&nbsp;LUN</b>: Pomoc&iacute; t&eacute;to možnosti provedete z&aacute;lohov&aacute;n&iacute; jednotky&nbsp;LUN ze zař&iacute;zen&iacute; DiskStation na jin&eacute; zař&iacute;zen&iacute; DiskStation.
</li>
</ul>
<li>
Pokud k&nbsp;tomu budete vyzv&aacute;ni, zadejte c&iacute;l z&aacute;lohov&aacute;n&iacute; a&nbsp;zdrojovou jednotku&nbsp;LUN a&nbsp;nastavte pl&aacute;n z&aacute;lohov&aacute;n&iacute;.
</li>
<li>
Nastaven&iacute; dokončete pomoc&iacute; průvodce.
</li>
</ol>
<p>Po vytvořen&iacute; z&aacute;lohy provede zař&iacute;zen&iacute; DiskStation &uacute;lohu z&aacute;lohov&aacute;n&iacute; podle pl&aacute;nu a&nbsp;ulož&iacute; z&aacute;lohovanou jednotku&nbsp;LUN do c&iacute;lov&eacute;ho um&iacute;stěn&iacute;. Z&aacute;lohovan&aacute; jednotka&nbsp;LUN se použ&iacute;v&aacute; pouze pro &uacute;čely z&aacute;lohov&aacute;n&iacute;. V&iacute;ce informac&iacute; o&nbsp;př&iacute;stupu k&nbsp;z&aacute;loze jednotky&nbsp;LUN najdete v&nbsp;č&aacute;sti <a href="restore.html">Obnoven&iacute; z&aacute;lohy&nbsp;LUN</a>.</p>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Jednotky LUN s běžnými soubory i jednotky LUN na úrovni bloků budou v cílovém umístění zálohovány jako bitové kopie souborů. Po obnovení budou všechny jednotky LUN na úrovni bloků změněny na jednotky LUN se soubory.</li>
<li>Jednotliv&eacute; &uacute;lohy z&aacute;lohov&aacute;n&iacute; mohou obsahovat pouze jednu jednotku&nbsp;LUN jako zdroj z&aacute;lohov&aacute;n&iacute;.</li>
<li>Jednotky&nbsp;LUN nelze z&aacute;lohovat na extern&iacute; disk s&nbsp;form&aacute;ty FAT, FAT32, HFS, HFS Plus nebo NTFS.</li>
<li>Před spu&scaron;těn&iacute;m s&iacute;ťov&eacute; z&aacute;lohy&nbsp;LUN se přihlaste k&nbsp;zař&iacute;zen&iacute; DiskStation a&nbsp;přesvědčte se, zda byla služba s&iacute;ťov&eacute; z&aacute;lohy v&nbsp;č&aacute;sti <b>Z&aacute;lohov&aacute;n&iacute; a&nbsp;replikace</b> &gt; <b>Služby z&aacute;lohov&aacute;n&iacute;</b> povolena.</li>
<li>Pokud se zař&iacute;zen&iacute; DiskStation připojuje k&nbsp;s&iacute;ti pomoc&iacute; směrovače, ověřte, zda jste před spu&scaron;těn&iacute;m s&iacute;ťov&eacute; z&aacute;lohy&nbsp;LUN nastavili pravidla pro před&aacute;v&aacute;n&iacute; portů pro službu iSCSI (port TCP 3260).</li>
</ul>
</div>


<div class="section">
<h4>&Uacute;pln&eacute; a&nbsp;př&iacute;růstkov&eacute; z&aacute;lohov&aacute;n&iacute;:</h4>
<p>
Zař&iacute;zen&iacute; DiskStation provede nejdř&iacute;ve &uacute;plnou z&aacute;lohu vybran&yacute;ch jednotek&nbsp;LUN a&nbsp;pot&eacute; př&iacute;růstkovou z&aacute;lohu. Pokud v&scaron;ak dojde ke změně n&aacute;zvu sd&iacute;len&eacute; složky nebo adres&aacute;ře, zař&iacute;zen&iacute; DiskStation provede &uacute;plnou z&aacute;lohu stejn&eacute; &uacute;lohy.
</p>
</div>
</body></html>
