
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Administrar opciones de File Station - Ayuda de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Learn how to customize File Station settings related to file management, shared links, and security.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Enviar archivos como archivos adjuntos de correo electr&oacute;nico</h2>

<p>Puede enviar archivos directamente como archivos adjuntos de correo electr&oacute;nico en <strong>File Station </strong>haciendo clic con el bot&oacute;n secundario en los archivos seleccionados y seleccionando a continuaci&oacute;n <strong>Enviar como archivos adjuntos de correo electr&oacute;nico</strong>. Aparecer&aacute; una ventana de correo electr&oacute;nico con varias caracter&iacute;sticas &uacute;tiles:</p>
<ul>
<li>Para: Si ha sincronizado varios contactos para su cuenta de correo electr&oacute;nico, aparecer&aacute; una lista de contactos, mostrando los contactos sincronizados asociados a su cuenta de correo electr&oacute;nico.</li>
<li>Desde: Puede seleccionar la cuenta de correo electr&oacute;nico predetermina u otra cuenta de correo electr&oacute;nico agregada. La lista de contactos cambiar&aacute; de forma autom&aacute;tica a la cuenta de correo electr&oacute;nico seleccionada.</li>
<li>Archivos adjuntos: Los archivos adjuntos seleccionados aparecen al final del correo electr&oacute;nico. Puede a&ntilde;adir m&aacute;s archivos adjuntos usando el bot&oacute;n de archivos adjuntos.</li>
</ul>

<div class="section">
  <h4>Nota:</h4>
  <ul>
    <li>Solo se pueden a&ntilde;adir archivos como archivos adjuntos.</li>
    <li>Puede cargar hasta 10 archivos en un solo correo electr&oacute;nico.</li>
    <li>El tama&ntilde;o total m&aacute;ximo de archivos de todos los archivos adjuntos en un solo correo electr&oacute;nico depender&aacute; de su servicio de correo electr&oacute;nico. Si no est&aacute; seguro, recomendamos que limite el tama&ntilde;o total de todos los archivos adjuntos a 25&nbsp;MB. </li>
  </ul>
</div>
</body>
</html>
