<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Cargar archivos o carpetas</h2>
<p>Use cualquiera de los m&eacute;todos siguientes para cargar archivos o carpetas desde su equipo a DiskStation.</p>
<p>Para tener total acceso a las funciones de carga que aparecen a continuaci&oacute;n, debe instalar primero la &uacute;ltima versi&oacute;n de Java Runtime Environment (JRE) y Flash Player. </p>


<h4>M&eacute;todo 1:</h4>
<ol>
<li>
Desde la parte superior del panel izquierdo, seleccione una carpeta de destino en DiskStation. 
</li>
<li>
Haga clic en <b>Cargar</b>, elija <strong>Cargar - Omitir</strong> o en <strong>Cargar - Sobrescribir</strong> y seleccione archivos o carpetas de su ordenador local. </li>
</ol>
<h4>M&eacute;todo 2:</h4>
<ol>
	<li>Vaya a <strong>Configuraci&oacute;n</strong>, marque <strong>Examinar archivos desde ordenador local con File Station</strong> y actualice la p&aacute;gina web para ver las carpetas de su ordenador local en la parte inferior del panel izquierdo.</li>
<div class="section">
<h4>Nota:</h4>
<p>La opci&oacute;n <strong>Examinar archivos desde ordenador local con File Station</strong> solo funcionar&aacute; tras haber instalado y habilitado JRE en su equipo.</p>
</div>
	<li>Desde la parte inferior del panel izquierdo, elija una carpeta de su equipo local. La secci&oacute;n principal muestra ahora el contenido de la carpeta seleccionada.
	</li>
	<li>Elija los archivos o carpetas que desee en la secci&oacute;n principal y haga clic en <b>Cargar</b>. 
</li>
	<li>Elija una carpeta de destino en DiskStation en la ventana que aparezca.
	</li>
	<li>En el v&eacute;rtice superior derecho de la ventana, seleccione <b>Sobrescribir</b> si desea sobrescribir archivos o carpetas con el mismo nombre en la carpeta de destino. En caso contrario, seleccione <b>Omitir</b>.
</li>
	<li>Haga clic en <b>OK</b> para iniciar la carga.
</li>
</ol>
<h4>M&eacute;todo 3:</h4>
<ol>
<li>Vaya a <strong>Configuraci&oacute;n</strong>, marque <strong>Examinar archivos desde ordenador local con File Station</strong> y actualice la p&aacute;gina web para ver las carpetas de su ordenador local en la parte inferior del panel izquierdo.</li>
<li>
En el panel izquierdo, arrastre una carpeta desde su equipo (la parte inferior) a cualquier carpeta de DiskStation (la parte superior).
</li>
<li>
En el men&uacute; emergente que aparece, elija si desea sobrescribir u omitir archivos/carpetas con el mismo nombre en la carpeta de destino.
</li>
</ol>
<h4>M&eacute;todo 4:</h4>
<ol>
<li>
Desde la parte superior del panel izquierdo, seleccione una carpeta de destino en DiskStation.
</li>

<li>
Seleccione los archivos en el escritorio del equipo o en el Explorador de archivos (por ejemplo, Explorador de Windows o Finder de Mac) y arr&aacute;strelos y su&eacute;ltelos en File Station en el navegador web.
</li>

<li>
En el cuadro de di&aacute;logo que aparece, elija si desea sobrescribir u omitir archivos con el mismo nombre en la carpeta de destino.</li>
<div class="section">
<h4>Nota:</h4>
<ul>
<li><b>M&eacute;todo 4</b> solo es compatible con determinados exploradores: Chrome, Firefox, Safari 5.1 o posterior. Sin embargo, no es compatible con Mac cuando la opci&oacute;n <strong>Examinar archivos desde ordenador local con File Station</strong> est&aacute; activada.</li>
<li>
Tambi&eacute;n puede arrastrar y soltar carpetas o archivos vac&iacute;os, pero solo cuando la opci&oacute;n <strong>Examinar archivos desde ordenador local con File Station</strong> est&eacute; activada para los exploradores indicados anteriormente. De lo contrario, no podr&aacute; cargar carpetas y archivos vac&iacute;os utilizando el <strong>M&eacute;todo 4</strong>.</li>
	<li>
Si utiliza Chrome for Linux e inicia sesi&oacute;n en DSM mediante el protocolo HTTPS, deber&aacute; importar un certificado de confianza (en <b>Panel de control</b> &gt; <b>Seguridad</b> &gt; <strong>Certificado</strong>) para poder cargar con el <b>M&eacute;todo 4</b>.
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Nota:</h4>
<ol>
<li>
Puede a&ntilde;adir hasta 1000 archivos a su cola de carga.
</li>
	<li>
	Puede cargar archivos con un tama&ntilde;o de hasta 4 GB si utiliza Google Chrome, Firefox, Safari 5.1 o posterior, o cuando la opci&oacute;n <strong>Examinar archivos desde ordenador local con File Station</strong> est&eacute; activada. En caso contrario, solo podr&aacute; cargar hasta 2 GB de archivos al mismo tiempo.</li>
	<li>
En una carpeta compartida sin cifrar, el nombre de archivo/carpeta debe tener un m&aacute;ximo de 255 caracteres (hasta unos 80 caracteres para idiomas no latinos); en una carpeta compartida cifrada, debe tener un m&aacute;ximo de 143 caracteres (hasta unos 47 caracteres para idiomas no latinos).
</li>
<li>
En el nombre de archivo/carpeta no pueden aparecer los siguientes caracteres: \ / : * ? &quot; &gt; |.
</li>
<li>
El nombre de archivo o carpeta no puede empezar por &quot;._&quot;.
</li>
<li>Solo puede cargar archivos con un tama&ntilde;o de 0 KB cuando haya instalado JRE.</li>
</ol>
</div>


<div class="section">
<h4>Soluci&oacute;n de problemas</h4>
<p>Si no puede explorar correctamente elementos locales almacenados en su Mac con Safari, haga lo siguiente:</p>
<ol>
<li>En su Mac, abra safari y elija <strong>Preferencias</strong> en el men&uacute; de Safari.</li>
<li>Haga clic en <strong>Administrar configuraci&oacute;n de sitios web</strong> en la pesta&ntilde;a <strong>Seguridad</strong>.</li>
<li>En <strong>Java</strong>, elija su &quot;website&quot; DSM.</li>
<li>Seleccione <strong>Ejecutar en modo no seguro</strong>.</li>
</ol>
</div>



</body>
</html>
