<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Limita&ccedil;&otilde;es e Requisitos do Sistema - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article explains the limitations of the Synology High Availability package.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 </head>
 <body>
 
 
<h2>Limita&ccedil;&otilde;es e Requisitos do Sistema</h2>

 <p>A implementa&ccedil;&atilde;o do Synology High Availability requer dois servidores Synology id&ecirc;nticos para funcionarem como servidor ativo e passivo. Antes que os dois servidores sejam combinados num cluster de high-availability, o sistema verificar&aacute; as seguintes limita&ccedil;&otilde;es de hardware e de software para garantir a cria&ccedil;&atilde;o de um cluster de high-availability.</p>
 
  
 <h3>Requisitos do Sistema</h3>
 
  <p>Tenha em aten&ccedil;&atilde;o as seguintes diretrizes sobre software e hardware:</p>
  <ul>
   <li><b>Servidor Synology:</b> Quer os servidores activo e passivo t&ecirc;m de ser modelos id&ecirc;nticos.</li>
   <li><b>Unidade(s) de expans&atilde;o:</b> Quer os servidores activo e passivo t&ecirc;m de estar ligados correctamente &agrave;s mesmas unidades de expans&atilde;o.</li>
   <li><b>N&uacute;mero e Tipo de Unidades:</b> O tipo de unidade deve ser apenas SAS. Antes de instalar o DSM, tem de instalar pelo menos 3 unidade na(s) unidade(s) de expans&atilde;o.</li>
   <li><b>Dispositivo USB Externo:</b> Apenas o armazenamento USB &eacute; suportado. Outros dispositivos USB externos (por ex., UPS, dongle Wi-Fi, Altifalante, Impressora, dongle Bluetooth e dongle DVB) n&atilde;o s&atilde;o suportados. O armazenamento USB pode ser usado apenas no servidor activo, e n&atilde;o pode ser mudado para o servidor passivo.</li>

  </ul>

  <h3>Ambiente de Rede</h3>
  <p>Tenha em aten&ccedil;&atilde;o as seguintes diretrizes sobre defini&ccedil;&otilde;es de rede quando tentar formar um cluster de high-availability.</p>
  <ul>
    <li><b>Defini&ccedil;&otilde;es de Rede:</b> A liga&ccedil;&atilde;o Heartbeat entre os dois servidores tem de estar configurada correctamente. Ambos os servidores t&ecirc;m de pertencer &agrave; mesma subrede, e &eacute; necess&aacute;rio configurar endere&ccedil;os IP est&aacute;ticos ap&oacute;s a instala&ccedil;&atilde;o.</li>
    <li><b>N&uacute;mero de Portas LAN:</b> Ambos os servidores devem ter o mesmo n&uacute;mero de portas LAN. Se um dos seus modelos DiskStation estiver equipado com interfaces de placas de rede adicionais, a outra tem de estar equipada com as mesmas interfaces de placa de rede. </li>
    <li><b>Restri&ccedil;&otilde;es de Liga&ccedil;&atilde;o:</b> Rede Wi-Fi n&atilde;o &eacute; compat&iacute;vel com o cluster high-availability.</li>

  </ul>
  <div class="section">
    <h4>Nota:</h4>
    <ul>
      <li>O servidor NTP ser&aacute; automaticamente activado no servidor activo.</li>
    </ul>
  </div>

<h3>Limita&ccedil;&otilde;es de Pacote e Software</h3> 

<p>Consulte as limita&ccedil;&otilde;es relacionadas com o pacote e software abaixo:</p>
	<ul>
	<li>O cluster high-availability n&atilde;o &eacute; compat&iacute;vel com os seguintes pacotes e funcionalidades:
		<ul><li>Servidor DVBLink</li>
		<li>A funcionalidade para reiniciar/encerrar o cluster de high-availability no CMS</li>
		<li>Time Backup</li>
		</ul>
	</li>
	<li>O cluster high-availability com armazenamento partilhado n&atilde;o pode ser configurado como nem usado juntamente com um cluster high-availability com base em replica&ccedil;&atilde;o.</li>
    </ul>

<h3>Unidades de Expans&atilde;o Espec&iacute;ficas</h3>
  <p>Quer os servidores activo e passivo t&ecirc;m de estar ligados &agrave;s unidades de expans&atilde;o espec&iacute;ficas. H&aacute; dois modelos em cada unidade de expans&atilde;o.</p>
  <h4>Para configurar/adicionar unidades de expans&atilde;o:</h4>
  <ul>
    <li>Um m&oacute;dulo cont&eacute;m duas portas; a porta de entrada, no lado esquerdo, e a porta de sa&iacute;da no lado direito. Ligue um cabo SAS da porta de sa&iacute;da de um m&oacute;dulo &agrave; porta de entrada do m&oacute;dulo da unidade de expans&atilde;o seguinte.</li>
	<li>As unidades de expans&atilde;o t&ecirc;m de estar ligados em s&eacute;rie com os m&oacute;dulos nos lados correspondentes para cada servidor.</li>
    <li>Quer os servidores activo e passivo t&ecirc;m de estar ligados &agrave;s unidades de expans&atilde;o partilhadas pela mesma ordem.</li>
  </ul>


<div class="section">
<h4>Notas:</h4>
<p>Para obter informa&ccedil;&otilde;es detalhadas sobre a instala&ccedil;&atilde;o da unidade de expans&atilde;o, n&atilde;o se esque&ccedil;a de consultar o Guia de Instala&ccedil;&atilde;o para os seus servidores e unidades de expans&atilde;o.</p>
</div>

   
 </body>
</html>
