<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 </head>
 <body>
 <h2>Rede</h2>
	<p>Esta p&aacute;gina cont&eacute;m o diagrama e tabela de estado das interfaces de rede.</p>
	<h3>Diagrama da Interface</h3>
	<p>Mostra o item seleccionado na tabela, e s&atilde;o usadas cores diferentes para apresentar interfaces de rede 1Gbps e 10Gbps.</p>
  <h3>Tabela de Estado da Interface</h3>
	<p>Mostra o estado da interface em ambos servidores, e se a interface est&aacute; ou n&atilde;o monitorizada. Esta tabela mostra as seguintes informa&ccedil;&otilde;es:</p>
  <ul>
    <li><b>Interface de Rede:</b> Mostra as interfaces f&iacute;sicas de rede nos servidores.</li>
    <li><b>Servidor Activo:</b> Mostra o estado da interface e velocidade de liga&ccedil;&atilde;o no servidor activo.</li>
    <li><b>Servidor Passivo/Servidor Desconhecido:</b> Mostra o estado da interface e velocidade de liga&ccedil;&atilde;o no servidor passivo. Esta coluna ir&aacute; mostrar o nome correspondente ao estado do servidor.</li>
	<li><b>Bond:</b> Mostra as defini&ccedil;&otilde;es da liga&ccedil;&atilde;o de agrega&ccedil;&atilde;o.</li>
	<li><b>Estado:</b> Mostra o estado de rede se a interface estiver monitorizada. Poder&aacute; tamb&eacute;m mostrar os seguintes estados:
		<ul>
			<li><b>Aviso:</b> A liga&ccedil;&atilde;o falha no servidor passivo, ou a interface tem diferentes velocidades de liga&ccedil;&atilde;o nos dois servidores;</li>
			<li><b>Erro:</b> A liga&ccedil;&atilde;o falha no servidor activo; </li>
			<li><b>Normal:</b> Nenhuma falha.</li>
		</ul>
	</li>
	<li><b>Monitorizar:</b> Mostra se a interface est&aacute; monitorizada. Aceda a <b>Monitorizar</b> &gt; <b>Interface de Rede</b> para assinalar/desmarcar a caixa de verifica&ccedil;&atilde;o <b>Monitorizar</b>.</li>
  </ul>
</body>
</html>
