<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 </head>
 <body>
<h2>Encerrar e Substituir o Servidor</h2>
<p>As seguintes instru&ccedil;&otilde;es ajud&aacute;-lo-&atilde;o durante o procedimento de encerramento, ou mudan&ccedil;a de um servidor num cluster de high-availability.</p>

<h4> Para encerrar o cluster de high-availability com Gestor de High Availability:</h4>
<p>Quando desejar encerrar um cluster de high-availability para transportar os servidores para um novo local f&iacute;sico ou realizar manuten&ccedil;&atilde;o, siga estas instru&ccedil;&otilde;es.</p>
  <ol>
<li>Inicie a sess&atilde;o no DSM.</li>
<li>V&aacute; at&eacute; ao <b>Gestor de High Availability</b>.</li>
<li>Clique no bot&atilde;o marcado <b>Gerir</b>.</li>
<li>Seleccione <b>Encerrar cluster de high-availability</b>.</li>
<li>&Eacute; exibida uma mensagem de confirma&ccedil;&atilde;o.Clique em <b>OK</b> para confirmar.</li>
  </ol>

<h4>Para encerrar manualmente um cluster de high-availability:</h4>
<p>O cluster de high-availability tamb&eacute;m pode ser encerrado usando manualmente os bot&otilde;es de energia em cada servidor. </p>
  <ol>
<li>Prima longamente o bot&atilde;o de energia no servidor passivo at&eacute; emitir um som, e aguarde at&eacute; que o servidor encerre completamente.</li>
<li>Prima longamente o bot&atilde;o de energia no servidor activo at&eacute; emitir um som, e aguarde at&eacute; que o servidor encerre completamente.</li>
  </ol>
<div class="section"><h4>Nota:</h4>
	<ul>
	  <li><b>Ligar Servidores:</b><br/>Quando pretender ligar de novo os servidores, deve ligar tanto o servidor activo como passivo ao mesmo tempo (ou com um intervalo de cinco minutos entre si).Se apenas ligar um dos servidores, este ir&aacute; tentar ligar o outro servidor emitindo uma mensagem Despertar pela LAN.</li>
	  <li><b>Encerramento Anormal:</b><br/>No cluster de high-availability a op&ccedil;&atilde;o de reiniciar ap&oacute;s falha de energia est&aacute; activada.Se os servidores encerrarem de forma anormal devido a uma falha de energia, ligar-se-&atilde;o automaticamente assim que for restaurada a energia.</li>
	</ul>
</div>

<h4>Para substituir um servidor num cluster de high-availability:</h4>
<p>Quando desejar remover um servidor e configurar outro servidor, siga estas instru&ccedil;&otilde;es.</p>
  <ol>
<li>Aceda &agrave; p&aacute;gina <b>Vis&atilde;o geral</b>.</li>
<li>Clique no bot&atilde;o <b>Gerir</b>.</li> 
<li>Seleccione <b>Encerrar Servidor Activo</b> ou <b>Encerrar Servidor Passivo</b> para encerrar o servidor que deseja substituir.</li>
<li>Verifique as liga&ccedil;&otilde;es do novo servidor.Depois de ligado o novo servidor, ser&aacute; marcado como &ldquo;desconhecido&rdquo; no Gestor de High Availability.</li>
<li>Aceda novamente &agrave; p&aacute;gina <b>Vis&atilde;o geral</b>.</li>
<li>Clique no bot&atilde;o <b>Gerir</b>.</li> 
<li>Seleccione <b>Recuperar servidor desconhecido</b> para que &ldquo;servidor desconhecido&rdquo; seja adicionado ao cluster de high-availability e reconhecido no servidor passivo.</li>
  </ol>

 </body>
</html>
