<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 </head>
 <body>
<h2>Split-brain</h2>

<p>Quando um cluster de high-availability estiver a funcionar normalmente, s&oacute; um dos servidores membros dever&aacute; ser o servidor activo. Neste caso, o servidor passivo detecta a presen&ccedil;a do servidor activo atrav&eacute;s da liga&ccedil;&atilde;o Heartbeat bem como a liga&ccedil;&atilde;o de dados com as unidades de expans&atilde;o partilhadas, para que a mudan&ccedil;a n&atilde;o seja activada. Para al&eacute;m disso, o servidor passivo detecta o estado do armazenamento partilhado, para evitar assumir de forma err&oacute;nea o papel do servidor activo quando o servidor activo actual ainda acede &agrave;s unidades de expans&atilde;o partilhadas de forma normal.</p>

<p>Com a perda das liga&ccedil;&otilde;es Heartbeat e de todos os dados, ou o estado inst&aacute;vel do armazenamento partilhado e do sistema, cada um dos dois servidores poder&aacute; assumir o papel de servidor activo. Esta situa&ccedil;&atilde;o &eacute; denominada como &quot;split-brain&quot;. Neste caso, para evitar a corrup&ccedil;&atilde;o de dados devido ao acesso simult&acirc;neo de ambos servidores, um servidor ir&aacute; tentar continuar a fornecer servi&ccedil;os, ao passo que o outro servidor ir&aacute; reiniciar e solicitar uma verifica&ccedil;&atilde;o de liga&ccedil;&atilde;o posteriormente. As liga&ccedil;&otilde;es dos utilizadores clientes podem ficar inst&aacute;veis durante algum tempo nesta situa&ccedil;&atilde;o.</p>
        
 </body>
</html>
