<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Synology Account</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Conta Synology</h2>

<p>Em <strong>Conta Synology</strong>, pode facilmente aceder e gerir as defini&ccedil;&otilde;es dos seus servi&ccedil;os Conta Synology e eNews associados com o seu DiskStation e pacotes. 

<ul>
<li><strong>Conta</strong>: Ver e editar informa&ccedil;&otilde;es da sua Conta Synology.</li>
<li><strong>Hist&oacute;rico de compras</strong>: Percorrer ou pesquisar atividades de compra de pacotes.</li>
<li><strong>eNews</strong>: Selecione uma ou mais categorias de eNews para receber da Synology e personalizar os conte&uacute;dos subscritos.</li>
<li><strong>Terminar Sess&atilde;o</strong>: Cessar todos os servi&ccedil;os de Conta Synology associados com o seu DiskStation.</li>
</ul>

<h4>Para iniciar a sess&atilde;o na sua Conta Synology:</h4>
<ol>
<li>Aceda a <strong>Conta Synology</strong>.</li>
<li>Na janela emergente <strong>Iniciar sess&atilde;o na sua Conta Synology</strong>, introduza o endere&ccedil;o de e-mail e a palavra-passe que utilizou para registar uma Conta Synology.</li>
       <ul>
       <li>Se n&atilde;o disp&otilde;e de uma Conta Synology, clique em <strong>Necessita de uma Conta Synology?</strong> para se registar.</li>
       <li>Se esqueceu a sua palavra-passe, clique em <strong>Esqueceu-se da sua palavra-passe?</strong> para receber por e-mail uma nova palavra-passe.</li>   
       </ul>
<li>Clique em <strong>Iniciar sess&atilde;o</strong> para aceder aos servi&ccedil;os da sua Conta Synology.</li>
</ol>

<h4>Para visualizar e editar a sua Conta Synology:</h4>
<ol>
<li>Clique em <strong>Conta</strong>, no painel esquerdo, para visualizar as informa&ccedil;&otilde;es da sua conta.</li>
<li>Clique no campo para alterar as informa&ccedil;&otilde;es da conta.</li>
<li>Para proteger as defini&ccedil;&otilde;es, clique em <strong>Aplicar</strong>.</li>
</ol>

<h4>Para visualizar o Hist&oacute;rico de Compras do seu DiskStation:</h4>
<ol>
<li>Clique em <strong>Hist&oacute;rico de Compras</strong>, no painel esquerdo.</li>
<li>Escolha qualquer das formas para encontrar o hist&oacute;rico de compras do  DiskStation.
    <ul>
    <li>Para recorrer a palavras-chave, selecione <strong>Procurar por palavra-chave</strong>.
        <ul>
        <li>Introduza a palavra-chave e selecione o filtro adequado.</li>
        </ul>
        </li>
    <li>Para recorrer a data de compra, selecione <strong>Procurar por data</strong>.
        <ul>
        <li>Clique nos &iacute;cones do calend&aacute;rio para especificar um per&iacute;odo de tempo em que comprou o seu DiskStation ou pacotes.</li>        
        </ul>
        </li>
  </ul>
  </li>
<li>Clique em <strong>Procurar</strong>.</li>
<li>As informa&ccedil;&otilde;es de compra de pacotes solicitadas (por exemplo, a data e pre&ccedil;o de compra) ser&atilde;o mostradas.</li>
</ol>




<h4>Para subscrever Synology eNews:</h4>
<ol>
<li>Clique em <strong>eNews</strong> no painel esquerdo.</li>
<li>Em <strong>Defini&ccedil;&otilde;es eNews</strong>, assinale uma ou mais categorias eNews para receber de Synology.</li>
<li>Pode detalhar as defini&ccedil;&otilde;es eNews das listas pendentes:</li>
    <ul>
    <li><strong>Lan&ccedil;amentos de novos produtos e funcionalidades</strong>: Escolha o idioma de subscri&ccedil;&atilde;o.</li>
    <li><strong>Informa&ccedil;&otilde;es em primeira m&atilde;o sobre eventos promocionais locais</strong>: Selecione um pa&iacute;s para saber quais os eventos locais de Synology.</li>
    <li><strong>Actualiza&ccedil;&otilde;es importantes para o DSM</strong>: Selecione uma ou mais vers&otilde;es DSM para as atualiza&ccedil;&otilde;es correspondentes.</li>   
    </ul>
<li>Para proteger as defini&ccedil;&otilde;es, clique em <strong>Aplicar</strong>.</li>
</ol>



<h4>Para terminar sess&atilde;o em Conta Synology:</h4>
<ol>
<li>Clique no bot&atilde;o <strong>Fechar Sess&atilde;o</strong> no canto inferior esquerdo.</li>
<li>Depois de fechar a sess&atilde;o, todos os servi&ccedil;os Conta Synology (por exemplo, DDNS e QuickConnect) e pacotes associados &agrave; conta de in&iacute;cio de sess&atilde;o ficar&atilde;o indispon&iacute;veis para o seu DiskStation.</li>
</ol>



<div class="section">
<h4>Nota:</h4>
<ol>
<li>Depois de alterar o endere&ccedil;o de e-mail, ser&aacute; enviada uma mendsagem de confirma&ccedil;&atilde;o para o novo endere&ccedil;o para verificar a altera&ccedil;&atilde;o.</li>
<li>Depois de fechar a sess&atilde;o, os pacotes permanecer&atilde;o instalados no seu DiskStation, mas as respetivas licen&ccedil;as perdem validade.</li>
</ol>
</div>

</body>
</html>
