<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Organiser et lire les vid&eacute;os avec Video Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Cat&eacute;goriser et lire les vid&eacute;os avec Video Station</h1>
<div class="tutorials_content">

<img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.jpg"/>


<h2>Vue d'ensemble</h2>
<p>Avec Video Station, vous pouvez facilement organiser et cat&eacute;goriser vos collections vid&eacute;o en diff&eacute;rentes biblioth&egrave;ques par d&eacute;faut ou personnalis&eacute;es, afin de trouver la vid&eacute;o que vous voulez beaucoup plus efficacement. En outre, la lecture et le partage des vid&eacute;os peuvent &ecirc;tre tout aussi faciles en quelques simples clics.</p>

<h3 class="list_head">1. Installer Video&nbsp;Station</h3>
<p>Pour installer Video Station, veuillez aller dans <b>Centre de paquets</b>, trouvez <b>Video Station</b>, puis cliquez sur <b>Installer</b>.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/1.png" border="1"/>

<h3 class="list_head">2. Stocker et cat&eacute;goriser les vid&eacute;os dans les biblioth&egrave;ques par d&eacute;faut</h3>
<p>Video Station fournit trois biblioth&egrave;ques par d&eacute;faut comme indiqu&eacute; sur le panneau de gauche&nbsp;: <b>Film</b>, <b>&Eacute;mission de t&eacute;l&eacute;vision</b> et <b>Vid&eacute;o personnelle</b>. Pour &ecirc;tre s&ucirc;r que vos vid&eacute;os pourront &ecirc;tre correctement index&eacute;es et class&eacute;es, vous devez d'abord ajouter des dossiers vid&eacute;o pour chaque biblioth&egrave;que et stocker vos fichiers dans les dossiers vid&eacute;o correspondants. Par d&eacute;faut, trois dossiers vid&eacute;o ont &eacute;t&eacute; cr&eacute;&eacute;s dans le dossier partag&eacute; <b>video</b> pour les trois biblioth&egrave;ques par d&eacute;faut&nbsp;: <b>film</b>, <b>&eacute;mission de t&eacute;l&eacute;vision</b> et <b>vid&eacute;o personnelle</b>. Cependant, en plus de ces trois dossiers, vous pouvez &eacute;galement proc&eacute;der comme suit pour ajouter d'autres dossiers vid&eacute;o pour les biblioth&egrave;ques.</p>

<div class="code_div">
<b>Remarque&nbsp;:</b>
<p>Le syst&egrave;me recherche automatiquement les m&eacute;tadonn&eacute;es associ&eacute;es et d'autres informations (par exemple, l'image de l'affiche) pour deux types de vid&eacute;o (film et &eacute;mission de t&eacute;l&eacute;vision) sur Internet. Ainsi, pour assurer que vos vid&eacute;os pourront &ecirc;tre associ&eacute;es avec les informations correctes, il est fortement recommand&eacute; que les vid&eacute;os correspondent au type de vid&eacute;o sp&eacute;cifi&eacute; de leurs biblioth&egrave;ques respectives.</p>
</div>

<h4>Ajouter des dossiers vid&eacute;o pour les biblioth&egrave;ques par d&eacute;faut</h4>
<ol>
<li>Allez &agrave; <b>Param&egrave;tres</b> &gt; <b>Biblioth&egrave;que</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/2.png" border="1"/>

<li>Cliquez sur <b>Cr&eacute;er</b> &gt; <b>Ajouter un dossier</b> pour choisir un dossier de votre NAS Synology, et s&eacute;lectionnez la biblioth&egrave;que de destination. Vous pouvez ajouter jusqu'&agrave; 100 dossiers vid&eacute;o pour une biblioth&egrave;que, mais une fois un dossier s&eacute;lectionn&eacute;, le dossier et ses sous-dossiers ne peuvent plus &ecirc;tre s&eacute;lectionn&eacute;s pour une autre biblioth&egrave;que.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/3.png" border="1"/>

<li>Stockez les fichiers vid&eacute;o dans les dossiers vid&eacute;o pour cat&eacute;goriser les vid&eacute;os dans les biblioth&egrave;ques correspondantes.</li>
<li>Maintenant, vous pouvez parcourir et regarder vos vid&eacute;os d&eacute;sir&eacute;es depuis les biblioth&egrave;ques&nbsp;!</li>
</ol>

<h3 class="list_head">3. Stocker et cat&eacute;goriser les vid&eacute;os dans les biblioth&egrave;ques personnalis&eacute;es</h3>
<p>En plus des trois biblioth&egrave;ques par d&eacute;faut qui peut &ecirc;tre acc&eacute;d&eacute;es par n'importe qui par d&eacute;faut, vous en tant que <B>admin</B> DSM, ou les utilisateurs appartenant au groupe <b>administrators</b>, pouvez &eacute;galement cr&eacute;er des biblioth&egrave;ques personnalis&eacute;es et affecter des permissions d'acc&egrave;s aux utilisateurs.</p>

<h4>3.1 Cr&eacute;er des biblioth&egrave;ques personnalis&eacute;es</h4>
<ol>
<li>Allez &agrave; <b>Param&egrave;tres</b> &gt; <b>Biblioth&egrave;que</b>, et cliquez sur <b>Cr&eacute;er</b> &gt; <b>Cr&eacute;er une biblioth&egrave;que</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/4.png" border="1"/>

<li>Sp&eacute;cifiez un nom pour la nouvelle biblioth&egrave;que, s&eacute;lectionnez le type de vid&eacute;os que vous voulez mettre dans le dossier, puis choisissez <b>Public</b> si vous souhaitez que la biblioth&egrave;que soit accessible &agrave; tous, ou choisissez <b>Priv&eacute;</b> pour limiter l'acc&egrave;s &agrave; certains utilisateurs qui ont la permission. Veuillez noter que les vid&eacute;os que vous placez dans le dossier doivent correspondre au type s&eacute;lectionn&eacute; ici pour assurer l'exactitude des informations vid&eacute;o recueillies &agrave; partir d'Internet.</li>
<li>Si vous choisissez <b>Priv&eacute;</b>, cliquez sur <b>Affecter des permissions</b> et cochez les cases pour accorder l'acc&egrave;s aux utilisateurs.</li>
</ol>

<h4>3.2 Ajouter des dossiers vid&eacute;o pour les biblioth&egrave;ques personnalis&eacute;es</h4>
<ol>
<li>Allez &agrave; <b>Param&egrave;tres</b> &gt; <b>Biblioth&egrave;que</b>.</li>
<li>Cliquez sur <b>Cr&eacute;er</b> &gt; <b>Ajouter un dossier</b> pour choisir un dossier de votre NAS Synology, et s&eacute;lectionnez la biblioth&egrave;que de destination. Vous pouvez ajouter jusqu'&agrave; 100 dossiers vid&eacute;o &agrave; une biblioth&egrave;que, mais une fois un dossier s&eacute;lectionn&eacute;, le dossier et ses sous-dossiers ne peuvent plus &ecirc;tre s&eacute;lectionn&eacute;s pour une autre biblioth&egrave;que.</li>
<li>Stockez les fichiers vid&eacute;o dans les dossiers vid&eacute;o pour cat&eacute;goriser les vid&eacute;os dans les biblioth&egrave;ques correspondantes.</li>
<li>Maintenant, vous pouvez parcourir et regarder vos vid&eacute;os d&eacute;sir&eacute;es depuis les biblioth&egrave;ques&nbsp;!</li>
</ol>

<h3 class="list_head">4. Lire les vid&eacute;os</h3>
<p>Une fois que vous avez cat&eacute;goris&eacute; vos fichiers vid&eacute;o dans diff&eacute;rentes biblioth&egrave;ques, vous pouvez suivre les &eacute;tapes ci-dessous pour lire vos vid&eacute;os sur Video Station. Il est fortement recommand&eacute; d'installer d'abord le <a href="http://www.videolan.org/vlc/" target="_blank">lecteur multim&eacute;dia VLC (Windows, Linux)</a> sur votre ordinateur. En plus de lire les vid&eacute;os sur votre ordinateur local, vous pouvez &eacute;galement diffuser vos vid&eacute;os vers les DMA compatibles DLNA/UPnP ou appareils AirPlay pour la lecture vid&eacute;o.</p>

<h4>Lire les vid&eacute;os avec le lecteur vid&eacute;o int&eacute;gr&eacute;</h4>
<ol>
<li>S&eacute;lectionnez un clip vid&eacute;o que vous voulez lire, puis cliquez sur l'ic&ocirc;ne de lecture sur l'image vid&eacute;o, ou cliquez sur <b>Action</b> &gt; <b>Lire</b>.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/5.png" border="1"/>

<li>La vid&eacute;o devrait commencer &agrave; &ecirc;tre lue imm&eacute;diatement. Si cela n'est pas le cas, assurez-vous que le format de votre vid&eacute;o est pris en charge par votre navigateur Web, ou que vous avez install&eacute; le plug-in VLC sur votre ordinateur.</li>
<li>Utilisez les boutons et la barre de progression sur l'&eacute;cran en bas du lecteur vid&eacute;o en fonction de votre besoin. Vous pouvez &eacute;galement r&eacute;gler le volume, s&eacute;lectionner la qualit&eacute; de la lecture vid&eacute;o et la piste audio, activer les sous-titres ou diffuser la vid&eacute;o &agrave; un autre appareil (si applicable).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/6.png" border="1"/>

</ol>


<div class="code_div">
<b>Remarque&nbsp;:</b>
<p>Pour des informations d&eacute;taill&eacute;es sur le plug-in VLC et les appareils pris en charge, reportez-vous &agrave; <b>Aide de DSM</b> &gt; <b>Video Station</b> &gt; <b>Lecture vid&eacute;o</b>.</p>
</div>
 
<h3 class="list_head">5. Partager les vid&eacute;os avec le public</h3> 
<p>Avec la fonction de partage public, vous pouvez facilement partager vos vid&eacute;os avec d'autres personnes en utilisant Video Station. Toutes les vid&eacute;os partag&eacute;es sont publiquement accessibles par n'importe qui avec le lien, et peuvent &ecirc;tre g&eacute;r&eacute;es sur la page <b>Collection</b>.</p>

<h4>Partager les vid&eacute;os avec d'autres</h4>
<ol>
<li>Allez dans n'importe quelle vid&eacute;oth&egrave;que et cliquez sur <b>Tous</b> dans le coin en haut &agrave; droite pour afficher toutes les vid&eacute;os dans cette biblioth&egrave;que.</li>
<li>Cliquez sur l'ic&ocirc;ne <b>Mode de s&eacute;lection</b>, ou appuyez et maintenez la touche <b>Ctrl</b> ou <b>Maj</b> pour s&eacute;lectionner plusieurs vid&eacute;os. Puis cliquez sur <b>Action</b> &gt; <b>Partager avec le public</b>.</li>
<ul>
<li>Si vous avez s&eacute;lectionn&eacute; une seule vid&eacute;o &agrave; partager, la vid&eacute;o sera ajout&eacute;e &agrave; une collection partag&eacute;e nomm&eacute;e <b>Vid&eacute;os partag&eacute;es</b>. Elle vous permet de g&eacute;rer toutes les vid&eacute;os que vous avez partag&eacute;es une par une.</li>
<li>Si vous avez s&eacute;lectionn&eacute; plusieurs vid&eacute;os &agrave; partager, les vid&eacute;os seront group&eacute;es dans une nouvelle collection partag&eacute;e.</li>
</ul>
<li>Vous pouvez &eacute;galement cliquer <b>Action</b> &gt; <b>Collection</b> pour ajouter les vid&eacute;os s&eacute;lectionn&eacute;es &agrave; une collection partag&eacute;e existante (si applicable).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/7.png" border="1"/>

<li>Sp&eacute;cifiez une p&eacute;riode de validit&eacute; si n&eacute;cessaire.</li>
<li>Il suffit de copier et coller le lien dans les e-mails, messages instantan&eacute;s, et pages Web pour partager les vid&eacute;os avec tout le monde.</li>
</ol> 


<h3 class="list_head">6. Organiser et regarder les vid&eacute;os sur les appareils mobiles</h3>
<p>Pour connecter &agrave; Video Station via des appareils mobiles, vous pouvez t&eacute;l&eacute;charger DS video avec les appareils iOS/Android ou Windows Phone avec les codes QR ci-dessous pour lire les vid&eacute;os et organiser vos collections sur vos appareils mobiles, ou diffuser les vid&eacute;os sur vos DMA ou appareils AirPlay &agrave; la fois &agrave; la maison ou en d&eacute;placement.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/>

</div>
<div class="page-info">
  <ul>
    <li>Précédent dans cette rubrique : <a href="home_theater_media_server.html">Profitez du contenu multimédia stocké sur le NAS Synology sur grands écrans</a> </li>
    <li>Suivant dans cette rubrique : <a href="home_theater_music.html">rofiter de la musique stockée sur votre NAS Synology avec Audio Station</a> </li>
  </ul>
</div>
</body>
</html>