<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Profitez du contenu multim&eacute;dia stock&eacute; sur le NAS Synology sur grands &eacute;crans</title>
</head>

<body class="tutorial-content-box" >

<h1>Profitez du contenu multim&eacute;dia stock&eacute; sur le NAS Synology sur grands &eacute;crans</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_media_server/enjoy_multimedia_contents_stored_on_synology_nas_with_big_screens.jpg" width="600" height="301" />
<h2>Vue d'ensemble</h2>
<p>Le NAS Synology peut &ecirc;tre utilis&eacute; comme serveur multim&eacute;dia sur le r&eacute;seau local, ce qui permet aux appareils domestiques, comme les t&eacute;l&eacute;viseurs/syst&egrave;mes st&eacute;r&eacute;o et Sony PlayStation3/Xbox 360, de lire son contenu multim&eacute;dia. Ces appareils sont des <b>adaptateurs multim&eacute;dia num&eacute;riques</b> (DMA) compatibles DLNA/UPnP. Pour diffuser le contenu multim&eacute;dia sur votre Synology NAS vers des appareils DMA pour la lecture, vous devez configurer les param&egrave;tres de lecture m&eacute;dia. Par exemple, g&eacute;rer les param&egrave;tres de navigation des fichiers multim&eacute;dia, et am&eacute;liorer la compatibilit&eacute; des fichiers. Cette fonction est disponible dans le paquet <strong>Serveur multim&eacute;dia</strong>.</p>

<h3 class="list_head">1. Installer Serveur multim&eacute;dia</h3>
<p>Pour installer Serveur multim&eacute;dia, veuillez aller dans <b>Centre de paquets</b>, trouvez <b>Serveur multim&eacute;dia</b>, puis cliquez sur <b>Installer</b>.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_install_media_server.png" width="640" border="1" />

<h3 class="list_head">2. Charger des fichiers multim&eacute;dia sur votre NAS Synology</h3>
<p>Les dossiers partag&eacute;s par d&eacute;faut, <b>photo</b>, <b>music</b> et <b>video</b>, sont automatiquement cr&eacute;&eacute;s et index&eacute;s apr&egrave;s l'installation de Serveur multim&eacute;dia sur votre NAS. Ce que vous devez faire est simplement de charger les fichiers multim&eacute;dia, comme les images, chansons ou vid&eacute;os, dans les dossiers correspondants, et ces fichiers seront accessibles depuis vos appareils DMA.</p>
<div class="code_div"><b>Remarque&nbsp;:</b> Les dossiers partag&eacute;s mont&eacute;s &agrave; partir des serveurs distants ne peuvent pas &ecirc;tre ajout&eacute;s sous la forme de dossiers index&eacute;s. Vous pouvez ajouter jusqu'&agrave; 100 dossiers index&eacute;s sur votre NAS Synology.</div>

<h3 class="list_head">3. Configurer les param&egrave;tres de navigation pour votre lecteur multim&eacute;dia</h3>
<p>Vous pouvez d&eacute;cider comment vos appareils DMA navigueront dans les fichiers multim&eacute;dia sur votre NAS Synology.</p>
<ol>
<li>Allez dans <b>Menu principal &gt; Serveur multim&eacute;dia</b>.</li>
<li>Cliquez sur <b>Param&egrave;tres de navigation</b> dans le panneau gauche.</li>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_browsing_settings.png" width="640" border="1" />
<li>Pour plus d'informations, cliquez sur le bouton <b>Aide</b> dans le coin en haut &agrave; droite de la fen&ecirc;tre de <b>Serveur multim&eacute;dia</b>.</li>
</ol>
<h3 class="list_head">4. Am&eacute;liorer la compatibilit&eacute; DMA</h3>
<p>Si vos t&eacute;l&eacute;viseurs DLNA/UPnP ou appareils DMA ne parviennent pas &agrave; lire le contenu multim&eacute;dia stock&eacute; sur votre NAS sans probl&egrave;me, vous pouvez essayer de configurer les param&egrave;tres de <b>Compatibilit&eacute; DMA</b> de Serveur multim&eacute;dia.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_dma_compatibility.png" width="640" border="1" />
<div class="code_div"><b>Remarque&nbsp;:</b>
<ol>
  <li>Si vous souhaitez v&eacute;rifier si votre appareil DMA est correctement install&eacute; et trouv&eacute; par votre NAS dans le r&eacute;seau local, cliquez sur <b>Liste des p&eacute;riph&eacute;riques</b>. Une liste des appareils DMA appara&icirc;tra avec leurs informations d'appareil.</li>
  <li>Assurez-vous d'avoir coch&eacute; <b>Restreindre l'acc&egrave;s au Serveur multim&eacute;dia pour les appareils UPnP/DLNA nouvellement d&eacute;tect&eacute;s</b>. Autrement, Serveur multim&eacute;dia ne sera pas accessible &agrave; vos appareils DMA.</li>
</ol>
</div>
<p>Pour plus d'informations sur le support technique sur les fichiers multim&eacute;dias d'autres formats, cliquez sur le bouton Aide dans le coin en haut &agrave; droite de la fen&ecirc;tre de Serveur multim&eacute;dia.</p>
<h3 class="list_head">5. Pour acc&eacute;der aux fichiers multim&eacute;dia stock&eacute;s sur votre NAS avec un t&eacute;l&eacute;viseur DLNA</h3>
<p>Les appareils DLNA/UPnP et DMA peuvent facilement se connecter &agrave; votre r&eacute;seau domestique. Une fois votre NAS Synology et vos appareils DLNA connect&eacute;s &agrave; votre r&eacute;seau domestique, vous pouvez parcourir les dossiers s&eacute;lectionn&eacute;s et &eacute;couter de la musique ou regarder des vid&eacute;os &agrave; partir de votre NAS sur un grand &eacute;cran.</p>
<div class="code_div"><b>Remarque&nbsp;:</b> Pour une liste des t&eacute;l&eacute;viseurs DLNA/UPnP et appareils DMA pris en charge qui ont &eacute;t&eacute; v&eacute;rifi&eacute;s par Synology, veuillez voir <a href="https://www.synology.com/compatibility?search_by=category&category=dlna_devices&p=1&not_recommend_mode=false" target="_blank">ici</a>.</div>
<p>Le processus de configuration d&eacute;pend de vos appareils DMA compatibles DLNA. Pour plus d'informations sur l'acc&egrave;s aux fichiers multim&eacute;dia stock&eacute;s sur votre NAS via DLNA, veuillez suivre les instructions de vos appareils clients.</p>
</div>
<div class="page-info">
  <ul>
    <li>Suivant dans cette rubrique : <a href="home_theater_videos.html">Catégoriser et lire les vidéos avec Video Station</a> </li>
  </ul>
</div>
</body>

</html>