<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Cr&eacute;er des albums pour g&eacute;rer et parcourir les photos avec Photo Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Cr&eacute;er des albums pour g&eacute;rer et parcourir les photos avec Photo Station</h1>
<div class="tutorials_content">

<img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/>

<h2>Vue d'ensemble</h2>
<p>Photo Station est une application Web con&ccedil;ue pour vous aider &agrave; organiser et afficher les photos stock&eacute;es sur votre NAS Synology sur Internet. Avec son interface raffin&eacute;e et conviviale, Photo Station vous permet de charger, parcourir, g&eacute;rer et partager vos albums photos en quelques simples clics.</p>

<h3 class="list_head">1. Installer Photo&nbsp;Station</h3>
<p>Pour installer Photo Station, veuillez aller dans <b>Centre de paquets</b>, trouvez <b>Photo Station</b>, puis cliquez sur <b>Installer</b>.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/>

<h3 class="list_head">2. Charger les photos</h3>
<p>Avant de pouvoir parcourir et g&eacute;rer les photos dans Photo Station, vous devez d'abord cr&eacute;er des albums et charger des photos avec une des m&eacute;thodes suivantes.</p>

<h4>2.1 Charger les photos via Photo Station Uploader (pour Windows et Mac)</h4>
<p>Nous vous recommandons d'utiliser Photo Station Uploader parce les miniatures de chaque photo &agrave; afficher seront g&eacute;n&eacute;r&eacute;es pendant le processus de chargement. Le chargement de fichiers via Photo Station Uploader tirera parti de la capacit&eacute; de calcul de votre ordinateur pour acc&eacute;l&eacute;rer la conversion.</p>
<ol>
<li>T&eacute;l&eacute;chargez et installez <b>Photo Station Uploader</b> (disponible sur le <a href="https://www.synology.com/support/download/DS713+" target="_blank">Centre de t&eacute;l&eacute;chargement de Synology</a>).</li>
<li>Sur votre ordinateur, faites un clic droit sur les photos que vous souhaitez charger, puis choisissez <b>Charger sur Photo Station</b> &gt; <b>Cr&eacute;er un nouveau profil</b> pour ouvrir l'assistant.</li>
<li>Entrez un nom de votre choix et le nom du serveur/adresse IP du NAS Synology de destination pour le nouveau profil.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/>

<div class="code_div">
<b>Remarque&nbsp;:</b>
<p>Les informations du serveur et les identifiants d'utilisateur fournis seront enregistr&eacute;s dans ce profil pour une utilisation future. Vous pouvez configurer plusieurs profils selon des r&egrave;gles ou destinations diff&eacute;rentes. Au lieu de remplir les informations du serveur &agrave; nouveau la prochaine fois que vous utilisez Photo Station Uploader, vous pouvez s&eacute;lectionner un profil existant et utiliser ses configurations d&eacute;finies pr&eacute;c&eacute;demment pour charger des photos vers la m&ecirc;me destination.</p>
</div>

<li>Choisissez si vous souhaitez charger les fichiers vers Photo Station ou Photo Station personnel.</li>

<li>Entrez les identifiants d'utilisateur pour le NAS Synology de destination.</li>

<li>Cliquez sur <b>Parcourir</b> pour choisir un dossier de destination ou cr&eacute;er un sous-dossier dans le dossier partag&eacute; <b>photo</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/>

<li>Une fois le chargement termin&eacute;, vous pouvez lancer Photo Station sur votre NAS Synology et afficher les fichiers charg&eacute;s dans diff&eacute;rents modes ou modifier d'autres informations, comme les propri&eacute;t&eacute;s de l'album et les privil&egrave;ges d'acc&egrave;s.</li>
</ol>


<h4>2.2 Cr&eacute;er des albums et charger les photos via Photo Station</h4>
<p>Lancez <b>Photo Station</b>, et cliquez sur <b>Ajouter</b> pour cr&eacute;er un nouvel album ou charger des photos depuis votre ordinateur ou NAS Synology &agrave; des albums existants.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/>

<div class="code_div">
<b>Remarque&nbsp;:</b>
<p>Si vous pr&eacute;f&eacute;rez charger les photos via l'interface de Photo Station, il est fortement recommand&eacute; d'activer le service QuickConnect. Que vous soyez &agrave; la maison ou en d&eacute;placement, QuickConnect vous permet d'acc&eacute;der &agrave; votre NAS Synology et &agrave; Photo Station depuis n'importe o&ugrave; via Internet avec un ID personnalis&eacute; mais sans les inconv&eacute;nients d'avoir &agrave; d&eacute;finir des configurations de r&eacute;seau complexes, comme les r&egrave;gles de transmission de ports. Pour plus d'informations sur QuickConnect, reportez-vous &agrave; <a class="launch-app" href="cloud_set_up_quickconnect.html">ce tutoriel</a>.</p>
</div>

<h3 class="list_head">3. Partager les photos</h3>
<p>Avec la fonction de partage, vous pouvez facilement partager les photos stock&eacute;es sur Photo Station avec des amis ou charger les photos sur les r&eacute;seaux sociaux populaires tels que Facebook, Picasa et Flickr.</p>

<h4>3.1 Partager les photos avec le public</h4>
<ol>
<li>Naviguez jusqu'&agrave; un album et s&eacute;lectionnez les photos que vous souhaitez partager.</li>
<li>Cliquez sur <b>Partager</b> &gt; <b>Partager avec le public</b> pour obtenir le lien.</li>
<ul>
<li>Si vous avez s&eacute;lectionn&eacute; une seule photo &agrave; partager, la photo sera ajout&eacute;e &agrave; un album partag&eacute; par d&eacute;faut nomm&eacute; <b>Photos partag&eacute;es</b>. Il vous permet de g&eacute;rer toutes les photos que vous avez partag&eacute;es une par une.</li>
<li>Si vous avez s&eacute;lectionn&eacute; plusieurs photos &agrave; partager, les photos seront group&eacute;es dans un nouvel album partag&eacute;.</li>
</ul>
<li>Vous pouvez &eacute;galement cliquer sur <b>Partager</b> &gt; <b>Ajouter &agrave; un album partag&eacute;</b> pour ajouter les photos s&eacute;lectionn&eacute;es &agrave; un album partag&eacute; existant (si applicable).</li>
<img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/>
<li>Entrez un nom pour le nouvel album partag&eacute;, et sp&eacute;cifiez la p&eacute;riode de validit&eacute; si n&eacute;cessaire.</li>
<li>Copiez et collez le lien dans les e-mails, messages instantan&eacute;s, et pages Web pour partager les photos s&eacute;lectionn&eacute;es avec tout le monde.</li>
</ol>

<div class="code_div">
<b>Remarque&nbsp;:</b>
<ul>
<li>Toutes les photos partag&eacute;es sont accessibles publiquement par n'importe qui avec le lien.</li>
<li>Vous pouvez sp&eacute;cifier quels utilisateurs peuvent avoir le privil&egrave;ge de partager les &eacute;l&eacute;ments de Photo Station avec le public dans <b>Param&egrave;tres</b> &gt; <b>Partage</b>.</li>
</ul>
</div>

<h4>3.2 Partager les photos avec les r&eacute;seaux sociaux</h4>
<ol>
<li>S&eacute;lectionnez les photos que vous souhaitez charger puis s&eacute;lectionnez <b>Partager</b> &gt; <b>Charger vers [sites Web de r&eacute;seaux sociaux]</b>.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/>

<li>Dans la fen&ecirc;tre qui appara&icirc;t, cliquez sur <b>Se connecter avec [sites Web de r&eacute;seaux sociaux]</b>, et autorisez avec votre compte de r&eacute;seau social. Vous pouvez choisir de charger les photos vers un nouvel album ou un album existant.</li>
</ol>

<h3 class="list_head">4. Organiser et parcourir les photos sur les appareils mobiles</h3>
<p>Pour vous connecter &agrave; Photo Station ou charger des photos via les appareils mobiles, vous pouvez installer <b>DS photo+</b> sur vos appareils mobiles avec les codes QR ci-dessous.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/>


</div>

</body>
</html>