<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>S&eacute;curiser votre NAS</title>
</head>

<body class="tutorial-content-box" >

<h1>S&eacute;curiser votre NAS Synology</h1>
<div class="tutorials_content">
<p><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/Intro.jpg" /></p>
<h2> Vue d’ensemble</h2>
<p>DSM a une nouvelle fonctionnalit&eacute; appel&eacute;e le Conseiller en s&eacute;curit&eacute; qui aide &agrave; garder votre NAS Synology s&ucirc;r. Le Conseiller en s&eacute;curit&eacute; analyse la configuration globale de votre NAS Synology et fournit des rapports d&eacute;taill&eacute;s sur son &eacute;tat de s&eacute;curit&eacute;. En outre, le Conseiller en s&eacute;curit&eacute; vous montrera comment g&eacute;rer les risques de s&eacute;curit&eacute; identifi&eacute;s. Ouvrez le Conseiller en s&eacute;curit&eacute; et apprenez &agrave;&nbsp;:</p>
<ul>
  <li>Ex&eacute;cuter une analyse de la s&eacute;curit&eacute;</li>
  <li>Afficher les rapports de r&egrave;gles de s&eacute;curit&eacute;</li>
  <li>G&eacute;rer les risques de s&eacute;curit&eacute;</li>
</ul>

<h3 class="list_head">1. Ex&eacute;cuter une analyse de la s&eacute;curit&eacute; </h3>
<ol>
	<li>La premi&egrave;re fois que vous ouvrez le Conseiller en s&eacute;curit&eacute;, il vous sera demand&eacute; pour quoi vous utilisez votre NAS Synology. Choisissez <strong>Maison</strong> ou <strong>Travail</strong> selon votre situation et cliquez sur <strong>OK</strong>. Vous pouvez toujours changer ce param&egrave;tre ult&eacute;rieurement dans la page <strong>Avanc&eacute;</strong>.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/01.png" />
	<li>Le Conseiller en s&eacute;curit&eacute; commencera &agrave; analyser la configuration de votre NAS Synology. Vous pouvez afficher l'&eacute;tat g&eacute;n&eacute;ral de la s&eacute;curit&eacute;, la progression de l'analyse, et le r&eacute;sum&eacute; des r&eacute;sultats dans la page <strong>Vue d'ensemble</strong>.</li><img alt="" style="display:block;"   width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/02.png" />
	<li>Une fois l'analyse termin&eacute;e, les r&eacute;sultats pour chaque cat&eacute;gorie de r&egrave;gles de s&eacute;curit&eacute; sont affich&eacute;s. Le Conseiller en s&eacute;curit&eacute; fournira un &eacute;tat global pour chaque cat&eacute;gorie et r&eacute;sumera les d&eacute;couvertes des risques de s&eacute;curit&eacute;. </li><img alt="" style="display:block;" width="680" height="391"  src="../../images/SecureNAS/1x/Secure_NAS/03.png" />
</ol>
<h3 class="list_head">2. Afficher les rapports de r&egrave;gles de s&eacute;curit&eacute;</h3>
<ol>
<li>Cliquez sur <strong>Afficher les r&eacute;sultats</strong> sur la page <strong>Vue d'ensemble</strong>.<strong> </strong>Vous pouvez afficher des informations d&eacute;taill&eacute;es de l'analyse termin&eacute;e, rapport par rapport.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/04.png" />
<li>Double-cliquez sur une r&egrave;gle de s&eacute;curit&eacute; pour ouvrir un rapport d&eacute;taill&eacute;. Chaque rapport peut contenir des informations sur la <strong>Gravit&eacute;</strong>, la <strong>Description</strong>, les <strong>D&eacute;tails</strong> et l'<strong>Action recommand&eacute;e</strong> pour chaque r&egrave;gle de s&eacute;curit&eacute;.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/05.png" />
</ol>

<h3 class="list_head">3. G&eacute;rer les risques de s&eacute;curit&eacute;</h3>
<p>Voici un exemple d'une r&egrave;gle de s&eacute;curit&eacute; &eacute;chou&eacute;e et les d&eacute;tails sur comment la g&eacute;rer.</p>
<ol>
<li>Le Conseiller en s&eacute;curit&eacute; identifiera les risques potentiels pour la s&eacute;curit&eacute; de toute r&egrave;gle de s&eacute;curit&eacute; &eacute;chou&eacute;e.  Ici, le Conseiller en s&eacute;curit&eacute; d&eacute;tecte que &quot;Blocage auto est d&eacute;sactiv&eacute;&quot;.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/06.png" />
<li>Ouvrez une r&egrave;gle de s&eacute;curit&eacute; &eacute;chou&eacute;e pour afficher des informations d&eacute;taill&eacute;es. Sous <strong>Action recommand&eacute;e</strong>, le Conseiller en s&eacute;curit&eacute; fournit des conseils sur comment g&eacute;rer ce risque de s&eacute;curit&eacute;.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/07.png" />
<li>Cliquez sur <strong>Ouvrir</strong> pour acc&eacute;der directement &agrave; la page des param&egrave;tres correspondants et suivre l'<strong>Action recommand&eacute;e</strong>.</li>
<li>Dans la page des <strong>R&eacute;sultats</strong>, analysez &agrave; nouveau la r&egrave;gle de s&eacute;curit&eacute; &eacute;chou&eacute;e en s&eacute;lectionnant la r&egrave;gle et en cliquant sur <strong>Analyser</strong>.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/08.png" />
<li>Aucun risque de s&eacute;curit&eacute; n'est d&eacute;tect&eacute; pour cette r&egrave;gle de s&eacute;curit&eacute;. Le Conseiller en s&eacute;curit&eacute; continuera &agrave; vous aider &agrave; identifier les risques potentiels de s&eacute;curit&eacute; et &agrave; recommander des mesures pour g&eacute;rer ces risques. Gardez votre NAS Synology s&ucirc;r en effectuant r&eacute;guli&egrave;rement des analyses dans le Conseiller en s&eacute;curit&eacute;&nbsp;!</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/09.png" />
</ol>
</div>

</body>

</html>
