<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Stocker les fichiers sur le NAS Synology depuis un ordinateur Mac dans le r&eacute;seau local</title>
</head>

<body class="tutorial-content-box" >

<h1>Stocker les fichiers sur le NAS Synology depuis un ordinateur Mac dans le r&eacute;seau local</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_mac/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Mac.jpg"/>
<h2>Vue d'ensemble</h2>
<p>Le NAS Synology est con&ccedil;u pour rendre le stockage et le partage de fichiers dans votre r&eacute;seau local simple et rapide, vous permettant d'acc&eacute;der directement aux dossiers et fichiers partag&eacute;s sur le NAS Synology sans les inconv&eacute;nients d'avoir vous connecter &agrave; DSM &agrave; chaque fois. Par exemple, vous pourrez stocker les fichiers sur votre NAS Synology avec Finder, tout comme d'autres appareils r&eacute;seau.</p>

<h3 class="list_head">Acc&eacute;der aux dossiers partag&eacute;s avec Mac OS</h3>
<ol>
<li>Ouvrez Finder sur votre ordinateur Mac.</li>
<li>Trouvez la barre de menus en haut de l'&eacute;cran.</li>
<li>Cliquez sur <b>Aller</b> et s&eacute;lectionnez <b>Se connecter au serveur</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image1.png" border="1"/>
<li>Entrez l'adresse IP de votre NAS Synology, pr&eacute;c&eacute;d&eacute;e de &quot;afp://&quot;, par exemple, &quot;afp://192.168.59.121&quot;. Cliquez sur <b>Connecter</b> pour continuer.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image2.png" border="1">
<div class="code_div"><b>Serveurs favoris&nbsp;:</b> Appuyez sur le bouton du signe plus <b>(+)</b> pour d&eacute;signer les adresses IP des serveurs pr&eacute;f&eacute;r&eacute;s pour une utilisation future. En outre, vous pouvez cliquer sur le bouton de l'horloge pour voir une liste de serveurs auxquels vous vous &ecirc;tes r&eacute;cemment connect&eacute;.</div>
<li>Saisissez votre nom d'utilisateur DSM et votre mot de passe. Votre compte utilisateur doit disposer des privil&egrave;ges de lecture/&eacute;criture appropri&eacute;s pour le dossier partag&eacute; auquel vous souhaitez acc&eacute;der. Cliquez sur <b>Connecter</b> pour continuer.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image3.png" border="1"/>
<li>Enfin, si vos identifiants de nom d'utilisateur sont corrects, vous verrez maintenant votre NAS Synology list&eacute; dans la section <b>Partag&eacute;</b> de votre fen&ecirc;tre de Finder. Double-cliquez sur le dossier partag&eacute; pour explorer son contenu.</li>
<img src="../../images/StoreFiles/1x/store_with_mac/image4.png" border="1" />
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Précédent dans cette rubrique : <a href="store_with_windows.html">Stocker les fichiers sur le NAS Synology depuis un PC Windows dans le réseau local</a> </li>
  </ul>
</div>
</body>

</html>
