<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Stocker les fichiers sur le NAS Synology depuis un PC Windows dans le r&eacute;seau local</title>
</head>

<body class="tutorial-content-box" >

<h1>Stocker les fichiers sur le NAS Synology depuis un PC Windows dans le r&eacute;seau local</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_windows/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Windows.jpg"/>
<h2>Vue d'ensemble</h2>
<p>Le NAS Synology est con&ccedil;u pour rendre le stockage et le partage de fichiers dans votre r&eacute;seau local simple et rapide, vous permettant d'acc&eacute;der directement aux dossiers et fichiers partag&eacute;s sur le NAS Synology sans les inconv&eacute;nients d'avoir vous connecter &agrave; DSM &agrave; chaque fois. Par exemple, vous pourrez stocker les fichiers sur votre NAS Synology avec l'Explorateur Windows, tout comme d'autres appareils r&eacute;seau.</p>

<h3 class="list_head">Connecter avec l'Explorateur Windows</h3>
<ol>
<li>Ouvrez une fen&ecirc;tre de l'Explorateur Windows et allez &agrave; <b>Ordinateur</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image1.png"/>
<li>Cliquez sur <b>Connecter un lecteur r&eacute;seau</b>. Cette action fait appara&icirc;tre la fen&ecirc;tre Connecter un lecteur r&eacute;seau.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image2.png"/>
<li>Sur la fen&ecirc;tre Connecter un lecteur r&eacute;seau, choisissez une lettre de lecteur dans le menu d&eacute;roulant <b>Lecteur</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image3.png"/>
<li>Dans le champ <b>Dossier</b>, saisissez le nom de serveur de votre NAS Synology et le nom de dossier partag&eacute; et pr&eacute;c&eacute;d&eacute;s et s&eacute;par&eacute;s des barres obliques inverses. Par exemple, si le nom de serveur de votre NAS Synology est &quot;DiskStation&quot;, et le nom de votre volume est &quot;Partage1&quot;, alors vous devez entrer &quot;\\DiskStation\Partage1&quot;. Cliquez sur <b>Terminer</b> quand vous &ecirc;tre pr&ecirc;t.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image4.png"/>
<li>Saisissez votre nom d'utilisateur DSM et votre mot de passe.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image5.png"/>
<div class="code_div"><b>Impossible d'acc&eacute;der au dossier partag&eacute;&nbsp;?</b> Le compte utilisateur que vous entrez ici doit disposer des privil&egrave;ges de d'acc&egrave;s pour le dossier partag&eacute; auquel vous souhaitez acc&eacute;der.</div>
<li>Enfin, une fen&ecirc;tre de l'Explorateur Windows appara&icirc;t. Votre dossier partag&eacute; sera d&eacute;sormais mapp&eacute; et accessibles sous <b>Ordinateur</b>.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image6.png"/>
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Suivant dans cette rubrique : <a href="store_with_mac.html">Stocker les fichiers sur le NAS Synology depuis un ordinateur Mac dans le réseau local</a> </li>
  </ul>
</div>
</body>

</html>
