<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8" />
<title>DSM Mobile</title>
<link href="../help.css" rel="stylesheet" type="text/css" />
<link href="help.css" rel="stylesheet" type="text/css" />
<script src="../jslib/jquery.min.js"></script>
<script src="../jslib/mobile.js"></script>
</head>
<body>

<br>
<p>Com o DSM mobile o <strong>admin</strong> do DSM (ou um usu&aacute;rio que perten&ccedil;a ao grupo <strong>administrators</strong>) pode gerenciar as configura&ccedil;&otilde;es do DSM e verificar as informa&ccedil;&otilde;es do DSM com um dispositivo iOS<sup>&reg;</sup> (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup> ou iPod touch<sup>&reg;</sup>) ou Android<sup>&reg;</sup>. Esta Ajuda do DSM mobile cont&eacute;m os t&oacute;picos e recursos a seguir, para ajud&aacute;-lo a come&ccedil;ar.</p>
<h2><a name="login" href="#">Login e logout</a></h2>

<div name="contents" id="login" class="x-hidden-display">
<p>Depois de conectar ao DSM com o navegador da web em seu dispositivo iOS ou Android, voc&ecirc; ver&aacute; a tela de logon, onde poder&aacute; digitar as informa&ccedil;&otilde;es de sua conta DSM.</p>

<h4>Para fazer logon no DSM mobile:</h4>
<p>Digite suas credenciais de usu&aacute;rio do DSM e toque em <b>Login</b>. Se quiser salvar suas informa&ccedil;&otilde;es de logon para faz&ecirc;-lo automaticamente da pr&oacute;xima vez, ligue o switch <b>Lembrar de mim</b> antes de fazer logon.</p>

<h4>Para fazer logout do DSM mobile:</h4>
<ol>
	<li>Toque o bot&atilde;o de op&ccedil;&atilde;o no canto superior direito da p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou do painel esquerdo (iPad ou tablet Android).</li>
	<li>Toque em <b>Configura&ccedil;&otilde;es</b> e toque em <b>Sair</b>.</li>
</ol>
</div>

<h2><a name="user" href="#" >Gerenciar usu&aacute;rios DSM</a></h2>

<div name="contents" id="user" class="x-hidden-display">
<p>Toque em <b>Usu&aacute;rio e grupo</b> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para ver a lista de usu&aacute;rios.</p>

<h4>Para criar um usu&aacute;rio:</h4>
<ol>
	<li>Toque em <b>+</b> e digite o nome de usu&aacute;rio, senha e endere&ccedil;o de e-mail do novo usu&aacute;rio.</li>
	<li>Ative <b>Enviar notifica&ccedil;&atilde;o</b> para enviar um e-mail de notifica&ccedil;&atilde;o ao endere&ccedil;o de e-mail do usu&aacute;rio quando a conta de usu&aacute;rio dele/dela no DSM for criada.<br><span class="note_head">Nota: </span>Antes de enviar a notifica&ccedil;&atilde;o, verifique se as configura&ccedil;&otilde;es de notifica&ccedil;&atilde;o foram completadas no Synology NAS. Fa&ccedil;a logon na edi&ccedil;&atilde;o da &aacute;rea de trabalho do DSM com o navegador da web do computador e v&aacute; ao <b>Menu principal</b> &gt; <b>Painel de controle</b> &gt; <b>Notifica&ccedil;&atilde;o</b> &gt; <b>E-mail</b> para modificar as configura&ccedil;&otilde;es.</li>
	<li>Toque em <b>Concluir</b> para confirmar ou toque na seta para a esquerda para cancelar.</li>
</ol>

<h4>Para localizar rapidamente um usu&aacute;rio:</h4>
<p>Digite o nome do usu&aacute;rio no campo Pesquisar.</p>

<h4>Para modificar as informa&ccedil;&otilde;es de um usu&aacute;rio:</h4>
<ol>
	<li>Toque o nome do usu&aacute;rio e fa&ccedil;a uma das seguintes op&ccedil;&otilde;es:
		<ul>
			<li>Modifique o nome ou senha do usu&aacute;rio nos campos <b>Nome</b> ou <b>Senha</b>.</li>
		<li>Ligue <b>Desabilitar</b> para desativar o usu&aacute;rio. Voc&ecirc; pode escolher se deseja habilitar o usu&aacute;rio mais tarde sem perder suas configura&ccedil;&otilde;es.</li>
		<li>Ligue <b>Administrador</b> para adicionar o usu&aacute;rio ao grupo <b>admin</b>. Os usu&aacute;rios que pertencem ao grupo <b>admin</b> ter&atilde;o privil&eacute;gios administrativos para modificar as configura&ccedil;&otilde;es do DSM com DSM mobile ou o navegador web do computador.</li>
		</ul>
	</li>
	<li>Em <b>Privil&eacute;gios</b>, fa&ccedil;a uma das seguintes op&ccedil;&otilde;es e toque em <b>Voltar</b>:
		<ul>
			<li>Toque em <b>Pasta compartilhada</b> e toque o nome da pasta compartilhada para modificar os privil&eacute;gios de acesso do usu&aacute;rio: <b>Leitura/Grava&ccedil;&atilde;o</b>: O usu&aacute;rio pode fazer altera&ccedil;&otilde;es aos arquivos e sub pastas na pasta compartilhada; <b>Somente leitura</b>: O usu&aacute;rio pode acessar os arquivos e sub pastas na pasta compartilhada, mas n&atilde;o pode fazer altera&ccedil;&otilde;es; <b>Nenhum acesso</b>: O usu&aacute;rio n&atilde;o pode acessar os arquivos e as subpastas na pasta compartilhada.<br><span class="note_head">Nota: </span>Caso ocorram conflitos de privil&eacute;gio, a prioridade dos privil&eacute;gios ser&aacute;: <span class="note_content">Nenhum acesso &gt; Leitura/Grava&ccedil;&atilde;o &gt; Somente leitura</span>.</li>
			<li>Toque em <b>Aplicativo</b> para modificar o privil&eacute;gio de acesso do usu&aacute;rio aos aplicativos DSM.</li>
		</ul>
	</li>
	<li>Toque em <b>Concluir</b> para confirmar ou toque na seta para a esquerda para cancelar.</li>
</ol>
</div>

<h2><a name="shared" href="#" >Gerenciamento de pastas compartilhadas</a></h2>

<div name="contents" id="shared" class="x-hidden-display">
<p>Toque em <b>Pasta compartilhada</b> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para ver a lista de pastas compartilhadas do Synology NAS.</p>

<h4>Para criar uma pasta compartilhada:</h4>
<ol>
	<li>Toque em <b>+</b> e digite o nome da nova pasta.</li>
	<li>Toque em <b>Concluir</b> para confirmar ou toque na seta para a esquerda para cancelar.</li>
</ol>

<h4>Para modificar uma pasta compartilhada:</h4>
<p>Toque o nome da pasta compartilhada e fa&ccedil;a uma das seguintes op&ccedil;&otilde;es:</p>
<ul>
	<li>Modifique o nome da pasta compartilhada no campo <b>Nome</b>.</li>
	<li>Toque em <b>Permiss&otilde;es do usu&aacute;rio</b> e toque em um usu&aacute;rio para modificar seus privil&eacute;gios de acesso &agrave; pasta compartilhada: <b>Leitura/Grava&ccedil;&atilde;o</b>: O usu&aacute;rio pode fazer altera&ccedil;&otilde;es aos arquivos e sub pastas na pasta compartilhada; <b>Somente leitura</b>: O usu&aacute;rio pode acessar os arquivos e sub pastas na pasta compartilhada, mas n&atilde;o pode fazer altera&ccedil;&otilde;es; <b>Nenhum acesso</b>: O usu&aacute;rio n&atilde;o pode acessar os arquivos e as subpastas na pasta compartilhada.<br><span class="note_head">Nota: </span>Caso ocorram conflitos de privil&eacute;gio, a prioridade dos privil&eacute;gios ser&aacute;: <span class="note_content">Nenhum acesso &gt; Leitura/Grava&ccedil;&atilde;o &gt; Somente leitura</span>.</li>
	<li>Voc&ecirc; tamb&eacute;m pode tocar em <b>Permiss&otilde;es do grupo</b> para configurar privil&eacute;gios para grupos.<br><span class="note_head">Nota: </span>As permiss&otilde;es do grupo t&ecirc;m prioridade maior do que as permiss&otilde;es do usu&aacute;rio.</li>
</ul>
</div>

<h2><a name="services" href="#" >Ativar servi&ccedil;os</a></h2>

<div name="contents" id="services" class="x-hidden-display">
<p>Toque em <b>Servi&ccedil;o</b> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para ativar ou desativar os servi&ccedil;os do Synology NAS.</p>

<h4>Para gerenciar os servi&ccedil;os de LAN do Synology NAS:</h4>
<ul>
	<li>Ative ou desative uma das op&ccedil;&otilde;es a seguir:
		<ul>
			<li><b>Servi&ccedil;o de arquivos Windows</b> permite que o Synology NAS seja um servidor de arquivos Windows (CIFS) dentro da LAN.</li>
			<li><b>Servi&ccedil;o de arquivos Mac</b> permite que o Synology NAS seja um servidor de arquivos Mac (AFP) dentro da LAN.</li>
			<li><b>Servi&ccedil;o NFS</b> permite que o cliente Linux dentro da LAN tenha aceso aos dados do Synology NAS.</li>
			<li><b>Bonjour Printer</b> permite que os clientes Mac imprimam na(s) impressora(s) USB conectadas ao Synology NAS.</li>
			<li><b>Servidor de M&iacute;dia</b> permite que os dispositivos dom&eacute;sticos DLNA/UPnP dentro da LAN pesquisem e reproduzam conte&uacute;do de multim&iacute;dia no Synology NAS.</li>
			<li><b>iTunes</b> permite que os clientes iTunes dentro da LAN pesquisem e reproduzam m&uacute;sicas ou v&iacute;deos no Synology NAS.</li>
		</ul>
	</li>
</ul>

<h4>Para gerenciar os servi&ccedil;os de Internet do Synology NAS:</h4>
<ul>
	<li>Ative ou desative uma das op&ccedil;&otilde;es a seguir:
		<ul>
			<li><b>FTP</b> habilita o Synology NAS a ser um servidor FTP.</li>
			<li><b>Servi&ccedil;os Web</b> permite a hospedagem de sites (com suporte a PHP+MySQL) no Synology NAS.</li>
			<li><b>WebDAV</b> permite que programas clientes gerenciem e editem arquivos do Synology NAS atrav&eacute;s do protocolo HTTP.</li>
			<li><b>WebDAV (HTTPS)</b> permite que programas clientes gerenciem e editem arquivos do Synology NAS atrav&eacute;s do protocolo HTTPS.</li>
			<li><b><a name="filestationservice"></a>File Station</b> &eacute; um aplicativo baseado na web que permite o gerenciamento de arquivos do Synology NAS atrav&eacute;s de uma porta personalizada sem exigir o logon no DSM.</li>
			<li><b>File Station (HTTPS)</b> permite a conex&atilde;o ao File Station atrav&eacute;s do protocolo HTTPS.</li>
			<li><b>Surveillance&nbsp;Station</b> &eacute; um aplicativo baseado na web que pode gerenciar c&acirc;meras IP para proteger sua casa ou ambiente de escrit&oacute;rio.</li>
			<li><b>Audio Station</b> &eacute; um aplicativo baseado na web que permite o acesso &agrave; biblioteca de m&uacute;sicas no Synology NAS.</li>
			<li><b>Photo Station</b> &eacute; um &aacute;lbum de fotos online integrado com blog salvo no Synology NAS.</li>
			<li><b><a name="downloadsationservice"></a>Download Station</b> (BT/HTTP/FTP/NZB/RSS) &eacute; um aplicativo baseado na web que auxilia o download de arquivos da Internet para o Synology NAS.</li>
			<li><b>eMule</b> habilita o suporte do Download Station ao eMule.</li>
		</ul>
	</li>
</ul>

<div class="section">
<h4>Nota:</h4>
<p>Para mais informa&ccedil;&otilde;es sobre os servi&ccedil;os acima, consulte uma das op&ccedil;&otilde;es a seguir:</p>
	<ul>
		<li><b>Ajuda do DSM</b> (dispon&iacute;vel ao fazer logon na edi&ccedil;&atilde;o da &aacute;rea de trabalho do DSM com o navegador da web do computador e indo ao <b>Menu principal</b> &gt; <b>Ajuda do DSM</b>)</li>
		<li><b>Guia do Usu&aacute;rio DSM do Synology</b> (dispon&iacute;vel no <a href="http://www.synology.com/support/download.php" target="_blank">Centro de Download</a> de Synology)</li>
	</ul>
</div>

</div>

<h2><a name="resourcemonitor" href="#" >Monitoramento de recursos do sistema</a></h2>

<div name="contents" id="resourcemonitor" class="x-hidden-display">
<p>Toque em <b>Monitoramento de recursos</b> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para monitorar a utiliza&ccedil;&atilde;o de mem&oacute;ria e da CPU do Synology NAS.</p>
</div>

<h2><a name="sysinfo" href="#" >Exibir informa&ccedil;&otilde;es do sistema</a></h2>

<div name="contents" id="sysinfo" class="x-hidden-display">
<p>Toque em <b>Informa&ccedil;&otilde;es do sistema</b> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para ver uma vis&atilde;o geral do status do Synology NAS.</p>

<h4>Para ver as informa&ccedil;&otilde;es de sistema do Synology NAS:</h4>
<ol>
	<li>Execute um dos seguintes procedimentos:
		<ul>
			<li>Toque em <b>Geral</b> para exibir as informa&ccedil;&otilde;es b&aacute;sicas sobre o Synology NAS, como o n&uacute;mero de s&eacute;rie, nome do modelo, a quantidade de mem&oacute;ria f&iacute;sica, vers&atilde;o do DSM, assim como informa&ccedil;&otilde;es de hora e status t&eacute;rmico.</li>
			<li>Toque em <b>Rede</b> para exibir a configura&ccedil;&atilde;o de rede do Synology NAS e o status de cada interface de rede.</li>
			<li>Toque em <b>Armazenamento</b> para exibir a utiliza&ccedil;&atilde;o de volume do Synology NAS.</li>
		</ul>
	</li>
	<li>Toque no bot&atilde;o <b>Atualizar</b> no canto superior direito para manter atualizadas as informa&ccedil;&otilde;es do sistema.</li>
</ol>
</div>

<h2><a name="firmware" href="#" >Firmware</a></h2>

<div name="contents" id="firmware" class="x-hidden-display">
<p>Toque em <b>Firmware</b> para visualizar e atualizar a vers&atilde;o do seu DSM.</p>

<h4>Para ajustar as configura&ccedil;&otilde;es de atualiza&ccedil;&atilde;o do DSM:</h4>
<ol>
	<li>Toque em <strong>Atualiza&ccedil;&atilde;o do DSM</strong>.</li>
	<li>Escolha uma das op&ccedil;&otilde;es a seguir:
		<ul>
			<li>Apenas atualiza&ccedil;&otilde;es importantes</li>
			<li>O DSM mais recente e todas as atualiza&ccedil;&otilde;es</li>
		</ul>
	</li>
	<li>Toque em <strong>Conclu&iacute;do</strong>.</li>
</ol>

<h4>Para baixar as atualiza&ccedil;&otilde;es dispon&iacute;veis:</h4>
<ol>
	<li>Verifique a vers&atilde;o do seu DSM em <strong>Status</strong>.</li>
	<li>Se a vers&atilde;o do seu DSM n&atilde;o estiver atualizada, toque no bot&atilde;o <strong>Download</strong> que aparecer&aacute; abaixo da se&ccedil;&atilde;o <strong>Status</strong> para atualizar seu DSM.</li>
</ol>
</div>

<h2><a name="block" href="#" >Gerenciamento de bloqueio de IP</a></h2>

<div name="contents" id="block" class="x-hidden-display">
<p>Toque em <b>Bloqueio de IP</b> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para impedir o login n&atilde;o autorizado.</p>

<h4>Para gerenciar o bloqueio de IP:</h4>
<ol>
	<li>Toque no bot&atilde;o de configura&ccedil;&atilde;o no canto superior direito.</li>
	<li>Ligue <b>Habilitar bloqueio autom&aacute;tico</b> para habilitar o bloqueio de IP.</li>
	<li>Digite um n&uacute;mero para <b>Tentativas de login</b> e <b>Dentro de (minutos)</b> para bloquear um endere&ccedil;o IP depois do n&uacute;mero definido de falhas em tentativas de login dentro do n&uacute;mero de minutos especificado.</li>
	<li>Voc&ecirc; pode ligar <b>Habilitar expira&ccedil;&atilde;o de bloqueio</b> e especificar <b>Desbloquear ap&oacute;s (dias)</b> para desbloquear o endere&ccedil;o IP ap&oacute;s um n&uacute;mero especificado de dias. Se voc&ecirc; digitar &quot;0&quot; aqui, o endere&ccedil;o IP bloqueado permanecer&aacute; bloqueado indefinidamente at&eacute; que voc&ecirc; o remova da lista de bloqueio.</li>
	<li>Toque em <b>Concluir</b>.</li>
</ol>

<h4>Para adicionar endere&ccedil;os IP &agrave; lista de permiss&atilde;o/bloqueio:</h4>
<ol>
	<li>Se desejar adicionar IP permitido/bloqueado &agrave; lista, toque no bot&atilde;o adicionar no canto superior direito e toque em <b>Lista de permiss&atilde;o</b> ou <b>Lista de bloqueio</b>.</li>
	<li>Ap&oacute;s inserir o endere&ccedil;o IP, toque em <b>Concluir</b>.</li>
</ol>
</div>


<h2><a name="package" href="#" >Gerenciamento do centro de pacotes</a></h2>

<div name="contents" id="package" class="x-hidden-display">

<p>A Synology integrou aplicativos de terceiros ou projetados pela pr&oacute;pria Synology em pacotes que podem ser instalados e habilitados facilmente no Synology NAS.</p>


<h4>Para gerenciar o Centro de Pacotes:</h4>
<p>Toque em <strong>Centro de Pacotes</strong> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para visualizar informa&ccedil;&otilde;es de pacotes, executar ou interromper pacotes ou atualizar para as vers&otilde;es mais recentes.</p>


<h4>Para executar ou interromper pacotes instalados:</h4>
<p>Toque no bot&atilde;o ao lado de um pacote para executar ou interromp&ecirc;-lo.</p>

<h4>Para visualizar pacotes: </h4>
<p>Toque em um pacote para visualizar suas informa&ccedil;&otilde;es.</p>
     
<h4>Para atualizar pacotes:</h4>
<ol>
	<li>Toque na guia <strong>Atualiza&ccedil;&atilde;o</strong> para visualizar as vers&otilde;es de atualiza&ccedil;&atilde;o dispon&iacute;veis no momento.</li>
    <li>Toque no bot&atilde;o &agrave; direita de um pacote para atualizar para a vers&atilde;o mais recente.</li>   
</ol>
</div>


<h2><a name="log" href="#">Exibir registros ou conex&otilde;es locais</a></h2>

<div name="contents" id="log" class="x-hidden-display">
<p>Toque em <b>Registro</b> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android) para monitorar as conex&otilde;es atuais ou ver os registros dos servi&ccedil;os do Synology NAS.</p>

<h4>Para monitorar as conex&otilde;es atuais:</h4>
<ul>
	<li>Toque em <b>Registros mais recentes [n&uacute;mero]</b> na se&ccedil;&atilde;o <b>Vis&atilde;o geral</b> para visualizar a lista de usu&aacute;rio que est&atilde;o acessando os servi&ccedil;os do Synology NAS ultimamente.</li>
</ul>

<h4>Para ver os registros de um servi&ccedil;o espec&iacute;fico:</h4>
<ul>
	<li>Toque em qualquer item de <b>Registros de eventos</b> ou <b>Registros de transfer&ecirc;ncia de arquivo</b> para ver a lista dos registros importantes.</li>
</ul>

</div>
<h2><a name="launch" href="#">Iniciar aplicativos m&oacute;veis</a></h2>
<div name="contents" id="launch" class="x-hidden-display">

<p>DSM mobile oferece um local conveniente para iniciar os aplicativos m&oacute;veis Synology instalados no seu dispositivo iOS ou Android.</p>

<h4>Para iniciar os aplicativos m&oacute;veis Synology com o DSM mobile:</h4>
<p>Toque um dos aplicativos a seguir na se&ccedil;&atilde;o inferior da p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou do painel esquerdo (iPad ou tablet Android):</p>
<ul>
	<li><b>DS photo</b> (dispon&iacute;vel quando o servi&ccedil;o <b>Photo Station</b> estiver ativado)</li>
	<li><b>DS audio</b> (dispon&iacute;vel quando o servi&ccedil;o <b>Audio Station</b> estiver ativado)</li>
	<li><b>DS cam</b> (dispon&iacute;vel quando o servi&ccedil;o <b>Surveillance Station</b> estiver ativado)</li>
	<li><b>DS file</b> (dispon&iacute;vel quando o servi&ccedil;o <b>WebDAV</b> estiver ativado)</li>
</ul>

<div class="section">
<h4>Nota:</h4>
	<ul>
		<li>Para obter mais informa&ccedil;&otilde;es sobre esses aplicativos, consulte os arquivos de Ajuda fornecidos com os aplicativos.</li>
     </ul> 
</div>
</div>

<h2><a name="restart" href="#">Configurar o Synology NAS em a&ccedil;&atilde;o<br><span style="font-size:80%;">(Reiniciar, desligar ou bipe)</span></a></h2>

<div name="contents" id="restart" class="x-hidden-display">
<p>Com DSM mobile voc&ecirc; pode reiniciar ou desligar seu Synology NAS com o dispositivo iOS ou Android. Al&eacute;m disso, se houver v&aacute;rios Synology NAS perto de voc&ecirc;, voc&ecirc; pode identificar rapidamente seu Synology NAS solicitando que ele emita sons de bipe.</p>

<h4>Para configurar seu Synology NAS em a&ccedil;&atilde;o:</h4>
<ol>
	<li>Toque o bot&atilde;o de op&ccedil;&atilde;o no canto superior direito da p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou do painel esquerdo (iPad ou tablet Android).</li>
	<li>Execute um dos seguintes procedimentos:
		<ul>
			<li>Toque em <b>Reiniciar</b> e toque em <b>Sim</b> para reiniciar o Synology NAS.</li>
			<li>Toque em <b>Desligar</b> e toque em <b>Sim</b> para desligar o Synology NAS.</li>
			<li>Toque em <b>Localizar-me</b> para pedir ao Synology NAS que reproduza sons de bipe. Toque em <b>OK</b> para interromper os bipes.</li>
		</ul>
	</li>
</ol>
</div>


<h2><a name="desktopedition" href="#">Alternar para o modo &aacute;rea de trabalho do DSM</a></h2>

<div name="contents" id="desktopedition" class="x-hidden-display">
<p>Toque no &iacute;cone de configura&ccedil;&otilde;es e selecione <b>Modo &aacute;rea de trabalho</b> para alternar para o modo &aacute;rea de trabalho do DSM.</p>

</div>




<h2><a name="contents12" href="#">Utilize o Gerenciador de armazenamento</a></h2>
<div name="contents" id="contents12" class="x-hidden-display">
<p>O <strong>Gerenciador de armazenamento</strong> permite visualizar o uso e o status de integridade de volumes e discos do sistema.</p>

<h4>Para visualizar informa&ccedil;&otilde;es de volumes:</h4>
	<ol>
		<li>Toque em <strong>Gerenciador de armazenamento</strong> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android).</li>
		<li>Toque na guia <strong>Volume</strong>.</li> 
		<li>Toque em um volume na lista para visualizar suas informa&ccedil;&otilde;es detalhadas.</li>
	</ol>

<h4>Para visualizar as informa&ccedil;&otilde;es do disco:</h4>
	<ol>
		<li>Toque em <strong>Gerenciador de armazenamento</strong> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android).</li>
		<li>Toque na guia <strong>HDD/SDD</strong>.</li>
		<li>Toque em um disco na lista para visualizar sua integridade e suas informa&ccedil;&otilde;es S.M.A.R.T.</li>
	</ol>

<h4>Para iniciar ou interromper um teste S.M.A.R.T.:</h4>
	<ol>
		<li>Toque em <strong>Gerenciador de armazenamento</strong> na p&aacute;gina inicial (iPhone/iPod touch ou telefone Android) ou no painel esquerdo (iPad ou tablet Android).</li>
		<li>Toque na guia <strong>HDD/SDD</strong>.</li>
		<li>Toque em um disco na lista para visualizar sua p&aacute;gina da informa&ccedil;&otilde;es.</li>
		<li>Toque em <strong>Teste S.M.A.R.T.</strong> para iniciar um teste S.M.A.R.T. ou <strong>Parar</strong> para interromp&ecirc;-lo.</li>
     </ol>
     
</div>


<h2><a name="contents11" href="#">Mais informa&ccedil;&otilde;es</a></h2>

<div name="contents" id="contents11" class="x-hidden-display">
<p>Se precisar de informa&ccedil;&otilde;es para solu&ccedil;&atilde;o de problemas ou se quiser saber mais sobre a Synology, toque nos links a seguir para obter recursos online da Synology:</p>
<ul>
	<li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">Perguntas frequentes</a>
</li>
	<li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
	<li><a href="http://forum.synology.com" target="_blank">F&oacute;rum</a></li>
	<li><a href="http://www.synology.com/support/download.php" target="_blank">Centro de Download</a></li>
	<li><a href="https://myds.synology.com/support/support_form.php" target="_blank">Suporte T&eacute;cnico</a></li>
</ul>
</div>


</body>
</html>