
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Options de gestion de File Station - Aide Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Learn how to customize File Station settings related to file management, shared links, and security.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Envoyer des fichiers en tant que pi&egrave;ces jointes de l&apos;e-mail</h2>

<p>Vous pouvez directement envoyer des fichiers en tant que pi&egrave;ces jointes de l&apos;e-mail dans <strong>File Station </strong> en effectuant un clic droit sur les fichiers s&eacute;lectionn&eacute;s puis en s&eacute;lectionnant <strong>Envoyer en tant que pi&egrave;ce jointe de l&apos;e-mail</strong>. Une fen&ecirc;tre e-mail appara&icirc;tra avec quelques fonctions utiles :</p>
<ul>
<li>Vers : Si vous avez synchronis&eacute; des contacts pour votre compte e-mail, une liste de contacts appara&icirc;tra, et affichera les contacts associ&eacute;s &agrave; votre compte e-mail.</li>
<li>Depuis : Vous pouvez s&eacute;lectionner le compte e-mail par d&eacute;faut ou un autre compte ajout&eacute;.  La liste de contacts passera automatiquement au compte e-mail s&eacute;lectionn&eacute;.</li>
<li>Pi&egrave;ces jointes : Les pi&egrave;ces jointes s&eacute;lectionn&eacute;es apparaissent au bas de l&apos;e-mail. Vous pouvez ajouter davantage de pi&egrave;ces jointes en utilisant le bouton pi&egrave;ces jointes.</li>
</ul>

<div class="section">
  <h4>Remarque&nbsp;:</h4>
  <ul>
    <li>Seuls les fichiers peuvent &ecirc;tre ajout&eacute;s comme pi&egrave;ces jointes.</li>
    <li>Vous pouvez attacher jusqu&rsquo;&agrave; 10 fichiers dans un seul e-mail.</li>
    <li>La taille maximale de toutes les pi&egrave;ces jointes dans un seul e-mail d&eacute;pendra de votre service e-mail. Si vous n&apos;&ecirc;tes pas s&ucirc;r(e), nous vous recommandons de limiter la taille totale de toutes les pi&egrave;ces jointes &agrave; 25Mo. </li>
  </ul>
</div>
</body>
</html>
