<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Afficher ou modifier les permissions des fichiers/dossiers</h2>
<p>Gr&acirc;ce &agrave; File&nbsp;Station, vous pouvez d&eacute;finir les privil&egrave;ges d&apos;acc&egrave;s aux fichiers et aux sous-dossiers. Cette fonction est particuli&egrave;rement int&eacute;ressante lorsque vous voulez autoriser diff&eacute;rents groupes d&apos;utilisateurs &agrave; acc&eacute;der aux diff&eacute;rents sous-dossiers d&apos;un dossier partag&eacute;.</p>

<h4>Pour autoriser les utilisateurs et les groupes &agrave; acc&eacute;der aux fichiers et aux sous-dossiers&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez les fichiers et les dossiers pour lesquels vous souhaitez d&eacute;finir les privil&egrave;ges d&apos;acc&egrave;s.</li>
<li>Effectuez un clic droit sur un des fichiers ou dossiers, ou choisissez le menu <b>Action</b>, puis choisissez <b>Propri&eacute;t&eacute;s</b>.</li>

<img src="about:blank" class="help_image"/>

<li>Dans la section <b>Propri&eacute;taire</b>,choisissez le propri&eacute;taire des fichiers et dossiers s&eacute;lectionn&eacute;s dans le menu d&eacute;roulant <b>Propri&eacute;taire</b>.</li>

<img src="about:blank" class="help_image"/>

<li class="disable-eds14">Cliquez sur l&apos;onglet <b>Autorisation</b>, et s&eacute;lectionnez un utilisateur ou un groupe. Cliquez sur <strong>Modifier</strong> pour ouvrir <strong>Inspecteur d&apos;autorisation<strong>.</strong></strong><br>

<li class="disable-eds14">Effectuez l&apos;une des actions suivantes dans la fen&ecirc;tre <b>Modifier l&apos;autorisation</b> pour g&eacute;rer les autorisations ACL pour le fichier ou le dossier :

<ol class="disable-eds14">
        <li><b>Utilisateur ou groupe&nbsp;:</b> Sp&eacute;cifiez l&apos;utilisateur ou le groupe dont vous d&eacute;sirez personnaliser les autorisations.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>H&eacute;riter de&nbsp;:</b> Pour visualiser seulement. Afficher les informations ici pour voir si l&apos;autorisation est h&eacute;rit&eacute;e (d&apos;un dossier parent) ou explicite (indiqu&eacute; par <b>Aucun</b>). </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Type :</b> Choisissez <b>Autoriser</b> ou <b>Refuser</b> pour accorder ou refuser l&apos;autorisation &agrave; l&apos;utilisateur ou au groupe.</li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Appliquer &agrave; :</b> Si vous cr&eacute;ez une entr&eacute;e d&apos;autorisation pour un dossier, cochez les cases pour appliquer l&apos;entr&eacute;e &agrave; ce dossier, les dossiers (ou <b>Dossiers enfants</b>) ou fichiers (ou <b>Fichiers enfants</b>) dans ce dossier, ou tous les fichiers ou dossiers contenu dans ce dossier (ou <b>Tous les descendants</b>). </li>
        
        <img src="about:blank" class="help_image"/>
        
        <li><b>Administration :</b> Cochez <b>Lire les autorisations</b>, <b>Changer les autorisations</b> ou <b>Prendre possession</b> pour sp&eacute;cifier le privil&egrave;ge d&apos;acc&egrave;s de l&apos;utilisateur ou du groupe pour l&apos;entr&eacute;e de l&apos;autorisation. </li>
        <li><b>Lecture</b> ou <b>&Eacute;criture</b>&nbsp;: Cochez les cases dans ces sections pour modifier la permission de l&apos;utilisateur ou du groupe pour le fichier ou dossier. </li>
      </ol>    
  <li> Cliquez sur <b>OK</b>.</li>
</ol>


<p><span class="note_head">Remarque&nbsp;: </span>Vous n&rsquo;&ecirc;tes pas autoris&eacute; &agrave; modifier les privil&egrave;ges d&rsquo;acc&egrave;s aux fichiers et sous-dossiers dans le dossier partag&eacute; <b>photo</b>.</p>
</body>
</html>
