<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Charger des fichiers ou dossiers</h2>
<p>Utilisez l'une des m&eacute;thodes suivantes pour charger les fichiers et dossiers de votre ordinateur vers le DiskStation.</p>
<p>Pour avoir un acc&egrave;s total aux fonctions de chargement d&eacute;crites ci-dessous, installez les derni&egrave;res versions de Java Runtime Environment (JRE) et Flash Player. </p>


<h4>M&eacute;thode 1&nbsp;:</h4>
<ol>
<li>
Dans la partie sup&eacute;rieure du panneau gauche, choisissez un dossier de destination sur le DiskStation. 
</li>
<li>
Cliquez sur <b>Charger</b>, choisissez <strong>Charger - Ignorer</strong> ou <strong>Charger - &Eacute;craser</strong> et s&eacute;lectionnez les fichiers et les dossiers sur votre ordinateur local. </li>
</ol>
<h4>M&eacute;thode 2&nbsp;:</h4>
<ol>
	<li>Allez dans <strong>Param&egrave;tres</strong>, cochez <strong>Parcourir les fichiers sur l'ordinateur local avec File Station</strong> et actualisez la page Web pour afficher les dossiers de votre ordinateur local sur la partie inf&eacute;rieure du volet gauche.</li>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>L'option <strong>Parcourir les fichiers sur l'ordinateur local avec File Station</strong> ne prend effet qu'apr&egrave;s avoir install&eacute; et activ&eacute; JRE sur votre ordinateur.</p>
</div>
	<li>Dans la partie inf&eacute;rieure du panneau gauche, s&eacute;lectionnez un dossier sur votre ordinateur local. La section principale affiche maintenant le contenu du dossier s&eacute;lectionn&eacute;.
	</li>
	<li>S&eacute;lectionnez les fichiers ou dossiers souhait&eacute;s dans la section principale, puis cliquez sur <b>Charger</b>. 
</li>
	<li>S&eacute;lectionnez un dossier de destination sur le DiskStation dans la fen&ecirc;tre qui appara&icirc;t.
	</li>
	<li>Dans le coin sup&eacute;rieur droit de la fen&ecirc;tre, s&eacute;lectionnez <b>&Eacute;craser</b> si vous voulez &eacute;craser les fichiers et dossiers ayant le m&ecirc;me nom dans le dossier de destination. Sinon, s&eacute;lectionnez <b>Ignorer</b>.
</li>
	<li>Cliquez sur <b>OK</b> pour d&eacute;marrer le chargement.
</li>
</ol>
<h4>M&eacute;thode 3&nbsp;:</h4>
<ol>
<li>Allez dans <strong>Param&egrave;tres</strong>, cochez <strong>Parcourir les fichiers sur l'ordinateur local avec File Station</strong> et actualisez la page Web pour afficher les dossiers de votre ordinateur local sur la partie inf&eacute;rieure du volet gauche.</li>
<li>
Sur le panneau gauche, faites glisser un dossier de votre ordinateur (la partie inf&eacute;rieure) vers n'importe quel dossier du DiskStation (la partie sup&eacute;rieure).
</li>
<li>
Dans le menu contextuel qui appara&icirc;t, choisissez si vous voulez &eacute;craser ou ignorer les fichiers/dossiers ayant le m&ecirc;me nom dans le dossier de destination.
</li>
</ol>
<h4>M&eacute;thode 4&nbsp;:</h4>
<ol>
<li>
Dans la partie sup&eacute;rieure du panneau gauche, choisissez un dossier de destination sur le DiskStation.
</li>

<li>
S&eacute;lectionnez les fichiers sur le bureau de votre ordinateur ou sur votre explorateur de fichiers (par exemple, Windows Explorer ou Mac Finder) et faites glisser et d&eacute;posez-les dans File Station dans le navigateur Web.
</li>

<li>
Dans le dialogue qui appara&icirc;t, choisissez si vous voulez &eacute;craser ou ignorer les fichiers ayant le m&ecirc;me nom dans le dossier de destination.</li>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>La <b>M&eacute;thode 4</b> n'est pris en charge que certains navigateurs&nbsp;: Chrome, Firefox, Safari 5.1 ou ult&eacute;rieur. Cependant, elle n'est pas prise en charge pour Mac quand <strong>Parcourir les fichiers sur l'ordinateur local avec File Station</strong> est coch&eacute;.</li>
<li>
Vous pouvez &eacute;galement faire glisser-d&eacute;placer des dossiers ou des fichiers vides, mais seulement quand <strong>Parcourir les fichiers sur l'ordinateur local avec File Station</strong> est coch&eacute; pour les navigateurs list&eacute;s ci-dessus. Dans le cas contraire, vous ne pouvez pas charger des dossiers et des fichiers vides &agrave; l'aide de la <strong>M&eacute;thode 4</strong>.</li>
	<li>
Si vous utilisez Chrome pour Linux et vous connectez &agrave; DSM via le protocole HTTPS, vous devez importer un certificat de confiance (dans <b>Panneau de configuration</b> &gt; <b>S&eacute;curit&eacute;</b> &gt; <strong>certificat</strong>) pour pouvoir charger &agrave; l'aide de <b>Method 4</b>. 
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ol>
<li>
Vous pouvez ajouter jusqu'&agrave; 1000 fichiers &agrave; votre file d'attente des chargements.
</li>
	<li>
	Vous pouvez charger des fichiers dont la taille d&eacute;passe 4&nbsp;Go si vous utilisez Google Chrome, Firefox, Safari 5.1 ou version ult&eacute;rieure, ou quand <strong>Parcourir les fichiers sur l'ordinateur local avec File Station</strong> est coch&eacute;. Sinon, vous ne pouvez charger des fichiers que de jusqu'&agrave; 2&nbsp;Go &agrave; la fois.</li>
	<li>
Dans un dossier partag&eacute; non crypt&eacute;, le dossier/fichier peut comporter jusqu'&agrave; 255 caract&egrave;res (jusqu'&agrave; 80 caract&egrave;res pour les langues non latines)&nbsp;; dans un dossier partag&eacute; crypt&eacute;, il peut comporter jusqu'&agrave; 143 caract&egrave;res (jusqu'&agrave; 47 caract&egrave;res pour les langues non latines).
</li>
<li>
Le nom du dossier/fichier doit exclure les caract&egrave;res suivants&nbsp;: \ / : * ? &quot; &gt; |.
</li>
<li>
Le nom du fichier/dossier ne peut commencer par &laquo;&nbsp;._&nbsp;&raquo;.
</li>
<li>Vous pouvez charger des fichiers d'une taille de 0&nbsp;Ko seulement quand vous avez install&eacute; JRE.</li>
</ol>
</div>


<div class="section">
<h4>D&eacute;pannage</h4>
<p>Si vous ne pouvez pas parcourir des &eacute;l&eacute;ments locaux stock&eacute;s sur votre Mac en utilisant Safari correctement, veuillez proc&eacute;der comme suit :</p>
<ol>
<li>Sur votre Mac, ouvrez Safari et choisissez <strong>Pr&eacute;f&eacute;rences</strong> dans le menu Safari.</li>
<li>Cliquez sur <strong>G&eacute;rer les param&egrave;tres du site web</strong> dans l'onglet <strong>S&eacute;curit&eacute;</strong>.</li>
<li>Sous <strong>Java</strong>, choisissez votre &quot;site web&quot; DSM.</li>
<li>S&eacute;lectionnez <strong>Ex&eacute;cuter en mode non s&eacute;curis&eacute;</strong>.</li>
</ol>
</div>



</body>
</html>
