<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<title>Správce High Availability – Synology DSM Help</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology High Availability uses two servers to form a high-availability cluster in which one server assumes the role of active server and another server acts as a standby passive server.">


 </head>
 <body>
  <h1>Správce High Availability</h1>

  <p>Nástroj High Availability představuje řešení rozvržení serveru, které slouží k omezení přerušení služeb způsobených poruchou serveru. Nástroj Synology High Availability vytvoří pomocí dvou serverů tzv. „cluster high-availability“, v rámci kterého jeden ze serverů představuje „aktivní server“ a druhý server slouží jako „pasivní server“ v pohotovostním režimu. Implementace a vytvoření clusteru high-availability vyžaduje dva kompatibilní servery Synology.</p>
  <p>Cluster high-availability využ&iacute;v&aacute; n&aacute;sleduj&iacute;c&iacute; souč&aacute;sti a&nbsp;koncepty:</p>

  <ul>
   <li><b>Koncept: </b>Implementace technologie Synology High Availability vyžaduje k&nbsp;vytvořen&iacute; clusteru high-availability dva servery Synology. Jeden ze severů představuje &bdquo;aktivn&iacute; server&ldquo;, druh&yacute; pak &bdquo;pasivn&iacute; server&ldquo;. Po vytvořen&iacute; clusteru high-availability prob&iacute;h&aacute; nepřetržit&eacute; kop&iacute;rov&aacute;n&iacute; dat z&nbsp;aktivn&iacute;ho serveru na pasivn&iacute; server. Na pasivn&iacute;m serveru budou uloženy duplicitn&iacute; kopie v&scaron;ech souborů z&nbsp;aktivn&iacute;ho serveru. V&nbsp;př&iacute;padě poruchy aktivn&iacute;ho serveru převezme pasivn&iacute; server v&scaron;echny služby a&nbsp;vytvoř&iacute; kompletn&iacute; zrcadlovou kopii dat uložen&yacute;ch na aktivn&iacute;m serveru. Cluster high-availability tak bude i&nbsp;nad&aacute;le zaji&scaron;ťovat běžn&yacute; provoz služeb a&nbsp;sn&iacute;ž&iacute; riziko v&yacute;padku serverů. Dal&scaron;&iacute; informace o&nbsp;funkci přepnut&iacute; najdete v&nbsp;č&aacute;sti <a href="switchover_fail.html">Přepnut&iacute;</a></li>
   <li><b>Aktivn&iacute; server:</b> Aktivn&iacute; server prov&aacute;d&iacute; spr&aacute;vu provozu v&scaron;ech služeb. V&nbsp;př&iacute;padě chyby aktivn&iacute;ho serveru můžete vy nebo v&aacute;&scaron; syst&eacute;m zah&aacute;jit proces přepnut&iacute; služeb na pasivn&iacute; server. V&nbsp;takov&eacute;m př&iacute;padě bude provoz těchto služeb před&aacute;n pasivn&iacute;mu serveru a&nbsp;aktivn&iacute; server bude pot&eacute; plnit funkci pasivn&iacute;ho serveru.</li>
   <li><b>Pasivn&iacute; server:</b> Za běžn&yacute;ch podm&iacute;nek je pasivn&iacute; server v&nbsp;pohotovostn&iacute;m režimu. Prob&iacute;h&aacute; neust&aacute;l&eacute; replikovan&iacute; dat z&nbsp;aktivn&iacute;ho serveru na pasivn&iacute; server. V&nbsp;př&iacute;padě, že aktivn&iacute; server nemůže zajistit provoz služeb, můžete vy nebo v&aacute;&scaron; syst&eacute;m zah&aacute;jit proces přepnut&iacute; služeb na pasivn&iacute; server. </li>
   <li><b>Připojen&iacute; prezenčn&iacute;ho sign&aacute;lu:</b> Aktivn&iacute; a&nbsp;pasivn&iacute; server clusteru high-availability jsou propojeny samostatn&yacute;m připojen&iacute;m priv&aacute;tn&iacute; s&iacute;tě, kter&eacute; se označuje jako &bdquo;Připojen&iacute; prezenčn&iacute;ho sign&aacute;lu&ldquo;. Po vytvořen&iacute; clusteru high-availability bude na z&aacute;kladě připojen&iacute; prezenčn&iacute;ho sign&aacute;lu zah&aacute;jena synchronizace a&nbsp;replikace dat mezi aktivn&iacute;m a&nbsp;pasivn&iacute;m serverem. Pokud je kontakt mezi servery na nějakou dobu přeru&scaron;en, bude syst&eacute;m zji&scaron;ťovat, zda je nutn&eacute; přepnut&iacute;.</li>
   <li><b>Hlavn&iacute; svazek &uacute;loži&scaron;tě pro cluster high-availability:</b> Svazek &uacute;loži&scaron;tě aktivn&iacute;ho serveru bude plnit funkci hlavn&iacute;ho svazku &uacute;loži&scaron;tě pro cluster high-availability. Data budou synchronizov&aacute;na se svazkem &uacute;loži&scaron;tě pasivn&iacute;ho serveru prostřednictv&iacute;m připojen&iacute; prezenčn&iacute;ho sign&aacute;lu.</li>
   <li><b>Z&aacute;ložn&iacute; svazek &uacute;loži&scaron;tě pro cluster high-availability: </b>Svazek &uacute;loži&scaron;tě pasivn&iacute;ho serveru pln&iacute; funkci z&aacute;ložn&iacute;ho svazku &uacute;loži&scaron;tě pro cluster high-availability. Data budou neust&aacute;le replikov&aacute;na ze svazku &uacute;loži&scaron;tě aktivn&iacute;ho serveru na svazek &uacute;loži&scaron;tě pasivn&iacute;ho serveru prostřednictv&iacute;m připojen&iacute; prezenčn&iacute;ho sign&aacute;lu. T&iacute;m bude během přepnut&iacute; zaji&scaron;těna konzistence obsahu souborů.</li>
   <li><b>N&aacute;zev serveru clusteru high-availability:</b> Servery v&nbsp;r&aacute;mci clusteru high-availability budou m&iacute;t stejn&yacute; n&aacute;zev. V&nbsp;r&aacute;mci s&iacute;tě se můžete připojit pomoc&iacute; tohoto n&aacute;zvu serveru, provoz služeb pak bude zaji&scaron;ťovat aktivn&iacute; server. </li>
   <li><b>IP adresa clusteru high-availability: </b>Vzhledem k&nbsp;tomu, že aktivn&iacute; i&nbsp;pasivn&iacute; servery v&nbsp;r&aacute;mci clusteru high-availability maj&iacute; vlastn&iacute; IP adresu a&nbsp;při přep&iacute;n&aacute;n&iacute; mezi jednotliv&yacute;mi servery je potřeba zabr&aacute;nit změně na jinou IP adresu, vytv&aacute;ř&iacute; cluster high-availability obecnou př&iacute;stupovou IP adresu. Chcete-li z&iacute;skat př&iacute;stup k&nbsp;libovoln&yacute;m služb&aacute;m syst&eacute;mu DSM bez ohledu na to, kter&yacute; server Synology pln&iacute; funkci aktivn&iacute;ho serveru, můžete se připojit pomoc&iacute; těchto IP&nbsp;adres. </li>
  </ul>
 


 </body>
</html>
