<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Nastaven&iacute; s&iacute;tě</h2>
	<p>Tato str&aacute;nka obsahuje tři karty, kter&eacute; zobrazuj&iacute; nastaven&iacute; s&iacute;tě pro cluster high-availability, aktivn&iacute; a&nbsp;pasivn&iacute; člensk&eacute; servery.</p>
  
	<h3>Karta clusteru HA</h3>
  	<p>Při vytv&aacute;řen&iacute; clusteru high-availability vytvoř&iacute; syst&eacute;m obecnou IP adresu clusteru high-availability určenou pro př&iacute;jem př&iacute;choz&iacute;ch připojen&iacute; pro tuto IP adresu. V&nbsp;př&iacute;padě potřeby lze vytvořit dodatečn&eacute; IP adresy clusteru high-availability. IP&nbsp;adresy aktivovan&yacute;ch s&iacute;ťov&yacute;ch rozhran&iacute; na aktivn&iacute;m serveru budou zobrazeny na t&eacute;to kartě (s&iacute;ťov&eacute; rozhran&iacute; využ&iacute;van&eacute; připojen&iacute;m prezenčn&iacute;ho sign&aacute;lu na t&eacute;to str&aacute;nce zobrazeno nebude, protože zm&iacute;něn&eacute; rozhran&iacute; bude použito pro synchronizaci dat mezi dvěma servery). Tato karta zobrazuje n&iacute;že uveden&eacute; informace:</p>
    	<ul>
    	  <li><b>S&iacute;ťov&eacute; rozhran&iacute;:</b> Aktivovan&aacute; s&iacute;ťov&aacute; rozhran&iacute; na aktivn&iacute;m serveru.</li>
          <li><b>Připojen&iacute;:</b> Zobrazuje, zda je toto rozhran&iacute; připojeno či nikoli.</li>
          <li><b>IP&nbsp;adresa:</b> Při vytv&aacute;řen&iacute; clusteru high-availability vytvoř&iacute; syst&eacute;m obecnou IP&nbsp;adresu clusteru high-availability určenou pro př&iacute;jem př&iacute;choz&iacute;ch připojen&iacute; pro tuto IP&nbsp;adresu. Pomoc&iacute; t&eacute;to IP&nbsp;adresy se můžete připojit ke clusteru high-availability, pokud chcete využ&iacute;vat služeb syst&eacute;mu&nbsp;DSM bez ohledu na to, kter&yacute; server Synology pln&iacute; funkci aktivn&iacute;ho serveru. D&iacute;ky tomu nen&iacute; nutn&eacute; se po přepnut&iacute; připojovat k&nbsp;různ&yacute;m IP&nbsp;adres&aacute;m.</li>
            <li><b>Maska pods&iacute;tě: </b>Přidružen&aacute; maska pods&iacute;tě dan&eacute; IP&nbsp;adresy clusteru high-availability.</li>
		</ul>
<h4>&Uacute;prava položek IP&nbsp;adresa a&nbsp;Maska pods&iacute;tě:</h4>
	<ol>
		<li>Vyberte IP&nbsp;adresu nebo masku pods&iacute;tě, kterou chcete upravit, a&nbsp;klepnut&iacute;m na možnost <b>Upravit</b> nebo poklep&aacute;n&iacute;m na pole zahajte &uacute;pravy.</li>
   <li>Chcete-li povolit nebo zak&aacute;zat jednotliv&aacute; rozhran&iacute;, za&scaron;krtněte pol&iacute;čko <b>Povolit</b>. Můžete povolit v&iacute;ce než jedno s&iacute;ťov&eacute; rozhran&iacute; clusteru, původn&iacute; s&iacute;ťov&eacute; rozhran&iacute; nastaven&eacute; při vytv&aacute;řen&iacute; clusteru v&scaron;ak nelze zak&aacute;zat.</li>
    </ol>
<h4>Změna n&aacute;zvu serveru clusteru high-availability:</h4>
 	<ul>
    	<li>Klepnut&iacute;m na možnost <b>Změnit s&iacute;ťov&aacute; nastaven&iacute;</b> zobraz&iacute;te n&aacute;zev clusteru high-availability a&nbsp;provedete změnu nastaven&iacute;.</li>
   		<li>Klepnut&iacute;m na možnost <b>Použ&iacute;t</b> ulož&iacute;te aktu&aacute;ln&iacute; nastaven&iacute; n&aacute;zvu a&nbsp;IP&nbsp;adresy clusteru high-availability.</li>
   		<li>Aktu&aacute;ln&iacute; změny zru&scaron;&iacute;te klepnut&iacute;m na možnost <b>Storno</b>. </li>
  </ul>

<h3>Karta aktivn&iacute;ho a&nbsp;pasivn&iacute;ho serveru (zobrazen jako n&aacute;zev serveru)</h3>
<p>Tyto karty zobrazuj&iacute; stav s&iacute;ťov&yacute;ch rozhran&iacute; na aktivn&iacute;m a&nbsp;pasivn&iacute;m serveru. Z&nbsp;toto je připojen&iacute; prezenčn&iacute;ho sign&aacute;lu souč&aacute;st&iacute; jednoho s&iacute;ťov&eacute;ho rozhran&iacute; jednotliv&yacute;ch aktivn&iacute;ch a&nbsp;pasivn&iacute;ch serverů. Tyto karty zobrazuj&iacute; n&aacute;sleduj&iacute;c&iacute; informace:</p>
	<ul>
    	<li><b>S&iacute;ťov&eacute; rozhran&iacute;:</b> Fyzick&eacute; s&iacute;ťov&eacute; rozhran&iacute; na serveru.</li>
    	<li><b>IP&nbsp;adresa:</b> Přiřazen&aacute; IP&nbsp;adresa dan&eacute;ho s&iacute;ťov&eacute;ho rozhran&iacute;.</li>
    	<li><b>Maska pods&iacute;tě:</b> Přiřazen&aacute; maska pods&iacute;tě dan&eacute; IP&nbsp;adresy.</li>
    	<li><b>Popis:</b> Zobrazuje informace o&nbsp;dan&eacute;m s&iacute;ťov&eacute;m rozhran&iacute; a zpř&iacute;stupněn&iacute; přiřazen&eacute; IP&nbsp;adresy. Toto pole zobraz&iacute; n&aacute;sleduj&iacute;c&iacute; možn&eacute; podm&iacute;nky:</li>
		<ol>
			<li><b>Př&iacute;stupn&aacute; původn&iacute; IP&nbsp;adresa</b>: Původn&iacute; IP&nbsp;adresa přidělen&aacute; rozhran&iacute; na aktivn&iacute;m serveru je př&iacute;stupn&aacute; pro data a&nbsp;služby.</li>
			<li><b>Nepř&iacute;stupn&aacute; původn&iacute; IP&nbsp;adresa</b>: Původn&iacute; IP&nbsp;adresa přidělen&aacute; rozhran&iacute; na pasivn&iacute;m serveru nen&iacute; př&iacute;stupn&aacute;.</li>
			<li><b>IP&nbsp;adresa připojen&iacute; prezenčn&iacute;ho sign&aacute;lu, nepř&iacute;stupn&aacute; z&nbsp;Intranetu</b>: Původn&iacute; IP&nbsp;adresa automaticky přidělen&aacute; připojen&iacute; prezenčn&iacute;ho sign&aacute;lu nen&iacute; př&iacute;stupn&aacute; pro data a&nbsp;služby.</li>
		</ol>
	</ul>
</body>
</html>