<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High&nbsp;Availability</title>


</head>
<body>

<h2> Sledov&aacute;n&iacute; služeb</h2>

<p>Tato str&aacute;nka umožňuje sledov&aacute;n&iacute; určit&yacute;ch služeb. Pokud dojde k&nbsp;selh&aacute;n&iacute; sledovan&eacute; služby na aktivn&iacute;m serveru, syst&eacute;m provede přepnut&iacute; služeb na z&aacute;ložn&iacute;, pasivn&iacute; server (v&nbsp;př&iacute;padě, že pasivn&iacute; server funguje norm&aacute;lně). Na t&eacute;to str&aacute;nce jsou zobrazeny n&aacute;sleduj&iacute;c&iacute; č&aacute;sti:</p>

<ul>
  <li><b>Služba:</b> Zobrazuje služby, kter&eacute; lze sledovat.</li>
  <li><b>Stav: </b> Zobrazuje informace o&nbsp;tom, zda jsou služby spu&scaron;těny či nikoli.</li>
  <li><b>Funkce převzet&iacute; služeb při poru&scaron;e: </b>Za&scaron;krtnut&iacute;m pol&iacute;čka vedle služby spust&iacute;te jej&iacute; sledov&aacute;n&iacute;. Pokud dojde k&nbsp;poru&scaron;e služby, syst&eacute;m spust&iacute; proces převzet&iacute;.</li>
</ul>

<h4>Postup sledov&aacute;n&iacute; služby:</h4>

<ol>
<li>Vyhledejte službu, kterou chcete sledovat. Za&scaron;krtněte pol&iacute;čko vedle t&eacute;to služby.</li>
<li>Nastaven&iacute; ulož&iacute;te klepnut&iacute;m na možnost <b>Použ&iacute;t</b>.</li>
</ol>

<div class="section">
<h4>Podporovan&eacute; služby</h4>
<p>Služby, kter&eacute; lze sledovat, jsou n&aacute;sleduj&iacute;c&iacute;: Souborov&aacute; služba syst&eacute;mu, c&iacute;l iSCSI&nbsp;Target, FTP, souborov&aacute; služba syst&eacute;mu&nbsp;Mac, služba&nbsp;NFS.</p>
</div>

<div class="section">
<h4>Převzet&iacute; služeb při poru&scaron;e s&iacute;ťov&eacute;ho připojen&iacute;</h4>
<p>Pokud tuto možnost povol&iacute;te, syst&eacute;m spust&iacute; převzet&iacute; služeb na pasivn&iacute; server v&nbsp;př&iacute;padě, že dojde k&nbsp;selh&aacute;n&iacute; nebo poru&scaron;e s&iacute;ťov&eacute;ho připojen&iacute; aktivn&iacute;ho serveru, a&nbsp;za předpokladu, že s&iacute;ťov&eacute; připojen&iacute; pasivn&iacute;ho serveru funguje norm&aacute;lně.</p>

<ul>
<li>Převzet&iacute; služeb bude spu&scaron;těno pouze tehdy, pokud m&aacute; pasivn&iacute; server kvalitněj&scaron;&iacute; připojen&iacute;. Pokud m&aacute; aktivn&iacute; server k&nbsp;dispozici např&iacute;klad tři připojen&iacute; a&nbsp;dojde k&nbsp;selh&aacute;n&iacute; jednoho z&nbsp;nich, syst&eacute;m spust&iacute; převzet&iacute; služeb pouze tehdy, pokud m&aacute; pasivn&iacute; server k&nbsp;dispozici tři a&nbsp;v&iacute;ce funkčn&iacute;ch připojen&iacute;.</li>
<li>Kombinace připojen&iacute; s&nbsp;funkc&iacute; Link Aggregation se považuj&iacute; za jedin&eacute; připojen&iacute;. Pokud např&iacute;klad zkombinujete dvě připojen&iacute; a&nbsp;dojde k&nbsp;selh&aacute;n&iacute; jednoho z&nbsp;nich, přičemž druh&eacute; v&scaron;ak st&aacute;le funguje, bude připojen&iacute; považov&aacute;no za funkčn&iacute;.</li>
</ul>

</div>

</body>
</html>
