<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Configura&ccedil;&otilde;es Avan&ccedil;adas do Consultor de Seguran&ccedil;a</title>

<link href="../../help.css" rel="stylesheet" type="text/css">
<link href="../../scrollbar/flexcroll.css" rel="stylesheet" type="text/css">
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>

<h2>Avan&ccedil;adas</h2>
<p>Voc&ecirc; pode visualizar e alterar as configura&ccedil;&otilde;es avan&ccedil;adas do Consultor de Seguran&ccedil;a.	</p>
<h3>Linha de Base de Seguran&ccedil;a </h3>
<p>Voc&ecirc; pode escolher quais regras de seguran&ccedil;a o Consultor de Seguran&ccedil;a verificar&aacute; selecionando uma <strong>Linha de base de seguran&ccedil;a</strong>. O n&uacute;mero e os tipos das regras variam para cada <strong>Linha de base de seguran&ccedil;a</strong>. Fa&ccedil;a sua escolha conforme suas necessidades.  Voc&ecirc; est&aacute; usando o DiskStation para trabalho e neg&oacute;cios ou em casa e para uso pessoal? Voc&ecirc; pode selecionar entre as seguintes op&ccedil;&otilde;es:</p>
<ul>
<li><strong>Para uso dom&eacute;stico e pessoal</strong>: O Consultor de seguran&ccedil;a executar&aacute; verifica&ccedil;&otilde;es essenciais para proteger seu DiskStation contra as amea&ccedil;as cibern&eacute;ticas mais comuns.</li>
<li><strong>Para trabalho e neg&oacute;cios</strong>: O Consultor de seguran&ccedil;a executar&aacute; verifica&ccedil;&otilde;es completas para atender aos requisitos de conformidade de seguran&ccedil;a de empresas.</li>
<li><strong>Personalizado</strong>: Selecione quais regras de seguran&ccedil;a voc&ecirc; deseja que o Consultor de Seguran&ccedil;a verifique. </li></ul>
<h3>Agendamento de Verifica&ccedil;&atilde;o</h3>
<p> Voc&ecirc; pode definir um agendamento para verifica&ccedil;&otilde;es regulares clicando em <strong>Habilitar agendamento de verifica&ccedil;&atilde;o regular</strong> e selecionando o hor&aacute;rio em que deseja que o Consultor de Seguran&ccedil;a execute uma verifica&ccedil;&atilde;o. O Consultor de Seguran&ccedil;a verificar&aacute; as regras de acordo com a <strong>Linha de Base de Seguran&ccedil;a</strong> que voc&ecirc; selecionou.</p>

</body>
</html>
