<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Conta de E-mail - Ajuda do Synology DSM</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Conta de E-mail</h2>
<p>Voc&ecirc; pode adicionar suas contas de e-mail em <b>Pessoal</b> &gt; <b>Conta de E-mail</b> e enviar os arquivos armazenados no File Station como anexos dos e-mails adicionados aqui.</p>
<p>Os prestadores de servi&ccedil;os de e-mail suportados incluem Gmail, Outlook, Yahoo!, AOL e servidores SMTP personalizados.</p>

<h4>Para adicionar uma conta de e-mail:</h4>
<ol>
<li>Clique em <b>Adicionar</b> e selecione o provedor da conta de e-mail que deseja configurar.</li>
<li>Digite seu endere&ccedil;o de e-mail, senha e nome do remetente.</li>
<li>Marque <b>​​usar essa conta de e-mail como padr&atilde;o</b> se voc&ecirc; preferir deixar o File Station usar essa conta de e-mail como padr&atilde;o, quando voc&ecirc; tiver v&aacute;rias contas configuradas.</li>
<li>Clique em <b>Sincronizar contatos</b> para sincronizar seus contatos de e-mail no DiskStation se o seu provedor de e-mail (Gmail, Outlook ou Yahoo!) suportar essa funcionalidade. Observe que os contatos sincronizados ser&atilde;o da conta de e-mail fornecida na janela de autentica&ccedil;&atilde;o que aparece e n&atilde;o da que voc&ecirc; inseriu na etapa anterior. Portanto, se voc&ecirc; encontrar uma conta diferente ou n&atilde;o intencional exibida na janela de autentica&ccedil;&atilde;o, mude manualmente para a conta de e-mail desejada ou a que voc&ecirc; digitou anteriormente.</li>
<li>Clique em <b>Aplicar</b> para salvar as configura&ccedil;&otilde;es.</li>
</ol>
	
<h4>Para editar uma conta de e-mail:</h4>
<p>Escolha a conta de e-mail desejada na lista e clique em <b>Editar</b>.</p>

<h4>Para excluir uma conta de e-mail:</h4>
<p>Escolha a conta de e-mail desejada na lista e clique em <b>Excluir</b>.</p>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>	
<ul>
<li>A conta padr&atilde;o n&atilde;o pode ser exclu&iacute;da, a menos que n&atilde;o existam outras contas. Se voc&ecirc; quiser excluir uma conta de e-mail que esteja definida como padr&atilde;o, altere a sua conta padr&atilde;o para outra antes de continuar.</li>
</ul>
</div>

<h4>Para alterar a conta padr&atilde;o:</h4>
<p>Selecione a conta de e-mail que voc&ecirc; deseja definir como padr&atilde;o a partir da lista e, em seguida, clique em <b>Definir como padr&atilde;o</b>.</p>


<h4>Para enviar arquivos como anexos:</h4>
<ol>
<li>Clique com o bot&atilde;o direito do mouse em qualquer arquivo do File Station e selecione <b>Enviar como anexos de e-mail</b>.</li>
<li>Se voc&ecirc; tiver adicionado mais de uma conta de e-mail, voc&ecirc; pode escolher o endere&ccedil;o de e-mail do remetente desejado na lista suspensa para enviar os arquivos para um destinat&aacute;rio espec&iacute;fico.</li>
</ol>
</body>
</html>
