<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Op&ccedil;&otilde;es</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_user"></a>Outros</h2>
<p>Voc&ecirc; pode personalizar outras op&ccedil;&otilde;es de conta pessoal em <strong>Pessoal</strong> &gt; <strong>Outras</strong>.</p>

<h4>Para personalizar outras op&ccedil;&otilde;es pessoais:</h4>
<ol>
<li>Escolha uma das a&ccedil;&otilde;es a seguir:
<ul>
<li><b>N&atilde;o mostrar a caixa de di&aacute;logo de confirma&ccedil;&atilde;o ao sair do DSM:</b> Ignora a caixa de di&aacute;logo de confirma&ccedil;&atilde;o ao fechar a janela do navegador.</li>
<li><b>Retornar DSM ao meu status de logout anterior quando fizer login:</b> Lembra pacotes ou aplicativos abertos e os restaura na pr&oacute;xima vez em que voc&ecirc; faz login ou atualiza a janela do navegador.</li>
<li><b>Habilitar visualiza&ccedil;&atilde;o instant&acirc;nea na barra de tarefas:</b> Exibe uma visualiza&ccedil;&atilde;o r&aacute;pida de um aplicativo aberto ao passar o mouse sobre o &iacute;cone do aplicativo na barra de tarefas. O Internet Explorer pode n&atilde;o suportar totalmente este recurso se n&atilde;o for a vers&atilde;o mais recente.</li>

<li><strong>N&atilde;o abrir automaticamente a ajuda do DSM em todo login</strong>: A p&aacute;gina de ajuda do DSM n&atilde;o ser&aacute; aberta automaticamente quando voc&ecirc; fizer login no DSM.</li>
<li><strong>Habilitar atalhos do teclado da &aacute;rea de trabalho</strong>: Voc&ecirc; pode usar os atalhos de teclado para executar v&aacute;rios tipos de opera&ccedil;&otilde;es de &aacute;rea de trabalho e do DSM (por exemplo, alternar entre janelas ativas, marcar/desmarcar op&ccedil;&otilde;es etc.). Para visualizar todos os atalhos de teclado, pressione Shift + ?.</li>
<li><strong>Desabilitar acessibilidade (nenhuma pista de auditoria dispon&iacute;vel)</strong>: Suspende o recurso de acessibilidade no DSM para que voc&ecirc; n&atilde;o ou&ccedil;a pistas sonoras quando o leitor de tela estiver ativado.</li>

<li><strong>Habilitar notifica&ccedil;&otilde;es da &aacute;rea de trabalho do navegador:</strong> Mostra as notifica&ccedil;&otilde;es de seu navegador da Web na &aacute;rea de trabalho do DSM.
  
  As notifica&ccedil;&otilde;es da &aacute;rea de trabalho do navegador s&atilde;o suportadas apenas pelo Google Chrome e Safari. Dependendo da vers&atilde;o do seu navegador da Web, a p&aacute;gina de configura&ccedil;&otilde;es de notifica&ccedil;&otilde;es pode ser diferente. V&aacute; para a p&aacute;gina de configura&ccedil;&otilde;es do seu navegador para gerenciar as configura&ccedil;&otilde;es de notifica&ccedil;&atilde;o.</li>
<li><strong>Habilite o bot&atilde;o Visualiza&ccedil;&atilde;o piloto na barra de tarefas</strong>: Exibe o bot&atilde;o <strong>Visualiza&ccedil;&atilde;o piloto</strong>, que ajuda a ver todos os aplicativos abertos no modo de visualiza&ccedil;&atilde;o.</li>
</ul>
<li>
Clique em <b>OK</b>.
</li>
</ol>



</body>
</html>