<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Op&ccedil;&otilde;es</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Photo Station</h2>
<p>Photo Station Pessoal &eacute; um &aacute;lbum de fotos online com blog, propriedade de e gerenciado por um usu&aacute;rio do DSM. O DiskStation fornece a pasta <b>home/photo</b> onde voc&ecirc; pode armazenar fotos e v&iacute;deos que queira compartilhar. O sistema criar&aacute; miniaturas de &iacute;ndice das fotos e v&iacute;deos automaticamente, e as pessoas poder&atilde;o ver os &aacute;lbuns de fotos atrav&eacute;s de um navegador da web.</p>
<h4>Para habilitar o Photo Station Pessoal:</h4>
<p>Clique em <b>Habilitar o Photo Station Pessoal - [nome de usu&aacute;rio]</b> e clique em <b>OK</b>.</p>
<h4>Para editar as configura&ccedil;&otilde;es do Photo Station Pessoal:</h4>
<ol>

<li>Marque <b>Definir novas pastas como &aacute;lbuns p&uacute;blicos</b> se desejar que os &aacute;lbuns de fotos carregados estejam dispon&iacute;veis para visitantes.</li>
<li>Clique em <b>Reindexar</b> para reconstruir a estrutura de indexa&ccedil;&atilde;o dos arquivos de imagem, se houver imagens faltando no Photo&nbsp;Station.</li>

<li>Clique em <b>OK</b>.</li>
</ol>

<h4>Para iniciar o Photo Station, fa&ccedil;a uma das seguintes op&ccedil;&otilde;es:</h4>
<ul>
  <li> V&aacute; at&eacute; <b>Menu principal</b> e clique em <b>Photo Station</b>. </li>
  <li>Digite o endere&ccedil;o web a seguir na barra de endere&ccedil;o do navegador: <strong>http://Synology_Server_IP_Address/photo/</strong></li>
</ul>
<h4>Para iniciar o Photo Station pessoal, fa&ccedil;a uma das seguintes op&ccedil;&otilde;es:</h4>
<ul>
<li>Clique em <b>Iniciar Photo Station</b>.</li>
<li>V&aacute; at&eacute; <b>Menu Principal</b> e clique em <b>Photo Station - [nome do usu&aacute;rio]</b>.</li>
<li>Digite o endere&ccedil;o web a seguir na barra de endere&ccedil;o do navegador: <strong>http://Synology_Server_IP_Address/~username/photo/</strong></li>
</ul>

<div class="section">
<h4>Suporte e limita&ccedil;&otilde;es:</h4>

<ul>
<li>Formatos de imagem suportados: BMP, JPEG, GIF, RAW (arw, srf, sr2, dcr, k25, kdc, cr2, crw, nef, mrw, ptx, pef, raf, raw, 3fr, erf, mef, mos, orf, rw2, dng, x3f), TIFF, PNG</li>
<li>Formatos de v&iacute;deo suportados: 3G2, 3GP, ASF, AVI, DAT, DivX, FLV, M4V, MOV, MP4, MPEG, MPG, MTS, M2TS, M2T QT, WMV, XviD, RM<sup>(1)</sup>, RMVB<sup>(1)</sup>, VOB<sup>(1)</sup></li>
<li>Se voc&ecirc; fizer upload de conte&uacute;do com o Photo Station Pessoal, s&oacute; poder&aacute; enviar 2GB de conte&uacute;do de cada vez.</li>
<p><span class="note_head">Nota (1):</span> Os usu&aacute;rios podem baixar arquivos dos formatos especificados, mas n&atilde;o poder&atilde;o reproduzi-los no Photo Station como um arquivo Flash compactado.</p>
</ul>

<h4>Como usar o Photo Station Pessoal?</h4>
<p>Voc&ecirc; pode enviar arquivos de imagens ou v&iacute;deos para a pasta <b>home/photo</b> e criar um blog. Para fazer isso:</p>
<ol>
<li>Organize em pastas as fotos e v&iacute;deos que deseja compartilhar. Essas pastas tornar-se-&atilde;o &aacute;lbuns em Photo Station Pessoal.</li>
<li>Fa&ccedil;a upload das pastas de &aacute;lbuns para a pasta compartilhada <b>home/photo</b>.</li>
<li>Aponte o navegador para <b>http://servername/~username/photo/</b> para visualizar seus &aacute;lbuns.</li>
<li>Para criar seu blog, clique em <b>Blog</b> no canto superior direito e registre-se para come&ccedil;ar a postar artigos.</li>
</ol>
<h4></b>Como posso publicar meus &aacute;lbuns e blog em Photo Station Pessoal?</h4>
<p>Para public&aacute;-los no Photo Station Pessoal e torn&aacute;-los dispon&iacute;veis na Internet, voc&ecirc; ter&aacute; de configurar seu DiskStation para usar um IP externo.</p>
<ol>
<li>Fa&ccedil;a login no DiskStation como <b>admin</b> ou como um usu&aacute;rio que perten&ccedil;a ao grupo <b>administrators</b>.</li>
<li>Para conectar ao DiskStation na internet voc&ecirc; pode aplicar:</li>
<ul>
<li>Um IP externo. V&aacute; at&eacute; <b>Menu principal</b> &gt; <b>Painel de controle</b> &gt; <b>Rede</b> para editar as configura&ccedil;&otilde;es de rede do servidor, caso tenha recebido um endere&ccedil;o espec&iacute;fico de IP externo de seu provedor de servi&ccedil;os de rede.</li>
<li>As configura&ccedil;&otilde;es PPPoE. V&aacute; at&eacute; <b>PPPoE</b> no <b>Menu principal</b> &gt; <b>Painel de controle</b> &gt; <b>Rede</b> para ativar a conex&atilde;o PPPoE.</li>
</ul>
<li>Se deseja usar uma conta DDNS registrada, v&aacute; para <b>Menu principal</b> &gt; <b>Painel de Controle</b> &gt; <b>Acesso Externo</b> &gt; <b>DDNS</b> para habilitar o servi&ccedil;o DDNS.</li>
<li>Conclu&iacute;do!</li>
</ol>
<p>Agora as pessoas na Internet podem explorar seus &aacute;lbuns e seu blog apontando seus navegadores para <b>http://serverIP/~username/photo/</b> ou <b>http://DDNS_hostname/~username/photo/</b>.</p>

</div>
</body>
</html>
