<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Yedekleme ve &Ccedil;oğaltma</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>LUN Yedeklemesi</h2>
<p><b>Yedekle &amp; Geri Y&uuml;kle</b>'nin <b>Yedekle</b> sekmesi altında, DiskStation sunucunuzun iSCSI LUN'larını yedeklemek i&ccedil;in <b>Yerel LUN Yedeklemesi</b>'ni kullanabilirsiniz. Başka bir DiskStation sunucusuna yedeklemek i&ccedil;in <b>Ağ LUN Yedeklemesi</b>'ni de kullanabilirsiniz.</p>

<h4>Bir iSCSI LUN'u yedeklemek i&ccedil;in:</h4>
<ol>
<li>
<b>LUN Yedekleme Sihirbazı</b>'nı a&ccedil;mak i&ccedil;in <b>Oluştur</b> &gt; <b>LUN yedekleme g&ouml;revi</b> se&ccedil;imini yapın ve <b>İleri</b>'ye tıklayın.
</li>
<li>
Bir hedef t&uuml;r&uuml; se&ccedil;meniz istendiğinde, aşağıdakilerden birini se&ccedil;in:
</li>
<ul>
<li>
<b>Yerel LUN Yedeklemesi</b>: LUN yedeklemesini DiskStation sunucunuzdan bir yerel paylaşımlı klas&ouml;re ya da DiskStation sunucunuzun USB veya eSATA bağlantı noktasına bağlı bir harici depolama aygıtına yapmak i&ccedil;in bu se&ccedil;eneği se&ccedil;in.
</li>
<li><b>Ağ LUN Yedeklemesi</b>: LUN yedeklemesini DiskStation sunucunuzdan başka bir DiskStation sunucusuna yapmak i&ccedil;in bu se&ccedil;eneği se&ccedil;in.
</li>
</ul>
<li>
Sorulduğunda, yedekleme hedefini ve kaynak LUN'u belirleyin ve yedekleme zamanlamasını ayarlayın.
</li>
<li>
Kurulumu tamamlamak i&ccedil;in sihirbazı izleyin.
</li>
</ol>
<p>Yedekleme g&ouml;revi oluşturulduktan sonra, DiskStation yedekleme g&ouml;revini programa g&ouml;re ger&ccedil;ekleştirecek ve yedeklenmiş LUN'u hedefte depolayacaktır. Yedeklenmiş LUN yalnız yedekleme amacıyla kullanılır. Yedek LUN'a erişmek i&ccedil;in, daha fazla bilgi i&ccedil;in <a href="restore.html">Yedek LUN'u geri y&uuml;klemek i&ccedil;in</a> konusuna bakın.</p>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Normal Dosya ve Blok Seviyesi LUN'lar hedefte dosya görüntüleri olarak yedeklenecektir. Geri yüklenirse, tüm Blok Seviyesi LUN'lar Dosya LUN'larına değiştirilir.</li>
<li>Herbir yedekleme g&ouml;revi yedekleme kaynağı olarak yalnız bir adet LUN i&ccedil;erebilir.</li>
<li>LUN'lar, FAT, FAT32, HFS, HFS Plus veya NTFS formatındaki harici bir diske yedeklenemezler.</li>
<li>Ağ Network LUN Yedeklemesi yapmadan &ouml;nce, Ağ Yedekleme hizmetinin <b>Yedekleme ve &Ccedil;oğaltma</b> &gt; <b>Yedekleme Hizmetleri</b>'nde etkinleştirildiğinden emin olmak i&ccedil;in l&uuml;tfen DiskStation hedefinde oturum a&ccedil;ın.</li>
<li>DiskStation sunucunuz ağa bir y&ouml;nlendirici &uuml;zerinden bağlanıyorsa, Ağ LUN Yedeklemesi ger&ccedil;ekleştirmeden &ouml;nce y&ouml;nlendirici &uuml;zerinde iSCSI hizmeti i&ccedil;in (TCP port 3260) bir bağlantı noktası y&ouml;nlendirme kuralı belirlediğinizden emin olun.</li>
</ul>
</div>


<div class="section">
<h4>Tam Yedekleme ve Artımlı Yedekleme:</h4>
<p>
DiskStation ilk olarak se&ccedil;ilen LUN i&ccedil;in tam bir yedekleme ve daha sonra da artımlı yedekleme ger&ccedil;ekleştirecektir. Ancak, yedekleme hedefinin paylaşımlı klas&ouml;r adı veya dizin adı değiştirilirse, DiskStation g&ouml;rev i&ccedil;in tekrar tam bir yedekleme ger&ccedil;ekleştirecektir.
</p>
</div>
</body></html>
