<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Servi&ccedil;os de suporte</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>Servi&ccedil;os de suporte</h2>
<p>
Os servi&ccedil;os de suporte incluem acesso remoto e ferramentas de gera&ccedil;&atilde;o de log, permitindo que os engenheiros de nosso suporte t&eacute;cnico possam visualizar, diagnosticar e solucionar os problemas t&eacute;cnicos rapidamente em seu DiskStation a partir de um escrit&oacute;rio da Synology. Para fazer isso, v&aacute; para <b>Centro de suporte</b> &gt; <b>Servi&ccedil;os de suporte</b>.
</p>

<h4>Para habilitar o acesso remoto: </h4>
<p>
Habilite o acesso remoto em seu DiskStation somente quando estiver sendo solicitado pelos engenheiros de suporte t&eacute;cnico da Synology.
</p>
<ol>
<li>Marque a caixa de verifica&ccedil;&atilde;o <b>Habilitar acesso remoto</b>, em seguida clique em <b>Aplicar</b> para que as altera&ccedil;&otilde;es tenham efeito.
</li>
<li>Forne&ccedil;a aos engenheiros de suporte t&eacute;cnico da Synology sua senha de administrador e chave de identifica&ccedil;&atilde;o de suporte via email.
</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>O acesso remoto ser&aacute; desativado automaticamente ap&oacute;s 14 dias. Ele n&atilde;o deve ser desativado manualmente at&eacute; ent&atilde;o, a menos que um engenheiro do suporte t&eacute;cnico Synology solicitar que voc&ecirc; o fa&ccedil;a.
</li>
<li>Remova qualquer conte&uacute;do de seu DiskStation que voc&ecirc; considere privado. 
</li>
<li>Embora a Synology n&atilde;o possa garantir que o fornecimento do acesso remoto resolver&aacute; seu problema, a Synology far&aacute; todo esfor&ccedil;o poss&iacute;vel para realizar servi&ccedil;os de suporte de modo profissional.
</li>	
</ul>
</div>

<h4>Para gerar logs: </h4>
<p>
Gere e forne&ccedil;a logs somente aos engenheiros de suporte t&eacute;cnico da Synology.
</p>
<ol>
<li>Clique em <b>Gerar logs</b> e aguarde alguns minutos para que o download seja conclu&iacute;do.
</li>
<li>Forne&ccedil;a por email os logs aos engenheiros de suporte t&eacute;cnico da Synology.
</li>
</ol>

<div class="section">
<h4>O que voc&ecirc; deve saber sobre nossos Servi&ccedil;os de Suporte</h4>
<ul>
<li>Respeitamos seu DiskStation como se ele fosse nosso.</li>
<li>Seu DiskStation s&oacute; ser&aacute; usado para fins de diagn&oacute;stico do sistema. A Synology n&atilde;o acessar&aacute; ou divulgar&aacute; nenhuma outra informa&ccedil;&atilde;o pessoal em seu DiskStation. </li> 

</ul>
</div>

</body>
</html>
