<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Envio de log - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Configure DiskStation as a syslog client to transmit logs to a syslog server for centralized management.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Envio de log</h2>
<p>Se voc&ecirc; tiver o syslog server, pode seguir as instru&ccedil;&otilde;es abaixo para configurar o DiskStation como cliente syslog e transmitir os logs locais do sistema de seu DiskStation para um syslog server, para monitoramento e gerenciamento centralizados. </p>

<h4>Para enviar logs para um syslog server:</h4>
<ol>
<li>V&aacute; para <strong>Log Center</strong> &gt; <strong>Envio de log</strong>. </li>
<li>Marque a caixa <strong>Enviar logs para um syslog server</strong>.</li>
<li>Digite o nome de host ou endere&ccedil;o IP do syslog server em <strong>Servidor</strong>. </li>
<li>Especifique um n&uacute;mero de porta para receber mensagens do syslog em <strong>Porta</strong>.</li>
<li>Selecione <strong>UDP</strong> ou <strong>TCP</strong> em <strong>Protocolo de transfer&ecirc;ncia</strong>. Ele deve corresponder ao protocolo usado pelo syslog server.</li>
<li>Selecione <strong>BSD (RFC 3164)</strong> ou <strong>IETF (RFC 5424)</strong> em <strong>Formato do log</strong> para enviar logs usando o formato selecionado.</li>
	
    <div class="section">
	<h4>Nota:</h4>
	<ul>
    <li>Por padr&atilde;o, a porta &eacute; 514. As regras de envio de porta adequadas devem ser definidas se voc&ecirc; quiser transferir um n&uacute;mero de porta diferente para o syslog server.</li>
    <li>O UDP (Protocolo de Datagrama de Usu&aacute;rio) &eacute; um protocolo de conex&atilde;o baseado em mensagens mais simples, sendo um protocolo mais r&aacute;pido, mas que n&atilde;o tem corre&ccedil;&otilde;es de seguran&ccedil;a e erro. O TCP (Protocolo de Controle de Transmiss&atilde;o) oferece uma entrega garantida, usando o controle de fluxo para determinar se todos os pacotes foram enviados com &ecirc;xito antes que os novos pacotes sejam processados.</li>
    <li>A conex&atilde;o segura (SSL) est&aacute; dispon&iacute;vel apenas durante o uso do TCP.</li>
    <li>Se voc&ecirc; escolher TCP e desejar proteger a conex&atilde;o syslog com SSL, pode marcar a op&ccedil;&atilde;o <strong>Habilitar conex&atilde;o segura (SSL)</strong>. Em seguida, clique em <strong>Importar certificado</strong> e selecione o certificado para transferir logs com seguran&ccedil;a para o syslog server.</li>
    </ul>
	</div>

<li>Clique em <strong>Enviar log de teste</strong> para confirmar que o syslog server pode receber o log com &ecirc;xito. Se o syslog server n&atilde;o receber o log de teste, verifique se suas configura&ccedil;&otilde;es est&atilde;o corretas.</li>
<li>Clique em <strong>Aplicar</strong> para salvar as configura&ccedil;&otilde;es.</li>
</ol>

<h3>Filtrar logs</h3>
<p>Na guia <strong>Filtro</strong>, voc&ecirc; pode especificar quais tipos de logs s&atilde;o enviados para o syslog server, de acordo com a categoria (por exemplo, sistema, conex&atilde;o, backup) ou gravidade (por exemplo, aviso, erro, informa&ccedil;&otilde;es).</p>
</body>
</html>
