<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>M&eacute;diaindexel&eacute;si szolg&aacute;ltat&aacute;s</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Konvert&aacute;l&aacute;si be&aacute;ll&iacute;t&aacute;sok</h2>
<p>Amikor f&eacute;nyk&eacute;peket vagy vide&oacute;kat t&ouml;lt fel a M&eacute;diaszerverrel vagy a Photo Station alkalmaz&aacute;ssal val&oacute; haszn&aacute;lathoz, a rendszer a b&ouml;ng&eacute;sz&eacute;s k&eacute;nyelmesebb&eacute; t&eacute;tel&eacute;re miniatűr&ouml;ket hoz l&eacute;tre. Itt a miniatűr&ouml;k minős&eacute;g&eacute;nek be&aacute;ll&iacute;t&aacute;s&aacute;ra &eacute;s a konvert&aacute;l&aacute;suk folyamat&aacute;nak megtekint&eacute;s&eacute;re van lehetős&eacute;ge.</p>
<p>Ha emellett meg k&iacute;v&aacute;nja tekinteni a Photo Station <strong>photo</strong> megosztott mapp&aacute;j&aacute;nak tartalm&aacute;t mobilk&eacute;sz&uuml;l&eacute;k&eacute;n, akkor itt enged&eacute;lyezheti a videokonvert&aacute;l&aacute;st is, &eacute;s figyelemmel k&iacute;s&eacute;rheti a konvert&aacute;l&aacute;s előrehalad&aacute;s&aacute;t.</p>
<h4>Miniatűr&ouml;k minős&eacute;g&eacute;nek be&aacute;ll&iacute;t&aacute;sa:</h4>
<ol>
<li>
V&aacute;lasszon ki egy minős&eacute;get a leg&ouml;rd&uuml;lő men&uuml;ből.
</li>
<li>
Kattintson az <b>Alkalmaz</b> gombra.
</li>
</ol>
<div class="section">
<span class="note_head">Megjegyz&eacute;s: </span>
<ul>
<li>A j&oacute; minős&eacute;gű miniatűr&ouml;k l&eacute;trehoz&aacute;sa t&ouml;bb időt ig&eacute;nyel.</li>
</ul>
</div>
<h4>Videokonvert&aacute;l&aacute;s enged&eacute;lyez&eacute;se mobileszk&ouml;z&ouml;kh&ouml;z:</h4>
<ol>
<li>Jel&ouml;lje be a <strong>Videokonvert&aacute;l&aacute;s enged&eacute;lyez&eacute;se mobileszk&ouml;z&ouml;kh&ouml;z</strong> lehetős&eacute;get.</li>
<li>Kattintson az <strong>Alkalmaz</strong> gombra, &eacute;s &iacute;gy menet k&ouml;zben is megn&eacute;zhet vide&oacute;kat a mobileszk&ouml;z&eacute;n.
</li>
</ol>

<div class="section">
<span class="note_head">Megjegyz&eacute;s: </span>
<ul>
<li>Csak a Photo Station <strong>photo</strong> megosztott mapp&aacute;j&aacute;ba felt&ouml;lt&ouml;tt vide&oacute;k konvert&aacute;lhat&oacute;k a mobileszk&ouml;z&ouml;k &aacute;ltal t&aacute;mogatott form&aacute;tumba.</li>
<li>MP4 f&aacute;jlok nem ker&uuml;lnek konvert&aacute;l&aacute;sra.</li>
</ul>
</div>
<h4>F&eacute;nyk&eacute;pek/vide&oacute;k konvert&aacute;l&aacute;si folyamat&aacute;nak megtekint&eacute;se:</h4>
<ol>
<li>F&eacute;nyk&eacute;pek vagy vide&oacute;k DiskStation eszk&ouml;zre t&ouml;rt&eacute;nő felt&ouml;lt&eacute;se sor&aacute;n kattintson a t&aacute;lca jobb felső sark&aacute;ban megjelenő <strong>Konvert&aacute;l&aacute;si folyamat</strong> ikonra. </li>
<li>
A felbukkan&oacute; ablakban tegye a k&ouml;vetkezők b&aacute;rmelyik&eacute;t:
</li>
<ul>
<li>
A <b>Konvert&aacute;l&aacute;si folyamat</b> r&eacute;szben megfigyelheti a miniatűr&ouml;k a h&aacute;tt&eacute;rben t&ouml;rt&eacute;nő l&eacute;trehoz&aacute;s&aacute;nak előrehalad&aacute;s&aacute;t &eacute;s &aacute;llapot&aacute;t.
</li>
<li>
A konvert&aacute;l&aacute;si folyamatot a k&ouml;vetkezők&eacute;ppen sz&uuml;neteltetheti:
</li>
<ol>
<li>
A folyamat sz&uuml;neteltet&eacute;s&eacute;hez a leg&ouml;rd&uuml;lő men&uuml;ből v&aacute;lassza ki a <b>K&eacute;sleltet&eacute;s [sz&aacute;m] &oacute;r&aacute;ig</b> pontot, majd kattintson a <b>Sz&uuml;net</b> gombra. (Alap&eacute;rtelmez&eacute;s szerint a rendszer a <b>K&eacute;sleltet&eacute;s 1 &oacute;r&aacute;ig</b> &eacute;rt&eacute;ket v&aacute;lasztja.)
</li>
<li>A megadott k&eacute;sleltet&eacute;si idő letelte ut&aacute;n a konvert&aacute;l&aacute;s folytat&oacute;dik; illetve a <b>Folytat&aacute;s</b> gombra kattintva azonnal folytathatja a folyamatot.
</li>
</ol>
<div class="section">
<span class="note_head">Megjegyz&eacute;s: </span>
<ul>
<li>Mivel a konvert&aacute;l&aacute;s jelentős CPU-erőforr&aacute;sokat k&ouml;vetel, a folyamat sz&uuml;neteltet&eacute;se felszabad&iacute;thatja a rendszer erőforr&aacute;sait m&aacute;s folyamatban l&eacute;vő feladatok sz&aacute;m&aacute;ra.</li>
</ul>
</div>
</ul>
<li>
Amikor a konvert&aacute;l&aacute;si folyamat befejeződ&ouml;tt, az ikon eltűnik a t&aacute;lc&aacute;r&oacute;l.
</li>
</ol>

<div class="section">
<span class="note_head">Megjegyz&eacute;s: </span>
<ul>
<li>Mivel a Photo Station Uploader jobb teljes&iacute;tm&eacute;nyt ny&uacute;jt a miniatűr&ouml;k l&eacute;trehoz&aacute;s&aacute;hoz, a Photo Station Uploader haszn&aacute;lat&aacute;t javasoljuk, ha nagysz&aacute;m&uacute; f&eacute;nyk&eacute;pet/vide&oacute;t szeretne felt&ouml;lteni a Photo Station k&ouml;nyvt&aacute;rba.</li>
</ul>
</div>

</body>
</html>