<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Webszolg&aacute;ltat&aacute;sok</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>PHP be&aacute;ll&iacute;t&aacute;sok</h2>

<p>Ha enged&eacute;lyezte a Web Stationt, az al&aacute;bb le&iacute;rt PHP be&aacute;ll&iacute;t&aacute;sokat a <strong>Vez&eacute;rlőpult</strong> &gt; <strong>Webszolg&aacute;ltat&aacute;sok</strong> &gt; <strong>PHP be&aacute;ll&iacute;t&aacute;sok</strong> men&uuml;pontra l&eacute;pve konfigur&aacute;lhatja.</p>

<h4>PHP cache enged&eacute;lyez&eacute;se</h4>
<p>Jel&ouml;lje be a <b>PHP cache enged&eacute;lyez&eacute;se</b> lehetős&eacute;get, ha jav&iacute;tani szeretn&eacute; a PHP teljes&iacute;tm&eacute;nyt. Bizonyos k&ouml;r&uuml;lm&eacute;nyek k&ouml;z&ouml;tt azonban lehet, hogy ennek nem lesz hat&aacute;sa.</p>

<h4>PHP hiba&uuml;zenet megjelen&iacute;t&eacute;se a weboldalon</h4>
<p>Ha PHP hiba&uuml;zeneteket szeretne megjelen&iacute;teni a weboldalon, akkor jel&ouml;lje be a <b>Display_errors enged&eacute;lyez&eacute;se PHP hiba&uuml;zenet megjelen&iacute;t&eacute;s&eacute;hez</b> lehetős&eacute;get. </p>

<h4>PHP open_basedir testreszab&aacute;sa</h4>
<ol>
<li>Jel&ouml;lje be a <b>PHP open_basedir testreszab&aacute;sa</b> lehetős&eacute;get, ha szeretn&eacute; testreszabni saj&aacute;t open_basedir opci&oacute;j&aacute;t.</li>
<li>A sz&ouml;vegmezőbe &iacute;rja be a tesreszabott el&eacute;r&eacute;si utat, majd kattintson az <b>Alkalmaz</b> gombra. Ha az alap&eacute;rtelmezett rendszerbe&aacute;ll&iacute;t&aacute;st szeretn&eacute; haszn&aacute;lni, t&ouml;r&ouml;lje a <b>PHP open_basedir tesreszab&aacute;sa</b> bejel&ouml;lts&eacute;g&eacute;t, majd kattintson az <b>Alkalmaz</b> gombra.</li>
</ol>
<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Haszn&aacute;ljon kettőspontot (<strong>:</strong>) az egyes &uacute;tvonalak elv&aacute;laszt&aacute;s&aacute;ra. P&eacute;ld&aacute;ul: <strong>/etc:/tmp:/usr/bin/php</strong>.</li>
<li>A homes megosztott mappa el&eacute;r&eacute;si &uacute;tvonalai (pl. <strong>/volume1/homes</strong>) biztons&aacute;gi okokb&oacute;l nem adhat&oacute;k hozz&aacute; az <strong>open_basedir</strong> mapp&aacute;hoz.</li>
</ul>
</div>

<h4>PHP kiterjeszt&eacute;s kiv&aacute;laszt&aacute;sa</h4>
<ol>
<li>A saj&aacute;t PHP kiterjeszt&eacute;s testreszab&aacute;s&aacute;hoz kattintson a <b>PHP kiterjeszt&eacute;s kiv&aacute;laszt&aacute;sa</b> lehetős&eacute;gre.</li>
<li>A felbukkan&oacute; <b>PHP kiterjeszt&eacute;s lista</b> p&aacute;rbesz&eacute;dablakban v&aacute;lassza ki az enged&eacute;lyezni k&iacute;v&aacute;nt kiterjeszt&eacute;st.</li>
<li>R&aacute;kattinthat a p&aacute;rbesz&eacute;dablak tetej&eacute;n tal&aacute;lhat&oacute; <b>Alap&aacute;llapot</b> lehetős&eacute;gre is, ha vissza szeretne t&eacute;rni az alap&eacute;rtelmezett be&aacute;ll&iacute;t&aacute;sokhoz.</li>
<li>A m&oacute;dos&iacute;t&aacute;sok elment&eacute;s&eacute;hez kattintson az <b>OK</b> gombra.</li></ol>

</body>
</html>
