<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Multimédia-adatbázis</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Rendszeradatb&aacute;zis</h1>
<p> A(z) DiskStation rendszeradatb&aacute;zis seg&iacute;ts&eacute;g&eacute;vel tartja nyilv&aacute;n a k&uuml;lső t&aacute;rol&oacute;eszk&ouml;z&ouml;k&ouml;n l&eacute;trehozott megosztott mapp&aacute;kon, p&eacute;ld&aacute;ul <b>usbshare1</b> t&aacute;rolt csomagadatokat &eacute;s rendszernapl&oacute;-bejegyz&eacute;seket.</p>
<p> <span class="note_head">Fontos: </span>Ha hozz&aacute; szeretne f&eacute;rni a(z) DiskStation eszk&ouml;zh&ouml;z csatlakoztatott k&uuml;lső t&aacute;rol&oacute;eszk&ouml;z&ouml;k&ouml;n t&aacute;rolt csomagadatokhoz, vagy ha meg szeretn&eacute; tekinteni a DSM napl&oacute;bejegyz&eacute;seit a <b>Főmen&uuml;</b> &gt; <strong>Napló központ</strong> men&uuml;pontban, elősz&ouml;r enged&eacute;lyeznie kell a rendszeradatb&aacute;zist. M&aacute;sk&uuml;l&ouml;nben egyik kapcsol&oacute;d&oacute; szolg&aacute;ltat&aacute;s sem lesz hozz&aacute;f&eacute;rhető. </p>
<h4>A rendszeradatb&aacute;zis enged&eacute;lyez&eacute;se:</h4>
<ol>
  <li> Jel&ouml;lje be a <b>Rendszeradatb&aacute;zis enged&eacute;lyez&eacute;se</b> n&eacute;gyzetet. </li>
  <li> Tegye a k&ouml;vetkezők egyik&eacute;t:
    <ul>
      <li> Ha azt szeretn&eacute;, hogy a DSM automatikusan v&aacute;lasszon ki egy megosztott mapp&aacute;t a rendszeradatb&aacute;zis t&aacute;rol&aacute;s&aacute;ra, v&aacute;lassza az <b>Automatikus konfigur&aacute;ci&oacute;</b> elemet. Ha a megosztott mapp&aacute;t tartalmaz&oacute; k&uuml;lső t&aacute;rol&oacute;eszk&ouml;zt elt&aacute;vol&iacute;tj&aacute;k, a DSM automatikusan m&aacute;s megosztott mapp&aacute;t v&aacute;laszt az adatb&aacute;zis t&aacute;rol&aacute;s&aacute;hoz. </li>
      <li> Ha az aktu&aacute;lis adatb&aacute;zist a k&uuml;lső eszk&ouml;z&ouml;n l&eacute;trehozott m&aacute;sik megosztott mapp&aacute;ba szeretn&eacute; &aacute;thelyezni, v&aacute;lassza az <b>Helyezze át az aktuális adatbázist a kiválasztott megosztott mappába</b> lehetős&eacute;get, majd v&aacute;lasszon a leg&ouml;rd&uuml;lő men&uuml;ről. </li>
      <li>Ha egyn&eacute;l t&ouml;bb k&uuml;lső eszk&ouml;z van csatlakoztatva a(z) DiskStation eszk&ouml;zh&ouml;z, akkor v&aacute;lassza az <strong>Egy l&eacute;tező adatb&aacute;zis kiv&aacute;laszt&aacute;sa</strong> lehetős&eacute;get, majd egy l&eacute;tező adatb&aacute;zis kiv&aacute;laszt&aacute;s&aacute;hoz v&aacute;lasszon a leg&ouml;rd&uuml;lő men&uuml;ről.</li>
    </ul>
  </li>
  <li> Kattintson az <b>Alkalmaz</b> gombra. </li>
</ol>
<p> <span class="note_head">Figyelmeztet&eacute;s: </span>Az adatb&aacute;zis s&eacute;r&uuml;l&eacute;s&eacute;nek megakad&aacute;lyoz&aacute;sa &eacute;rdek&eacute;ben a <b>Főmen&uuml;</b> &gt; <b>Vez&eacute;rlőpult</b> &gt; <strong>K&uuml;lső eszk&ouml;z&ouml;k</strong> &gt; <strong>K&uuml;lső eszk&ouml;z&ouml;k</strong> men&uuml;pontban, illetve a jobb felső sarokban tal&aacute;lhat&oacute; k&uuml;lső eszk&ouml;z ikonra kattintva győződj&ouml;n meg a t&aacute;rol&oacute;eszk&ouml;z lev&aacute;lasztott &aacute;llapot&aacute;r&oacute;l, mielőtt elt&aacute;vol&iacute;tan&aacute; azt a(z) DiskStation eszk&ouml;zről. </p>
</body>
</html>
