
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Mobil</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="utf-8">
</head>
<body>


<h2><a name="usbmodem"></a>Mobil*</h2>

<p>Ha mobil sz&eacute;less&aacute;v&uacute; adapterrel van felszerelve, a(z) DiskStation csatlakozhat az internethez egy vezet&eacute;k n&eacute;lk&uuml;li, 3G/LTE h&aacute;l&oacute;zat seg&iacute;ts&eacute;g&eacute;vel A <strong>Vez&eacute;rlőpult</strong> &gt; <strong>H&aacute;l&oacute;zat</strong> &gt; <strong>H&aacute;l&oacute;zati interf&eacute;sz</strong> &gt; <strong>Mobil</strong> men&uuml;pont be&aacute;ll&iacute;t&aacute;sai seg&iacute;tenek a mobil sz&eacute;less&aacute;v&uacute; adapter&eacute;nek seg&iacute;ts&eacute;g&eacute;vel l&eacute;trehozni &eacute;s m&oacute;dos&iacute;tani egy vezet&eacute;k n&eacute;lk&uuml;li internetkapcsolatot.</p>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>A Synology term&eacute;kek &aacute;ltal t&aacute;mogatott mobil sz&eacute;less&aacute;v&uacute; adapterek teljes list&aacute;j&aacute;t l&aacute;sd a <a href="http://www.synology.com/" target=_blank>www.synology.com</a> c&iacute;men.</p>
</div>

<h4>Mobil h&aacute;l&oacute;zat be&aacute;ll&iacute;t&aacute;sa:</h4>
<p>Ha mobil sz&eacute;less&aacute;v&uacute; adaptert csatlakoztat a(z) DiskStation egyik USB-portj&aacute;ra, a(z) DiskStation automatikusan csatlakozni pr&oacute;b&aacute;l. Ha a csatlakoz&aacute;s nem hozhat&oacute; l&eacute;tre automatikusan, vagy ha m&oacute;dos&iacute;tani szeretn&eacute; a csatlakoz&aacute;s be&aacute;ll&iacute;t&aacute;sait, tegye a k&ouml;vetkezőket: </p>

<ul>
<li><b>SIM-z&aacute;rol&aacute;s felold&aacute;sa/Be&aacute;ll&iacute;t&aacute;sok:</b> Ha a SIM-k&aacute;rtya PIN-k&oacute;ddal v&eacute;dett, akkor z&aacute;rol&aacute;s&aacute;t fel kell oldani ahhoz, hogy a(z) DiskStation csatlakozhasson a h&aacute;l&oacute;zathoz. Ha a z&aacute;rol&aacute;s felold&aacute;sa megt&ouml;rt&eacute;nt, ez a r&eacute;sz lehetős&eacute;geket ny&uacute;jt a PIN-be&aacute;ll&iacute;t&aacute;sok m&oacute;dos&iacute;t&aacute;s&aacute;hoz.</li>

<li><b>Szerkeszt&eacute;s:</b> Manu&aacute;lisan konfigur&aacute;lhatja a csatlakoz&aacute;st, vagy v&aacute;laszthat hely &eacute;s szolg&aacute;ltat&oacute; szerint. A csatlakoz&aacute;s manu&aacute;lis be&aacute;ll&iacute;t&aacute;s&aacute;hoz meg kell adni az APN-t, telefonsz&aacute;mot, felhaszn&aacute;l&oacute;nevet &eacute;s jelsz&oacute;t. Ha nem tudja ezeket az adatokat, t&aacute;mogat&aacute;s&eacute;rt forduljon mobilszolg&aacute;ltat&oacute;j&aacute;hoz.</li>

<li><b>Csatlakoz&aacute;s/Lecsatlakoz&aacute;s:</b> Ezek a gombok lehetőv&eacute; teszik, hogy csatlakoztassa vagy lecsatlakoztassa a(z) DiskStation eszk&ouml;zt a 3G/LTE h&aacute;l&oacute;zathoz vagy h&aacute;l&oacute;zatr&oacute;l.</li>
<li><b>Opci&oacute;k:</b> Ez a r&eacute;sz lehetős&eacute;get ad a mobil sz&eacute;less&aacute;v&uacute; adapter alap&eacute;rtelmezett &aacute;tj&aacute;r&oacute;k&eacute;nt t&ouml;rt&eacute;nő be&aacute;ll&iacute;t&aacute;s&aacute;ra a(z) DiskStation eszk&ouml;zh&ouml;z. Ha alap&eacute;rtelmezett &aacute;tj&aacute;r&oacute;k&eacute;nt konfigur&aacute;lja a mobil h&aacute;l&oacute;zatot, a(z) DiskStation eszk&ouml;zről sz&aacute;rmaz&oacute; internetes forgalom a vezet&eacute;kes h&aacute;l&oacute;zat helyett a mobil h&aacute;l&oacute;zaton fog kereszt&uuml;lmenni. </li>
</ul>
<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ol>
<li>Amikor csatlakozva vannak az internethez, egyes mobil sz&eacute;less&aacute;v&uacute; adapterek nem jelzik ki a jel erőss&eacute;g&eacute;t, ha nem t&aacute;mogatj&aacute;k ezt a funkci&oacute;t.</li>
<li>Egyes mobil sz&eacute;less&aacute;v&uacute; adapterek eset&eacute;n nem m&oacute;dos&iacute;that&oacute;k a SIM-be&aacute;ll&iacute;t&aacute;sok, amikor csatlakozva vannak az internethez.</li>
</ol>
</div>
<p>____<br> <strong>*</strong>Csak bizonyos modellek eset&eacute;ben el&eacute;rhető. </p>


</body>
</html>
