<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Ez az oldal Bluetooth-adapterek kezel&eacute;s&eacute;hez &eacute;s Bluetooth-eszk&ouml;z&ouml;k a(z) DiskStation eszk&ouml;zh&ouml;z t&ouml;rt&eacute;nő csatlakoztat&aacute;s&aacute;hoz biztos&iacute;t lehetős&eacute;geket. Ha csatlakoztatva vannak, egyes Bluetooth-eszk&ouml;z&ouml;k, p&eacute;ld&aacute;ul hangsz&oacute;r&oacute;k vagy fejhallgat&oacute;k kiv&aacute;laszthat&oacute;k az Audio Station hangkimenetek&eacute;nt, &iacute;gy lehetőv&eacute; t&eacute;ve a(z) DiskStation eszk&ouml;z&ouml;n tal&aacute;lhat&oacute; zene k&ouml;nnyű meghallgat&aacute;s&aacute;t.</p>
<h2>A haszn&aacute;lat megkezd&eacute;se</h2>
<p>Csatlakoztasson USB Bluetooth-adaptert a(z) DiskStation USB-portj&aacute;hoz. A Bluetooth főoldal&aacute;nak baloldal&aacute;n megjelenik a Bluetooth-adapterek list&aacute;ja. A Bluetooth-eszk&ouml;z&ouml;kre vonatkoz&oacute; inform&aacute;ci&oacute;k &eacute;s opci&oacute;k a jobboldalon vannak felt&uuml;ntetve.</p>
<h4>Bluetooth-adapterek enged&eacute;lyez&eacute;se vagy tilt&aacute;sa:</h4>
<ol>
<li>V&aacute;lasszon ki egy Bluetooth-adaptert.</li>
<li>Kattintson a <strong>Speci&aacute;lis be&aacute;ll&iacute;t&aacute;sok</strong> lehetős&eacute;gre.</li>
<li>Jel&ouml;lje ki a <strong>Bluetooth enged&eacute;lyez&eacute;se</strong> mezőt.</li>
<li>A be&aacute;ll&iacute;t&aacute;sok ment&eacute;s&eacute;hez kattintson az <strong>OK</strong> gombra.</li>
</ol>
<h2>Bluetooth-eszk&ouml;z&ouml;k kezel&eacute;se</h2>
<p>Amikor &uacute;j Bluetooth-eszk&ouml;zh&ouml;z csatlakozik, győződj&ouml;n meg r&oacute;la, hogy az felder&iacute;thető, a(z) DiskStation 10 m&eacute;teres k&ouml;rzet&eacute;n bel&uuml;l tal&aacute;lhat&oacute;, &eacute;s A2DP (halad&oacute; hangeloszt&aacute;si profil) protokollt haszn&aacute;l. A telep&iacute;t&eacute;sre vonatkoz&oacute; tov&aacute;bbi r&eacute;szleteket l&aacute;sd a Bluetooth-eszk&ouml;z felhaszn&aacute;l&oacute;i &uacute;tmutat&oacute;j&aacute;ban.</p>
<h4>Csatlakoz&aacute;s Bluetooth-eszk&ouml;zh&ouml;z:</h4>
<ol>
<li>A <strong>Bluetooth</strong> főoldalon v&aacute;lassza ki a(z) DiskStation eszk&ouml;zh&ouml;z csatlakoztatni k&iacute;v&aacute;nt Bluetooth-eszk&ouml;zt. Ha az eszk&ouml;z nem jelenik meg, akkor a k&ouml;zeli eszk&ouml;z&ouml;k megkeres&eacute;s&eacute;hez pr&oacute;b&aacute;ljon meg r&aacute;kattintani a <strong>Friss&iacute;t&eacute;s</strong> lehetős&eacute;gre.</li>
<li>Amikor megjelenik, v&aacute;lassza ki az eszk&ouml;zt.</li>
<li>Kattintson a <strong>Csatlakoz&aacute;s</strong> lehetős&eacute;gre.</li>
<li>Ha sz&uuml;ks&eacute;ges, adja meg az eszk&ouml;zh&ouml;z tartoz&oacute; PIN-k&oacute;dot.</li>
</ol>
<h4>Bluetooth-eszk&ouml;zadatok megtekint&eacute;se:</h4>
<ol>
<li>V&aacute;lasszon ki egy csatlakoztatott Bluetooth-eszk&ouml;zt.</li>
<li>Kattintson az <strong>Inform&aacute;ci&oacute;</strong> lehetős&eacute;gre.</li>
<li>Megjelenik egy inform&aacute;ci&oacute;kat, p&eacute;ld&aacute;ul Bluetooth-c&iacute;met, nevet, t&iacute;pust, &eacute;s &aacute;llapotot megjelen&iacute;tő ablak.</li>
</ol>
<h4>Bluetooth-eszk&ouml;z elt&aacute;vol&iacute;t&aacute;sa:</h4>
<ol>
<li>V&aacute;lasszon ki egy olyan Bluetooth-eszk&ouml;zt, amelyet t&ouml;bb&eacute; m&aacute;r nem k&iacute;v&aacute;n egy&uuml;tt haszn&aacute;lni a(z) DiskStation eszk&ouml;zzel.</li>
<li>Kattintson az <strong>Elt&aacute;vol&iacute;t&aacute;s</strong> gombra.</li>
</ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Ha Bluetooth hangsz&oacute;r&oacute;kon vagy fejhallgat&oacute;kon kereszt&uuml;l j&aacute;tszik le zen&eacute;t, akkor esetleg lej&aacute;tsz&aacute;si neh&eacute;zs&eacute;geket tapasztalhat, ha a Bluetooth adapter be&aacute;ll&iacute;t&aacute;sai m&oacute;dos&iacute;t&aacute;sra ker&uuml;ltek, illetve ha egyidejűleg t&uacute;l sok Bluetooth eszk&ouml;zh&ouml;z kapcsol&oacute;dik.</li>
<li>Az eszk&ouml;ztől f&uuml;ggően, ha egy, a(z) DiskStation eszk&ouml;zh&ouml;z csatlakoztatott Bluetooth hangsz&oacute;r&oacute;p&aacute;rt k&eacute;sőbb egy m&aacute;sik DiskStation eszk&ouml;zh&ouml;z (vagy Bluetooth zenelej&aacute;tsz&oacute;hoz) csatlakoztat, akkor a hangsz&oacute;r&oacute;k esetleg elfelejthetik a(z) DiskStation eszk&ouml;zt. Ebben az esetben hiba t&ouml;rt&eacute;nik, amikor zen&eacute;t k&iacute;s&eacute;rel meg lej&aacute;tszani a hangsz&oacute;r&oacute;kkal. A probl&eacute;ma megold&aacute;sa &eacute;rdek&eacute;ben t&aacute;vol&iacute;tsa el a hangsz&oacute;r&oacute;kat, majd pr&oacute;b&aacute;ljon meg &uacute;jra csatlakozni hozz&aacute;juk.</li>
</ul>

</div>
</body>
</html>
