<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Automatikus blokkol&aacute;s</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Automatikus blokkol&aacute;s</h2>

<p>Az automatikus blokkol&aacute;s lehetőv&eacute; teszi az &ouml;n sz&aacute;m&aacute;ra a hiteles&iacute;tetlen bejelentkez&eacute;s megelőz&eacute;s&eacute;t. A szolg&aacute;ltat&aacute;s enged&eacute;lyez&eacute;se ut&aacute;n egy IP-c&iacute;m blokkol&aacute;sra ker&uuml;l, ha t&uacute;ls&aacute;gosan sok sikertelen bejelentkez&eacute;si k&iacute;s&eacute;rlettel rendelkezik. Nem siker&uuml;lt bejelentkezni SSH-n, Telneten, rsync-en, H&aacute;l&oacute;zaton kereszt&uuml;li biztons&aacute;gi ment&eacute;sen, Megosztott mappa szinkroniz&aacute;l&aacute;son, FTP-n, WebDAV-en, Synology mobil alkalmaz&aacute;sokon, File Station-&ouml;n &eacute;s DSM-en kereszt&uuml;l. Lehet egy enged&eacute;lyezett list&aacute;ja is, ami az olyan IP-c&iacute;meket tartalmazza, amelyek soha nem ker&uuml;lnek blokkol&aacute;sra.</p>

<h4>Automatikus blokkol&aacute;s be&aacute;ll&iacute;t&aacute;sa:</h4>
<ol>
<li>Menjen az <strong>&Aacute;ltal&aacute;nos</strong> f&uuml;lre, &eacute;s jel&ouml;lje be az <b>Automatikus blokkol&aacute;s enged&eacute;lyez&eacute;se</b> lehetős&eacute;get.</li>
<li>Adjon meg egy sz&aacute;mot a <b>Bejelentkez&eacute;si k&iacute;s&eacute;rletek</b> &eacute;s a <b>(Percen) bel&uuml;l</b> sz&aacute;m&aacute;ra, ha blokkolni szeretne egy IP-c&iacute;met a meghat&aacute;rozott sz&aacute;m&uacute; percen bel&uuml;li be&aacute;ll&iacute;tott sz&aacute;m&uacute; sikertelen bejelentkez&eacute;si k&iacute;s&eacute;rlet ut&aacute;n.</li>
<li>Jel&ouml;lje be a <b>Blokkol&aacute;s lej&aacute;rat&aacute;nak enged&eacute;lyez&eacute;se</b> lehetős&eacute;get, majd adjon meg egy sz&aacute;mot a blokkolt IP-c&iacute;mnek a meghat&aacute;rozott sz&aacute;m&uacute; nap eltelt&eacute;vel t&ouml;rt&eacute;nő elt&aacute;vol&iacute;t&aacute;s&aacute;hoz.  A blokkolt IP-c&iacute;mek meghat&aacute;rozatlan ideig a tilt&oacute;list&aacute;n maradnak, hacsak manu&aacute;lisan el nem t&aacute;vol&iacute;tja a list&aacute;r&oacute;l, ha ez az opci&oacute; nincs kijel&ouml;lve, vagy ha a <b>Blokkol&aacute;s felold&aacute;sa (nap) ut&aacute;n</b> lehetős&eacute;g be&aacute;ll&iacute;t&aacute;sa 0.</li>

<li>Kattintson az <b>Alkalmaz</b> gombra.</li>
</ol>

<h4>Blokkolt IP-c&iacute;mek hozz&aacute;ad&aacute;sa:</h4>
<p>Kattintson a <strong>Tilt&oacute;lista</strong> f&uuml;lre, majd a <strong>L&eacute;trehoz&aacute;s</strong> leg&ouml;rd&uuml;lő men&uuml;ből v&aacute;lassza ki a k&ouml;vetkezők egyik&eacute;t:</p>
<ul>
<li><strong>IP-c&iacute;m hozz&aacute;ad&aacute;sa</strong></li>
<p>Adjon meg egy IP-c&iacute;met &eacute;s &aacute;ll&iacute;tsa be a lej&aacute;rati időt.<p/>
<li><strong>IP-c&iacute;m lista import&aacute;l&aacute;sa</strong></li>
<p>Ha egyszerre sok IP-c&iacute;met szeretne hozz&aacute;adni &eacute;s egyidejűleg a lej&aacute;rati időt is be szeretn&eacute; &aacute;ll&iacute;tani, import&aacute;ljon egy IP-c&iacute;meket felsorol&oacute; sz&ouml;vegf&aacute;jlt. Ha fel&uuml;l szeretn&eacute; &iacute;rni a l&eacute;tező IP-c&iacute;meket, jel&ouml;lje be a megfelelő jel&ouml;lőn&eacute;gyzetet. Ha ez a lehetős&eacute;g nem ker&uuml;l kiv&aacute;laszt&aacute;sra, akkor a k&eacute;tszer szereplő IP-c&iacute;mek kihagy&aacute;sra ker&uuml;lnek.</p>
<p>F&aacute;jl import&aacute;l&aacute;s&aacute;hoz a f&aacute;jlnak meg kell felelnie az al&aacute;bbi k&ouml;vetelm&eacute;nyeknek:</p>
<ul>
<li>A f&aacute;jlnak egyszerű sz&ouml;vegf&aacute;jlnak kell lennie.</li>
<li>A f&aacute;jl minden egyes sora csak egy IP-c&iacute;met tartalmazhat.</li>
<li>A magyar&aacute;z&oacute; sorok # jellel (font jellel) kezdődnek.</li>
<p>Ha a kiv&aacute;lasztott f&aacute;jl megfelelő form&aacute;tum&uacute;, az előn&eacute;zeti ter&uuml;leten l&aacute;tni fogja az &ouml;sszes IP-c&iacute;met. Az import&aacute;l&aacute;shoz kattintson az <strong>OK</strong> gombra.</p>
</ul>
</ul>

<h4>Blokkolt IP-c&iacute;mek elt&aacute;vol&iacute;t&aacute;sa:</h4>
<ol>
<li>
A blokkolt IP-c&iacute;mek list&aacute;j&aacute;nak megjelen&iacute;t&eacute;s&eacute;hez kattintson a <b>Tilt&oacute;lista</b> f&uuml;lre.
</li>
<li>
V&aacute;lassza ki a list&aacute;r&oacute;l elt&aacute;vol&iacute;tani k&iacute;v&aacute;nt IP-c&iacute;meket, majd kattintson az <b>Elt&aacute;vol&iacute;t&aacute;s</b> lehetős&eacute;gre.
</li>
</ol>


<h4>Enged&eacute;lyezett IP-c&iacute;mek hozz&aacute;ad&aacute;sa:</h4>
<p>Kattintson az <strong>Enged&eacute;lyezett lista</strong> f&uuml;lre, majd a <strong>L&eacute;trehoz&aacute;s</strong> leg&ouml;rd&uuml;lő men&uuml;ből v&aacute;lassza ki a k&ouml;vetkezők egyik&eacute;t:</p>
<ul>
<li><strong>IP-c&iacute;m hozz&aacute;ad&aacute;sa</strong></li>
<p>IP c&iacute;m megad&aacute;sa.<p/>
<li><strong>IP-c&iacute;m lista import&aacute;l&aacute;sa</strong></li>
<p>Ha egyszerre sok IP-c&iacute;met szeretne hozz&aacute;adni, import&aacute;ljon egy IP-c&iacute;meket felsorol&oacute; sz&ouml;vegf&aacute;jlt. Ha fel&uuml;l szeretn&eacute; &iacute;rni a l&eacute;tező IP-c&iacute;meket, jel&ouml;lje be a megfelelő jel&ouml;lőn&eacute;gyzetet. Ha ez a lehetős&eacute;g nem ker&uuml;l kiv&aacute;laszt&aacute;sra, akkor a k&eacute;tszer szereplő IP-c&iacute;mek kihagy&aacute;sra ker&uuml;lnek.</p>
<p>F&aacute;jl import&aacute;l&aacute;s&aacute;hoz a f&aacute;jlnak meg kell felelnie az al&aacute;bbi k&ouml;vetelm&eacute;nyeknek:</p>
<ul>
<li>A f&aacute;jlnak egyszerű sz&ouml;vegf&aacute;jlnak kell lennie.</li>
<li>A f&aacute;jl minden egyes sora csak egy IP-c&iacute;met tartalmazhat.</li>
<li>A magyar&aacute;z&oacute; sorok # jellel (font jellel) kezdődnek.</li>
<p>Ha a kiv&aacute;lasztott f&aacute;jl megfelelő form&aacute;tum&uacute;, az előn&eacute;zeti ter&uuml;leten l&aacute;tni fogja az &ouml;sszes IP-c&iacute;met. Az import&aacute;l&aacute;shoz kattintson az <strong>OK</strong> gombra.</p>
</ul>
</ul>

<h4>Enged&eacute;lyezett IP-c&iacute;mek elt&aacute;vol&iacute;t&aacute;sa:</h4>
<ol>
<li>
Az enged&eacute;lyezett IP-c&iacute;mek list&aacute;j&aacute;nak megjelen&iacute;t&eacute;s&eacute;hez kattintson az <b>Enged&eacute;lyezett lista</b> f&uuml;lre.
</li>
<li>
V&aacute;lassza ki a list&aacute;r&oacute;l elt&aacute;vol&iacute;tani k&iacute;v&aacute;nt IP-c&iacute;meket, majd kattintson az <b>Elt&aacute;vol&iacute;t&aacute;s</b> lehetős&eacute;gre. </li>
</ol>


</body>
</html>
