<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Biztons&aacute;g</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Biztons&aacute;g</h2>
<p>Ez a f&uuml;l lehetőv&eacute; teszi az egyes h&aacute;l&oacute;zati interf&eacute;szek h&aacute;l&oacute;zati biztons&aacute;gi be&aacute;ll&iacute;t&aacute;sainak m&oacute;dos&iacute;t&aacute;s&aacute;t.</p>
<h3>DoS v&eacute;delem</h3>
<p>A szolg&aacute;ltat&aacute;smegtagad&aacute;si (DoS) v&eacute;delem seg&iacute;t megelőzni az interneten kereszt&uuml;li k&aacute;rt&eacute;kony t&aacute;mad&aacute;sokat.</p>
<h4>DoS v&eacute;delem enged&eacute;lyez&eacute;se:</h4>
<ol>
<li>Jel&ouml;lje ki a <strong>DoS v&eacute;delem enged&eacute;lyez&eacute;se</strong> mezőt.</li>
<li>Kattintson az <strong>Alkalmaz</strong> gombra.</li>
</ol>
<h3>VPN Pass-through*</h3>
<p>Amikor a(z) DiskStation routerk&eacute;nt műk&ouml;dik, akkor a VPN pass-through lehetőv&eacute; teszi a kliensek sz&aacute;m&aacute;ra, hogy &aacute;tjussanak a(z) DiskStation NAT-on &eacute;s kimenő vagy bej&ouml;vő VPN kapcsolatokat l&eacute;tes&iacute;tsenek. Ha a belső be&aacute;ll&iacute;t&aacute;sa VPN-kiszolg&aacute;l&oacute;t tartalmaz, menjen a <strong>Vez&eacute;rlőpult</strong> &gt; <strong>Adat&uacute;tv&aacute;laszt&oacute; konfigur&aacute;l&aacute;sa</strong> men&uuml;pontra, &eacute;s &aacute;ll&iacute;tson be porttov&aacute;bb&iacute;t&aacute;si szab&aacute;lyokat, illetve enged&eacute;lyezze a VPN-kiszolg&aacute;l&oacute; sz&aacute;m&aacute;ra VPN kapcsolatok l&eacute;trehoz&aacute;s&aacute;t.</p>
<h4>VPN pass-through be&aacute;ll&iacute;t&aacute;sok szerkeszt&eacute;se:</h4>
<ol>
<li>Itt a k&ouml;vetkező be&aacute;ll&iacute;t&aacute;sok enged&eacute;lyezhetők vagy tilthat&oacute;k le:</li>
<ul>
<li><strong>PPTP Pass-through:</strong> Lehetőv&eacute; teszi PPTP (Point-to-Point Tunneling Protocol - pont-pont alag&uacute;t t&iacute;pus&uacute; &aacute;tvitel protokoll) forgalom sz&aacute;m&aacute;ra az &aacute;tjut&aacute;st &eacute;s kapcsolatok l&eacute;tes&iacute;t&eacute;s&eacute;t.</li>
<li><strong>IPSec Pass-through:</strong> Lehetőv&eacute; teszi IPSec (IP Security Protocol - IP biztons&aacute;gi protokoll) forgalom sz&aacute;m&aacute;ra az &aacute;tjut&aacute;st &eacute;s kapcsolatok l&eacute;tes&iacute;t&eacute;s&eacute;t.</li>
<li><strong>L2TP Pass-through:</strong> Lehetőv&eacute; teszi L2TP (Layer 2 Tunneling Protocol - 2 r&eacute;tegű alag&uacute;t t&iacute;pus&uacute; &aacute;tvitel protokoll) forgalom sz&aacute;m&aacute;ra az &aacute;tjut&aacute;st &eacute;s kapcsolatok l&eacute;tes&iacute;t&eacute;s&eacute;t.</li>
</ul>
<li>A be&aacute;ll&iacute;t&aacute;sok m&oacute;dos&iacute;t&aacute;sa ut&aacute;n kattintson az <strong>Alkalmaz</strong> gombra.</li>
</ol>
<p>____<br> *Csak bizonyos modelleken &eacute;rhető el.</p>
</body>
</html>
