<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DDNS</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="UTF-8">
</head>
<body>
<h2>DDNS</h2>
<p>A DDNS (dinamikus tartom&aacute;nyn&eacute;v szolg&aacute;ltat&aacute;s) &uacute;gy egyszerűs&iacute;ti az interneten kereszt&uuml;li csatlakoz&aacute;st a(z) DiskStation term&eacute;khez, hogy hosztnevet k&eacute;pez le annak IP-c&iacute;m&eacute;hez. A DDNS p&eacute;ld&aacute;ul lehetőv&eacute; teszi, hogy tartom&aacute;nyn&eacute;v (pl. <i>www.john.synology.me</i>) haszn&aacute;lat&aacute;val f&eacute;rjen hozz&aacute; a(z) DiskStation term&eacute;khez an&eacute;lk&uuml;l, hogy meg kellene jegyeznie egy IP-c&iacute;met (pl. <i>172.16.254.1</i>).</p>

<h3>DDNS be&aacute;ll&iacute;t&aacute;sa</h3>
<p>Egy l&eacute;tező hosztnevet a(z) DiskStation term&eacute;k IP-c&iacute;m&eacute;re ir&aacute;ny&iacute;that, illetve a Synology vagy n&eacute;h&aacute;ny m&aacute;s DDNS-szolg&aacute;ltat&oacute; &aacute;ltal ny&uacute;jtott &uacute;j&eacute;rt is regisztr&aacute;lhat. A hosztn&eacute;v-regisztr&aacute;ci&oacute;ra vonatkoz&oacute; tov&aacute;bbi r&eacute;szletek&eacute;rt forduljon az egyes szolg&aacute;ltat&oacute;khoz.</p>



<h4>DDNS-hosztn&eacute;v be&aacute;ll&iacute;t&aacute;sa:</h4>
<ol>
<li>Kattintson a <b>Hozz&aacute;ad&aacute;s</b> gombra.</li>
<li>Egy felbukkan&oacute; p&aacute;rbesz&eacute;dpanel a k&ouml;vetkező be&aacute;ll&iacute;t&aacute;sok szerkeszt&eacute;s&eacute;re sz&oacute;l&iacute;tja fel:<ul>
<li><strong>Szolg&aacute;ltat&oacute;:</strong> V&aacute;lasszon egy szolg&aacute;ltat&oacute;t. A Synology &aacute;ltal ny&uacute;jtott ingyenes hosztn&eacute;v regisztr&aacute;ci&oacute;j&aacute;hoz v&aacute;lassza ki a leg&ouml;rd&uuml;lő men&uuml;ből a <b>Synology</b> lehetős&eacute;get, kattintson a <b>Regisztr&aacute;l&aacute;s most</b> elemre, &eacute;s az utas&iacute;t&aacute;sok szerint adja meg a r&eacute;szleteket.</li>
<li><strong>Gazdan&eacute;v:</strong> Adjon meg egy regisztr&aacute;lt DDNS-hosztnevet, p&eacute;ld&aacute;ul <i>john.synology.me</i>.</li>
<li><strong>Felhaszn&aacute;l&oacute;n&eacute;v:</strong> Adja meg DDNS-szolg&aacute;ltat&oacute;j&aacute;hoz tartoz&oacute; felhaszn&aacute;l&oacute;nev&eacute;t.</li>
<li><strong>Jelsz&oacute;:</strong> Adja meg DDNS-szolg&aacute;ltat&oacute;j&aacute;hoz tartoz&oacute; jelszav&aacute;t.</li>
<li><strong>K&uuml;lső c&iacute;m:</strong> Adja meg a hosztnevet a j&ouml;vőben haszn&aacute;l&oacute; DiskStation term&eacute;k k&uuml;lső IP-c&iacute;m&eacute;t.</li>
<li><strong>Heartbeat:</strong> Enged&eacute;lyezze ezt a lehetős&eacute;get, ha a lek&eacute;pzett hosztn&eacute;v &aacute;llapot&aacute;ra vonatkoz&oacute; figyelmeztet&eacute;seket szeretne kapni (csak a Synology &aacute;ltal ny&uacute;jtott hosztnevek eset&eacute;n).</li>
</ul>
</li>
<li>A be&aacute;ll&iacute;t&aacute;sok helyess&eacute;g&eacute;nek megtekint&eacute;s&eacute;hez kattintson a <strong>Csatlakoz&aacute;s ellenőrz&eacute;se</strong> lehetős&eacute;gre.</li>
<li>A ment&eacute;shez &eacute;s befejez&eacute;shez kattintson az <strong>OK</strong> gombra.</li>
</ol>

<p>A be&aacute;ll&iacute;t&aacute;s befejez&eacute;se ut&aacute;n az interneten kereszt&uuml;l el&eacute;rheti a(z) DiskStation term&eacute;ket, ha egy webb&ouml;ng&eacute;szőbe be&iacute;rja a DDNS-hosztnevet.</p>
<div class="section">
<h4>K&ouml;vetelm&eacute;nyek &eacute;s korl&aacute;toz&aacute;sok</h4>
<ul> 
<li>Műk&ouml;dnek a DDNS-szolg&aacute;ltat&oacute; kiszolg&aacute;l&oacute;i.</li>
<li>A(z) DiskStation csatlakozni tud az internethez.</li>
<li>A DDNS csak olyan h&aacute;l&oacute;zati k&ouml;rnyezetben műk&ouml;dik, ahol nincs sz&uuml;ks&eacute;g proxy-szerverre.</li>
<li>Minden egyes DDNS-szolg&aacute;ltat&oacute;hoz csak egy hosztn&eacute;v adhat&oacute; meg.</li>

</ul>
</div>

<h3>Hosztnevek kezel&eacute;se</h3>
<p>L&eacute;tező hosztn&eacute;v-bejegyz&eacute;sek kezel&eacute;s&eacute;hez haszn&aacute;lja a k&ouml;vetkező gombokat:</p>
<ul>
<li><strong>T&ouml;rl&eacute;s:</strong> Elt&aacute;vol&iacute;tja a kiv&aacute;lasztott hosztn&eacute;v-bejegyz&eacute;st a list&aacute;r&oacute;l.</li>
<li><strong>Szerkeszt&eacute;s:</strong> A művelet r&eacute;v&eacute;n m&oacute;dos&iacute;that&oacute;k a kiv&aacute;lasztott hosztn&eacute;v-bejegyz&eacute;s be&aacute;ll&iacute;t&aacute;sai.</li>
<li><strong>Friss&iacute;t&eacute;s most:</strong> Az &ouml;sszes olyan hosztn&eacute;v-bejegyz&eacute;s &aacute;llapot&aacute;t friss&iacute;ti, amin enged&eacute;lyezett a DDNS-szolg&aacute;ltat&aacute;s.</li></ul>

<h3>Egy&eacute;ni DDNS-szolg&aacute;ltat&oacute; be&aacute;ll&iacute;t&aacute;sa</h3>
<p>Amennyiben a DDNS-szolg&aacute;ltat&oacute;ja nem tal&aacute;lhat&oacute; meg a szolg&aacute;ltat&oacute;k list&aacute;j&aacute;ban, lehetős&eacute;ge van egy&eacute;ni szolg&aacute;ltat&oacute; meghat&aacute;roz&aacute;s&aacute;ra.</p>
<h4>Egy&eacute;ni DDNS-szolg&aacute;ltat&oacute; be&aacute;ll&iacute;t&aacute;sa:</h4>
<ol>
<li>Kattintson a <b>Testreszab&aacute;s</b> gombra.</li>
<li>Egy felbukkan&oacute; p&aacute;rbesz&eacute;dpanel a k&ouml;vetkező be&aacute;ll&iacute;t&aacute;sok meghat&aacute;roz&aacute;s&aacute;ra sz&oacute;l&iacute;tja fel:<ul>
    <li><strong>Szolg&aacute;ltat&oacute;:</strong> Adja meg az egy&eacute;ni szolg&aacute;ltat&oacute; nev&eacute;t.</li>
    <li><strong>Lek&eacute;rdez&eacute;si URL:</strong> Adja meg az egy&eacute;ni szolg&aacute;ltat&oacute; URL-c&iacute;m&eacute;t.</li>
  </ul>
</li>
<li>Kattintson a <strong>Ment&eacute;s</strong> parancsra az egy&eacute;ni szolg&aacute;ltat&oacute; DDNS-szolg&aacute;ltat&oacute;k list&aacute;j&aacute;ra ad&aacute;s&aacute;hoz.</li>
</ol>
<div class="section">
<h4>K&ouml;vetelm&eacute;nyek &eacute;s korl&aacute;toz&aacute;sok</h4>
<ul>
  <li>A lek&eacute;rdez&eacute;si URL-nek meg kell felelnie a szolg&aacute;ltat&oacute;ja &aacute;ltal meghat&aacute;rozott protokollnak. A rendszer ezt az URL-c&iacute;met haszn&aacute;lja az IP-c&iacute;mre vonatkoz&oacute; adatok DDNS kiszolg&aacute;l&oacute;n val&oacute; friss&iacute;t&eacute;s&eacute;hez.</li>
  <li>A lek&eacute;rdez&eacute;si URL &aacute;ltal&aacute;ban a n&eacute;gy al&aacute;bbi param&eacute;tert tartalmazza. A lek&eacute;rdez&eacute;si URL megad&aacute;sakor cser&eacute;lje ki ezeket a param&eacute;tereket a megfelelő v&aacute;ltoz&oacute;kkal.</li>
  <ul>
    <li>Felhaszn&aacute;l&oacute;n&eacute;v: __USERNAME__</li>
    <li>Jelsz&oacute;: __PASSWORD__</li>
    <li>Gazdan&eacute;v: __HOSTNAME__</li>
    <li>K&uuml;lső c&iacute;m: __MYIP__</li>
  </ul>
<li>A lek&eacute;rdez&eacute;si URL nem tartalmazhat sz&oacute;k&ouml;z&ouml;ket vagy pontosvesszőket.</li>
</ul>
</div>
</body>
</html>
