<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Megosztott mappa enged&eacute;lyek hozz&aacute;rendel&eacute;se - Synology DSM S&uacute;g&oacute;</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="You can specify which users or groups can access, view, or modify a shared folder and its contents. This article shows you how to assign and customize shared folder permissions in DSM.">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>




<h2>Megosztott mappa enged&eacute;lyek hozz&aacute;rendel&eacute;se</h2>

<p>Meghat&aacute;rozhatja, hogy milyen felhaszn&aacute;l&oacute;k vagy csoportok f&eacute;rhessenek hozz&aacute;, tekinthessenek meg, illetve m&oacute;dos&iacute;thassanak egy megosztott mapp&aacute;t &eacute;s annak tartalm&aacute;t. A megosztott mapp&aacute;k, valamint egyedi f&aacute;jlok &eacute;s almapp&aacute;k hozz&aacute;f&eacute;r&eacute;si jogai minden egyes felhaszn&aacute;l&oacute; vagy csoport sz&aacute;m&aacute;ra testreszabhat&oacute;k.</p>

<div class="section disable-eds14">
<h4>Windows ACL:</h4>

<p>DSM 5.0 vagy &uacute;jabb verzi&oacute;ban a megosztott mapp&aacute;k hozz&aacute;f&eacute;r&eacute;si enged&eacute;lyei alap&eacute;rtelmez&eacute;s szerint Windows ACL alap&uacute;ak. Az &uacute;jonnan l&eacute;trehozott megosztott mapp&aacute;k &ouml;r&ouml;klik a Windows ACL enged&eacute;ly-be&aacute;ll&iacute;t&aacute;sait, ami egyedi f&aacute;jlok &eacute;s almapp&aacute;k enged&eacute;lyeinek testreszab&aacute;s&aacute;t is lehetőv&eacute; teszi. Az enged&eacute;lyek testreszabhat&oacute;k tov&aacute;bb&aacute; a File Station vagy Windows-ban a F&aacute;jlkezelő seg&iacute;ts&eacute;g&eacute;vel is.</p>
<p>A k&ouml;vetkező megosztott mapp&aacute;k nem haszn&aacute;lhatj&aacute;k a Windows ACL enged&eacute;lykezelő rendszert: <strong>photo</strong>, <strong>satashare</strong>, <strong>sdshare</strong>, <strong>surveillance</strong>, <strong>usbshare</strong>.</p>
</div>
<div class="section disable-eds14">
<h4>Megjegyz&eacute;s:</h4>  
<p>A felhaszn&aacute;l&oacute;k szem&eacute;lyes <strong>home</strong> mapp&aacute;i a <strong>homes</strong> mapp&aacute;ban tal&aacute;lhat&oacute;k. Mivel az ACL az enged&eacute;ly-&ouml;r&ouml;klőd&eacute;s alapj&aacute;n műk&ouml;dik, &iacute;gy ha &ouml;n NA enged&eacute;lyt &aacute;ll&iacute;t be egy felhaszn&aacute;l&oacute;/csoport sz&aacute;m&aacute;ra a <strong>homes</strong> mapp&aacute;hoz, a felhaszn&aacute;l&oacute;k nem f&eacute;rhetnek hozz&aacute; a saj&aacute;t szem&eacute;lyes <strong>home</strong> mapp&aacute;jukhoz. </p>
</div>
<h4>Egy megosztott mappa enged&eacute;lyeinek szerkeszt&eacute;se:</h4>

<ol>

<li>V&aacute;lassza a <strong>Vez&eacute;rlőpult</strong> &gt; <strong>Megosztott mappa</strong> opci&oacute;t.</li><img src="about:blank" class="help_image"/><li>V&aacute;lassza ki a megosztott mapp&aacute;t, amelynek enged&eacute;lyeit szerkeszteni k&iacute;v&aacute;nja. Kattintson a <b>Szerkeszt&eacute;s</b> gombra.</li><img src="../../../online_img/dsm/AdminCenter/file_share_privilege/howto450-2.png" class="help_image"/><li> Menjen az <strong>Enged&eacute;lyek</strong> f&uuml;lre.</li><img src="../../../online_img/dsm/AdminCenter/file_share_privilege/howto450-3.png" class="help_image"/><li>V&aacute;lassza ki a k&ouml;vetkezők egyik&eacute;t a leg&ouml;rd&uuml;lő men&uuml;ből:<ul>
<li><b>Rendszer belső felhaszn&aacute;l&oacute;:</b> Rendeljen enged&eacute;lyeket az alap&eacute;rtelmezett rendszerfelhaszn&aacute;l&oacute;khoz, p&eacute;ld&aacute;ul az Anonim FTP/WebDAV felhaszn&aacute;l&oacute;hoz. Mielőtt enged&eacute;lyezn&eacute; anonim FTP felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra a csatlakoz&aacute;st egy megosztott mapp&aacute;hoz, hozz&aacute;f&eacute;r&eacute;si enged&eacute;lyeket kell hozz&aacute;rendelnie ehhez a felhaszn&aacute;l&oacute;hoz.</li>
<li><b>Helyi felhaszn&aacute;l&oacute;k:</b> Rendeljen enged&eacute;lyeket helyi felhaszn&aacute;l&oacute;khoz (bele&eacute;rtve a <b>guest</b> felhaszn&aacute;l&oacute;t).</li>
<li><b>Helyi csoportok:</b> Rendeljen enged&eacute;lyeket helyi csoportokhoz.</li>
</ul>
</li><img src="about:blank" class="help_image"/><li>Minden egyes felhaszn&aacute;l&oacute; vagy csoport eset&eacute;ben jel&ouml;lje be a megfelelő jel&ouml;lőn&eacute;gyzeteket vagy sz&uuml;ntesse meg azok bejel&ouml;lts&eacute;g&eacute;t, ha szeretn&eacute; testreszabni azok hozz&aacute;f&eacute;r&eacute;si enged&eacute;lyeit a megosztott mapp&aacute;hoz:<ul>
<li><b>&Iacute;r&aacute;s/olvas&aacute;s</b>: A felhaszn&aacute;l&oacute; vagy csoport hozz&aacute;f&eacute;rhet a megosztott mapp&aacute;ban tal&aacute;lhat&oacute; f&aacute;jlokhoz &eacute;s almapp&aacute;khoz &eacute;s azokon v&aacute;ltoztat&aacute;sokat is v&eacute;gezhet.</li>
<li><b>Csak olvashat&oacute;</b>: A felhaszn&aacute;l&oacute; vagy csoport hozz&aacute;f&eacute;rhet a megosztott mapp&aacute;ban tal&aacute;lhat&oacute; f&aacute;jlokhoz &eacute;s almapp&aacute;khoz.</li>
<li><b>Nincs hozz&aacute;f&eacute;r&eacute;s</b>: A felhaszn&aacute;l&oacute; vagy csoport nem f&eacute;rhet hozz&aacute; a megosztott mapp&aacute;ban tal&aacute;lhat&oacute; f&aacute;jlokhoz vagy almapp&aacute;khoz.</li>
</ul>
</li><img src="about:blank" class="help_image"/><li>A befejez&eacute;shez kattintson az <b>OK</b> gombra</li>
</ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>

<ul>
<li>Ha enged&eacute;ly &uuml;tk&ouml;z&eacute;s fordul elő, akkor az enged&eacute;ly priorit&aacute;s a k&ouml;vetkező: Nincs hozz&aacute;f&eacute;r&eacute;s &gt; &Iacute;r&aacute;s/olvas&aacute;s &gt; Csak olvashat&oacute;.</li>
<li>&Uacute;j megosztott mappa l&eacute;trehoz&aacute;sakor, ha az <strong>administrators</strong> csoporthoz tartoz&oacute; felhaszn&aacute;l&oacute;k enged&eacute;lyeinek be&aacute;ll&iacute;t&aacute;sa <b>Nincs hozz&aacute;f&eacute;r&eacute;s</b>, ezek a felhaszn&aacute;l&oacute;k csak a <strong>Vez&eacute;rlőpult</strong> &gt; <strong>Megosztott mappa</strong> men&uuml;pontban l&aacute;thatj&aacute;k majd a megosztott mapp&aacute;t.</li>
</ul>
</div>

<h3 class="disable-eds14">Windows ACL enged&eacute;lyek testreszab&aacute;sa</h3>

<p class="disable-eds14">A fent le&iacute;rt be&aacute;ll&iacute;t&aacute;sokon k&iacute;v&uuml;l, az al&aacute;bb k&ouml;vetkező l&eacute;p&eacute;sekkel tov&aacute;bb finom&iacute;thatja az enged&eacute;lyek testreszab&aacute;s&aacute;t. </p>

<div class="section disable-eds14">
<h4>Megjegyz&eacute;s:</h4>
<p>Az al&aacute;bbi be&aacute;ll&iacute;t&aacute;sok a k&ouml;vetkező megosztott mapp&aacute;k eset&eacute;n nem haszn&aacute;lhat&oacute;ak: <strong>photo</strong>, <strong>satashare</strong>, <strong>sdshare</strong>, <strong>surveillance</strong>, <strong>usbshare</strong>.</p>
</div>

<h4 class="disable-eds14">Enged&eacute;lyek testreszab&aacute;sa:</h4>
<ol class="disable-eds14">
  <li>Az <strong>Enged&eacute;lyek</strong> f&uuml;l&ouml;n v&aacute;lassza ki a felhaszn&aacute;l&oacute;t, akinek az enged&eacute;lyeit testre szeretn&eacute; szabni. Kattintson b&aacute;rhov&aacute; az <strong>Egyedi</strong> oszlopban.</li><img src="about:blank" class="help_image"/><li>A f&aacute;jl vagy mappa ACL enged&eacute;lyeinek kezel&eacute;s&eacute;hez tegye a k&ouml;vetkezők valamelyik&eacute;t az <b>Enged&eacute;lyszerkesztő</b> ablakban:<ol>
        <li><b>Felhaszn&aacute;l&oacute; vagy csoport:</b> Hat&aacute;rozza meg a felhaszn&aacute;l&oacute;t vagy csoportot, amelynek enged&eacute;lyeit testre szeretn&eacute; szabni.</li><img src="about:blank" class="help_image"/><li><b>&Ouml;r&ouml;kl&eacute;s innen:</b> Csak megtekint&eacute;sre. Itt megtekintheti, hogy az enged&eacute;ly &ouml;r&ouml;kl&ouml;tt-e (sz&uuml;lőmapp&aacute;t&oacute;l) vagy explicit (ebben az esetben <b>Nincs</b> l&aacute;that&oacute;). </li><img src="../../../online_img/dsm/AdminCenter/file_share_privilege/howto450-9.png" class="help_image"/><li><b>T&iacute;pus:</b> Adja meg az enged&eacute;lyt a felhaszn&aacute;l&oacute;nak, illetve csoportnak, vagy vonja meg től&uuml;k &ndash; ehhez v&aacute;lasszon az <b>Enged&eacute;lyez&eacute;s</b> &eacute;s a <b>Megtagad&aacute;s</b> k&ouml;z&ouml;tt.</li><img src="../../../online_img/dsm/AdminCenter/file_share_privilege/howto450-10.png" class="help_image"/><li><b>Alkalmaz&aacute;s a k&ouml;vetkezőre:</b> Ha mapp&aacute;hoz hoz l&eacute;tre jogosults&aacute;got, a jel&ouml;lőn&eacute;gyzetekkel alkalmazza erre a mapp&aacute;ra, a mapp&aacute;ban tal&aacute;lhat&oacute; mapp&aacute;kra (<b>Belső mapp&aacute;k</b>) &eacute;s f&aacute;jlokra (<b>Belső f&aacute;jlok</b>), illetve a mapp&aacute;ban tal&aacute;lhat&oacute; &ouml;sszes f&aacute;jlra &eacute;s mapp&aacute;ra (<b>&Ouml;sszes lesz&aacute;rmazott</b>). </li><img src="../../../online_img/dsm/AdminCenter/file_share_privilege/howto450-11.png" class="help_image"/><li><b>Adminisztr&aacute;ci&oacute;:</b> Az <b>Enged&eacute;lyek olvas&aacute;sa</b>, <b>Enged&eacute;lyek m&oacute;dos&iacute;t&aacute;sa</b>, illetve <b>Saj&aacute;t tulajdonba v&eacute;tel</b> elem seg&iacute;ts&eacute;g&eacute;vel adja meg, milyen hozz&aacute;f&eacute;r&eacute;si enged&eacute;ly-be&aacute;ll&iacute;t&aacute;ssal b&iacute;r a felhaszn&aacute;l&oacute; vagy csoport a t&eacute;telt illetően. </li>
        <li><b>Olvas&aacute;s</b> vagy <b>&Iacute;r&aacute;s:</b> Az ebben a r&eacute;szben tal&aacute;lhat&oacute; jel&ouml;lőn&eacute;gyzetekkel &aacute;ll&iacute;tsa be a felhaszn&aacute;l&oacute;, illetve csoport f&aacute;jl- &eacute;s mappaenged&eacute;ly-be&aacute;ll&iacute;t&aacute;sait. </li>
      </ol>    
  <li> Kattintson az <b>OK</b> gombra.</li>
</ol>
<div class="section disable-eds14">
  <h4>Az ACL enged&eacute;lyek fajt&aacute;i a k&ouml;vetkezők:</h4>
  <ul>
    <li><b>Adminisztr&aacute;ci&oacute;:</b><ul>
      <li><b>Enged&eacute;lyek m&oacute;dos&iacute;t&aacute;sa</b>: Azt vez&eacute;rli, m&oacute;dos&iacute;thatja-e a felhaszn&aacute;l&oacute; a f&aacute;jl vagy mappa enged&eacute;lyeit.</li>
      <li><b>Saj&aacute;t tulajdonba v&eacute;tel</b>: Azt vez&eacute;rli, saj&aacute;t tulajdonba veheti-e a felhaszn&aacute;l&oacute; a f&aacute;jlt vagy mapp&aacute;t.</li>
    </ul></li>
    <li><b>Olvas&aacute;s:</b><ul>
      <li><b>Mapp&aacute;k bej&aacute;r&aacute;sa/F&aacute;jlok v&eacute;grehajt&aacute;sa</b>: Azt vez&eacute;rli, futtathat-e a felhaszn&aacute;l&oacute; programf&aacute;ljt.</li>
      <li><b>Mapp&aacute;k list&aacute;z&aacute;sa, adatok olvas&aacute;sa</b>: Azt vez&eacute;rli, beolvashat-e a felhaszn&aacute;l&oacute; f&aacute;jlb&oacute;l adatokat.</li>
      <li><b>Attrib&uacute;tumok olvas&aacute;sa</b>: Azt vez&eacute;rli, beolvashat-e a felhaszn&aacute;l&oacute; f&aacute;jlattrib&uacute;tumokat.</li>
      <li><b>Kiterjesztett attrib&uacute;tumok olvas&aacute;sa</b>: Azt vez&eacute;rli, beolvashat-e a felhaszn&aacute;l&oacute; kiterjesztett f&aacute;jlattrib&uacute;tumokat.</li>
      <li><b>Enged&eacute;lyek olvas&aacute;sa</b>: Azt vez&eacute;rli, kiolvashatja-e a felhaszn&aacute;l&oacute; a f&aacute;jl vagy mappa enged&eacute;lyeit.</li>
    </ul></li>
    <li><b>&Iacute;r&aacute;s:</b><ul>
      <li><b>F&aacute;jlok l&eacute;trehoz&aacute;sa, adatok &iacute;r&aacute;sa</b>: Azt vez&eacute;rli, m&oacute;dos&iacute;thatja-e a felhaszn&aacute;l&oacute; f&aacute;jl tartalm&aacute;t.</li>
      <li><b>Mapp&aacute;k l&eacute;trehoz&aacute;sa, adatok hozz&aacute;fűz&eacute;se</b>: Azt vez&eacute;rli, adhat-e hozz&aacute; a felhaszn&aacute;l&oacute; adatot f&aacute;jl v&eacute;g&eacute;hez.</li>
      <li><b>Attrib&uacute;tumok &iacute;r&aacute;sa</b>: Azt vez&eacute;rli, m&oacute;dos&iacute;thatja-e a felhaszn&aacute;l&oacute; f&aacute;jl attrib&uacute;tumait.</li>
      <li><b>Kiterjesztett attrib&uacute;tumok &iacute;r&aacute;sa</b>: Azt vez&eacute;rli, m&oacute;dos&iacute;thatja-e a felhaszn&aacute;l&oacute; f&aacute;jl kiterjesztett attrib&uacute;tumait.</li>
      <li><b>Almapp&aacute;k &eacute;s f&aacute;jlok t&ouml;rl&eacute;se</b>: Azt vez&eacute;rli, t&ouml;r&ouml;lhet-e a felhaszn&aacute;l&oacute; mapp&aacute;t.</li>
      <li><b>T&ouml;rl&eacute;s</b>: Azt vez&eacute;rli, t&ouml;r&ouml;lhet-e a felhaszn&aacute;l&oacute; f&aacute;jlt.</li>
    </ul></li>
  </ul>
  <h4>Enged&eacute;lyek &ouml;r&ouml;kl&eacute;se:</h4>
  <p> Az ACL enged&eacute;lyek sz&uuml;lőobjektumr&oacute;l gyermekobjektumra &ouml;r&ouml;klődnek. Ha p&eacute;ld&aacute;ul a &bdquo;marketing&rdquo; mappa ACL-bejegyz&eacute;se &bdquo;Olvas&aacute;s&rdquo; enged&eacute;lyt ad &bdquo;Juli&rdquo; felhaszn&aacute;l&oacute;nak, akkor az ACL-bejegyz&eacute;s a &bdquo;marketing&rdquo; mappa &ouml;sszes f&aacute;jlj&aacute;ra vonatkozik (p&eacute;ld&aacute;ul &bdquo;&eacute;ves jelent&eacute;s.xls&rdquo;), &eacute;s a felhaszn&aacute;l&oacute; megnyithatja a f&aacute;jlokat. Az &ouml;r&ouml;kl&ouml;tt enged&eacute;lyek sz&uuml;rk&eacute;n jelennek meg, az objektum saj&aacute;t (vagy &bdquo;explicit&rdquo;) enged&eacute;lyei pedig feket&eacute;n. </p>
</div>
<div class="section disable-eds14">
  <h4>Megjegyz&eacute;s:</h4>
  <ul>
    <li>F&aacute;jlonk&eacute;nt, illetve mapp&aacute;nk&eacute;nt legfeljebb 200 ACL explicit enged&eacute;ly vehető fel.</li>
    <li>A Windows ACL csak ext4<span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64">/Btrfs</span> f&aacute;jlrendszereken t&aacute;mogatott. Kor&aacute;bbi DSM 2.3 felhaszn&aacute;l&oacute;k eset&eacute;ben a Windows ACL enged&eacute;lyek haszn&aacute;lat&aacute;hoz legal&aacute;bb egy ext4<span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64">/Btrfs</span> k&ouml;tetet kell l&eacute;trehozni. Ez azt jelenti, hogy meg kell form&aacute;zni legal&aacute;bb egy merevlemezt, &eacute;s &uacute;jra l&eacute;tre kell hoznia egy k&ouml;tetet. A(z) DiskStation form&aacute;z&aacute;sa az &ouml;sszes t&aacute;rolt adat &eacute;s be&aacute;ll&iacute;t&aacute;s t&ouml;rl&eacute;s&eacute;vel j&aacute;r. K&eacute;rj&uuml;k, győződj&ouml;n meg r&oacute;la, hogy az &ouml;sszes adata biztons&aacute;gban van, mielőtt folytatn&aacute;!</li>
    <li>Ha &uacute;j enged&eacute;lyeket szeretne meghat&aacute;rozni a domain felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra, győződj&ouml;n meg r&oacute;la, hogy a DSM &eacute;s a Windows kliensek ugyanabban a domainben vannak.</li>
    <li>Ha Windows F&aacute;jlkezelő seg&iacute;ts&eacute;g&eacute;vel m&oacute;dos&iacute;tja az enged&eacute;lyeket, a <strong>Tartom&aacute;nyadminok</strong> csoportra alkalmazott <strong>Tilt</strong> szab&aacute;lyok nem ker&uuml;lnek figyelembev&eacute;telre.</li>
  </ul>
</div>


</body>
</html>
