<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Megosztott mappa</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Megosztott mappa</h1>
<p>A megosztott mapp&aacute;k azok az alapk&ouml;nyvt&aacute;rak, ahol f&aacute;jlokat &eacute;s mapp&aacute;kat t&aacute;rolhat a(z) DiskStation eszk&ouml;z&ouml;n. Mielőtt b&aacute;rmilyen f&aacute;jlt t&aacute;rolhatna a(z) DiskStation eszk&ouml;z&ouml;n, l&eacute;tre kell hoznia legal&aacute;bb egy megosztott mapp&aacute;t. A megosztott mapp&aacute;kban t&aacute;rolt adatok t&aacute;rolhat&oacute;k priv&aacute;t adatokk&eacute;nt, illetve a testreszabhat&oacute; hozz&aacute;f&eacute;r&eacute;si enged&eacute;lyek szerint meghat&aacute;rozott felhaszn&aacute;l&oacute;kkal vagy felhaszn&aacute;l&oacute;i csoportokkal megosztva. A megosztott mapp&aacute;k r&aacute;ad&aacute;sul l&eacute;trehoz&aacute;s k&ouml;zben titkos&iacute;that&oacute;k, ami tov&aacute;bbi v&eacute;delmi szint hozz&aacute;ad&aacute;s&aacute;t jelenti.</p>

<h3>Alap&eacute;rtelmezett megosztott mapp&aacute;k</h3>

<p>Az al&aacute;bbiakban l&aacute;that&oacute; a bizonyos alkalmaz&aacute;sok, szolg&aacute;ltat&aacute;sok illetve csomagok telep&iacute;t&eacute;sekor vagy enged&eacute;lyez&eacute;sekor automatikusan l&eacute;trehozott megosztott mapp&aacute;k list&aacute;ja.</p> 

<table>
<tr>
<th>N&eacute;v</th>
<th>Le&iacute;r&aacute;s</th>
</tr>
<tr>
<th>public</th>
<td>A <strong>public</strong> mappa a(z) DiskStation első be&aacute;ll&iacute;t&aacute;sa ut&aacute;n automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l.*</td>
</tr>
<tr>
<th>web</th>
<td>A <strong>web</strong> mappa a(z) DiskStation eszk&ouml;z&ouml;n hosztolt weboldal tartalm&aacute;nak alap&eacute;rtelmezett t&aacute;rol&oacute;helye. A <strong>Web Station</strong> enged&eacute;yez&eacute;sekor automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l.</td>
</tr>
<tr>
<th>photo</th>
<td>A <strong>photo</strong> mappa olyan f&eacute;nyk&eacute;pek &eacute;s vide&oacute;k t&aacute;rol&aacute;s&aacute;ra haszn&aacute;latos, amelyeket &ouml;n meg k&iacute;v&aacute;n osztani a Photo&nbsp;Station seg&iacute;ts&eacute;g&eacute;vel. Automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l, amikor a <strong>Photo Station</strong> vagy a <strong>DLNA/UPnP m&eacute;diaszerver</strong> enged&eacute;lyez&eacute;sre ker&uuml;l.</td>
</tr>
<tr>
<th>music</th>
<td>A <strong>music</strong> mappa az Audio Station seg&iacute;ts&eacute;g&eacute;vel meghallgatni k&iacute;v&aacute;nt zene t&aacute;rol&aacute;s&aacute;ra haszn&aacute;latos. Az <strong>Audio Station</strong> enged&eacute;yez&eacute;sekor automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l.</td>
</tr>
<tr>
<th>video</th>
<td>A <strong>video</strong> mappa olyan videof&aacute;jlok t&aacute;rol&aacute;s&aacute;ra haszn&aacute;latos, amelyek k&ouml;zt DLNA/UPnP eszk&ouml;z&ouml;k seg&iacute;ts&eacute;g&eacute;vel szeretne b&ouml;ng&eacute;szni. A <strong>M&eacute;diaszerver</strong> enged&eacute;yez&eacute;sekor automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l.</td>
</tr>
<tr>
<th>surveillance</th>
<td>A <strong>surveillance</strong> mappa a Surveillance&nbsp;Station felv&eacute;teleinek t&aacute;rol&aacute;s&aacute;ra haszn&aacute;latos. A <strong>Surveillance Station</strong> enged&eacute;yez&eacute;sekor automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l. Ez csak olvashat&oacute;, &eacute;s csak a rendszergazda f&eacute;rhet hozz&aacute;.</td>
</tr>
<tr>
<th>home</th>
<td>A <strong>home</strong> mappa minden felhaszn&aacute;l&oacute; sz&aacute;m&aacute;ra olyan priv&aacute;t t&aacute;rhelyet biztos&iacute;t az adatt&aacute;rol&aacute;shoz, amihez csak az illető felhaszn&aacute;l&oacute; f&eacute;rhet hozz&aacute;. A <strong>Felhaszn&aacute;l&oacute;i kezdőlap</strong> funkci&oacute; enged&eacute;lyez&eacute;sekor automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l.</td>
</tr>
<tr>
<th>homes</th>
<td>A <strong>homes</strong> mappa az &ouml;sszes felhaszn&aacute;l&oacute; home mapp&aacute;j&aacute;t tartalmazza. A <strong>Felhaszn&aacute;l&oacute;i kezdőlap</strong> funkci&oacute; enged&eacute;lyez&eacute;sekor automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l. Csak a rendszergazda f&eacute;rhet hozz&aacute; &eacute;s kezelheti az &ouml;sszes felhaszn&aacute;l&oacute; home mapp&aacute;j&aacute;t.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>A <strong>NetBackup</strong> mappa automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l, amikor a <strong>H&aacute;l&oacute;zaton kereszt&uuml;li biztons&aacute;gi ment&eacute;s</strong> szolg&aacute;ltat&aacute;st enged&eacute;lyezi.</td>
</tr>
<tr>
<th>usbshare</th>
<td>A <strong>usbshare[sz&aacute;m]</strong> mappa automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l, amikor egy k&uuml;lső USB-meghajt&oacute; eszk&ouml;zt csatlakoztat a(z) DiskStation USB-portj&aacute;hoz.*</td>
</tr>
<tr>
<th>satashare</th>
<td>A <strong>satashare</strong> mappa automatikusan l&eacute;trehoz&aacute;sra ker&uuml;l, amikor egy k&uuml;lső eSATA-meghajt&oacute; eszk&ouml;zt csatlakoztat a(z) DiskStation eSATA-portj&aacute;hoz.*</td>
</tr>
</table>

<p>____<br> * Csak egyes modelleken el&eacute;rhető.</p>

</body>
</html>
