<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Megosztott mappa</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Speci&aacute;lis megosztott mappa enged&eacute;lyek kezel&eacute;se</h2>

<p>A <strong>Vez&eacute;rlőpult</strong> &gt; <strong>Megosztott mappa</strong> &gt; <strong>Szerkeszt&eacute;s</strong> &gt; <strong>Speci&aacute;lis</strong> oldal az al&aacute;bbi lehetős&eacute;geket tartalmazza egy megosztott mappa hozz&aacute;f&eacute;r&eacute;si enged&eacute;lyeinek tov&aacute;bbi finomhangol&aacute;s&aacute;hoz.</p>

<h3>Speci&aacute;lis megoszt&aacute;si enged&eacute;lyek</h3>
<p>A speci&aacute;lis megoszt&aacute;si enged&eacute;lyek tov&aacute;bbi ellenőrz&eacute;si szintet biztos&iacute;tanak a megosztott mapp&aacute;k hozz&aacute;f&eacute;r&eacute;si enged&eacute;lyeinek kezel&eacute;s&eacute;hez. Ha enged&eacute;lyezve van, a felhaszn&aacute;l&oacute;k &eacute;s csoportok csak akkor tekinthetik meg vagy m&oacute;dos&iacute;thatj&aacute;k egy megosztott mappa tartalm&aacute;t, ha a felhaszn&aacute;l&oacute; vagy csoport rendelkezik mind speci&aacute;lis megoszt&aacute;si enged&eacute;lyekkel, <em>mind pedig</em> Windows ACL enged&eacute;lyekkel (l&aacute;sd: <strong>Megosztott mappa</strong> &gt; <strong>Szerkeszt&eacute;s</strong> &gt; <strong>Enged&eacute;lyek</strong>).</p>

<h4>Speci&aacute;lis megoszt&aacute;si enged&eacute;lyek enged&eacute;lyez&eacute;se:</h4>

<ol>
<li>Jel&ouml;lje be a <strong>Speci&aacute;lis megoszt&aacute;si enged&eacute;lyek enged&eacute;lyez&eacute;se</strong> n&eacute;gyzetet.</li>
<li>A megosztott mappa speci&aacute;lis megoszt&aacute;si enged&eacute;lyeinek m&oacute;dos&iacute;t&aacute;s&aacute;hoz kattintson a <strong>Speci&aacute;lis megoszt&aacute;si enged&eacute;lyek</strong> lehetős&eacute;gre. </li>
</ol>

<div class="section">
  <h4>Megjegyz&eacute;s:</h4>
<ul>
<li>A speci&aacute;lis megoszt&aacute;si enged&eacute;lyek akkor ker&uuml;lnek alkalmaz&aacute;sra, amikor egy felhaszn&aacute;l&oacute; a k&ouml;vetkező f&aacute;jlszolg&aacute;ltat&aacute;sok seg&iacute;ts&eacute;g&eacute;vel f&eacute;r hozz&aacute; egy megosztott mapp&aacute;hoz: Windows File Sharing, Apple File Sharing, File Station, FTP, &eacute;s WebDAV.</li>
</ul>
</div>

<h3>Speci&aacute;lis be&aacute;ll&iacute;t&aacute;sok</h3>

<p>Sz&uuml;ks&eacute;g eset&eacute;n &ouml;n tov&aacute;bbi korl&aacute;toz&aacute;sokat l&eacute;ptethet &eacute;letbe a felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra, amikor azok File Station, FTP, vagy WebDAV seg&iacute;ts&eacute;g&eacute;vel f&eacute;rnek hozz&aacute; egy megosztott mapp&aacute;hoz.</p>
	<ul>
    <li><strong>K&ouml;nyvt&aacute;rb&ouml;ng&eacute;sz&eacute;s tilt&aacute;sa:</strong> Ennek a lehetős&eacute;gnek az enged&eacute;lyez&eacute;se korl&aacute;tozza a felhaszn&aacute;l&oacute;kat a megosztott mappa tartalm&aacute;nak megtekint&eacute;s&eacute;ben.</li>
    <li><strong>L&eacute;tező f&aacute;jlok m&oacute;dos&iacute;t&aacute;s&aacute;nak tilt&aacute;sa:</strong> Ennek a lehetős&eacute;gnek az enged&eacute;lyez&eacute;se korl&aacute;tozza a felhaszn&aacute;l&oacute;kat a megosztott mapp&aacute;ban tal&aacute;lhat&oacute; f&aacute;jlok &aacute;thelyez&eacute;s&eacute;ben, t&ouml;rl&eacute;s&eacute;ben vagy m&oacute;dos&iacute;t&aacute;s&aacute;ban. Ne feledje, hogy a felhaszn&aacute;l&oacute;k tov&aacute;bbra is k&eacute;pesek a megosztott mappa tartalm&aacute;nak megtekint&eacute;s&eacute;re, let&ouml;lt&eacute;s&eacute;re/felt&ouml;lt&eacute;s&eacute;re, m&aacute;sol&aacute;s&aacute;ra, illetve kicsomagol&aacute;s&aacute;ra.</li>
    <li><strong>F&aacute;jllet&ouml;lt&eacute;s tilt&aacute;sa:</strong> Ennek a lehetős&eacute;gnek az enged&eacute;lyez&eacute;se korl&aacute;tozza a felhaszn&aacute;l&oacute;kat a megosztott mappa tartalm&aacute;nak let&ouml;lt&eacute;s&eacute;ben.</li>
    </ul>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>A fenti korl&aacute;toz&aacute;sok nem vonatkoznak az <strong>administrators</strong> csoporthoz tartoz&oacute; felhaszn&aacute;l&oacute;kra.</p>
</div>
</body>
</html>
