<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Felhaszn&aacute;l&oacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Felhaszn&aacute;l&oacute;i kezdőlap</h2>
<p>Ha minden egyes felhaszn&aacute;l&oacute; sz&aacute;m&aacute;ra szem&eacute;lyes <b>home</b> mapp&aacute;t szeretne l&eacute;trehozni, enged&eacute;lyezze a felhaszn&aacute;l&oacute;i kezdőlapot, kiv&eacute;ve a <b>guest</b> fi&oacute;kot. Minden felhaszn&aacute;l&oacute; hozz&aacute;f&eacute;rhet saj&aacute;t home mapp&aacute;j&aacute;hoz CIFS, AFP, FTP, vagy File Station seg&iacute;ts&eacute;g&eacute;vel.</p>
<p>Az admin az alap&eacute;rtelmezett <b>homes</b> megosztott mapp&aacute;ban tal&aacute;lhat&oacute; &ouml;sszes szem&eacute;lyes mapp&aacute;hoz hozz&aacute;f&eacute;rhet. A kezdőlap mappa neve megegyezik a felhaszn&aacute;l&oacute;i fi&oacute;k nev&eacute;vel.</p>
<h4>A felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;s enged&eacute;lyez&eacute;se:</h4>
<ol>
<li>Kattintson a <b>Felhaszn&aacute;l&oacute;i kezdőlap</b> gombra.</li>
<li>Jel&ouml;lje be a k&ouml;vetkezőt: <b>Felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;s enged&eacute;lyez&eacute;se</b>.</li>
<li>Ha egyn&eacute;l t&ouml;bb k&ouml;tet van a Synology DiskStation-&ouml;n, v&aacute;lassza ki, hol szeretn&eacute; t&aacute;rolni a <b>homes</b> mapp&aacute;t.</li>
<li>Kattintson az <b>OK</b> gombra.</li>
</ol>
<p><span class="note_head">Megjegyz&eacute;s:</span> Ha a helyi felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;s le van tiltva, a domain felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;s is p&aacute;rhuzamosan letilt&aacute;sra ker&uuml;l.</p>
<h4>A felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;s tilt&aacute;sa:</h4>
<ol>
<li>Kattintson a <b>Felhaszn&aacute;l&oacute;i kezdőlap</b> gombra.</li>
<li>T&ouml;r&ouml;lje a k&ouml;vetkező kijel&ouml;l&eacute;s&eacute;t: <b>Felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;s enged&eacute;lyez&eacute;se</b>.</li>
</ol>
<p>A user home szolg&aacute;ltat&aacute;s letilt&aacute;sa ut&aacute;n a <b>homes</b> megosztott mapp&aacute;hoz csak az admin f&eacute;rhet hozz&aacute;.  A felhaszn&aacute;l&oacute;k &uacute;jra hozz&aacute;f&eacute;rhetnek kezdőlap mapp&aacute;ikhoz, amikor ism&eacute;t enged&eacute;lyezi a felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;st.</p>
<ol>
<span class="note_head">Megjegyz&eacute;s:</span>
<li>A <b>homes</b> megosztott mappa t&ouml;rl&eacute;s&eacute;hez elősz&ouml;r le kell tiltani a felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;st.</li>
<li>A domain felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;s letilt&aacute;sra ker&uuml;l, ha a helyi felhaszn&aacute;l&oacute;i kezdőlap szolg&aacute;ltat&aacute;st letiltj&aacute;k.</li> 
</ol> 
</body>	
</html> 
