<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Felhaszn&aacute;l&oacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Jelsz&oacute;be&aacute;ll&iacute;t&aacute;sok</h2>
<p>Az al&aacute;bb le&iacute;rt be&aacute;ll&iacute;t&aacute;sok megtekint&eacute;s&eacute;hez &eacute;s m&oacute;dos&iacute;t&aacute;s&aacute;hoz kattintson a <strong>Jelsz&oacute;be&aacute;ll&iacute;t&aacute;sok</strong> gombra.</p>

<h3>Elfelejtett jelszavak vissza&aacute;ll&iacute;t&aacute;sa</h3>
<p>Ez a r&eacute;sz egy <strong>Elfelejtett jelsz&oacute; e-mailes vissza&aacute;ll&iacute;t&aacute;s&aacute;nak enged&eacute;lyez&eacute;se nem-admin felhaszn&aacute;l&oacute;knak</strong> megjel&ouml;l&eacute;sű lehetős&eacute;get tartalmaz. Ha ez a lehetős&eacute;g enged&eacute;lyezve van, a DSM bejelentkező oldal&aacute;n megjelenik egy <strong>Elfelejtette a jelszav&aacute;t?</strong> megjel&ouml;l&eacute;sű hivatkoz&aacute;s. Ha egy felhaszn&aacute;l&oacute; elfelejti a jelszav&aacute;t, akkor r&aacute;kattinthat erre a hivatkoz&aacute;sra &eacute;s megadhatja felhaszn&aacute;l&oacute;nev&eacute;t. Ebben az esetben a rendszer &uuml;zenetet k&uuml;ld a felhaszn&aacute;l&oacute;nak, ami tartalmaz egy hivatkoz&aacute;st az elfeledett jelszav&aacute;nak vissza&aacute;ll&iacute;t&aacute;s&aacute;hoz. </p>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Ennek a lehetős&eacute;gnek az enged&eacute;lyez&eacute;se előtt győződj&ouml;n meg r&oacute;la, hogy m&aacute;r enged&eacute;lyezte az SMTP email &eacute;rtes&iacute;t&eacute;seket. Ennek megt&eacute;tel&eacute;hez menjen a <strong>Vez&eacute;rlőpult</strong> &gt; <strong>&Eacute;rtes&iacute;t&eacute;s</strong> &gt; <strong>&Aacute;ltal&aacute;nos</strong> men&uuml;pontra. Ha az &eacute;rtes&iacute;t&eacute;sek nincsenek enged&eacute;lyezve, a rendszer k&eacute;ptelen lesz &uuml;zeneteket k&uuml;ldeni a jelszavukat vissza&aacute;ll&iacute;tani k&iacute;v&aacute;n&oacute; felhaszn&aacute;l&oacute;knak.</li>
<li>A felhaszn&aacute;l&oacute;knak, ha &uuml;zeneteket szeretn&eacute;nek kapni a rendszertől, a fi&oacute;kjuk felhaszn&aacute;l&oacute;i inform&aacute;ci&oacute;k r&eacute;sz&eacute;ben meg kell adniuk egy email c&iacute;met.</li>
<li>Az <strong>administrators</strong> csoporthoz tartoz&oacute; felhaszn&aacute;l&oacute;k ezzel az opci&oacute;val nem &aacute;ll&iacute;thatnak vissza jelszavakat.</li>
<li>Tartom&aacute;nyfelhaszn&aacute;l&oacute;k nem &aacute;ll&iacute;thatnak vissza jelszavakat ezzel az opci&oacute;val.</li>
<li>LDAP felhaszn&aacute;l&oacute;k vissza&aacute;ll&iacute;thatnak jelszavakat ezzel az opci&oacute;val, felt&eacute;ve, hogy a(z) DiskStation szolg&aacute;l az LDAP directoty server k&ouml;nyvt&aacute;rkiszolg&aacute;l&oacute;k&eacute;nt.</li>

</ul>
</div>


<h3>Jelsz&oacute; erőss&eacute;g</h3>
<p>Jelsz&oacute;erőss&eacute;gi szab&aacute;lyokat &aacute;ll&iacute;that fel a felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra a(z) DiskStation eszk&ouml;z&ouml;n.</p>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>A jelsz&oacute;erőss&eacute;gi szab&aacute;lyok csak az &uacute;j jelszavakra vonatkoznak. Az &uacute;j jelsz&oacute;erőss&eacute;gi szab&aacute;lyok p&eacute;ld&aacute;ul csak egy &uacute;j felhaszn&aacute;l&oacute;i fi&oacute;k l&eacute;trehoz&aacute;sakor ker&uuml;lnek alkalmaz&aacute;sra, vagy ha egy l&eacute;tező felhaszn&aacute;l&oacute; megv&aacute;ltoztatja a jelszav&aacute;t. A l&eacute;tező jelszavakra, illetve az import&aacute;lt felhaszn&aacute;l&oacute;i fi&oacute;kokhoz tartoz&oacute; jelszavakra nem vonatkoznak az &uacute;j jelsz&oacute;szab&aacute;lyok.</p>
</div>
<h4>Jelsz&oacute;erőss&eacute;gi szab&aacute;lyok enged&eacute;lyez&eacute;se:</h4>
<ol>
<li>A jelszavakra vonatkoz&oacute; korl&aacute;toz&aacute;sok &eacute;letbe l&eacute;ptet&eacute;s&eacute;hez jel&ouml;lje be a <b>Jelsz&oacute;erőss&eacute;gi szab&aacute;lyok alkalmaz&aacute;sa</b> jel&ouml;lőn&eacute;gyzetet.</li>
<li>V&aacute;lasszon ki az al&aacute;bbi szab&aacute;lyok k&ouml;z&uuml;l egyn&eacute;l t&ouml;bb jelsz&oacute;korl&aacute;toz&aacute;st:</li>
<ul>
<li><b>A jelsz&oacute; ne tartalmazza a felhaszn&aacute;l&oacute; nev&eacute;t &eacute;s le&iacute;r&aacute;s&aacute;t</b>: A jelsz&oacute; nem tartalmazhatja a felhaszn&aacute;l&oacute;nevet &eacute;s a felhaszn&aacute;l&oacute;hoz tartoz&oacute; le&iacute;r&aacute;st. Az UTF-8 k&oacute;dol&aacute;s&uacute; karaktereket a k&eacute;sz&uuml;l&eacute;k kihagyja.</li>
<li><b>Kis- &eacute;s nagybetűk haszn&aacute;lat&aacute;t enged&eacute;lyezze</b>: A jelszavakban lehetős&eacute;g van kis- &eacute;s nagybetűk haszn&aacute;lat&aacute;ra is.</li>
<li><b>Sz&aacute;mkaraktert tartalmazzon</b>: A jelsz&oacute;nak tartalmaznia kell legal&aacute;bb egy sz&aacute;mjegyet (0~9).</li>
<li><b>Speci&aacute;lis karaktert tartalmazzon</b>: A jelsz&oacute;ban szerepelnie kell legal&aacute;bb egy k&uuml;l&ouml;nleges ASCII karakternek (pl. ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Jelsz&oacute; minim&aacute;lis hossza</b>: A jelsz&oacute;nak legal&aacute;bb a sz&ouml;vegmezőben megadott &eacute;rt&eacute;kűnek kell lennie. A hossz 6 &eacute;s 127 k&ouml;z&ouml;tti lehet.</li>
</ul>
<li>Kattintson az <b>Alkalmaz</b> gombra a be&aacute;ll&iacute;t&aacute;sok ment&eacute;s&eacute;hez.</li>
</ol>
 
</body>
</html>

