<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Conta de e-mail - Ajuda Synology DSM</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Conta de e-mail</h2>
<p>Pode adicionar as suas contas de e-mail em <b>Pessoais</b> &gt; <b>Conta de e-mail</b> e enviar os ficheiros guardados numa File Station como anexos a partir dos endere&ccedil;os de e-mail aqui adicionados.</p>
<p>Os fornecedores de servi&ccedil;o de e-mail suportados incluem Gmail, Outlook, Yahoo!, AOL e o servidor SMTP personalizado.</p>

<h4>Para adicionar uma conta de e-mail:</h4>
<ol>
<li>Clique <b>Adicionar</b> e escolha o fornecedor de servi&ccedil;o para a conta de e-mail que pretende configurar.</li>
<li>Introduza o seu endere&ccedil;o de email, palavra-passe e nome do remetente.</li>
<li>Marque <b>Utilizar esta conta de e-mail como predefinida</b> se preferir deixar a File Station utilizar esta conta de e-mail como predefini&ccedil;&atilde;o quando tem v&aacute;rias contas configuradas.</li>
<li>Clique <b>Sincronizar contactos</b> para sincronizar os seus contactos de e-mail para DiskStation se o seu fornecedor do servi&ccedil;o de e-mail (Gmail, Outlook e Yahoo!) suportar esta funcionalidade. Tenha em aten&ccedil;&atilde;o que os contactos sincronizados ser&atilde;o provenientes da conta de e-mail que facultar na janela de autentica&ccedil;&atilde;o que surge e n&atilde;o da conta que inseriu no passo anterior. Desse modo, se encontrar uma conta diferente ou que n&atilde;o pretende exibida na janela de autentica&ccedil;&atilde;o, altere manualmente para a conta de e-mail pretendida ou para aquela que inseriu anteriormente.</li>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>
	
<h4>Para editar uma conta de e-mail:</h4>
<p>Escolha a conta de e-mail pretendida da lista e clique em <b>Editar</b>.</p>

<h4>Para eliminar uma conta de e-mail:</h4>
<p>Escolha a conta de e-mail pretendida da lista e clique em <b>Eliminar</b>.</p>
<div class="section">
<h4>Nota:</h4>	
<ul>
<li>A conta predefinida n&atilde;o pode ser eliminada, exceto se n&atilde;o houver outras contas. Se pretender eliminar uma conta de e-mail que esteja atualmente como predefinida, altere a sua conta predefinida para outra antes de prosseguir.</li>
</ul>
</div>

<h4>Para alterar a conta predefinida:</h4>
<p>Escolha a conta de e-mail que pretende colocar como predefinida a partir da lista e clique <b>Definir como predefini&ccedil;&atilde;o</b>.</p>


<h4>Para enviar ficheiros como anexos:</h4>
<ol>
<li>Clique com o bot&atilde;o direito em qualquer ficheiro na File Station e escolha <b>Enviar como anexos de e-mail</b>.</li>
<li>Se tiver adicionado mais de uma conta de e-mail, pode escolher o seu endere&ccedil;o de e-mail de remetente pretendido na lista pendente para enviar os ficheiros para um destinat&aacute;rio especificado.</li>
</ol>
</body>
</html>
