<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Come&ccedil;ar a utilizar com o DSM</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Navegar Ambiente de Trabalho</h1>

<p>O DiskStation Manager (DSM) &eacute; um sistema operativo com base na Internet, especificamente concebido para os produtos Synology. Com o DSM, pode realizar, com rapidez e facilidade, as seguintes tarefas no seu DiskStation:</p>

<ul>
<li>Modificar e personalizar as defini&ccedil;&otilde;es do sistema</li>
<li>Instalar e abrir aplica&ccedil;&otilde;es e pacotes</li>
<li class="disable-eds14">Criar volumes RAID e gerir outros tipos de espa&ccedil;os de armazenamento</li>
<li>...E muito mais!</li>
</ul>

<div class="section">
<h4>Saber mais acerca do DSM</h4>
<p>Para ficar a conhecer todas as funcionalidades dispon&iacute;veis no DSM, visite <a href="http://www.synology.com/" target="_blank">www.synology.com</a>.</p>
</div>

<h2>Iniciar sess&atilde;o no DSM</h2>

<p>Depois da configura&ccedil;&atilde;o e instala&ccedil;&atilde;o do DSM no seu DiskStation, pode iniciar sess&atilde;o recorrendo a um navegador no seu computador.</p> 


<div class="section">
<h4>Instala&ccedil;&atilde;o do DSM</h4>
<p>Para obter as instru&ccedil;&otilde;es passo-a-passo para instalar o DSM no seu DiskStation, consulte o guia de instala&ccedil;&atilde;o r&aacute;pida para o seu produto Synology, dispon&iacute;vel em <a href="http://www.synology.com/support/download" target="_blank">www.synology.com</a>.</p>
</div>

<h4>Para iniciar sess&atilde;o no DSM:</h4>
<ol>
<li>Certifique-se de que o seu computador e o DiskStation est&atilde;o ligados &agrave; mesma rede local.</li>
<li>Abra um navegador no seu computador e introduza uma das seguintes op&ccedil;&otilde;es na barra de endere&ccedil;os:</li>
<ul>
<li><a href="http://find.synology.com/" target="_blank">find.synology.com</a> (apenas se o seu computador e o DiskStation estiverem ligados &agrave; Internet)</li>
<li>O nome do servidor do seu DiskStation, seguido por <strong>:5000</strong>, por exemplo, <strong>diskstation:5000</strong> ou <strong>rackstation:5000</strong> (o nome espec&iacute;fico depende das defini&ccedil;&otilde;es que adotou durante a configura&ccedil;&atilde;o inicial)</li>
<li>O endere&ccedil;o IP do seu DiskStation, seguido por <strong>:5000</strong>, por exemplo, <strong>192.168.48.14:5000</strong> (o endere&ccedil;o IP depende das defini&ccedil;&otilde;es que adotou durante a configura&ccedil;&atilde;o inicial)</li>
</ul>
<img src="about:blank" class="help_image"/>

<li>Introduza o seu nome de utilizador e a palavra-passe e clique em <strong>Iniciar sess&atilde;o</strong>.</li>
<img src="about:blank" class="help_image"/>

</ol>
<div class="section">
<h4>Nota:</h4>
<p>O nome, endere&ccedil;o IP e a palavra-passe de admin para o seu DiskStation devem ter sido configurados durante a instala&ccedil;&atilde;o inicial.  Se tiver dificuldades para encontrar esta informa&ccedil;&atilde;o, experimente instalar o Synology Assistant ou aceda a <a href="http://find.synology.com/" target="_blank">find.synology.com</a>.</p>
</div>


<h2>Ambiente de trabalho do DSM</h2>

<p>Depois de iniciar sess&atilde;o, ser&aacute; vis&iacute;vel o ambiente de trabalho do DSM. A partir daqui, pode come&ccedil;ar a obter resultados, como gerir as defini&ccedil;&otilde;es, utilizar pacotes ou visualizar notifica&ccedil;&otilde;es.</p>

<img src="about:blank" class="help_image"/>

<h3>Barra de Tarefas</h3>

<p>A barra de tarefas situa-se na parte superior do ecr&atilde; e inclui os seguintes itens:</p>

<img src="about:blank" class="help_image"/>

<ol>
<li><strong>Mostrar o Ambiente de Trabalho:</strong> Minimiza todas as aplica&ccedil;&otilde;es abertas e as janelas de pacotes.</li>
<li><strong>Menu Principal:</strong> Visualiza e abre aplica&ccedil;&otilde;es e pacotes instalados no seu DiskStation. Tamb&eacute;m pode clicar e arrastar para criar atalhos no ambiente de trabalho.</li>
<li><strong>Aplica&ccedil;&otilde;es abertas:</strong> Apresenta as aplica&ccedil;&otilde;es e pacotes actualmente abertos. Pode clicar com o bot&atilde;o direito do rato e afixar pacotes na barra de tarefas para um acesso mais r&aacute;pido no futuro.</li>
<li><strong>Fila de carregamento:</strong> &Eacute; exibida quando inicia o carregamento de ficheiros para o DiskStation. Clique aqui para consultar mais detalhes, como o progresso e a velocidade de carregamento.</li>
<li><strong>Dispositivos Externos</strong>: Aparece quando um dispositivo externo (por ex., unidade USB) &eacute; ligado ao seu DiskStation.</li>
<li><strong>Notifica&ccedil;&otilde;es:</strong> Exibe as notifica&ccedil;&otilde;es, sejam notifica&ccedil;&otilde;es de erros, actualiza&ccedil;&otilde;es de estado e instala&ccedil;&atilde;o de pacotes.</li>
<li class="disable-eds14"><strong>Op&ccedil;&otilde;es:</strong> Op&ccedil;&otilde;es para encerrar, reiniciar, terminar sess&atilde;o ou modificar a conta pessoal.</li>
<li class="enable-eds14"><strong>Op&ccedil;&otilde;es:</strong> Op&ccedil;&otilde;es para parar, reiniciar, terminar sess&atilde;o ou modificar a conta pessoal.</li>
<li><strong>Procurar:</strong> Aqui, encontra rapidamente aplica&ccedil;&otilde;es espec&iacute;ficas, pacotes ou artigos de ajuda do DSM.</li>
<li><strong>Widgets:</strong> Mostra ou oculta widgets.</li>
<li><strong>Vista Piloto:</strong> Para consultar uma pr&eacute;-visualiza&ccedil;&atilde;o de todas as aplica&ccedil;&otilde;es e janelas de pacotes abertas.</li>
</ol>

<h3>Menu Principal</h3>

<p>Aqui, encontra uma lista das aplica&ccedil;&otilde;es e pacotes instalados no seu DiskStation. </p>

<h4>Para criar atalhos no ambiente de trabalho:</h4>

<ol>
<li>Abra <strong>Menu Principal</strong>.</li>
<li>Clique e arraste uma aplica&ccedil;&atilde;o ou pacote para o lado.</li>
<img src="about:blank" class="help_image"/>

</ol>



</body>
</html>
