<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Op&ccedil;&otilde;es</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Photo Station</h2>
<p>A Photo Station Pessoal &eacute; um &aacute;lbum fotogr&aacute;fico online com blogue, cuja propriedade e gest&atilde;o pertencem a um utilizador do DSM. O DiskStation disponibiliza a pasta partilhada <b>home/photo</b> para guardar as suas fotos e v&iacute;deos que pretende partilhar. O sistema vai criar automaticamente um &iacute;ndice de miniaturas das fotos e v&iacute;deos e, a partir da&iacute;, podem visualizar-se os &aacute;lbuns de fotos atrav&eacute;s de um navegador de Internet.</p>
<h4>Para ativar a Photo Station Pessoal:</h4>
<p>Clique em <b>Ativar a Photo Station Pessoal - [nome de utilizador]</b> e clique em <b>OK</b>.</p>
<h4>Para editar as defini&ccedil;&otilde;es da Photo&nbsp;Station Pessoal:</h4>
<ol>

<li>Marque <b>Definir novas pastas como &aacute;lbuns p&uacute;blicos</b> se pretende que os &aacute;lbuns carregados estejam dispon&iacute;veis aos visitantes.</li>
<li>Clique em <b>Reindexar</b> para reconstruir a estrutura de &iacute;ndices dos ficheiros de imagem se detetar a falta de imagens na Photo&nbsp;Station.</li>

<li>Clique em <b>OK</b>.</li>
</ol>

<h4>Para iniciar a Photo Station, proceda de uma das formas seguintes:</h4>
<ul>
  <li> Aceda a <b>Menu Principal</b> e clique em <b>Photo Station</b>. </li>
  <li>Introduza o seguinte endere&ccedil;o web na barra de endere&ccedil;os do seu navegador: <strong>http://Synology_Server_IP_Address/photo/</strong></li>
</ul>
<h4>Para iniciar a Photo Station Pessoal, proceda de uma das formas seguintes:</h4>
<ul>
<li>Clique em <b>Iniciar Photo Station</b>.</li>
<li>Aceda ao <b>Menu Principal</b> e clique em <b>Photo Station &ndash; [nome de utilizador]</b>.</li>
<li>Introduza o seguinte endere&ccedil;o web na barra de endere&ccedil;os do seu navegador: <strong>http://Synology_Server_IP_Address/~username/photo/</strong></li>
</ul>

<div class="section">
<h4>Suporte e limita&ccedil;&otilde;es:</h4>

<ul>
<li>Formatos de imagem suportados: BMP, JPEG, GIF, RAW (arw, srf, sr2, dcr, k25, kdc, cr2, crw, nef, mrw, ptx, pef, raf, raw, 3fr, erf, mef, mos, orf, rw2, dng, x3f), TIFF, PNG</li>
<li>Suporta formatos de v&iacute;deo: 3G2, 3GP, ASF, AVI, DAT, DivX, FLV, M4V, MOV, MP4, MPEG, MPG, MTS, M2TS, M2T QT, WMV, XviD, RM<sup>(1)</sup>, RMVB<sup>(1)</sup>, VOB<sup>(1)</sup></li>
<li>Se carregar conte&uacute;dos com a Photo Station Pessoal, apenas pode carregar at&eacute; 2GB de conte&uacute;dos, de cada vez.</li>
<p><span class="note_head">Nota (1):</span> Os utilizadores podem transferir ficheiros dos formatos especificados mas n&atilde;o podem reproduzi-los na Photo Station como v&iacute;deo Flash comprimido.</p>
</ul>

<h4>Como utilizar a Photo Station Pessoal?</h4>
<p>Pode carregar ficheiros de v&iacute;deo ou de imagem para a pasta <b>home/photo</b> e criar um blogue. Para isso:</p>
<ol>
<li>Organize as fotos e v&iacute;deos que pretende partilhar nas pastas. Estas pastas v&atilde;o tornar-se &aacute;lbuns na Photo Station Pessoal.</li>
<li>Carregue as pastas de &aacute;lbuns para a pasta <b>home/photo</b>.</li>
<li>Insira no seu navegador <b>http://servername/~username/photo/</b> para visualizar os seus &aacute;lbuns.</li>
<li>Para criar o seu blogue, clique em <b>Blogue</b> no canto superior direito e registe-se para come&ccedil;ar a publicar.</li>
</ol>
<h4></b>Como publicar os meus &aacute;lbuns e o blogue na Photo Station Pessoal?</h4>
<p>Para publicar na Photo Station Pessoal e disponibilizar na Internet, &eacute; necess&aacute;rio que defina o seu DiskStation para utilizar um IP externo.</p>
<ol>
<li>Inicie sess&atilde;o no DiskStation como <b>admin</b> o utilizador pertencente ao grupo <b>administrators</b>.</li>
<li>Para ligar o DiskStation &agrave; Internet, pode aplicar:</li>
<ul>
<li>Um IP externo. Aceda a <b>Menu Principal</b> &gt; <b>Painel de Controlo</b> &gt; <b>Rede</b> para editar as defini&ccedil;&otilde;es de rede do servidor se receber um endere&ccedil;o de IP externo espec&iacute;fico do seu fornecedor do servi&ccedil;o de rede.</li>
<li>As defini&ccedil;&otilde;es de PPPoE. Aceda a <b>PPPoE</b>, em <b>Menu Principal</b> &gt; <b>Painel de Controlo</b> &gt; <b>Rede</b>, para ativar a liga&ccedil;&atilde;o PPPoE.</li>
</ul>
<li>Se pretender usar uma conta DDNS registada, aceda a <b>Menu Principal</b> &gt; <b>Painel de Controlo</b> &gt; <strong>Acesso Externo</strong> &gt; <b>DDNS</b> para ativar o servi&ccedil;o DDNS.</li>
<li>Terminado!</li>
</ol>
<p>A partir de agora, as pessoas na Internet podem navegar pelos seus &aacute;lbuns e blogue, inserindo nos respetivos navegadores <b>http://serverIP/~username/photo/</b> ou <b>http://DDNS_hostname/~username/photo/</b>.</p>

</div>
</body>
</html>
