<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM mobile</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script> <script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>DSM mobile</h1>

<p>DSM mobile permet &agrave; l'<b>admin</b> DSM (ou &agrave; un utilisateur appartenant au groupe <b>administrators</b>) de g&eacute;rer les param&egrave;tres de DSM et de v&eacute;rifier les informations DSM &agrave; l'aide d'un appareil iOS<sup>&reg;</sup> (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup>, ou iPod touch<sup>&reg;</sup>) ou d'un appareil Android<sup>&reg;</sup>. Cette aide de DSM mobile met &agrave; votre disposition les rubriques et ressources suivantes permettant de vous assister au d&eacute;but de votre utilisation.</p>

<h2>Connexion et d&eacute;connexion</h2>

<div name="contents" id="login">
<p>Une fois connect&eacute; au DSM &agrave; l'aide de votre navigateur Web sur votre appareil iOS ou Android, vous verrez l'&eacute;cran de connexion dans lequel vous pouvez saisir les informations de votre compte DSM.</p>

<h4>Pour se connecter &agrave; DSM mobile&nbsp;:</h4>
<p>Saisissez vos identifiants d&rsquo;utilisateur de DSM et appuyez sur <b>Connexion</b>. Si vous souhaitez enregistrer vos informations de connexion et vous connecter automatiquement la prochaine fois, cochez <b>Se souvenir de moi</b> avant de vous connecter.</p>

<h4>Pour vous d&eacute;connecter de DSM mobile&nbsp;:</h4>
<ol>
  <li>Touchez le bouton d'option situ&eacute; dans le coin sup&eacute;rieur droit de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (Tablette iPad ou Android).</li>
  <li>Appuyez sur <b>Param&egrave;tres</b>, puis sur <b>D&eacute;connexion</b>.</li>
</ol>
</div>

<h2>G&eacute;rer les utilisateurs de DSM</h2>

<div name="contents" id="user">
<p>Appuyez sur <b>Utilisateur et groupe</b> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android) pour afficher la liste d'utilisateurs.</p>

<h4>Pour cr&eacute;er un utilisateur&nbsp;:</h4>
<ol>
  <li>Appuyez sur <b>+</b> puis saisissez le nom de l'utilisateur, son adresse &eacute;lectronique et le mot de passe du nouvel utilisateur.</li>
  <li>Activez <b>Envoyer notification</b> pour envoyer un e-mail de notification &agrave; l'adresse de l'utilisateur lorsque son compte utilisateur de DSM est cr&eacute;&eacute;.<br><span class="note_head">Remarque&nbsp;: </span>Avant d'envoyer une notification, assurez-vous que les param&egrave;tres de notification ont &eacute;t&eacute; configur&eacute;s sur votre Synology NAS. Connectez-vous &agrave; l'&eacute;dition desktop de DSM avec le navigateur web de votre ordinateur, puis s&eacute;lectionnez <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>Notification</b> &gt; <b>E-mail</b> pour modifier les param&egrave;tres.</li>
  <li>Appuyez sur <b>Terminer</b> pour confirmer ou sur la fl&egrave;che gauche pour annuler.</li>
</ol>

<h4>Pour d&eacute;tecter rapidement un utilisateur&nbsp;:</h4>
<p>Entrez le nom de l'utilisateur dans le champ Recherche.</p>

<h4>Pour modifier les informations d'un utilisateur&nbsp;:</h4>
<ol>
  <li>Appuyez sur le nom de l'utilisateur et proc&eacute;dez comme suit&nbsp;:
    <ul>
      <li>Modifiez le nom de l'utilisateur et le mot de passe dans le champ <b>Nom</b> ou <b>Mot de passe</b>.</li>
    <li>Appuyez sur <b>D&eacute;sactiver</b> pour d&eacute;sactiver le compte de l'utilisateur. Vous pouvez choisir d'activer le compte de cet utilisateur plus tard et sans perdre ses param&egrave;tres de son compte.</li>
    <li>Activez <b>Administrateur</b> pour ajouter l'utilisateur au groupe <b>admin</b>. Tous les utilisateurs appartenant au groupe <b>admin</b> b&eacute;n&eacute;ficieront de privil&egrave;ge administratif permettant de modifier les param&egrave;tres de DSM &agrave; l'aide de DSM mobile ou du navigateur Web de leur ordinateur.</li>
    </ul>
  </li>
  <li>Sous <b>Privil&egrave;ges</b>, effectuez l'une des op&eacute;rations suivantes puis appuyez sur <b>Retour</b>&nbsp;:
    <ul>
      <li>Appuyez sur <b>Dossier partag&eacute;</b> et appuyez sur le nom du dossier partag&eacute; pour modifier le privil&egrave;ge du compte de l'utilisateur&nbsp;: <b>Lecture/&eacute;criture</b>&nbsp;: L'utilisateur peut effectuer des modifications sur les fichiers et sous-dossiers contenus dans le dossier partag&eacute;&nbsp;; <b>Lecture seule</b>&nbsp;: L'utilisateur peut acc&eacute;der aux fichiers et sous-dossiers contenus dans le dossier partag&eacute;, mais ne peut pas effectuer de modifications sur ces derniers. <b>Pas d'acc&egrave;s</b>&nbsp;: L'utilisateur ne peut pas acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute;.<br><span class="note_head">Remarque&nbsp;: </span>Si des conflits de privil&egrave;ges se produisent, la priorit&eacute; du privil&egrave;ge sera&nbsp;: <span class="note_content">Pas d'acc&egrave;s&gt; Lecture/&eacute;criture &gt; Lecture seule</span>.</li>
      <li>Appuyez sur <b>Application</b> pour modifier le privil&egrave;ge d'acc&egrave;s de l'utilisateur aux applications DSM.</li>
    </ul>
  </li>
  <li>Appuyez sur <b>Terminer</b> pour confirmer ou sur la fl&egrave;che gauche pour annuler.</li>
</ol>
</div>

<h2>G&eacute;rer des dossiers partag&eacute;s</h2>

<div name="contents" id="shared">
<p>Appuyez sur <b>Dossier partag&eacute;</b> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android) pour afficher la liste des dossiers partag&eacute;s sur votre Synology NAS.</p>

<h4>Pour cr&eacute;er un dossier partag&eacute;&nbsp;:</h4>
<ol>
  <li>Appuyez sur <b>+</b> puis saisissez le nom du nouveau dossier.</li>
  <li>Appuyez sur <b>Terminer</b> pour confirmer ou sur la fl&egrave;che gauche pour annuler.</li>
</ol>

<h4>Pour modifier un dossier partag&eacute;&nbsp;:</h4>
<p>Appuyez sur le nom du dossier partag&eacute; et proc&eacute;dez comme suit&nbsp;:</p>
<ul>
  <li>Modifiez le nom du dossier partag&eacute; dans le champ <b>Nom</b>.</li>
  <li>Appuyez sur <b>Permissions utilisateur</b>, puis sur un utilisateur pour modifier ses privil&egrave;ges d'acc&egrave;s au dossier partag&eacute;&nbsp;: <b>Lecture/&eacute;criture</b>&nbsp;: L'utilisateur peut effectuer des modifications sur les fichiers et sous-dossiers contenus dans le dossier partag&eacute;&nbsp;; <b>Lecture seule</b>&nbsp;: L'utilisateur peut acc&eacute;der aux fichiers et sous-dossiers contenus dans le dossier partag&eacute;, mais ne peut pas effectuer de modifications sur ces derniers. <b>Pas d'acc&egrave;s</b>&nbsp;: L'utilisateur ne peut pas acc&eacute;der aux fichiers et sous-dossiers du dossier partag&eacute;.<br><span class="note_head">Remarque&nbsp;: </span>Si des conflits de privil&egrave;ges se produisent, la priorit&eacute; du privil&egrave;ge sera&nbsp;: <span class="note_content">Pas d'acc&egrave;s&gt; Lecture/&eacute;criture &gt; Lecture seule</span>.</li>
  <li>Vous pouvez &eacute;galement appuyer sur <b>Permissions des groupes</b> pour configurer des privil&egrave;ges pour des groupes.<br><span class="note_head">Remarque&nbsp;: </span>Les permissions des groupes ont une priorit&eacute; sup&eacute;rieure aux permissions des utilisateurs.</li>
</ul>
</div>

<h2>Activer les services</h2>

<div name="contents" id="services">
<p>Touchez <b>Service</b> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android) pour activer ou d&eacute;sactiver les services du Synology NAS.</p>

<h4>Pour g&eacute;rer les services LAN du Synology NAS&nbsp;:</h4>
<ul>
  <li>Activez ou d&eacute;sactiver l'un des services suivants&nbsp;:
    <ul>
      <li><b>Service de fichiers Windows</b> permet &agrave; votre Synology NAS de devenir un serveur de fichiers Windows (CIFS) sur le r&eacute;seau local.</li>
      <li><b>Service de fichiers Mac</b> permet &agrave; votre Synology NAS de devenir un serveur de fichiers Mac (AFP) sur le r&eacute;seau local.</li>
      <li><b>Service NFS</b> permet aux clients Linux sur le r&eacute;seau local d'acc&eacute;der aux donn&eacute;es du Synology NAS.</li>
      <li><b>Imprimante Bonjour</b> permet aux clients Mac d'imprimer vers le(s) imprimante(s) connect&eacute;e(s) &agrave; votre Synology NAS.</li>
      <li><b>Serveur multim&eacute;dia</b> permet aux p&eacute;riph&eacute;riques domestiques DLNA/UPnP sur le r&eacute;seau local de parcourir et de lire des contenus multim&eacute;dias sur votre Synology NAS.</li>
      <li><b>iTunes</b> permet aux clients iTunes sur le r&eacute;seau local de parcourir et de lire de la musique ou des vid&eacute;os sur votre Synology NAS.</li>
    </ul>
  </li>
</ul>

<h4>Pour g&eacute;rer les services Internet du Synology NAS&nbsp;:</h4>
<ul>
  <li>Activez ou d&eacute;sactiver l'un des services suivants&nbsp;:
    <ul>
      <li><b>FTP</b> permet &agrave; votre Synology NAS de devenir un serveur FTP.</li>
      <li><b>Services Web</b> vous permet d'h&eacute;berger des sites Web (&agrave; l'aide de la prise en charge PHP+MySQL) sur votre Synology NAS.</li>
      <li><b>WebDAV</b> permet aux programmes client de g&eacute;rer et d'&eacute;diter les fichiers du Synology NAS via le protocole HTTP.</li>
      <li><b>WebDAV (HTTPS)</b> permet aux programmes client de g&eacute;rer et d'&eacute;diter les fichiers du Synology NAS via le protocole HTTPS.</li>
      <li><b><a name="filestationservice"></a>File Station</b> est une application Web vous permettant de g&eacute;rer les fichiers du Synology NAS via un port personnalis&eacute; sans avoir &agrave; vous connecter au DSM.</li>
      <li><b>File Station (HTTPS)</b> vous permet de vous connecter &agrave; File Station via le protocole HTTPS.</li>
      <li><b>Surveillance Station</b> est une application Web qui peut g&eacute;rer des cam&eacute;ras IP pour prot&eacute;ger l'environnement de votre domicile ou de votre bureau.</li>
      <li><b>Audio Station</b> est une application Web vous permettant d'acc&eacute;der &agrave; la biblioth&egrave;que musicale de votre Synology NAS.</li>
      <li><b>Photo Station</b> est un album photo int&eacute;gr&eacute; &agrave; un blog en ligne enregistr&eacute; sur votre Synology NAS.</li>
      <li><b><a name="downloadsationservice"></a>Download Station</b> (BT/HTTP/FTP/NZB/RSS) est une application Web vous permettant de t&eacute;l&eacute;charger des fichiers depuis Internet vers votre Synology NAS.</li>
      <li><b>eMule</b> permet de prendre en charge eMule sur Download Station.</li>
    </ul>
  </li>
</ul>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Pour plus d'informations sur les services mentionn&eacute;s ci-dessus, consultez l'une des m&eacute;thodes suivantes&nbsp;:</p>
	<ul>
		<li><b>Aide de DSM</b> (disponible en vous connectant &agrave; l'&Eacute;dition desktop du DSM &agrave; l'aide du navigateur Web de votre ordinateur et acc&eacute;dez &agrave; <b>Menu principal</b> &gt; <b>Aide de DSM</b>)</li>
		<li><b>Guide de l'utilisateur du DSM de Synology</b> (disponible sur le <a href="http://www.synology.com/support/download.php" target="_blank">Centre de t&eacute;l&eacute;chargement</a> de Synology)</li>
	</ul>
</div>

<h2>Contr&ocirc;le des ressources du syst&egrave;me</h2>

<div name="contents" id="resourcemonitor">
<p>Appuyez sur <b>Moniteur de ressources</b> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android) pour surveiller le processeur et l'utilisation de m&eacute;moire du Synology NAS.</p>
</div>

<h2>Afficher les infos syst&egrave;me</h2>

<div name="contents" id="sysinfo">
<p>Appuyez sur <b>Info syst&egrave;me</b> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android) pour obtenir une vue d'ensemble du statut de votre Synology NAS.</p>

<h4>Pour afficher les infos syst&egrave;me de votre Synology NAS&nbsp;:</h4>
<ol>
  <li>Proc&eacute;dez de l'une des mani&egrave;res suivantes&nbsp;:
    <ul>
      <li>Appuyez sur <b>G&eacute;n&eacute;ral</b> pour afficher les informations de base de votre Synology NAS, notamment le num&eacute;ro de s&eacute;rie, le nom du mod&egrave;le, la quantit&eacute; de m&eacute;moire physique, la version de DSM, ainsi que les informations sur la dur&eacute;e de fonctionnement et les temp&eacute;ratures.</li>
      <li>Appuyez sur <b>R&eacute;seau</b> pour afficher la configuration r&eacute;seau de votre Synology NAS et le statut de chaque interface r&eacute;seau.</li>
      <li>Touchez <b>Stockage</b> pour afficher l'utilisation du volume du Synology NAS.</li>
    </ul>
  </li>
  <li>Touchez le bouton <b>Actualiser</b> situ&eacute; dans le coin sup&eacute;rieur droit pour que les informations syst&egrave;me soient mises &agrave; jour.</li>
</ol>
</div>

<h2>Micrologiciel</h2>

<div name="contents" id="firmware">
<p>Appuyez sur <b>Micrologiciel</b> pour afficher mettre &agrave; jour votre version de DSM.</p>

<h4>Pour configurer les param&egrave;tres de mise &agrave; jour de DSM&nbsp;:</h4>
<ol>
  <li>Appuyez sur <strong>Mise &agrave; jour de DSM</strong>.</li>
  <li>Choisissez l'une des options suivantes&nbsp;:
    <ul>
      <li>Mises &agrave; jour importantes</li>
      <li>DSM le plus r&eacute;cent et toutes les mises &agrave; jour</li>
    </ul>
  </li>
  <li>Appuyez sur <strong>Effectu&eacute;</strong>.</li>
</ol>

<h4>Pour t&eacute;l&eacute;charger les mises &agrave; jour disponibles&nbsp;:</h4>
<ol>
  <li>V&eacute;rifiez votre version de DSM dans <strong>&Eacute;tat</strong>.</li>
  <li>Si votre version de DSM n'est pas &agrave; jour, appuyez sur le bouton <strong>T&eacute;l&eacute;charger</strong> qui s'affiche en dessous de la section <strong>&Eacute;tat</strong> pour mettre &agrave; jour DSM.</li>
</ol>
</div>

<h2>Gestion du blocage des IP</h2>

<div name="contents" id="block">
<p>Appuyez sur <b>Blocage d'une adresse IP</b> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android) pour emp&ecirc;cher une connexion non autoris&eacute;e.</p>

<h4>Pour g&eacute;rer le blocage des IP&nbsp;:</h4>
<ol>
  <li>Appuyez sur le bouton de configuration, dans le coin sup&eacute;rieur droit.</li>
  <li>Activez <b>Activer le blocage auto</b> pour activer le blocage des IP.</li>
  <li>Entrez un nombre pour les <b>Tentatives de connexion</b> et <b>Sous (minutes)</b> pour bloquer une adresse IP apr&egrave;s un nombre sp&eacute;cifi&eacute; d'&eacute;checs de tentatives de connexion sous le nombre de minutes sp&eacute;cifi&eacute;.</li>
  <li>Vous pouvez activer <b>Activer l'expiration des blocages</b>, et sp&eacute;cifier <b>D&eacute;bloquer apr&egrave;s (jours)</b> pour d&eacute;bloquer une adresse IP apr&egrave;s le nombre de jours indiqu&eacute;. Si vous entrez &laquo;&nbsp;0&nbsp;&raquo; ici, l'Adresse IP bloqu&eacute;e restera bloqu&eacute;e ind&eacute;finiment jusqu'&agrave; ce que vous la retiriez de la liste des blocages.</li>
  <li>Appuyez sur<b>Terminer</b>.</li>
</ol>

<h4>Pour ajouter des adresses IP &agrave; la liste des autorisations/des blocages&nbsp;:</h4>
<ol>
  <li>Si vous souhaitez ajouter l'IP autoris&eacute;e/bloqu&eacute;e &agrave; la liste, appuyez sur le bouton d'ajout, dans le coin sup&eacute;rieur droit, puis sur <b>Liste des permissions</b> ou <b>Liste des blocages</b>.</li>
  <li>Apr&egrave;s avoir entr&eacute; l'adresse IP, appuyez sur <b>Terminer</b>.</li>
</ol>
</div>

<h2>G&eacute;rer le Centre de paquets</h2>

<div name="contents" id="package">

<p>Synology a int&eacute;gr&eacute; des applications tierces et con&ccedil;ues par Synology dans des paquets pouvant &ecirc;tre install&eacute;s et activ&eacute;s facilement sur Synology NAS.</p>

<h4>Pour g&eacute;rer le Centre de paquets&nbsp;:</h4>
<p>Appuyez sur <strong>Centre de paquets</strong> sur la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou sur le panneau gauche (tablette iPad ou Android) pour afficher les informations du paquet, ex&eacute;cuter ou arr&ecirc;ter des paquets ou proc&eacute;der &agrave; la mise &agrave; jour avec les derni&egrave;res versions.</p>


<h4>Pour ex&eacute;cuter ou arr&ecirc;ter les paquets install&eacute;s&nbsp;:</h4>
<p>Appuyez sur le commutateur situ&eacute; en dessous d'un paquet pour ex&eacute;cuter ou l'interrompre.</p>

<h4>Pour afficher des paquets&nbsp;: </h4>
<p>Appuyez sur un paquet pour afficher ses informations vid&eacute;o.</p>
     
<h4>Pour mettre &agrave; jour des paquets&nbsp;:</h4>
<ol>
	<li>Appuyez sur l'onglet <strong>Mettre &agrave; jour</strong> en bas de la page pour afficher les informations des mises &agrave; jour actuellement disponibles.</li>
    <li>Appuyez sur le bouton situ&eacute; &agrave; droite d'un paquet pour le mettre &agrave; jour avec la derni&egrave;re version.</li>   
</ol>
</div>    

<h2>Afficher les journaux ou les connexions actuelles</h2>

<div name="contents" id="log">
<p>Appuyez sur <b>Journal</b> sur la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou sur le panneau gauche (tablette iPad ou Android) pour surveiller les connexions actuelles ou afficher les journaux des services Synology NAS.</p>

<h4>Pour surveiller les connexions actuelles&nbsp;:</h4>
<ul>
  <li>Appuyez sur <b>Les [nombre] derniers journaux</b> dans la section <b>Aper&ccedil;u</b> pour afficher la liste des derniers utilisateurs ayant acc&eacute;d&eacute; aux services du Synology NAS.</li>
</ul>

<h4>Pour consulter les enregistrements du journal d'un service sp&eacute;cifique&nbsp;:</h4>
<ul>
  <li>Appuyez sur un &eacute;l&eacute;ment dans la section <b>Journaux d'&eacute;v&eacute;nements</b> ou <b>Journaux de transfert de fichiers</b> pour voir la liste des journaux en rapport.</li>
</ul>

</div>
<h2>Lancer des applications mobiles</h2>
<div name="contents" id="launch">

<p>DSM mobile fournit un endroit facile d'acc&egrave;s vous permettant de lancer des applications mobiles Synology install&eacute;es sur votre appareil iOS ou Android.</p>

<h4>Pour lancer les applications mobiles Synology avec DSM mobile&nbsp;:</h4>
<p>Appuyez sur une des applications suivantes situ&eacute;es dans la section inf&eacute;rieure de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (Tablette iPad ou Android)&nbsp;:</p>
<ul>
  <li><b>DS photo</b> (disponible lorsque le service <b>Photo Station</b> est activ&eacute;)</li>
  <li><b>DS audio</b> (disponible lorsque le service <b>Audio Station</b> est activ&eacute;)</li>
  <li><b>DS cam</b> (disponible lorsque le service <b>Surveillance Station</b> est activ&eacute;)</li>
  <li><b>DS file</b> (disponible lorsque le service <b>WebDAV</b> est activ&eacute;)</li>
</ul>

<div class="section">
<h4>Remarque&nbsp;:</h4>
	<ul>
		<li>Pour plus d'informations concernant ces applications, reportez-vous aux fichiers d'Aide fournis avec les applications.</li>
     </ul> 
</div>

<h2>Configurer Synology NAS dans Action<br><span style="font-size:80%;">(red&eacute;marrer, &eacute;teindre ou &eacute;mettre des bips)</span></h2>

<div name="contents" id="restart">
<p>DSM mobile vous permet de red&eacute;marrer ou d'&eacute;teindre votre Synology NAS &agrave; l'aide d'un appareil iOS ou Android. De plus, lorsque plusieurs Synology NAS sont disponibles, vous pouvez rapidement identifier votre Synology NAS en lui demandant qu'il &eacute;mette des bips.</p>

<h4>Pour configurer votre Synology NAS avec le menu Action&nbsp;:</h4>
<ol>
  <li>Touchez le bouton d'option situ&eacute; dans le coin sup&eacute;rieur droit de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (Tablette iPad ou Android).</li>
  <li>Proc&eacute;dez de l'une des mani&egrave;res suivantes&nbsp;:
    <ul>
      <li>Touchez <b>Red&eacute;marrer</b> puis touchez <b>Oui</b> pour red&eacute;marrer votre Synology NAS.</li>
      <li>Touchez <b>&Eacute;teindre</b> puis touchez <b>Oui</b> pour &eacute;teindre votre Synology NAS.</li>
      <li>Appuyez sur <b>Me trouver</b> pour demander &agrave; votre Synology NAS d'&eacute;mettre un bip. Appuyez sur <b>OK</b> pour arr&ecirc;ter le signal sonore.</li>
    </ul>
  </li>
</ol>
</div>

<h2>Basculer vers le mode bureau de DSM</h2>

<div name="contents" id="desktopedition">

<p>Appuyez sur l'ic&ocirc;ne des param&egrave;tres et s&eacute;lectionnez <b>Mode bureau</b> pour acc&eacute;der au mode bureau de DSM.</p>
</div>



<h2>Utilisation du gestionnaire de stockage</h2>
<div name="contents" id="contents12">
<p>Le <strong>Gestionnaire de stockage</strong> vous permet d'afficher rapidement l'utilisation et l'&eacute;tat de sant&eacute; des volumes et des disques du syst&egrave;me.</p>

<h4>Pour afficher les informations des volumes&nbsp;:</h4>
	<ol>
		<li>Appuyez sur <strong>Gestionnaire de stockage</strong> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android).</li>
		<li>Appuyez sur l&rsquo;onglet <strong>Volume</strong>.</li> 
		<li>Appuyez sur un volume dans la liste pour afficher ses informations d&eacute;taill&eacute;es.</li>
	</ol>

<h4>Pour afficher les informations d'un disque&nbsp;:</h4>
	<ol>
		<li>Appuyez sur <strong>Gestionnaire de stockage</strong> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android).</li>
		<li>Appuyez sur l&rsquo;onglet <strong>HDD/SDD</strong>.</li>
		<li>Appuyez sur un disque dans la liste pour afficher son &eacute;tat de sant&eacute; et les informations S.M.A.R.T.</li>
	</ol>

<h4>Pour d&eacute;marrer ou arr&ecirc;ter le test S.M.A.R.T.&nbsp;:</h4>
	<ol>
		<li>Appuyez sur <strong>Gestionnaire de stockage</strong> de la page d'accueil (iPhone/iPod touch ou t&eacute;l&eacute;phone Android) ou du panneau gauche (tablette iPad ou Android).</li>
		<li>Appuyez sur l&rsquo;onglet <strong>HDD/SDD</strong>.</li>
		<li>Appuyez sur un disque dans la liste pour afficher sa page d'information.</li>
		<li>Appuyez sur <strong>Test S.M.A.R.T.</strong> pour d&eacute;marrer &agrave; un test S.M.A.R.T. ou sur <strong>Arr&ecirc;t</strong> pour l'arr&ecirc;ter.</li>
     </ol>
     
</div>




<h2>Plus d'informations</h2>

<div name="contents" id="contents11">
<p>Si vous avez besoin d'informations de d&eacute;pannage ou pour en savoir plus sur Synology, appuyez sur les liens suivants pour obtenir des ressources en ligne de Synology&nbsp;:</p>
<ul>
  <li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">FAQ</a>
</li>
  <li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
  <li><a href="http://forum.synology.com" target="_blank">Forum</a></li>
  <li><a href="http://www.synology.com/support/download.php" target="_blank">Centre de t&eacute;l&eacute;chargement</a></li>
  <li><a href="https://account.synology.com/support/support_form.php" target="_blank">Support technique</a></li>
</ul>
</div>

</body>
</html>
