<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Ağ Ayarları</h2>
	<p>Bu sayfa high-availability k&uuml;mesinin, aktif &uuml;ye hizmetinin ve pasif &uuml;ye sunucunuzun ağ ayarlarını g&ouml;r&uuml;nt&uuml;leyen &uuml;&ccedil; sekme i&ccedil;erir.</p>
  
	<h3>HA K&uuml;mesi Sekmesi</h3>
  	<p>Bir high-availability k&uuml;mesi oluştururken, gelen bağlantıları almak &uuml;zere sistem high-availability k&uuml;mesi IP'si i&ccedil;in genel bir IP adresi oluşturur. Gerekirse ilave high-availability k&uuml;mesi IP adresleri oluşturulabilir. Aktif sunucu &uuml;zerindeki aktive edilmiş ağ arabirimlerinin IP adresleri bu sekmede g&ouml;r&uuml;nt&uuml;lenecektir (Kalp atışı bağlantısı tarafından kullanılan ağ arabirimi bu sayfada g&ouml;sterilmez zira ilgili arabirim iki sunucu arasındaki veri &ccedil;oğaltımı i&ccedil;in kullanılacaktır). Bu sekme aşağıdaki bilgileri g&ouml;sterir:</p>
    	<ul>
        	<li><b>Ağ Arabirimi:</b> Aktif sunucudaki aktive edilmiş ağ arabirim(ler)i.</li>
            <li><b>Bağlantı:</b> Bu aray&uuml;z&uuml;n bağlı olup olmadığını g&ouml;r&uuml;nt&uuml;ler.</li>
            <li><b>IP adresi:</b> Bir high-availability k&uuml;mesi oluştururken, gelen bağlantıları almak &uuml;zere sistem high-availability k&uuml;mesi IP'si i&ccedil;in genel bir IP adresi oluşturur. Hangi Synology sunucusunun aktif sunucu olduğundan bağımsız olarak, DiskStation Manager'da (DSM) oturum a&ccedil;mak istediğinizde bu IP adresini kullanarak high-availability k&uuml;mesine bağlanabilirsiniz. Bu, bir ge&ccedil;iş meydana geldikten sonra farklı IP adreslerine bağlanma zorunluluğunu ortadan kaldırır.</li>
            <li><b>Alt Ağ Maskesi: </b>Verilen high-availability k&uuml;mesi IP adresi i&ccedil;in ilgili alt ağ maskesi.</li>
		</ul>
<h4>IP Adresini ve Al Ağ maskesini d&uuml;zenlemek i&ccedil;in:</h4>
	<ol>
		<li>D&uuml;zenlemek istediğiniz IP adresini veya alt ağ maskesini se&ccedil;in ve <b>D&uuml;zenle</b> &uuml;zerine tıklayın veya d&uuml;zenlemeye başlamak i&ccedil;in alan &uuml;zerine &ccedil;ift tıklayın.</li>
   <li>Her arabirimi etkinleştirmek veya devre dışı bırakmak i&ccedil;in <b>Etkinleştir</b> onay kutularını işaretleyin. Birden fazla k&uuml;me ağ arabirimini etkinleştirebilirsiniz, ancak k&uuml;menin oluşturulması sırasında yapılandırılmış orijinal ağ arabirimi devre dışı bırakılamaz.</li>
    </ol>
<h4>High-availability k&uuml;mesi sunucu adının değiştirilmesi:</h4>
 	<ol>
    	<li>High-availability k&uuml;mesi adını g&ouml;r&uuml;nt&uuml;lemek ve ayarlarını değiştirmek i&ccedil;in <b>Ağ ayarlarını değiştir</b> &ouml;ğesine tıklayın.</li>
   		<li>Mevcut high-availability k&uuml;mesi adını ve IP adres ayarlarını kaydetmek i&ccedil;in <b>Uygula</b>'ya tıklayın.</li>
   		<li>Mevcut değişiklikleri iptal etmek i&ccedil;in <b>İptal et</b> &uuml;zerine tıklayın. </li>
  </ol>

<h3>Aktif ve Pasif Sunucu Sekmeleri (sunucu adıyla g&ouml;r&uuml;nt&uuml;lenir)</h3>
<p>Bu sekmeler aktif veya pasif sunucudaki ağ arabirimlerinin durumunu g&ouml;sterir. Bunlar arasında, Kalp atışı bağlantısı aktif ve pasif sunucuların her birisinde bir ağ arabirimini işgal eder. Bu sekmeler aşağıdaki bilgileri g&ouml;r&uuml;nt&uuml;ler:</p>
	<ul>
    	<li><b>Ağ Arabirimi:</b> Sunucu &uuml;zerindeki fiziksel ağ arabirimi.</li>
    	<li><b>IP Adresi:</b> Mevcut ağ arabirimi i&ccedil;in atanmış IP adresi.</li>
    	<li><b>Alt Ağ Maskesi:</b> Mevcut IP adresi i&ccedil;in ilgili alt ağ maskesi.</li>
    	<li><b>A&ccedil;ıklama:</b> Mevcut ağ arabiriminin ve atanmış olan IP adresinin bilgilerini g&ouml;r&uuml;nt&uuml;ler. Bu alan aşağıdaki olası durumları g&ouml;sterir:</li>
		<ol>
			<li><b>Erişilebilir orijinal IP adresi</b>: Aktif sunucunun arabirimine atanmış orijinal IP adresi veri ve hizmetler i&ccedil;in erişilebilirdir.</li>
			<li><b>Erişilebilir olmayan orijinal IP adresi</b>: Pasif sunucunun arabirimine atanmış orijinal IP adresi erişilebilir değildir.</li>
			<li><b>Kalp atışı bağlantı IP'si, intranet &uuml;zerinden erişilebilir değil</b>: Kalp atışı bağlantısına otomatik olarak atanmış orijinal IP adresi veri ve hizmetler i&ccedil;in erişilebilir değildir.</li>
		</ol>
	</ul>
</body>
</html>