<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
  <h2>Kapatma ve Sıfırlama</h2>
  <p>Aşağıdaki talimatlar bir high-availability k&uuml;mesinin kapatılması, kaldırılması veya sıfırlanması s&uuml;recinde size yardımcı olur.</p>

  <h4> Synology High Availability kullanarak high-availability k&uuml;mesini kapatmak i&ccedil;in:</h4>
  <p>Sunucuları yeni bir fiziksel konuma taşımak veya bakım yapmak i&ccedil;in bir high-availability k&uuml;mesini kapatmak istiyorsanız, ancak high-availability k&uuml;mesi yapılandırmalarını kaldırmak istemiyorsanız, l&uuml;tfen bu talimatlara uyun.</p>
  <ol>
   <li>DSM'de oturum a&ccedil;ın.</li>
   <li>Synology High Availability'i a&ccedil;ın.</li>
   <li><b>Y&ouml;netim</b> işaretli d&uuml;ğmeye tıklayın.</li>
   <li><b>HA k&uuml;mesini kapat</b> &ouml;ğesini se&ccedil;in.</li>
   <li>Bir onay mesajı belirir. Onaylamak i&ccedil;in <b>Evet</b>'e tıklayın.</li>
  </ol>

  <h4>Bir high-availability k&uuml;mesini manuel olarak kapatmak i&ccedil;in:</h4>
  <p> High-availability k&uuml;mesi ayrıca her bir sunucu &uuml;zerinde bulunan g&uuml;&ccedil; d&uuml;ğmeleri kullanılarak manuel olarak kapatılabilir. </p>
  <ol>
   <li>Bir bip sesi &ccedil;ıkarana kadar bir sunucu (aktif veya pasif) &uuml;zerindeki g&uuml;&ccedil; d&uuml;ğmesine basın ve basılı tutun.</li>
   <li>Bir sunucu tamamen kapatıldıktan sonra, en az 30 saniye bekleyin (halen &ccedil;evrimi&ccedil;i olan sunucu ayarları kaydetmek i&ccedil;in zamana ihtiya&ccedil; duyar).</li>
   <li>Bir bip sesi &ccedil;ıkarana kadar diğer sunucudaki g&uuml;&ccedil; d&uuml;ğmesine basın ve basılı tutun.</li>
   <li>Sunucunun tamamen kapanmasını bekleyin.</li>
  </ol>
<div class="section">
<h4>Sunucuları A&ccedil;ma:</h4>   
<p>Sunucuları tekrar a&ccedil;mak istediğinizde, hem aktif hem de pasif sunucuyu aynı anda a&ccedil;malısınız (veya birbirlerinden beş dakika arayla). Sunuculardan yalnızca birini a&ccedil;tığınızda, bir Yerel Ağda Uyandırma mesajı yayınlayarak diğer sunucuyu a&ccedil;maya &ccedil;alışacaktır.</p>
<h4>Anormal Kapanma:</h4>
<p>Bir high-availability k&uuml;mesi oluşturulduğunda, Denetim Masası'ndaki g&uuml;&ccedil; arızasından sonra yeniden başlatma se&ccedil;eneği otomatik olarak etkinleştirilir. Sunucular, g&uuml;&ccedil; arızasından dolayı anormal bi&ccedil;imde kapanırsa, g&uuml;&ccedil; geri geldiğinde otomatik olarak a&ccedil;ılacaklardır.</p>
</div>

<h4>Bir high-availability k&uuml;mesini kaldırmak i&ccedil;in:</h4>
 <p>Her iki sunucuyu ayırmak ve farklı bir sunucuyu bağlamak amacıyla bir high-availability k&uuml;mesini kaldırmak i&ccedil;in l&uuml;tfen bu talimatlara uyun.</p>
  <ol>
   <li><b>Genel Bakış</b> sayfasına gidin.</li>
   <li><b>Y&ouml;netim</b> d&uuml;ğmesine tıklayın.</li> 
   <li><b>HA k&uuml;mesini kaldır</b> &ouml;ğesini se&ccedil;in.</li>
  </ol>
  <p>Onay sonrasında, sistem high-availability k&uuml;mesini kaldırır. Durum alanı kaldırma s&uuml;recinin ilerlemesini g&ouml;sterir. High-availability k&uuml;mesi başarıyla kaldırıldıktan sonra, aktif sunucunun orijinal IP adresine y&ouml;nlendirileceksiniz. Her iki sunucunun durumu <b>Tek Başına</b> olarak değişir.</li>
  
 <h4>Arızalı bir high-availability k&uuml;mesini sıfırlamak i&ccedil;in:</h4>
  <p>DSM veya Synology High Availability'ye bir b&ouml;l&uuml;nm&uuml;ş beyin hatası veya başka arızalar nedeniyle erişemiyor olmanız durumunda, sunucularınızda yer alan <b>Sıfırla</b> d&uuml;ğmesine basarak high-availability k&uuml;mesinin ayrılmasını sağlayabilirsiniz.</p>
  <ol>
   <li>Sunucu bir bip sesi &ccedil;ıkarana kadar <b>Sıfırla</b> d&uuml;ğmesine (genellikle bir sunucunun arka panelinde yer alır) basın ve basılı tutun.
   <li>Sistem high-availability k&uuml;mesini kaldırır ve her iki sunucunun durumu <b>Tek başına</b> olarak değişir.</li>
   <li><b>Sıfırla</b> d&uuml;ğmesine basılması ayrıca IP adresi, DNS ve y&ouml;netici şifresi gibi bazı ayarların aşağıdakilere ek olarak geri y&uuml;klenmesini sağlar:</li>
   <ul>
    <li>Y&ouml;netici şifresi boş olarak geri y&uuml;klenecektir.</li>
    <li>Misafir hesabı devre dışı bırakılacaktır.</li>
    <li>DHCP, IP, DNS, Ağ Ge&ccedil;idi ve diğer ağ arabirimlerinde etkinleştirilecektir</li>
    <li>JumboFrames devre dışı bırakılacak ve MTU 1500'e ayarlanacaktır.</li>
    <li>Y&ouml;netim Portu 5000/5001 olarak ayarlanacaktır.</li>
    <li>PPPoE varsayılan olarak ayarlanacaktır.</li>
    <li>IP otomatik blokajı devre dışı bırakılacaktır (bloke edilmiş IP adresi silinmeyecektir).</li>
    <li>Link Aggregation devre dışı bırakılacaktır.</li>
    <li>G&uuml;venlik Duvarı kuralları devre dışı bırakılacaktır (kurallar silinmeyecektir).</li>
   </ul>
  </ol>

<div class="section">
<h4>Not:</h4>
<p>Bir high-availability k&uuml;mesinin kaldırılması işleminde, bazı eksik veri yazma işlemleri olabilir. Verinin eksiksiz olmasını sağlamak i&ccedil;in, pasif sunucu bazı veri g&uuml;ncellemelerini alamayabileceğinden aktif sunucuya dayalı olarak veri &ccedil;oğaltımını yapın.</p>
</div>
 </body>
</html>
