<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Služby podpory</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>Služby podpory</h2>
<p>
Služby podpory zahrnuj&iacute; n&aacute;stroje pro vzd&aacute;len&yacute; př&iacute;stup a&nbsp;vytv&aacute;řen&iacute; protokolů, kter&eacute; na&scaron;im technikům podpory umožňuj&iacute; rychl&eacute; zobrazen&iacute;, diagn&oacute;zu a&nbsp;ře&scaron;en&iacute; technick&yacute;ch probl&eacute;mů na zař&iacute;zen&iacute; DiskStation př&iacute;mo ze s&iacute;dla společnosti Synology. Tyto služby najdete v&nbsp;č&aacute;sti <b>Centrum podpory</b> &gt; <b>Služby podpory</b>.
</p>

<h4>Postup povolen&iacute; vzd&aacute;len&eacute;ho př&iacute;stupu: </h4>
<p>
Vzd&aacute;len&yacute; př&iacute;stup k&nbsp;zař&iacute;zen&iacute; DiskStation povolte pouze tehdy, pokud v&aacute;s o&nbsp;to pož&aacute;daj&iacute; technici společnosti Synology.
</p>
<ol>
<li>Za&scaron;krtněte pol&iacute;čko <b>Povolit vzd&aacute;len&yacute; př&iacute;stup</b>. Změny uložte kliknut&iacute;m na možnost <b>Použ&iacute;t</b>.
</li>
<li>Technikům podpory společnosti Synology předejte v&nbsp;e-mailov&eacute; zpr&aacute;vě heslo uživatele admin a&nbsp;identifikačn&iacute; kl&iacute;č podpory.
</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Vzd&aacute;len&yacute; př&iacute;stup bude automaticky zak&aacute;z&aacute;n po 14&nbsp;dnech. Do t&eacute; doby by neměl b&yacute;t ručně deaktivov&aacute;n, pokud v&aacute;s v&scaron;ak o&nbsp;to nepož&aacute;d&aacute; technik podpory společnosti Synology.
</li>
<li>Odeberte jak&yacute;koli obsah zař&iacute;zen&iacute; DiskStation, kter&yacute; považujete za priv&aacute;tn&iacute;. 
</li>
<li>Ačkoli společnost Synology nemůže zaručit, že vzd&aacute;len&yacute;m př&iacute;stupem bude probl&eacute;m vyře&scaron;en, vyvine společnost Synology přiměřenou snahu o&nbsp;to, aby služby podpory byly poskytov&aacute;ny na profesion&aacute;ln&iacute; &uacute;rovni.
</li>	
</ul>
</div>

<h4>Postup vytv&aacute;řen&iacute; protokolů: </h4>
<p>
Vytvořen&eacute; protokoly před&aacute;vejte pouze technikům podpory společnosti Synology.
</p>
<ol>
<li>Klikněte na možnost <b>Vytvořit protokoly</b> a&nbsp;pot&eacute; vyčkejte několik minut na dokončen&iacute; stahov&aacute;n&iacute;.
</li>
<li>Protokoly předejte technikům společnosti Synology e-mailem.
</li>
</ol>

<div class="section">
<h4>Co byste měli vědět o&nbsp;na&scaron;ich služb&aacute;ch podpory</h4>
<ul>
<li>Va&scaron;e zař&iacute;zen&iacute; DiskStation respektujeme tak, jako by bylo na&scaron;e.</li>
<li>Va&scaron;e zař&iacute;zen&iacute; DiskStation použijeme pouze pro &uacute;čely diagn&oacute;zy syst&eacute;mu. Společnost Synology nebude zpř&iacute;stupňovat ani zveřejňovat ž&aacute;dn&eacute; osobn&iacute; &uacute;daje uložen&eacute; na zař&iacute;zen&iacute; DiskStation. </li> 

</ul>
</div>

</body>
</html>
