 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SSD TRIM - Synology DSM - Hj&aelig;lp</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="SSD TRIM improves the read and write performance of volumes created on SSDs, increasing efficiency as well as extending the lifetime of your SSDs.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SSD TRIM</h2>
<p>Hvis en diskenhed kun best&aring;r af SSD'er (Solid State Drives), anbefaler vi at aktivere SSD TRIM. Denne funktion forbedrer l&aelig;se- og skriveyelsen af diskenheder, der er oprettet p&aring; SS'er, for&oslash;ger effektiviteten samt forl&aelig;nger levetiden for dine SSD'er.</p>
<h4>S&aring;dan aktiverer du SSD TRIM:</h4>
<ol>
  <li>&Aring;bn <strong>Lagerstyring</strong>, og g&aring; til <strong>Diskenhed</strong>. </li>
  <li>V&aelig;lg en diskenhed, som kun best&aring;r af SSD'er, og klik p&aring; knappen <b>Konfigurer</b>.</li>
  <li>I det vindue, der vises, g&aring;r du til fanen <b>SSD TRIM</b> og markerer feltet <strong>Aktiver TRIM</strong>.</li>
  <li>Klik p&aring; knappen <strong>Angiv plan</strong> for at v&aelig;lge, hvorn&aring;r systemet vil udf&oslash;re SSD TRIM.</li>
  <li>Klik p&aring; <strong>OK</strong>.</li>
</ol>
<div class="section">
  <h4>Bem&aelig;rk:</h4>
  <ul>
    <li>SSD TRIM er kun tilg&aelig;ngelig p&aring; visse DiskStation-modeller og RAID-typer. </li>
    <li>Nogle SSD-modeller kan ikke udf&oslash;re SSD TRIM p&aring; RAID 5- og RAID 6-diskenheder. Der henvises til kompatibilitetslisten p&aring; <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</li>
    <li>SSD TRIM kan ikke aktiveres i f&oslash;lgende situationer:
      <ul>
        <li>Diskenheden tilknyttes med SSD-cache.</li>
        <li>Pakken <strong>Time Backup</strong> installeres.</li>
        <li>En high-availability-klynge er oprettet med pakken <strong>High Availability-styring</strong>.</li>
      </ul>
    </li>
    <li>SSD TRIM kan ikke aktiveres p&aring; iSCSI LUN'er med blokniveau.</li>
    <li>Systemydelse bliver p&aring;virket, n&aring;r der udf&oslash;res SSD TRIM. Den tid, der er brug for, til at f&aelig;rdigg&oslash;re udf&oslash;relsen af TRIM varierer, afh&aelig;ngigt af diskenhedsst&oslash;rrelsen og SSD-modellen.</li>
    <li>N&aring;r TRIM er aktiveret p&aring; en diskenhed, bliver den ogs&aring; aktiveret p&aring; andre diskenheder, der er oprettet i den samme diskgruppe eller RAID-gruppe.</li>
  </ul>
</div>
</body>
</html>
