<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>B&uuml;y&uuml;k eranlar ile Synology NAS'a kaydedilen multimedya i&ccedil;eriklerinin keyfini &ccedil;ıkarın</title>
</head>

<body class="tutorial-content-box" >

<h1>B&uuml;y&uuml;k eranlar ile Synology NAS'a kaydedilen multimedya i&ccedil;eriklerinin keyfini &ccedil;ıkarın</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_media_server/enjoy_multimedia_contents_stored_on_synology_nas_with_big_screens.jpg" width="600" height="301" />
<h2>Genel Bakış</h2>
<p>Synology NAS, yerel alan ağında televizyonlar/stereo sistemleri ve bilgisayarların ve Sony PlayStation3/Xbox 360 ev cihazlarının multimedya i&ccedil;eriğini y&uuml;r&uuml;tmesini sağlayan bir multimedya sunucusu olarak g&ouml;rev yapabilir. Bu aygıtlar DLNA/UPnP-uyumlu <b>dijital medya adapt&ouml;rleridir</b> (DMA). Oynatmak i&ccedil;in Synology NAS'ınızdan DMA cihazlarına multimedya i&ccedil;eriklerini y&uuml;r&uuml;tmek i&ccedil;in, medya oynatma ayarlarını yapılandırmanız gereklidir. &Ouml;rneğin, medya dosyaları i&ccedil;in tarama ayarlarını y&ouml;netmek ve dosyaların uyumluluğunu geliştirmek. Bu &ouml;zellik <strong>Medya Sunucusu</strong> paketinde vardır.</p>

<h3 class="list_head">1. Medya Sunucusu Y&uuml;kle</h3>
<p>Medya Sunucusu y&uuml;klemek i&ccedil;in, l&uuml;tfen <b>Paket Merkezi</b>'ne gidin, <b>Medya Sunucusunu</b> bulun ve ardından <b>Y&uuml;kle</b> &uuml;zerine tıklayın.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_install_media_server.png" width="640" border="1" />

<h3 class="list_head">2. Multimedya dosyalarını Synology NAS'ınıza y&uuml;kleyin</h3>
<p>Varsayılan paylaşılan klas&ouml;rler, <b>photo</b>, <b>music</b> ve <b>video</b> otomatik olarak oluşturulur ve Medya Sunucusu NAS'ınıza kurulduktan sonra endekslenir. Yapmanız gereken sadece resimler, şarkılar veya videolar gibi medya dosyalarını ilgili klas&ouml;rlere y&uuml;klemektir ve bu dosyalara DMA cihazlarınızdan erişilebilecektir.</p>
<div class="code_div"><b>Not:</b>Uzak sunuculardan tanıtılan paylaşımlı klas&ouml;rler indeksli klas&ouml;r olarak eklenemez. Synology NAS'ınıza 100'e kadar endekslenmiş klas&ouml;r ekleyebilirsiniz.</div>

<h3 class="list_head">3. Medya oynatıcınız i&ccedil;in tarama ayarlarını yapılandırın</h3>
<p>Synology NAS'ınızdaki medya dosyalarının DMA cihazlarınız tarafından nasıl g&ouml;z atıldığına karar verebilirsiniz.</p>
<ol>
<li><b>Ana Men&uuml; &gt; Medya Sunucusu</b> kısmına gidin.</li>
<li>Sol panelden <b>G&ouml;zatma Ayarları</b> kısmına tıklayın.</li>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_browsing_settings.png" width="640" border="1" />
<li>Ayrıntılı bilgi i&ccedil;in, <b>Medya Sunucusu</b> penceresinin sağ &uuml;st k&ouml;şesindeki <b>Yardım</b> d&uuml;ğmesine tıklayın.</li>
</ol>
<h3 class="list_head">4. DMA uyumunu artır</h3>
<p>Eğer DLNA/UPnP TV'ler veya DMA cihazları NAS'ınızda kaydedilen multimedya i&ccedil;eriklerini d&uuml;zg&uuml;n bir şekilde oynatamazsa, Medya Sunucusunun <b>DMA Uyumluluğu</b> ayarlarını yapılandırmayı deneyebilirsiniz.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_dma_compatibility.png" width="640" border="1" />
<div class="code_div"><b>Not:</b>
<ol>
  <li>DMA cihaznızın doğru y&uuml;klendiğini ve yerel ağınızda NAS'ınız tarafından bulunduğunu kontrol etmek istiyorsanız, <b>Aygıt listesi</b> &uuml;zerine tıklayın. DMA cihazlarının bir listesi cihaz bilgisi ile birlikte g&ouml;r&uuml;necektir.</li>
  <li><b>Yeni algılanan UPnP/DLNA cihazları i&ccedil;in Medya Sunucusuna erişimi kısıtla</b>'yi işaretleyin. Aksi halde, Medya Sunucusu DMA cihazlarınıza erişemeyecektir.</li>
</ol>
</div>
<p>Diğer formatların multimedya dosyalarına ait teknik destek hakkında ayrıntılı bilgi almak i&ccedil;in, Medya Sunucusu penceresinin sağ &uuml;st k&ouml;şesindeki Yardım d&uuml;ğmesine tıklayın.</p>
<h3 class="list_head">5. DLNA TV ile birlikte NAS'ınıza kaydedilen medya dosyalarına erişmek i&ccedil;in</h3>
<p>DLNA/UPnP ve DMA cihazlar ev ağınıza kolaylıkla bağlanabilir. Hem Synology NAS hem de DLNA cihazlarının ev ağınıza bağlantıları oluşturulduğunda, se&ccedil;ilen klas&ouml;rlere g&ouml;z atabilir ve NAS'ınızdaki m&uuml;zikleri dinleyebilr veya videoları b&uuml;y&uuml;k ekranda izleyebilirsiniz.</p>
<div class="code_div"><b>Not:</b> Synology tarafından onaylanmış desteklenen DLNA/UPnP TV'lerin ve DMA cihazlarının bir listesi i&ccedil;in, l&uuml;tfen <a href="https://www.synology.com/compatibility?search_by=category&category=dlna_devices&p=1&not_recommend_mode=false" target="_blank">buraya</a> bakın.</div>
<p>Ayar s&uuml;reci DLNA-uyumlu DMA cihazlarınıza bağlıdır. NAS'ınıza kaydedilen medya dosyalarına DLNA &uuml;zerinde erişim hakkında ayrıntılı bilgi i&ccedil;ni, l&uuml;tfen istemci cihazlarınızın talimatlarına bakın.</p>
</div>
<div class="page-info">
  <ul>
    <li>Bu konudaki sonraki: <a href="home_theater_videos.html">Video Station ile videoları organize edin ve oynatın</a> </li>
  </ul>
</div>
</body>

</html>