<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Video Station ile Videoları Organize Edin ve Oynatın</title>
</head>

<body class="tutorial-content-box" >

<h1>Video Station ile videoları organize edin ve oynatın</h1>
<div class="tutorials_content">

<img src="../../images/HomeTheater/1x/home_theater_videos/Categorize_and_Play_Videos_with_Video_Station.jpg"/>


<h2>Genel Bakış</h2>
<p>Video Station ile, video koleksiyonlarınızı farklı varsayılan veya &ouml;zelleştirilen kitaplıklara kolaylıkla d&uuml;zenleyebilir ve kategorize edebilirsiniz, b&ouml;ylece istediğiniz videoyu etkin bir şekilde bulabilirsiniz. Buna ek olarak, videoları oynatmak ve paylaşmak sadece birka&ccedil; basit tıkla kolay ve basit bir şekilde yapılabilir.</p>

<h3 class="list_head">1. Video Station y&uuml;kle</h3>
<p>Video Station y&uuml;klemek i&ccedil;in, l&uuml;tfen <b>Paket Merkezi</b>'ne gidin, <b>Video Station</b>'ı bulun ve ardından <b>Y&uuml;kle</b> &uuml;zerine tıklayın.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/1.png" border="1"/>

<h3 class="list_head">2. Videoları Varsayılan Kitaplıklara Sakklayın ve Kategorize Edin</h3>
<p>Video Station sol panelde g&ouml;sterildiği gibi &uuml;&ccedil; varsayılan kitaplık sunar: <b>Film</b>, <b>TV Programı</b> ve <b>Ana Video</b>. Videolarınızın kolaylıkla endekslendiğinden ve kategorize edildiğinden emin olmak i&ccedil;in, her kitaplık i&ccedil;in video klas&ouml;rleri eklemeniz ve ardından dosyalarınızı ilk olarak ilgili video klas&ouml;rlerine saklamanız gereklidir. Varsayılan olarak, &uuml;&ccedil; video klas&ouml;r&uuml; <b>video</b> paylaşılan klas&ouml;r&uuml;nde oluşturuldu: <b>film</b>, <b>TV programı</b> ve <b>ana video</b>. Ancak, bu &uuml;&ccedil; klas&ouml;re ek olarak, kitaplıklar i&ccedil;in daha fazla video klas&ouml;r&uuml; eklemek &uuml;zere aşağıdakileri de yapabilirsiniz.</p>

<div class="code_div">
<b>Not:</b>
<p>Sistem, iki video t&uuml;r&uuml; (film ve tv programı) i&ccedil;in ilgili meta veriyi ve diğer bilgilerini (&ouml;rn. poster g&ouml;r&uuml;nt&uuml;s&uuml;) internetten otomatik olarak arıyacaktır. Dolayısıyla, videolarınızın doğru bilgiler ile eşleştiğinden emin olmak i&ccedil;in, ilgili kitaplıkların videolarının belirtilen video t&uuml;r&uuml; ile eşleşmesi &ouml;nemle vurgulanmıştır.</p>
</div>

<h4>Varsayılan kitaplıklar i&ccedil;in video klas&ouml;rlerini ekle</h4>
<ol>
<li><b>Ayarlar</b> &gt; <b>Kitaplık</b> &ouml;ğelerine gidin.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/2.png" border="1"/>

<li>Synology NAS'dan bir klas&ouml;r se&ccedil;mek i&ccedil;in <b>Oluştur</b> &gt; <b>Klas&ouml;r ekle</b> &uuml;zerine tıklayın ve hedef kitaplığı se&ccedil;in. Bir kitaplık i&ccedil;in 100'e kadar video klas&ouml;r&uuml; ekleyebilirsiniz, fakat bir klas&ouml;r se&ccedil;ildiğinde, ne klas&ouml;r ne de alt klas&ouml;rler diğer kitaplık i&ccedil;in artık se&ccedil;ilemez.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/3.png" border="1"/>

<li>Video dosyalarını video klas&ouml;rlerine kaydederek videoları ilgili kitaplıklara kategorize edin.</li>
<li>Artık istediğiniz videoları kitaplıklardan g&ouml;zatabilir ve izleyebilirsiniz!</li>
</ol>

<h3 class="list_head">3. Videoları &Ouml;zel Kitaplıklara Sakklayın ve Kategorize Edin</h3>
<p>Varsayılan olarak herhangi bir kişi tarafından erişilebilecek &uuml;&ccedil; varsayılan kitaplığa ek olarak, siz bir DSM <B>admin</B> olarak ya da <b>administrators</b> grubuna ait kullanıcılar &ouml;zel kitaplıklar oluşturabilirler ve kullanıcılara erişim izinleri atayabilirler.</p>

<h4>3.1 &Ouml;zel kitaplıklar oluşturun</h4>
<ol>
<li><b>Ayarlar</b> &gt; <b>Kitaplık</b> &ouml;ğesine gidin ve <b>Oluştur</b> &gt; <b>Kitaplık oluştur</b> &uuml;zerine tıklayın.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/4.png" border="1"/>

<li>Yeni kitaplık i&ccedil;in bir ad belirleyin, klas&ouml;re hangi t&uuml;r videoları koymak istediğinizi se&ccedil;in ve ardından kitaplığa herkes tarafından erişilmesini istiyorsanız <b>Genel</b> &ouml;ğesini se&ccedil;in ya da izinleri bulunan belirli kullanıcıların erişmesini istiyorsanız <b>&Ouml;zel</b> &ouml;ğesini se&ccedil;in. İnternetten topladığınız video bilgilerinin doğruluğundan emin olmak i&ccedil;in klas&ouml;re yerleştirdiğiniz videoların burada se&ccedil;tiğiniz t&uuml;r ile eşleşmesi gerektiğini l&uuml;tfen aklınızda bulundurun.</li>
<li>Eğer <b>&Ouml;zel</b> &ouml;ğesini se&ccedil;erseniz, <b>İzinleri ata</b> &uuml;zerine tıklayın ve kullanıcılara erişim vermek i&ccedil;in onay kutularını işaretleyin.</li>
</ol>

<h4>3.2 &Ouml;zel kitaplıklar i&ccedil;in video klas&ouml;rleri ekle</h4>
<ol>
<li><b>Ayarlar</b> &gt; <b>Kitaplık</b> &ouml;ğelerine gidin.</li>
<li>Synology NAS'dan bir klas&ouml;r se&ccedil;mek i&ccedil;in <b>Oluştur</b> &gt; <b>Klas&ouml;r ekle</b> &uuml;zerine tıklayın ve hedef kitaplığı se&ccedil;in. Bir kitaplık i&ccedil;in 100'e kadar video klas&ouml;r&uuml; ekleyebilirsiniz, fakat bir klas&ouml;r se&ccedil;ildiğinde, ne klas&ouml;r ne de alt klas&ouml;rler diğer kitaplık i&ccedil;in artık se&ccedil;ilemez.</li>
<li>Video dosyalarını video klas&ouml;rlerine kaydederek videoları ilgili kitaplıklara kategorize edin.</li>
<li>Artık istediğiniz videoları kitaplıklardan g&ouml;zatabilir ve izleyebilirsiniz!</li>
</ol>

<h3 class="list_head">4. Videoları Oynatın</h3>
<p>Video dosyalarınızı farklı kitaplıklara kategorize ettiğinizde, aşağıdaki adımları izleyerek Video Station'da videoları oynatabilirsiniz. İlk olarak bilgisayarınıza <a href="http://www.videolan.org/vlc/" target="_blank">VLC media player (Windows, Linux)</a> y&uuml;klemeniz &ouml;nemle &ouml;nerilir. Yerel bilgisayarınızda videoları y&uuml;r&uuml;tmeye ek olarak, video y&uuml;r&uuml;tme i&ccedil;in DLNA/UPnP-uyumlu DMA'lar ya da AirPlay uyumlu aygıtlara videolarınızın akışını da yapabilirsiniz.</p>

<h4>G&ouml;m&uuml;l&uuml; Video Oynatıcısıyla videoları y&uuml;r&uuml;t&uuml;n</h4>
<ol>
<li>Oynatmak istediğiniz herhangi bir video klipini se&ccedil;in ve ardından video g&ouml;r&uuml;nt&uuml;s&uuml;nde oynat simgesine tıklayın veya <b>Eylem</b> &gt; <b>Y&uuml;r&uuml;t</b> &uuml;zerine tıklayın.</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/5.png" border="1"/>

<li>Video derhal oynamaya başlamalıdır. Eğer başlamazsa, l&uuml;tfen video formatınızın web tarayıcınız tarafından desteklendiğinden veya VLC eklentisini bilgisayarınıza y&uuml;klediğinizden emin olun.</li>
<li>Video Oynatıcısının altındaki ekran &uuml;st&uuml; d&uuml;ğmelerini ve ilerleme &ccedil;ubuğunu ihtiyacınıza g&ouml;re kullanın. Ayrıca sesi ayarlayabilir, video oynatma kalitesini ve sesli par&ccedil;ayı se&ccedil;ebilir, altyazıları a&ccedil;abilir veya videoyu diğer cihazda y&uuml;r&uuml;tebilirsiniz (m&uuml;mk&uuml;nse).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/6.png" border="1"/>

</ol>


<div class="code_div">
<b>Not:</b>
<p>VLC eklentisi ve desteklenen cihazlar hakkında ayrıntılı bilgi i&ccedil;in, l&uuml;tfen <b>DSM Yardımı</b> &gt; <b>Video Station</b> &gt; <b>Video Y&uuml;r&uuml;tme</b> kısmına bakın.</p>
</div>
 
<h3 class="list_head">5. Videoları Herkesle Paylaş</h3> 
<p>Herkesle paylaşma &ouml;zelliği sayesinde, Video Station'ı kullanarak videolarınızı diğer kişiler ile kolaylıkla paylaşabilirsiniz. Paylaşılan t&uuml;m videoların link kullanılarak herkes tarafından erişilir olması ve <b>Koleksiyon</b> sayfasından y&ouml;netilebilmesi gereklidir.</p>

<h4>Videoları diğer kişiler ile paylaşın</h4>
<ol>
<li>Herhangi bir video kitaplığına gidin ve sağ &uuml;st k&ouml;şedeki <b>T&uuml;m&uuml;</b> &ouml;ğesine tıklayarak bu kitaplıktaki t&uuml;m videoları g&ouml;r&uuml;nt&uuml;leyin.</li>
<li><b>Se&ccedil;im Modu</b> simgesine tıklayın veya <b>Ctrl</b> veya <b>Shift</b> &uuml;zerine basarak &ccedil;oklu videoları se&ccedil;in. Ardından <b>Eylem</b> &gt; <b>Herkesle paylaş</b> &uuml;zerine tıklayın.</li>
<ul>
<li>Eğer paylaşacak bir video se&ccedil;tiyseniz, video <b>Paylaşılan Videolar</b> adındaki paylaşılan koleksiyona eklenecektir. Burada, paylaştığınız t&uuml;m videoları birer birer y&ouml;netebilirsiniz.</li>
<li>Eğer paylaşacak birden fazla video se&ccedil;tiyseniz, videolar yeni paylaşılan koleksiyonuna gruplanacaktır.</li>
</ul>
<li>Alternatif olarak, aynı zamanda <b>Eylem</b> &gt; <b>Koleksiyon</b> &uuml;zerine tıklayarak se&ccedil;ilen videoları mevcut paylaşılan koleksiyonuna ekleyebilirsiniz (varsa).</li>

<img src="../../images/HomeTheater/1x/home_theater_videos/7.png" border="1"/>

<li>Gerekirse bir ge&ccedil;erlilik s&uuml;resi belirleyin.</li>
<li>Yapmanız gereken sadece linki kopyalayıp epostalara, anlık mesajlara ve web sayfalarına yapıştırarak videoları herkes ile paylaşmaktır.</li>
</ol> 


<h3 class="list_head">6. Videoları Mobil Cihazlarda D&uuml;zenleyin ve İzleyin</h3>
<p>Mobil cihazlarınızda video oynatmak veya DMA'larınıza ya da AirPlay aygıtlarınıza evde ve hareket halindeyken video akışı sağlamak &uuml;zere Video Station'a mobil cihazlar &uuml;zerinden bağlanarak iOS/Android cihazlar veya aşağıdaki QR kodlarına sahip Windows Phone ile DS video indirebilirsiniz.</p>

<img src="../../images/HomeTheater/1x/home_theater_videos/8.png"/>

</div>

<div class="page-info">
  <ul>
    <li>Bu konudaki önceki: <a href="home_theater_media_server.html">B&uuml;y&uuml;k eranlar ile Synology NAS'a kaydedilen multimedya i&ccedil;eriklerinin keyfini &ccedil;ıkarın</a> </li>
    <li>Bu konudaki sonraki: <a href="home_theater_music.html">Audio Station ile Synology NAS'ınıza kaydettiğiniz m&uuml;zikleri dinleyin</a> </li>
  </ul>
</div>
</body>
</html>