<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Photo Station ile fotoları y&ouml;netmek ve g&ouml;zatmak i&ccedil;in alb&uuml;mleri oluşturun</title>
</head>

<body class="tutorial-content-box" >

<h1>Photo Station ile fotoları y&ouml;netmek ve g&ouml;zatmak i&ccedil;in alb&uuml;mleri oluşturun</h1>
<div class="tutorials_content">

<img src="../../images/ManagePhotos/1x/manage_share_photos/Create_Albums_to_Manage_and_Browse_Photos_with_Photo_Station.jpg"/>

<h2>Genel Bakış</h2>
<p>Photo Station, Synology NAS'ınızda kayıtlı olan fotoları internet &uuml;zerinden d&uuml;zenlemenize ve g&ouml;r&uuml;nt&uuml;lemenize yardım edecek şekilde tasarlanmıştır. Tanımlanan ve kullanıcı dostu aray&uuml;z&uuml; ile, Photo Station foto alb&uuml;mlerinizi sadece birka&ccedil; tıkta y&uuml;klemenize, g&ouml;zatmanıza, y&ouml;netmenize ve paylaşmanıza olanak sağlar.</p>

<h3 class="list_head">1. Photo Station'ı Y&uuml;kleyin</h3>
<p>Photo Station y&uuml;klemek i&ccedil;in, l&uuml;tfen <b>Paket Merkezi</b>'ne gidin, <b>Photo Station</b>'ı bulun ve ardından <b>Y&uuml;kle</b> &uuml;zerine tıklayın.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/1.png" border="1"/>

<h3 class="list_head">2. Fotoğraf Y&uuml;kle</h3>
<p>Fotolara Photo Station'da g&ouml;zatmadan ve y&ouml;netmeden &ouml;nce, alb&uuml;mleri oluşturmanız ve fotoları ilk olaral aşağıdaki y&ouml;ntemlerden birini kullanarak oluşturmanız gereklidir.</p>

<h4>2.1 Fotoları Photo Station Uploader'a y&uuml;kleyin (Windows ve Mac i&ccedil;in)</h4>
<p>Photo Station Uploader'ı kullanmanızı &ouml;neririz, &ccedil;&uuml;nk&uuml; y&uuml;kleme s&uuml;recinde g&ouml;sterilecek her fotonun k&uuml;&ccedil;&uuml;k resimleri oluşturulacaktır. Dosyaları Photo Station Uploader ile y&uuml;klemek bilgisayarınızın işlem yeteneğini y&uuml;kselterek d&ouml;n&uuml;ş&uuml;m&uuml; hızlandıracaktır.</p>
<ol>
<li><b>Photo Station Uploader</b>'ı indirin ve y&uuml;kleyin (<a href="https://www.synology.com/support/download/DS713+" target="_blank">Synology's Download Center</a>'da vardır).</li>
<li>Bilgisayarınızda, y&uuml;klemek istediğiniz herhangi bir fotoya sağ tıklayın ve sihirbazı a&ccedil;mak i&ccedil;in <b>Photo Station'a Y&uuml;kle</b> &gt; <b>Yeni profil oluştur</b> &ouml;ğesini se&ccedil;in.</li>
<li>Kendi se&ccedil;tiğiniz bir adı ve yeni profil i&ccedil;in hedef Synology NAS'ın sunucu adını/IP adresini girin.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/2.png" border="1"/>

<div class="code_div">
<b>Not:</b>
<p>Sağlanan sunucu bilgisi ve kullanıcı bilgileri ileride kullanmak i&ccedil;in bu profile kaydedilecektir. Farklı kurallara veya hedeflere g&ouml;re birka&ccedil; profil ayarlayabilirsiniz. Sunucu bilgilerini tekrar doldurmak yerşine, bir sonraki sefere Photo Station Uploader'ı kullanın, mevcut bir profili se&ccedil;ebilir ve fotoları aynı hedefe y&uuml;klemek i&ccedil;in yapılandırma ayarını &ouml;nceden kullanabilirsiniz.</p>
</div>

<li>Dosyaları Photo Station veya Kişisel Photo Station'dan birine y&uuml;kleyip y&uuml;klemiyeceğinizi se&ccedil;in.</li>

<li>Hedef Synology NAS i&ccedil;in kullanıcı bilgilerini girin.</li>

<li><b>G&ouml;zat</b> &uuml;zerine tıklayarak hedef klas&ouml;r&uuml; se&ccedil;in veya <b>photo</b> paylaşılan klas&ouml;r&uuml;nde bir alt klas&ouml;r oluşturun.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/3.png" border="1"/>

<li>Y&uuml;kleme tamamlandığında, Photo Station'ı Synology NAS'ınızda başlatabilir ve y&uuml;klediğiniz dosyaları &ccedil;eşitli modlarda g&ouml;r&uuml;nt&uuml;leyebilir veya alb&uuml;m &ouml;zellikleri ve erişim &ouml;ncelikleri gibi diğer bilgileri d&uuml;zenleyebilirsiniz.</li>
</ol>


<h4>2.2 Alb&uuml;mleri oluşturun ve fotoları Photo Station &uuml;zerinden y&uuml;kleyin</h4>
<p><b>Photo Station</b>'ı başlatın ve <b>Ekle</b> &uuml;zerine tıklayarak yeni bi alb&uuml;m oluşturun veya fotoları bilgisayarınızdan veya Synology NAS'dan mevcut alb&uuml;mlere y&uuml;kleyin.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/4.png" border="1"/>

<div class="code_div">
<b>Not:</b>
<p>Eğer fotoları Photo Station aray&uuml;z&uuml;n&uuml; kullanarak y&uuml;klemek isterseniz, QuickConnect servisinin etkinleştirilmesi &ouml;nemle tavsidye edilir. İster evde olun ister dışarıda QuickConnect, iletme kuralları gibi karmaşık ağ yapılandırmaları kurulumunu yapmanıza gerek kalmadan &ouml;zel ID kullanaral Synology NAS ve Photo Station'a internet &uuml;zerinden istediğiniz yerden giriş yapabilmenize olanak sağlar. QuickConnect hakkında ayrıntılı bilgi i&ccedil;in, l&uuml;tfen <a class="launch-app" href="cloud_set_up_quickconnect.html">bu kılavuza</a> bakınız.</p>
</div>

<h3 class="list_head">3. Fotoğraf Paylaş</h3>
<p>Paylaşım &ouml;zelliği ile,Photo Station'a kaydedilen fotoları arkadaşlarınız ile kolaylıkla paylaşabilir veya fotoları Facebook, Picasa ve Flickr gibi sosyal ağlara y&uuml;kleyebilirsiniz.</p>

<h4>3.1 Fotoları genel paylaş</h4>
<ol>
<li>Bir alb&uuml;me g&ouml;z atın ve paylaşmak istediğiniz fotoları se&ccedil;in.</li>
<li><b>Paylaş</b> &gt; <b>Herkesle paylaş</b> &uuml;zerine tıklayarak linki alın.</li>
<ul>
<li>Eğer paylaşacak bir foto se&ccedil;tiyseniz, video <b>Paylaşılan Fotolar</b> adındaki varsayılan paylaşılan alb&uuml;me eklenecektir. Burada, paylaştığınız t&uuml;m fotoları birer birer y&ouml;netebilirsiniz.</li>
<li>Eğer paylaşacak birden fazla foto se&ccedil;tiyseniz, fotolar yeni paylaşılan alb&uuml;me gruplanacaktır.</li>
</ul>
<li>Alternatif olarak, aynı zamanda <b>Paylaş</b> &gt; <b>Paylaşılan alb&uuml;me ekle</b> &uuml;zerine tıklayarak se&ccedil;tiğiniz fotoları mevcut paylaşılan alb&uuml;me ekleyin (varsa).</li>
<img src="../../images/ManagePhotos/1x/manage_share_photos/5.png" border="1"/>
<li>Yeni paylaşılan alb&uuml;me bir ad verin ve gerekirse bir ge&ccedil;erlilik s&uuml;resi belirleyin.</li>
<li>Linki kopyalayıp epostalara, anlık mesajlara ve web sayfalarına yapıştırarak fotoları herkes ile paylaşmaktır.</li>
</ol>

<div class="code_div">
<b>Not:</b>
<ul>
<li>Paylaşılan t&uuml;m fotolar linke sahip herhangi bir kişi tarafından genel olarak paylaşılmalıı.</li>
<li>Hangi kullanıcıların Photo Station &ouml;ğelerini <b>Ayarlar</b> &gt; <b>Paylaşma</b> &uuml;zerinden herkesle paylaşma &ouml;nceliğine sahip olacaklarını belirleyebilirsiniz.</li>
</ul>
</div>

<h4>3.2 Fotoları sosyal ağlar ile paylaşın</h4>
<ol>
<li>Karşıya y&uuml;klemek istediğiniz fotoğrafları se&ccedil;in ve ardından <b>Paylaş</b> &gt; <b>[Sosyal ağ web sitelerine] karşıya y&uuml;kle</b>'yi se&ccedil;in.</li>

<img src="../../images/ManagePhotos/1x/manage_share_photos/6.png" border="1"/>

<li>Beliren pencerede, <b>[Sosyal ağ web siteleri] ile bağlan</b>'a tıklayın ve ardından sosyal ağ hesabınızla yetkilendirin. Fotoları yeni veya mevcut alb&uuml;me y&uuml;klemek i&ccedil;in se&ccedil;ebilrsiniz.</li>
</ol>

<h3 class="list_head">4. Fotoları Mobil Cihazlarda D&uuml;zenleyin ve G&ouml;zatın</h3>
<p>Photo Station'a bağlanmak veya fotoları mobil cihazları kullanarak y&uuml;klemek i&ccedil;in, aşağıdaki QR kodları ile birlikte mobil cihazlarınıza <b>DS photo+</b>'ı y&uuml;kleyebilirsiniz.</p>

<img src="../../images/ManagePhotos/1x/manage_share_photos/7.png"/>


</div>

</body>
</html>