<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>NAS'ınızı g&uuml;vence altına alın</title>
</head>

<body class="tutorial-content-box" >

<h1>Synology NAS'ınızı g&uuml;vence altına alın</h1>
<div class="tutorials_content">
<p><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/Intro.jpg" /></p>
<h2>Genel Bakış</h2>
<p>DSM, Security Advisor adında Synology NAS'ınızın g&uuml;venliğini sağlayan yenib bir &ouml;zelliktir. Security Advisor, Synology NAS'ınızın t&uuml;m yapılandırmasını tarar ve g&uuml;venlik durumu hakkında ayrıntılı raporlar sunar. Ek olarak, Security Advisor tanımlanan g&uuml;venlik risklerini nasıl y&ouml;neteceğinizi de g&ouml;sterecektir. Security Advisor'ı a&ccedil;ın ve şunları &ouml;ğrenin:</p>
<ul>
  <li>Bir g&uuml;venlik taraması &ccedil;alıştırın</li>
  <li>G&uuml;venlik kuralı raporlarını g&ouml;r&uuml;nt&uuml;leyin</li>
  <li>G&uuml;venik risklerini y&ouml;netin</li>
</ul>

<h3 class="list_head">1. Bir G&uuml;venlik Taraması &ccedil;alıştırın </h3>
<ol>
	<li>Security Advisor' ilk kez a&ccedil;tığınızda, Synology NAS'ınızı ne ama&ccedil; doğrultusunda kullanacağınız sorulacaktır. Durumunuza bağlı olarak <strong>Ev</strong> veya <strong>İş</strong>'den birini se&ccedil;in ve <strong>Tamam</strong>'a tıklayın. Bu ayarı ileride daima <strong>Gelişmiş</strong> sayfasından değiştirebilirsiniz.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/01.png" />
	<li>Security Advisor, Synology NAS yapılandırmanızı taramaya başlayacaktır. Genel g&uuml;venlik durumunu, program taraması ve sonu&ccedil; &ouml;zetlerini <strong>Genel bakış</strong> sayfasında g&ouml;r&uuml;nt&uuml;leyebilirsiniz.</li><img alt="" style="display:block;"   width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/02.png" />
	<li>Tarama sona erdiğinde, g&uuml;venlik kurallarının her bir kategorisinin sonu&ccedil;ları g&ouml;sterilir. Security Advisor her bir kategori i&ccedil;in bir genel bakış sağlayacak ve g&uuml;venlik riski bulgularını &ouml;zetleyecektir. </li><img alt="" style="display:block;" width="680" height="391"  src="../../images/SecureNAS/1x/Secure_NAS/03.png" />
</ol>
<h3 class="list_head">2. G&uuml;venlik Kuralı Raporlarını G&ouml;r&uuml;nt&uuml;le</h3>
<ol>
<li><strong>Sonu&ccedil;ları G&ouml;ster</strong>'a <strong>Genel bakış</strong> sayfasından tıklayın.<strong> </strong>Tamamladığınız taramanına ayrıntılı bilgilerini rapor bazında g&ouml;r&uuml;nt&uuml;leyebilirsiniz.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/04.png" />
<li>Ayrıntılı raporu a&ccedil;mak i&ccedil;in herhangi bir g&uuml;venlik kuralına &ccedil;ift tıklayın. Her raporda <strong>Şiddet</strong>, <strong>A&ccedil;ıklama</strong>, <strong>Ayrıntılar</strong> hakkında bilgiler ile her g&uuml;venlik kuralı i&ccedil;in <strong>&Ouml;nerilen Eylem</strong> g&ouml;sterilir.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/05.png" />
</ol>

<h3 class="list_head">3. G&uuml;venik Risklerini Y&ouml;netin</h3>
<p>Ortalama başarısız g&uuml;venlik kuralının bir &ouml;rneğine bakalım ve nasıl y&ouml;neteceğimizi inceleyelim.</p>
<ol>
<li>Security Advisor, başarısız olan g&uuml;venlik kuralı i&ccedil;in olası g&uuml;venlik risklerini tanımlayacaktır.  Burada, Security Advisor &quot;Oto Engelle'nin devre dışı olduğunu algılar.&quot;</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/06.png" />
<li>Ayrıntılı bilgileri okumak i&ccedil;in bir başarısız g&uuml;venlik kuralı a&ccedil;ın. <strong>&Ouml;nerilen Eylem</strong> kısmında, Security Advisor bu g&uuml;venlik riskini nasıl y&ouml;neteceği hakkında kılavuzluk eder.</li><img alt="" style="display:block;"   src="../../images/SecureNAS/1x/Secure_NAS/07.png" />
<li><strong>A&ccedil;</strong> &uuml;zerine tıklayarak doğrudan ilgilia yarlar sayfasına gidin ve <strong>&Ouml;nerilen Eylem</strong>'i izleyin.</li>
<li><strong>Sonu&ccedil;lar</strong> sayfasında, kuralı se&ccedil;erek başarısız olan g&uuml;venlik kuralını yeniden tarayın ve <strong>Tara</strong> &uuml;zerine tıklayın.</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/08.png" />
<li>Bu g&uuml;venlik kuralı i&ccedil;in hi&ccedil;bir g&uuml;venlik riski saptanmamıştır. Security Advisor olası g&uuml;venlik risklerini tanımlamanıza yardım etmeye devam edecektir ve b riskleri y&ouml;netmek i&ccedil;in eylemler &ouml;nerir. Security Advisor'da d&uuml;zenli taramalar yaparak Synology NAS'ı g&uuml;vende tutun!</li><img alt="" style="display:block;"  width="680" height="391" src="../../images/SecureNAS/1x/Secure_NAS/09.png" />
</ol>
</div>

</body>

</html>
