<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Dosyaları Windows PC'den yerel ağdaki Synology NAS'a kaydetmek</title>
</head>

<body class="tutorial-content-box" >

<h1>Dosyaları Windows PC'den yerel ağdaki Synology NAS'a kaydetmek</h1>
<div class="tutorials_content">
<img src="../../images/StoreFiles/1x/store_with_windows/How_to_Access_Shared_Folders_on_Synology_NAS_within_the_Local_Network_Windows.jpg"/>
<h2>Genel Bakış</h2>
<p>Synology NAS yerel ağdaki dosyaları saklamanızı ve paylaşmanızı hızlı ve basit hale getirerek DSM'yer her defasında giriş yapmanıza gerek kalmadan Synology NAS'deki doğrudan paylaşılan klas&ouml;re ve dosyalara erişmenize olanak sağlar. &Ouml;rneğin, dosyaları ağ cihazlarında olduğu gibi Windows Explorer ile birlikte Synology NAS'a saklayabileceksiniz.</p>

<h3 class="list_head">Windows Explorer ile haritala</h3>
<ol>
<li>Bir Windows Explorer penceresi a&ccedil;ın ve <b>Bilgisayar</b>'a gidin.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image1.png"/>
<li><b>Harita ağ s&uuml;r&uuml;c&uuml;s&uuml;</b> &uuml;zerine tıklayın. Bu eylem Harita Ağ S&uuml;r&uuml;c&uuml;s&uuml; penceresinin g&ouml;r&uuml;n&uuml;r olmasını sağlar.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image2.png"/>
<li>Harita Ağ S&uuml;r&uuml;c&uuml;s&uuml; penceresinde, <b>S&uuml;r&uuml;c&uuml;</b> indirmeli men&uuml;s&uuml;nden bir s&uuml;r&uuml;c&uuml; harfi se&ccedil;in.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image3.png"/>
<li><b>Klas&ouml;r</b> alanından, Synology NAS'ınızın bir sunucu adını girin ve paylaşılan klas&ouml;r adı ters slaş kullanılara belirlenmeli ve ayrılmalıdır. &Ouml;rneğin, Synology NAS'ınızın sunucu adı &quot;DiskStation,&quot; ise ve paylaşılan klas&ouml;r&uuml;n adı &quot;Share1&quot; ise, bu durumda &quot;\\DiskStation\Share1 girmelisiniz&quot;. Hazır olduğunuzda <b>Bitir</b> &uuml;zerine tıklayın.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image4.png"/>
<li>DSM kullanıcı adınızı ve parolanızı girin.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image5.png"/>
<div class="code_div"><b>Paylaşılan Klas&ouml;re erişemiyor musunuz?</b> Buraya girdiğiniz kullanıcı hesabı paylaşılan klas&ouml;r ve erişmek hakkı i&ccedil;inse, erişim &ouml;nceliklerine sahip olmalıdır.</div>
<li>Son olarak, bir Windows Explorer penceresi g&ouml;r&uuml;n&uuml;r. Paylaşılan klas&ouml;r&uuml;n&uuml;z artık haritalanacak ve <b>Bilgisayar</b>'dan erişilebilecektir.</li>
<img src="../../images/StoreFiles/1x/store_with_windows/image6.png"/>
</ol>
</div>
<div class="page-info">
  <ul>
    <li>Bu konudaki sonraki: <a href="store_with_mac.html">Dosyaları yerel ağda Mac bilgisayardan Synology NAS'a kaydetmek</a> </li>
  </ul>
</div>



</body>

</html>
