<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2>Configurer le centre de paquets</h2>
<h4>Pour g&eacute;rer quels paquets sont autoris&eacute;s a &ecirc;tre install&eacute; :</h4>
<ol>
<li>Sous l&apos;onglet <strong>G&eacute;n&eacute;ral</strong>, choisissez les options suivantes pour configurer votre <strong>Niveau de confiance</strong> d&eacute;sir&eacute; :</li>
<ul>
<li><strong>Synology Inc.</strong>: Autoriser uniquement les paquets fournis par Synology Inc.</li>
<li><strong>Synology Inc. et les &eacute;diteurs de confiance</strong>: Autoriser uniquement les paquets fournis par Synology Inc.et les &eacute;diteurs de confiance. Les &eacute;diteurs de confiance se compose d&apos;&eacute;diteurs qui ont soit obtenu la confiance d&apos;une communaut&eacute; tierce via l&apos;ajout d&apos;une source de paquet ou sont de confiance par l&apos;utilisateur via l&apos;importation du certificat de l&apos;&eacute;diteur.</li>
<li><strong>N&apos;importe quel &eacute;diteur</strong>: Autorise l&apos;installation de n&apos;importe quel paquet en ce qui concerne l&apos;&eacute;diteur et l&apos;int&eacute;grit&eacute;.</li>
</ul>
<li>Cliquez sur <strong>OK</strong>.</li>
</ol>

<h4>Pour importer un certificat d&apos;un &eacute;diteur de confiance&nbsp;:</h4>
<ol>
<li>Sous l&apos;onglet <strong>Certificat</strong>, cliquez sur <b>Importer</b>. </li>
<li>Cliquez sur <strong>Parcourir</strong> et s&eacute;lectionnez le certificat de l&apos;&eacute;diteur de confiance.</li>
<li>Cliquez sur <strong>OK</strong>. </li>
</ol>

<h4>Pour mettre &agrave; jour le certificat Synology Inc.&apos;s :</h4>
<p>Lorsque vous vous connectez &agrave; Internet, le certificat Synology Inc.&apos;s sera mis &agrave; jour automatiquement pendant le processus d&apos;installation du paquet. Pour mettre &agrave; jour manuellement :</p>
<ol>
<li>Sous l&apos;onglet <strong>Certificat</strong>, cliquez sur <b>Importer</b>. </li>
<li>Cliquez sur <strong>Parcourir</strong> et s&eacute;lectionnez le certificat Synology Inc.&apos;s qui peut &ecirc;tre t&eacute;l&eacute;charg&eacute; via le <a href="http://www.synology.com/support/download" target="_blank">site web de Synology</a>.</li>
<li>Cliquez sur <strong>OK</strong>. </li>
</ol>
<h4>Pour activer les notifications sur les mises &agrave; jour des paquets&nbsp;:</h4>
<ol>
<li>Cliquez sur l&rsquo;onglet <b>Notification</b>, puis cochez <b>Activer la notification par courriel</b> et/ou <b>Activer les notifications sur le bureau</b>. La premi&egrave;re option permet &agrave; DSM de vous envoyer des e-mails lorsque de nouvelles mises &agrave; jour sont disponibles, tandis que la seconde permet &agrave; DSM d&apos;afficher un message de notification dans le coin sup&eacute;rieur droit de votre bureau de DSM.</li>
<li>Cliquez sur <b>OK</b>.</li>
</ol>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Pour que les notifications par courriel prennent effet, configurez d&apos;abord vos param&egrave;tres de notification par courriel de DSM (&agrave; <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>Notification</b>).</p></div>

<h4>Pour ajouter une ressource de paquet fournie par une communaut&eacute; tierce&nbsp;:</h4>
<ol>
<li>Cliquez sur l&apos;onglet <b>Sources de paquets</b>, cliquez sur <strong>Ajouter</strong>, puis entrez le nom et l&apos;emplacement de vos sources de paquet. <br>L&apos;emplacement peut &ecirc;tre une URL que vous avez trouv&eacute;e sur Internet fournie par un d&eacute;veloppeur/&eacute;diteur tiers ou une communaut&eacute;.</li>
<li>Cliquez sur <b>OK</b>. Quand la source du paquet est ajout&eacute;e avec succ&egrave;s, vous verrez une liste de paquets dans l&apos;onglet <strong>Communaut&eacute;</strong>. </li>
</ol>

</body>
</html>
