<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM mobile</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script> <script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>DSM mobile</h1>

<p>DSM mobile, DSM <b>admin</b> kullanıcısının (veya <b>administrators</b> grubuna dahil bir kullanıcının) bir iOS<sup>&reg;</sup> (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup> veya iPod touch<sup>&reg;</sup>) ya da Android<sup>&reg;</sup> aygıtla DSM ayarlarını y&ouml;netmesine ve DSM bilgilerini kontrol etmesine olanak sağlar. Bu DSM mobile Yardımı, başlangı&ccedil;ta yardımcı olmak i&ccedil;in size aşağıdaki başlıkları ve kaynakları sunar.</p>

<h2>Oturum A&ccedil;ma ve Oturum Kapatma</h2>

<div name="contents" id="login">
<p>iOS veya Android aygıtınızdaki web tarayıcısıyla DSM'ye bağlandıktan sonra, DSM hesap bilgilerinizi girebileceğiniz oturum a&ccedil;ma ekranını g&ouml;receksiniz.</p>

<h4>DSM mobile oturumu a&ccedil;mak i&ccedil;in:</h4>
<p>DSM kullanıcı bilgilerinizi girin ve <b>Oturum a&ccedil;</b>'a dokunun. Oturum a&ccedil;ma bilgilerinizi kaydederek sonraki seferde otomatik olarak oturum a&ccedil;mak isterseniz, oturum a&ccedil;madan &ouml;nce <b>Beni hatırla</b> anahtarını a&ccedil;ık konuma getirin.</p>

<h4>DSM mobile oturumunu kapatmak i&ccedil;in:</h4>
<ol>
  <li>Ana sayfanın (iPhone/iPod touch or Android phone) veya sol panelin (iPad or Android tablet) sağ &uuml;st k&ouml;şesinde bulunan se&ccedil;enek d&uuml;ğmesine dokunun.</li>
  <li><b>Ayarlar</b>'a dokunun ve <b>Oturumu Kapat</b>'a dokunun.</li>
</ol>
</div>

<h2>DSM Kullanıcılarını Y&ouml;netin</h2>

<div name="contents" id="user">
<p>Kullanıcı listesini g&ouml;rmek i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol paneldeki (iPad veya Android tablet) <b>Kullanıcı &amp; Grup</b> &uuml;zerine dokunun.</p>

<h4>Bir kullanıcı oluşturmak i&ccedil;in:</h4>
<ol>
  <li><b>+</b> &uuml;zerine dokunun ve ardından yeni kullanıcının kullanıcı adını, parolasını ve e-posta adresini girin.</li>
  <li>Kendisine ait DSM kullanıcı hesapları oluşturulduğunda kullanıcının e-posta adresine bildirim postası g&ouml;ndermek i&ccedil;in <b>Bildirim G&ouml;nder</b> se&ccedil;eneğini etkinleştirin.<br><span class="note_head">Not: </span>Bildirim g&ouml;ndermeden &ouml;nce, Synology NAS sunucunuz &uuml;zerindeki bildirim ayarlarının tamamlandığından emin olun. Bilgisayarınızın web tarayıcısı ile DSM'de oturum a&ccedil;ın ve ayarları değiştirmek i&ccedil;in <b>Ana Men&uuml;</b> &gt; <b>Denetim Masası</b> &gt; <b>Bildirim</b> &gt; <b>E-posta</b> se&ccedil;eneğine gidin.</li>
  <li>Onaylamak i&ccedil;in <b>Bitir</b> veya iptal etmek i&ccedil;in sol ok &uuml;zerine dokunun.</li>
</ol>

<h4>Bir kullanıcıyı hızla bulmak i&ccedil;in:</h4>
<p>Arama alanına kullanıcının adını yazın.</p>

<h4>Bir kullanıcının bilgilerini değiştirmek i&ccedil;in:</h4>
<ol>
  <li>Kullanıcının adına dokunun ve aşağıdakilerden birini yapın:
    <ul>
      <li><b>Ad</b> veya <b>Parola</b> alanında kullanıcının adını veya parolasını değiştirin.</li>
    <li>Kullanıcıyı devre dışı bırakmak i&ccedil;in <b>Devre dışı bırak</b> &uuml;zerine dokunun. Ayarlarını kaybetmeksizin daha sonra kullanıcıyı etkinleştirmeyi tercih edebilirsiniz.</li>
    <li>Kullanıcıyı <b>admin</b> grubuna eklemek i&ccedil;in <b>Administrator</b> &ouml;ğesini a&ccedil;ık konuma getirin. <b>admin</b> grubuna dahil olan bir kullanıcıya DSM mobile ya da bilgisayarlarının web tarayıcısı ile DSM ayarlarını değiştirme y&ouml;netici ayrıcalığı verilecektir.</li>
    </ul>
  </li>
  <li><b>Ayrıcalıklar</b> altında aşağıdakilerden birini yapın ve ardından <b>Geri</b>'ye dokunun:
    <ul>
      <li><b>Paylaşımlı Klas&ouml;r</b> &uuml;zerine dokunun ve kullanıcının erişim ayrıcalığını değiştirmek i&ccedil;in bir paylaşımlı klas&ouml;r adına dokunun: <b>Oku/Yaz</b>: Kullanıcı paylaşımlı klas&ouml;rdeki dosya ve alt klas&ouml;rlerde değişiklik yapabilir; <b>Salt okunur</b>: Kullanıcı paylaşımlı klas&ouml;rdeki dosya ve alt klas&ouml;rlere erişebilir ancak bunlarda değişiklik yapamaz; <b>Erişim yok</b>: Kullanıcı paylaşımlı klas&ouml;rdeki dosya ve alt klas&ouml;rlere erişemez.<br><span class="note_head">Not: </span>Ayrıcalık &ccedil;akışması olursa, ayrıcalık &ouml;nceliği ş&ouml;yle olacaktır: <span class="note_content">Erişim yok&gt; Oku/Yaz &gt; Salt oku</span>.</li>
      <li>Kullanıcının DSM uygulamalarına erişim ayrıcalığını değiştirmek i&ccedil;in <b>Uygulama</b> &uuml;zerine dokunun.</li>
    </ul>
  </li>
  <li>Onaylamak i&ccedil;in <b>Bitir</b> veya iptal etmek i&ccedil;in sol ok &uuml;zerine dokunun.</li>
</ol>
</div>

<h2>Paylaşımlı Klas&ouml;rleri Y&ouml;netin</h2>

<div name="contents" id="shared">
<p>Synology NAS sunucunuz &uuml;zerindeki paylaşımlı klas&ouml;rlerin listesini g&ouml;rmek i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol paneldeki (iPad veya Android tablet) <b>Paylaşımlı Klas&ouml;r</b> &uuml;zerine dokunun.</p>

<h4>Bir paylaşımlı klas&ouml;r oluşturmak i&ccedil;in:</h4>
<ol>
  <li><b>+</b> &uuml;zerine dokunun ve ardından yeni klas&ouml;r&uuml;n adını girin.</li>
  <li>Onaylamak i&ccedil;in <b>Bitir</b> veya iptal etmek i&ccedil;in sol ok &uuml;zerine dokunun.</li>
</ol>

<h4>Bir paylaşımlı klas&ouml;r&uuml; değiştirmek i&ccedil;in:</h4>
<p>Paylaşımlı klas&ouml;r&uuml;n adına dokunun ve aşağıdakilerden birini yapın:</p>
<ul>
  <li><b>Ad</b> alanında paylaşımlı klas&ouml;r&uuml;n adını değiştirin.</li>
  <li><b>Kullanıcı İzinleri</b> &uuml;zerine dokunun ve paylaşımlı klas&ouml;re erişim ayrıcalığını değiştirmek i&ccedil;in bir kullanıcıya dokunun: <b>Oku/Yaz</b>: Kullanıcı paylaşımlı klas&ouml;rdeki dosya ve alt klas&ouml;rlerde değişiklik yapabilir; <b>Salt okunur</b>: Kullanıcı paylaşımlı klas&ouml;rdeki dosya ve alt klas&ouml;rlere erişebilir ancak bunlarda değişiklik yapamaz; <b>Erişim yok</b>: Kullanıcı paylaşımlı klas&ouml;rdeki dosya ve alt klas&ouml;rlere erişemez.<br><span class="note_head">Not: </span>Ayrıcalık &ccedil;akışması olursa, ayrıcalık &ouml;nceliği ş&ouml;yle olacaktır: <span class="note_content">Erişim yok&gt; Oku/Yaz &gt; Salt oku</span>.</li>
  <li>Ayrıca gruplar i&ccedil;in ayrıcalıkları yapılandırmak &uuml;zere <b>Grup İzinleri</b> &uuml;zerine de dokunabilirsiniz.<br><span class="note_head">Not: </span>Grup izinlerinin kullanıcı izinlerine g&ouml;re daha y&uuml;ksek &ouml;nceliği vardır.</li>
</ul>
</div>

<h2>Hizmetleri Etkinleştirin</h2>

<div name="contents" id="services">
<p>Synology NAS hizmetlerini etkinleştirmek veya devre dışı bırakmak i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol paneldeki (iPad veya Android tablet) <b>Hizmet</b> &uuml;zerine dokunun.</p>

<h4>Synology NAS'ın LAN hizmetlerini y&ouml;netmek i&ccedil;in:</h4>
<ul>
  <li>Aşağıdakilerden herhangi birini etkinleştirin veya devre dışı bırakın:
    <ul>
      <li><b>Windows Dosya Hizmeti</b>, Synology NAS sunucunuzun LAN i&ccedil;inde bir Windows (CIFS) dosya sunucusu olmasını sağlar.</li>
      <li><b>Mac Dosya Hizmeti</b>, Synology NAS sunucunuzun LAN i&ccedil;inde bir Mac (AFP) dosya sunucusu olmasını sağlar.</li>
      <li><b>NFS Hizmeti</b>, LAN i&ccedil;indeki Linux istemcinin Synology NAS verilerine erişmesini sağlar.</li>
      <li><b>Bonjour Yazıcı</b>, Mac istemcilerin Synology NAS sunucuza bağlı USB yazıcılara yazdırmasını sağlar.</li>
      <li><b>Medya Sunucusu</b> LAN i&ccedil;indeki DLNA/UPnP ev cihazlarının Synology NAS sunucunuz &uuml;zerindeki multimedya i&ccedil;eriğine g&ouml;zatmasını ve y&uuml;r&uuml;tmesini sağlar.</li>
      <li><b>iTunes</b>, LAN i&ccedil;indeki iTunes istemcilerin Synology NAS sunucunuz &uuml;zerindeki m&uuml;zik ve videolara g&ouml;zatmasını ve y&uuml;r&uuml;tmesini sağlar.</li>
    </ul>
  </li>
</ul>

<h4>Synology NAS'ın İnternet Hizmetlerini y&ouml;netmek i&ccedil;in:</h4>
<ul>
  <li>Aşağıdakilerden herhangi birini etkinleştirin veya devre dışı bırakın:
    <ul>
      <li><b>FTP</b>, Synology NAS sunucunuzun bir FTP sunucusu olmasını sağlar.</li>
      <li><b>Web Hizmetleri</b> Synology NAS sunucunuz &uuml;zerinde web siteleri (PHP+MySQL desteği ile) barındırmanızı sağlar.</li>
      <li><b>WebDAV</b>, istemci programların HTTP protokol&uuml; vasıtasıyla Synology NAS dosyalarını y&ouml;netmesini ve d&uuml;zenlemesini sağlar.</li>
      <li><b>WebDAV (HTTPS)</b>, istemci programların HTTPS protokol&uuml; vasıtasıyla Synology NAS dosyalarını y&ouml;netmesini ve d&uuml;zenlemesini sağlar.</li>
      <li><b><a name="filestationservice"></a>File Station</b>, DSM oturumu a&ccedil;maksızın &ouml;zelleştirilmiş bir bağlantı noktası &uuml;zerinden Synology NAS dosyalarını y&ouml;netmenizi sağlayan web tabanlı bir uygulamadır.</li>
      <li><b>File Station (HTTPS)</b> File Station'a HTTPS protokol&uuml; yoluyla bağlanmanızı sağlar.</li>
      <li><b>Surveillance Station</b>, ev veya ofis ortamınızı korumak &uuml;zere IP kameraları y&ouml;netebilen web tabanlı bir uygulamadır.</li>
      <li><b>Audio Station</b>, Synology NAS sunucunuz &uuml;zerindeki m&uuml;zik kitaplığına erişmenizi sağlayan web tabanlı bir uygulamadır.</li>
      <li><b>Photo Station</b>, Synology NAS sunucunuz &uuml;zerinde kaydedilmiş t&uuml;mleşik bir bloga sahip &ccedil;evrimi&ccedil;i bir fotoğraf alb&uuml;m&uuml;d&uuml;r.</li>
      <li><b><a name="downloadsationservice"></a>Download Station</b> (BT/HTTP/FTP/NZB/RSS), İnternetten Synology NAS sunucunuza dosya indirmenizi sağlayan web tabanlı bir uygulamadır.</li>
      <li><b>eMule</b> Download Station'ın eMule desteğini etkinleştirir.</li>
    </ul>
  </li>
</ul>

<div class="section">
<h4>Not:</h4>
<p>Yukarıdaki hizmetler hakkında daha fazla bilgi i&ccedil;in aşağıdakilerden birine bakın:</p>
	<ul>
		<li><b>DSM Yardım</b> (bilgisayarınızın web tarayıcısı ile DSM'nin masa&uuml;st&uuml; s&uuml;r&uuml;m&uuml;nde oturum a&ccedil;ıp <b>Ana Men&uuml;</b> &gt; <b>DSM Yardım</b> se&ccedil;eneğine giderek kullanılabilir)</li>
		<li><b>Synology DSM Kullanım Kılavuzu</b> (Synology'nin <a href="http://www.synology.com/support/download.php" target="_blank">İndirme Merkezi</a>'nde bulunabilir)</li>
	</ul>
</div>

<h2>Sistem Kaynaklarını İzleyin</h2>

<div name="contents" id="resourcemonitor">
<p>Synology NAS sunucunuzun CPU ve bellek kullanımını izlemek i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol paneldeki (iPad veya Android tablet) <b>Kaynak Monit&ouml;r&uuml;</b> &uuml;zerine dokunun.</p>
</div>

<h2>Sistem Bilgisini G&ouml;r&uuml;nt&uuml;leyin</h2>

<div name="contents" id="sysinfo">
<p>Synology NAS sunucunuzun bir durum &ouml;zetini almak i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol paneldeki (iPad veya Android tablet) <b>Sistem Bilgisi</b> &uuml;zerine dokunun.</p>

<h4>Synology NAS sunucunuzun sistem bilgisini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in:</h4>
<ol>
  <li>Aşağıdakilerden birini yapın:
    <ul>
      <li>Seri numarası, model adı, fiziksel bellek miktarı, DSM s&uuml;r&uuml;m&uuml;yle birlikte zaman bilgisi ve ısı durumu dahil Synology NAS sunucunuz hakkında temel bilgiler g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <b>Genel</b> &uuml;zerine dokunun.</li>
      <li>Synology NAS sunucunuzun ağ yapılandırmasını ve herbir ağ aray&uuml;z&uuml;n&uuml;n durumunu g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <b>Ağ</b> &uuml;zerine dokunun.</li>
      <li>Synology NAS'ın birim kullanımını g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <b>Depolama</b> &uuml;zerine dokunun.</li>
    </ul>
  </li>
  <li>Sistem bilgisini g&uuml;ncel tutmak i&ccedil;in sağ &uuml;st k&ouml;şedeki <b>Yenile</b> d&uuml;ğmesine dokunun.</li>
</ol>
</div>

<h2>Donanım yazılımı</h2>

<div name="contents" id="firmware">
<p>DSM s&uuml;r&uuml;m&uuml;n&uuml;z&uuml; g&ouml;r&uuml;nt&uuml;leyip g&uuml;ncellemek i&ccedil;in <b>Donanım Yazılımı</b> &uuml;zerine dokunun.</p>

<h4>DSM y&uuml;kseltme ayarlarını yapılandırmak i&ccedil;in:</h4>
<ol>
  <li><strong>DSM Y&uuml;kseltmesi</strong> &uuml;zerine dokunun.</li>
  <li>Aşağıdaki se&ccedil;eneklerden birini se&ccedil;in:
    <ul>
      <li>Sadece &ouml;nemli g&uuml;ncellemeler</li>
      <li>En yeni DSM ve t&uuml;m g&uuml;ncellemeler</li>
    </ul>
  </li>
  <li><strong>Bitti</strong>'ye dokunun.</li>
</ol>

<h4>Mevcut g&uuml;ncellemeleri indirmek i&ccedil;in:</h4>
<ol>
  <li><strong>Durum</strong> &ouml;ğesinde DSM s&uuml;r&uuml;m&uuml;n&uuml;z&uuml; kontrol edin.</li>
  <li>DSM s&uuml;r&uuml;m&uuml;n&uuml;z g&uuml;ncel değilse, DSM'nizi y&uuml;kseltmek i&ccedil;in <strong>Durum</strong> b&ouml;l&uuml;m&uuml;nde g&ouml;z&uuml;kecek <strong>İndir</strong> d&uuml;ğmesine dokunun.</li>
</ol>
</div>

<h2>IP Engellemeyi Y&ouml;netme</h2>

<div name="contents" id="block">
<p>Yetkisiz oturum a&ccedil;mayı &ouml;nlemek i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol panelde (iPad veya Android tablet) bulunan <b>IP Engelleme</b>'ye dokunun.</p>

<h4>IP engellemeyi y&ouml;netmek i&ccedil;in:</h4>
<ol>
  <li>Sağ &uuml;st k&ouml;şedeki yapılandırma d&uuml;ğmesine dokunun.</li>
  <li>IP Engellemeyi etkinleştirmek i&ccedil;in <b>Otomatik engellemeyi etkinleştir</b> se&ccedil;eneğini a&ccedil;ık konuma getirin.</li>
  <li>Belirlenen dakika sayısı i&ccedil;inde yapılan belirlenen başarısız oturum a&ccedil;ma girişimlerinden sonra IP adresini engellemek i&ccedil;in <b>Oturum a&ccedil;ma sayısı</b> ve <b>S&uuml;re i&ccedil;inde (dakika)</b> girişlerini yapın.</li>
  <li>Belirlenen g&uuml;n sayısından sonra bir IP adresinin engellemesini kaldırmak i&ccedil;in <b>Engelleme s&uuml;re dolumunu etkinleştir</b> se&ccedil;imi yapıp <b>Engellemeyi sonra kaldır (g&uuml;n)</b> sayısını belirleyebilirsiniz. Buraya &quot;0&quot; girerseniz Engellenmiş IP adresi, engelleme listesinden &ccedil;ıkarılana kadar s&uuml;resiz olarak engellenmiş kalacaktır.</li>
  <li><b>Bitir</b>'e dokunun.</li>
</ol>

<h4>IP adreslerini izin/engelleme listesine eklemek i&ccedil;in:</h4>
<ol>
  <li>İzin/engelleme IP'sini listeye eklemek istiyorsanız, sağ &uuml;st k&ouml;şedeki ekle d&uuml;ğmesine dokunun ve <b>İzin Listesi</b> veya <b>Engelleme Listesi</b> &uuml;zerine dokunun.</li>
  <li>IP adresini girdikten sonra, <b>Bitir</b> &uuml;zerine dokunun.</li>
</ol>
</div>

<h2>Paket Merkezini Y&ouml;netin</h2>

<div name="contents" id="package">

<p>Synology kolaylıkla Synology NAS &uuml;zerine y&uuml;klenebilen ve etkinleştirilebilen &uuml;&ccedil;&uuml;nc&uuml; taraf ya da Synology tasarımı uygulamaları paketlerde b&uuml;t&uuml;nleştirmiştir.</p>

<h4>Paket Merkezini y&ouml;netmek i&ccedil;in:</h4>
<p>Paket bilgilerini g&ouml;r&uuml;nt&uuml;lemek, paketleri &ccedil;alıştırmak veya durdurmak veya en yeni s&uuml;r&uuml;mlere g&uuml;ncellemek i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol panelde (iPad veya Android tablet) bulunan <strong>Paket Merkezi</strong>'ne dokunun.</p>


<h4>Y&uuml;kl&uuml; paketleri &ccedil;alıştırmak veya durdurmak i&ccedil;in:</h4>
<p>&Ccedil;alıştırmak veya durdurmak i&ccedil;in bir paketin yanındaki d&uuml;ğmeye dokunun.</p>

<h4>Paketleri g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in: </h4>
<p>Bilgilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in bir pakete dokunun.</p>
     
<h4>Paketleri g&uuml;ncellemek i&ccedil;in:</h4>
<ol>
	<li>Mevcut olan g&uuml;ncelleme versiyonlarını g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <strong>G&uuml;ncelle</strong> sekmesine dokunun.</li>
    <li>En yeni s&uuml;r&uuml;me g&uuml;ncellemek i&ccedil;in bir paketin sağ tarafındaki d&uuml;ğmeye dokunun.</li>   
</ol>
</div>    

<h2>G&uuml;nl&uuml;kleri veya Ge&ccedil;erli Bağlantıları G&ouml;r&uuml;nt&uuml;leyin</h2>

<div name="contents" id="log">
<p>Ge&ccedil;erli bağlantıları izlemek veya Synology NAS hizmetlerinin g&uuml;nl&uuml;klerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol panelde (iPad veya Android tablet) bulunan <b>G&uuml;nl&uuml;k</b>'e dokunun.</p>

<h4>Ge&ccedil;erli bağlantıları izlemek i&ccedil;in:</h4>
<ul>
  <li>Son d&ouml;nemde Synology NAS hizmetlerine erişmekte olan kullanıcıların listesini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in <b>Genel Bakış</b> b&ouml;l&uuml;m&uuml;nde <b>En yeni [number] g&uuml;nl&uuml;kler</b>'e dokunun.</li>
</ul>

<h4>Belirli hizmetin g&uuml;nl&uuml;k kayıtlarını g&ouml;rmek i&ccedil;in:</h4>
<ul>
  <li>İlgili g&uuml;nl&uuml;klerin listesini g&ouml;rmek i&ccedil;in <b>Olay G&uuml;nl&uuml;kleri</b> veya <b>Dosya Aktarma G&uuml;nl&uuml;kleri</b> b&ouml;l&uuml;m&uuml;nde herhangi bir &ouml;ğeye dokunun.</li>
</ul>

</div>
<h2>Mobil Uygulamaları Başlatın</h2>
<div name="contents" id="launch">

<p>iOS veya Android aygıtınız &uuml;zeride y&uuml;kl&uuml; Synology mobil uygulamalarını başlatmak i&ccedil;in DSM mobile kullanışlı bir konum sağlar.</p>

<h4>DSM mobile ile Synology mobil uygulamalarını başlatmak i&ccedil;in:</h4>
<p>Ana sayfanın (iPhone/iPod touch or Android phone) veya sol panelin (iPad or Android tablet) alt kısmında bulunan aşağıdaki uygulamalardan herhangi birine dokunun:</p>
<ul>
  <li><b>DS photo</b> (<b>Photo Station</b> hizmeti etkinleştirildiğinde kullanılabilir)</li>
  <li><b>DS audio</b> (<b>Audio Station</b> hizmeti etkinleştirildiğinde kullanılabilir)</li>
  <li><b>DS cam</b> (<b>Surveillance Station</b> hizmeti etkinleştirildiğinde kullanılabilir)</li>
  <li><b>DS file</b> (<b>WebDAV</b> hizmeti etkinleştirildiğinde kullanılabilir)</li>
</ul>

<div class="section">
<h4>Not:</h4>
	<ul>
		<li>Bu uygulamalar hakkında daha fazla bilgi i&ccedil;in uygulamalarla birlikte gelen Yardım dosyalarına bakın.</li>
     </ul> 
</div>

<h2>Hareket Halindeyken Synology NAS'ı Ayarlayın<br><span style="font-size:80%;">(Yeniden başlat, Kapat veya Bip sesi)</span></h2>

<div name="contents" id="restart">
<p>DSM mobile, Synology NAS sunucunuzu iOS ya da Android aygıtınızla yeniden başlatmanızı veya kapatmanızı sağlar. &Uuml;stelik, yakınınızda birka&ccedil; tane Synology NAS bulunduğunda, bip sesleri vermesini isteyerek Synology NAS sunucunuzu hızla belirleyebilirsiniz.</p>

<h4>Hareket halindeyken Synology NAS sunucunuzu ayarlamak i&ccedil;in:</h4>
<ol>
  <li>Ana sayfanın (iPhone/iPod touch or Android phone) veya sol panelin (iPad or Android tablet) sağ &uuml;st k&ouml;şesinde bulunan se&ccedil;enek d&uuml;ğmesine dokunun.</li>
  <li>Aşağıdakilerden birini yapın:
    <ul>
      <li>Synology NAS sunucunuzu yeniden başlatmak i&ccedil;in <b>Yeniden başlat</b>'a ardından <b>Evet</b>'e dokunun.</li>
      <li>Synology NAS sunucunuzu kapatmak i&ccedil;in <b>Kapat</b>'a ardından <b>Evet</b>'e dokunun.</li>
      <li>Synology NAS'ın bip sesi vermesini istemek i&ccedil;in <b>Beni bul</b>'a dokunun. Bip sesi vermeyi durdurmak i&ccedil;in <b>TAMAM</b>'a dokunun.</li>
    </ul>
  </li>
</ol>
</div>

<h2>DSM'nin Masa&uuml;st&uuml; Moduna Ge&ccedil;iş Yapın</h2>

<div name="contents" id="desktopedition">

<p>DSM'nin masa&uuml;st&uuml; moduna ge&ccedil;iş yapmak i&ccedil;in ayarlar simgesine dokunun ve <b>Masa&uuml;st&uuml; Modu</b> se&ccedil;imi yapın.</p>
</div>



<h2>Depolama Y&ouml;neticisi'nden Faydalanma</h2>
<div name="contents" id="contents12">
<p><strong>Depolama Y&ouml;neticisi</strong> sistem birimlerinin ve disklerinin kullanımını ve sağlık durumunu hızlıca g&ouml;r&uuml;nt&uuml;lemenizi sağlar.</p>

<h4>Birim bilgilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in:</h4>
	<ol>
		<li>Ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol panelde (iPad veya Android tablet) bulunan <strong>Depolama Y&ouml;neticisi</strong>'ne dokunun.</li>
		<li><strong>Birim</strong> sekmesine dokunun.</li> 
		<li>Ayrıntılı bilgilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in bir birim &uuml;zerine dokunun.</li>
	</ol>

<h4>Disk bilgilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in:</h4>
	<ol>
		<li>Ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol panelde (iPad veya Android tablet) bulunan <strong>Depolama Y&ouml;neticisi</strong>'ne dokunun.</li>
		<li><strong>HDD/SDD</strong> sekmesine dokunun.</li>
		<li>Sağlık ve S.M.A.R.T. bilgilerini g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in liste &uuml;zerinde bir diske dokunun.</li>
	</ol>

<h4>S.M.A.R.T. testini başlatmak veya durdurmak i&ccedil;in:</h4>
	<ol>
		<li>Ana sayfada (iPhone/iPod touch veya Android telefon) ya da sol panelde (iPad veya Android tablet) bulunan <strong>Depolama Y&ouml;neticisi</strong>'ne dokunun.</li>
		<li><strong>HDD/SDD</strong> sekmesine dokunun.</li>
		<li>Bilgi sayfasını g&ouml;r&uuml;nt&uuml;lemek i&ccedil;in bir disk &uuml;zerine dokunun.</li>
		<li>Bir S.M.A.R.T. testini başlatmak i&ccedil;in <strong>S.M.A.R.T. Test</strong> &uuml;zerine veya durdurmak i&ccedil;in <strong>Durdur</strong> &uuml;zerine dokunun.</li>
     </ol>
     
</div>




<h2>Daha Fazla Bilgi</h2>

<div name="contents" id="contents11">
<p>Sorun giderme bilgisine ihtiya&ccedil; duyarsanız veya Synology hakkında daha fazla bilgiye ulaşmak isterseniz, Synology'nin &ccedil;evrimi&ccedil;i kaynaklarını edinmek i&ccedil;in aşağıdaki linklere dokunun:</p>
<ul>
  <li><a href="https://www.synology.com/knowledgebase/faq" target="_blank">SSS</a>
</li>
  <li><a href="http://forum.synology.com/wiki" target="_blank">Wiki</a></li>
  <li><a href="http://forum.synology.com" target="_blank">Forum</a></li>
  <li><a href="http://www.synology.com/support/download.php" target="_blank">İndirme Merkezi</a></li>
  <li><a href="https://account.synology.com/support/support_form.php" target="_blank">Teknik Destek</a></li>
</ul>
</div>

</body>
</html>
