<!DOCTYPE html>
<html class="img-no-display" xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<title>Normas Legais da Synology</title>
</head>
<body>
<h1>Normas Legais da Synology</h1>
<p>Copyright &copy; 2004-<span id="date-info"><script>document.write(new Date().getUTCFullYear());</script></span> Synology Inc. Todos os direitos reservados.</p>
<p> Todos os t&iacute;tulos, os direitos de autor e outros direitos de propriedade intelectual inclu&iacute;dos e anexados ao Produto de Software (incluindo, entre outros, qualquer meio de suporte de dados relevante, imagens, fotografias, anima&ccedil;&otilde;es, v&iacute;deos, &aacute;udio, m&uacute;sica, textos e miniaplica&ccedil;&otilde;es incorporados no produto de software), os manuais e outros documentos que o acompanham e documentos online ou eletr&oacute;nicos, se existirem (coletivamente, &quot;Produto de Software&quot;), s&atilde;o propriedade da Synology Inc. Exceto se de outra forma expressamente licenciado pela Synology Inc., por escrito, qualquer fornecimento do Produto de Software n&atilde;o representa qualquer licenciamento dos direitos acima referidos.</p>
<p>Copyright &copy;</p>
<p> Os direitos de autor e outros direitos de propriedade intelectual dos ficheiros multim&eacute;dia incluindo, entre outros, as fotografias, v&iacute;deos, m&uacute;sica, v&iacute;deos em rede e ficheiros eletr&oacute;nicos, guardados com a utiliza&ccedil;&atilde;o das aplica&ccedil;&otilde;es fornecidas com o Produto de Software pelo utilizador, s&atilde;o propriedade do utilizador ou de outras entidades terceiras.</p>
</body>
</html>
