<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Sauvegarde et r&eacute;plication</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Sauvegarde des LUN</h2>
<p>Sous l'onglet <b>Sauvegarder</b> de <b>Sauvegarder et restaurer</b>, vous pouvez utiliser <b>Sauvegarde du LUN locale</b> pour sauvegarder les iSCSI LUN de votre DiskStation vers les dossiers partag&eacute;s locaux. Vous pouvez &eacute;galement utiliser <b>Sauvegarde du LUN en r&eacute;seau</b> pour sauvegarder vers un autre DiskStation.</p>

<h4>Pour sauvegarder un iSCSI LUN&nbsp;:</h4>
<ol>
<li>
S&eacute;lectionnez <b>Cr&eacute;er</b> &gt; <b>T&acirc;che de sauvegarde du LUN</b> pour ouvrir l'<b>Assistant de sauvegarde du LUN</b>, et cliquez sur <b>Suivant</b>.
</li>
<li>
Lorsque vous &ecirc;tes invit&eacute; &agrave; choisir un type de destination, choisissez parmi les options suivantes&nbsp;:
</li>
<ul>
<li>
<b>Sauvegarde du LUN locale</b>&nbsp;: Choisissez cette option pour sauvegarder le LUN du DiskStation vers un dossier partag&eacute; local ou un disque externe qui est connect&eacute; au port USB ou eSATA de votre DiskStation.
</li>
<li><b>Sauvegarde du LUN en r&eacute;seau</b>&nbsp;: Choisissez cette option pour sauvegarder le LUN de votre DiskStation vers un autre DiskStation.
</li>
</ul>
<li>
Lorsque vous y &ecirc;tes invit&eacute;, sp&eacute;cifiez la destination de sauvegarde et le LUN source, et d&eacute;finissez la sauvegarde programm&eacute;e.
</li>
<li>
Suivez l&rsquo;assistant pour terminer la configuration.
</li>
</ol>
<p>Apr&egrave;s la cr&eacute;ation de la t&acirc;che de sauvegarde, DiskStation effectuera la t&acirc;che de sauvegarde selon la programmation et stockera le LUN sauvegard&eacute; &agrave; l'emplacement de destination. Le LUN sauvegard&eacute; n'est utilis&eacute; que dans un but de sauvegarde. Pour acc&eacute;der au LUN sauvegard&eacute;, voir <a href="restore.html">Pour restaurer le LUN sauvegard&eacute;</a> ci-dessous pour plus d'information.</p>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Les fichiers r&eacute;guliers tout comme les LUN de niveau bloc seront sauvegard&eacute;s en tant qu&apos;images de fichiers &agrave; l&apos;emplacement de destination. S&apos;ils sont restaur&eacute;s, les LUN de niveau bloc seront transform&eacute;s en LUN de fichier.</li>
<li>Chaque t&acirc;che de sauvegarde ne peut inclure qu'un LUN comme source de sauvegarde.</li>
<li>Les LUN ne peuvent pas &ecirc;tre sauvegard&eacute;s vers un disque externe au format FAT, FAT32, HFS, HFS Plus ou NTFS.</li>
<li>Avant d'effectuer une sauvegarde LUN de r&eacute;seau, veuillez vous connecter dans le DiskStation de destination pour vous assurer que son service de sauvegarde de r&eacute;seau est activ&eacute; dans <b>Sauvegarde et r&eacute;plication</b> &gt; <b>Services de sauvegarde</b>.</li>
<li>Si votre DiskStation se connecte au r&eacute;seau via un routeur, assurez-vous d'avoir bien sp&eacute;cifi&eacute; la r&egrave;gle de transmission de port pour le service iSCSI (port TCP 3260) sur le routeur avant d'effectuer la sauvegarde du LUN en r&eacute;seau.</li>
</ul>
</div>


<div class="section">
<h4>&Agrave; propos de la sauvegarde compl&egrave;te et de la sauvegarde incr&eacute;mentale&nbsp;:</h4>
<p>
Le DiskStation effectuera une sauvegarde compl&egrave;te du LUN s&eacute;lectionn&eacute; la premi&egrave;re fois, puis effectuera une sauvegarde incr&eacute;mentale par la suite. Cependant, si le nom du dossier partag&eacute; ou le nom du r&eacute;pertoire de destination de la sauvegarde est modifi&eacute;, le DiskStation effectuera une sauvegarde compl&egrave;te pour la t&acirc;che &agrave; nouveau.
</p>
</div>
</body></html>
