<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Datensicherung und Replikation</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>LUN-Datensicherung</h2>
<p>Auf der Registerkarte <b>Sicherung</b> von <b>Sicherung und Replikation</b> k&ouml;nnen Sie mit <b>Sicherung lokaler LUN</b> die iSCSI LUNs Ihrer DiskStation in lokalen gemeinsamen Ordner speichern. Sie k&ouml;nnen die Sicherung mit <b>Netzwerk-LUN-Sicherung</b> auch auf einer anderen DiskStation durchf&uuml;hren.</p>

<h4>So sichern Sie eine iSCSI LUN:</h4>
<ol>
<li>
W&auml;hlen Sie <b>Erstellen</b> &gt; <b>LUN-Sicherungsaufgabe</b>, um den <b>LUN-Sicherungs-Assistenten</b> zu &ouml;ffnen. Klicken Sie anschlie&szlig;end auf <b>Weiter</b>.
</li>
<li>
Wenn Sie aufgefordert werden, einen Zieltyp auszuw&auml;hlen, w&auml;hlen Sie bitte eine der folgenden Optionen:
</li>
<ul>
<li>
<b>Sicherung lokaler LUN</b>: W&auml;hlen Sie diese Option, um die LUN von Ihrer DiskStation zu einem lokalen gemeinsamen Ordner oder einem externen Datenspeicher, welche mit dem USB- oder eSATA-Port Ihrer DiskStation verbunden ist, zu sichern.
</li>
<li><b>Netzwerk-LUN-Sicherung</b>: W&auml;hlen Sie diese Option, um die LUN von Ihrer DiskStation zu einer anderen DiskStation zu sichern.
</li>
</ul>
<li>
Geben Sie bei Aufforderung den Sicherungszielort und die Quell-LUN an. Stellen Sie anschlie&szlig;end den Sicherungszeitplan ein.
</li>
<li>
Folgen Sie dem Assistenten, um das Setup abzuschlie&szlig;en.
</li>
</ol>
<p>Nachdem die Sicherungsaufgabe erstellt wurde, f&uuml;hrt die DiskStation die Sicherung nach dem Zeitplan durch und speichert die gesicherte LUN am Zielort. Die gesicherte LUN wird nur f&uuml;r Sicherungszwecke verwendet. Unter <a href="restore.html">So stellen Sie eine gesicherte LUN wieder her</a> erfahren Sie, wie Sie auf eine gesicherte LUN zugreifen k&ouml;nnen.</p>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Sowohl regul&auml;re Datei-, als auch Block-Ebenen-LUNs werden als Datei-Images am Zielort gesichert. Bei der Wiederherstellung werden alle Block-Ebenen-LUNs zu Datei-LUNs ge&auml;ndert.</li>
<li>Eine Sicherungsaufgabe kann nur eine LUN als Sicherungsquelle enthalten.</li>
<li>LUNs k&ouml;nnen nicht auf einer externen Festplatte mit den Formaten FAT, FAT32, HFS, HFS Plus oder NTFS gesichert werden.</li>
<li>Bevor Sie eine Netzwerk-LUN-Sicherung durchf&uuml;hren, melden Sie sich bitte bei der Ziel-DiskStation an, um sicherzustellen, dass deren Netzwerksicherungsdienst unter <b>Datensicherung und Replikation</b> &gt; <b>Datensicherungsdienste</b> aktiviert wurde.</li>
<li>Wenn Ihre DiskStation &uuml;ber einen Router mit dem Netzwerk verbunden wird, stellen Sie bitte sicher, dass Sie eine Portweiterleitungsregel f&uuml;r den iSCSI-Dienst (TCP-Port 3260) auf dem Router angegeben haben, bevor Sie die Netzwerk-LUN-Sicherung durchf&uuml;hren.</li>
</ul>
</div>


<div class="section">
<h4>&Uuml;ber vollst&auml;ndige Sicherung und inkrementelle Sicherung:</h4>
<p>
Die DiskStation f&uuml;hrt beim ersten Mal eine vollst&auml;ndige Sicherung f&uuml;r die ausgew&auml;hlte LUN durch. Danach geschieht die Sicherung inkrementell. Wenn aber der Name des gemeinsamen Ordners oder Verzeichnisses des Sicherungsziels ge&auml;ndert wird, f&uuml;hrt die DiskStation erneut eine vollst&auml;ndige Sicherung durch.
</p>
</div>
</body></html>
