<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<title>Gestionnaire High Availability - Aide Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology High Availability uses two servers to form a high-availability cluster in which one server assumes the role of active server and another server acts as a standby passive server.">


 </head>
 <body>
  <h1>Gestionnaire High Availability</h1>

 <p>High Availability est une solution de configuration de serveurs con&ccedil;ue pour r&eacute;duire les interruptions des services caus&eacute;es par des d&eacute;faillances du serveur. Synology High Availability utilise deux serveurs pour former une «&nbsp;grappe de serveurs High Availability&nbsp;» dans lequel un serveur assume le r&ocirc;le de «&nbsp;serveur actif&nbsp;» et un autre serveur agit comme «&nbsp;serveur passif&nbsp;» en veille. Afin de mettre en place et de cr&eacute;er une grappe de serveurs high-availability, deux serveurs Synology compatibles sont n&eacute;cessaires.</p>
  <p>Un cluster high-availability utilise les composants et concepts suivants&nbsp;:</p>

  <ul>
   <li><b>Concept : </b>La mise en place de la technologie Synology High Availability n&eacute;cessite deux serveurs Synology pour cr&eacute;er un cluster high-availability. Un serveur agit comme &laquo;&nbsp;serveur actif&nbsp;&raquo; et un l'autre agit comme &laquo;&nbsp;serveur passif&nbsp;&raquo;. Une fois le cluster high-availability cr&eacute;&eacute;, les donn&eacute;es sont r&eacute;pliqu&eacute;es en permanence du serveur actif vers le serveur passif. Tous les fichiers sur le serveur actif existeront en double sur le serveur passif. En cas de dysfonctionnement du serveur actif, le serveur passif sera pr&ecirc;t &agrave; prendre en charge tous les services avec une copie compl&egrave;te des donn&eacute;es en miroir sur le serveur actif. Ainsi, le cluster high-availability continuera &agrave; fournir les services normalement, ce qui minimise les interruptions du serveur. Pour plus de d&eacute;tails sur le basculement, veuillez consulter <a href="switchover_fail.html">Basculement</a></li>
   <li><b>Serveur actif :</b> Le serveur actif g&egrave;re la fourniture de tous les services. Si des erreurs se produisent sur ​​le serveur actif, vous, ou le syst&egrave;me, pouvez initier un basculement vers le serveur passif. Dans ce cas, la fourniture des services est transf&eacute;r&eacute;e vers le serveur passif, et &agrave; ce point le serveur actif devient le serveur passif.</li>
   <li><b>Serveur passif&nbsp;:</b> Dans des conditions normales, le serveur passif reste en mode veille. Les donn&eacute;es du serveur actif sont r&eacute;pliqu&eacute;es en permanence vers le serveur passif. Si ​​le serveur actif ne peut pas fournir les services, vous, ou le syst&egrave;me, pouvez initier un basculement vers le serveur passif. </li>
   <li><b>Connexion de pulsation&nbsp;:</b> Le serveur actif et le serveur passif d'un cluster high-availability sont reli&eacute;s par une connexion r&eacute;seau priv&eacute;e et d&eacute;di&eacute;e appel&eacute;e &laquo;&nbsp;connexion de pulsation&nbsp;&raquo;. Une fois le cluster high-availability cr&eacute;&eacute;, la connexion de pulsation facilite la synchronisation des donn&eacute;es et la r&eacute;plication entre le serveur actif et le serveur passif. Si le contact entre les serveurs est perdu pendant une dur&eacute;e de temps donn&eacute;e, le syst&egrave;me d&eacute;termine qu'un basculement est n&eacute;cessaire.</li>
   <li><b>Volume de stockage principal du cluster high-availability&nbsp;:</b> Le volume de stockage du serveur actif deviendra le volume de stockage principal du cluster high-availability. Les donn&eacute;es sont r&eacute;pliqu&eacute;es avec le volume de stockage du serveur passif via la connexion de pulsation.</li>
   <li><b>Volume de stockage de secours du cluster high-availability&nbsp;: </b>Le volume de stockage sur le serveur passif deviendra le volume de stockage de secours du cluster high-availability. Les donn&eacute;es sont r&eacute;pliqu&eacute;es en permanence depuis le volume de stockage du serveur actif au volume de stockage passif via la connexion de pulsation. Cela assure la coh&eacute;rence du contenu des fichiers lorsqu'un basculement se produit.</li>
   <li><b>Nom de serveur du cluster high-availability&nbsp;:</b> Les serveurs du cluster high-availability partageront un nom de serveur. Dans le r&eacute;seau, vous pouvez vous connecter en utilisant ce nom de serveur, et les services seront fournis par le serveur actif. </li>
   <li><b>IP du cluster high-availability&nbsp;: </b>Le serveur actif et le serveur passif du cluster high-availability ayant chacun sa propre adresse IP, afin d'&eacute;viter d'avoir &agrave; passer &agrave; une autre adresse IP lorsqu'un basculement est effectu&eacute;, le cluster high-availability g&eacute;n&eacute;rera des adresses IP communes pour l'acc&egrave;s. Pour acc&eacute;der &agrave; tous les services DSM, quel que soit le serveur Synology qui agit en tant que serveur actif, vous pouvez vous connecter via ces adresses IP. </li>
  </ul>




 </body>
</html>
