<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Param&egrave;tres r&eacute;seau</h2>
	<p>Cette page contient trois onglets qui affichent les param&egrave;tres r&eacute;seau du cluster high-availability, le serveur membre actif, et le serveur membre passif.</p>
  
	<h3>Onglet Cluster HA</h3>
  	<p>Lors de la cr&eacute;ation d'un cluster high-availability, le syst&egrave;me g&eacute;n&egrave;re une adresse IP commune pour que l'IP du cluster high-availability re&ccedil;oive les connexions entrantes. Des adresses IP du cluster high-availability suppl&eacute;mentaires peuvent &ecirc;tre cr&eacute;&eacute;es si n&eacute;cessaire. Les adresses IP des interfaces r&eacute;seau activ&eacute;es sur le serveur actif seront affich&eacute;es sur cet onglet (l'interface r&eacute;seau utilis&eacute;e par la connexion de pulsation ne sera pas affich&eacute;e sur cette page, car cette interface sera utilis&eacute;e pour la r&eacute;plication des donn&eacute;es entre les deux serveurs). Cet onglet affiche les informations ci-dessous&nbsp;:</p>
    	<ul>
        	<li><b>Interface r&eacute;seau&nbsp;:</b> La ou les interfaces r&eacute;seau activ&eacute;es sur le serveur actif.</li>
            <li><b>Connexion&nbsp;:</b> Affiche l'&eacute;tat de connexion (ou non) de cette interface.</li>
            <li><b>Adresse IP&nbsp;:</b> Lorsque l'on cr&eacute;e un cluster high-availability, le syst&egrave;me g&eacute;n&egrave;re une adresse IP commune de cluster high-availability IP pour recevoir les connexions entrantes. Vous pouvez vous connecter au cluster high-availability en utilisant cette adresse IP lorsque vous souhaitez vous connecter &agrave; DiskStation Manager (DSM), quel que soit le serveur Synology qui est le serveur actif. Cela &eacute;vite d'avoir &agrave; se connecter &agrave; des adresses IP diff&eacute;rentes apr&egrave;s un basculement.</li>
            <li><b>Masque de sous r&eacute;seau&nbsp;: </b>Le masque de sous r&eacute;seau associ&eacute; &agrave; l'adresse IP du cluster high-availability donn&eacute;e.</li>
		</ul>
<h4>Pour modifier l'Adresse IP et le Masque de sous r&eacute;seau&nbsp;:</h4>
	<ol>
		<li>Choisissez l'adresse IP et le masque de sous r&eacute;seau que vous souhaitez modifier et cliquez sur <b>Modifier</b> ou double cliquez sur le champ pour commencer la modification.</li>
		
        
   <li>Cochez les case <b>Activer</b> pou activer ou d&eacute;sactiver chaque interface. Vous pouvez activer plus d'une interface r&eacute;seau de cluster, mais l'interface r&eacute;seau d'origine qui a &eacute;t&eacute; configur&eacute;e lors de la cr&eacute;ation du cluster ne peut pas &ecirc;tre d&eacute;sactiv&eacute;e.</li>
        
        
        
    </ol>
<h4>Pour changer le nom de serveur du cluster high-availability&nbsp;:</h4>
 	<ol>
    	<li>Cliquez sur <b>Modifier les param&egrave;tres r&eacute;seau</b> pour afficher le nom du cluster high-availability et changer ses param&egrave;tres.</li>
   		<li>Cliquez sur <b>Appliquer</b> pour enregistrer le nom du cluster high-availability et ses param&egrave;tres d'adresse IP.</li>
   		<li>Pour abandonner les modifications actuelles, cliquez sur <b>Annuler</b>. </li>
  </ol>

<h3>Onglets Serveur actif et Serveur passif (affich&eacute; comme nom de serveur)</h3>
<p>Ces onglets affichent l'&eacute;tat des interfaces r&eacute;seau sur le serveur actif ou le serveur passif. De celles-ci, la Connexion de pulsation occupera une interface r&eacute;seau sur chacun des serveurs, actif et passif. Ces onglets affichent les informations suivantes&nbsp;:</p>
	<ul>
    	<li><b>Interface r&eacute;seau&nbsp;:</b> L'interface r&eacute;seau physique sur le serveur.</li>
    	<li><b>Adresse IP&nbsp;:</b> L'adresse IP attribu&eacute;e pour l'interface r&eacute;seau donn&eacute;e.</li>
    	<li><b>Masque de sous r&eacute;seau&nbsp;:</b> Le masque de sous r&eacute;seau associ&eacute; &agrave; l'adresse IP donn&eacute;e.</li>
    	<li><b>Description&nbsp;:</b> Affiche les informations de l'interface r&eacute;seau donn&eacute;e et l'accessibilit&eacute; de son adresse IP attribu&eacute;e. Ce champ affiche les conditions suivantes possibles&nbsp;:</li>
		<ol>
			<li><b>Adresse IP originale accessible&nbsp;</b>: L'adresse IP originale attribu&eacute;e &agrave; l'interface sur le serveur actif est accessible pour les donn&eacute;es et les services.</li>
			<li><b>Adresse IP originale non-accessible&nbsp;</b>: L'adresse IP originale attribu&eacute;e &agrave; l'interface sur le serveur passif n'est pas accessible.</li>
			<li><b>IP de connexion de pulsation, non accessible depuis l'intranet&nbsp;</b>: L'adresse IP originale attribu&eacute;e automatiquement &agrave; la connexion de pulsation n'est pas accessible pour les donn&eacute;es et les services.</li>
		</ol>
	</ul>
</body>
</html>