<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Surveillance du service</h2>

<p>Cette page vous permet de surveiller certains services. Si un service surveill&eacute; est d&eacute;faillant sur le serveur actif, le syst&egrave;me va basculer sur le serveur en standby passif (&agrave; condition que le serveur passif fonctionne normalement). Les sections suivantes apparaissent sur cette page :</p>

<ul>
  <li><b>Service&nbsp;:</b> Affiche les services qui peuvent &ecirc;tre surveill&eacute;s.</li>
  <li><b>&Eacute;tat&nbsp;: </b> Indique si les services fonctionnent ou non.</li>
  <li><b>Basculement en cas de panne du service&nbsp;: </b>Cochez la case &agrave; c&ocirc;t&eacute; d'un service pour commencer &agrave; le surveiller. Le syst&egrave;me va basculer en cas de panne du service.</li>
</ul>

<h4>Afin de surveiller un service :</h4>

<ol>
<li>Trouver le service que vous d&eacute;sirez surveiller. Cochez la case &agrave; c&ocirc;t&eacute; de celui-ci.</li>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>

<div class="section">
<h4>Services pris en charge</h4>
<p>Les service qui peuvent &ecirc;tre surveill&eacute;s sont les suivants&nbsp;: Windows File Service, iSCSI Target, FTP, Mac File Service, NFS Service.</p>
</div>

<div class="section">
<h4>Basculement en cas de panne de la connexion r&eacute;seau</h4>
<p>Si cette option est activ&eacute;e, le syst&egrave;me va basculer vers le serveur passif lorsque la connexion r&eacute;seau du serveur actif est d&eacute;faillante, et que la connexion r&eacute;seau du serveur passif fonctionne encore normalement.</p>

<ul>
<li>Le basculement ne sera d&eacute;clench&eacute; que si le serveur passif poss&egrave;de des connexion plus saines. Par exemple, si le serveur actif poss&egrave;de trois connexions et que l'une est d&eacute;faillante, le syst&egrave;me ne d&eacute;clenchera d&eacute;clencher un basculement que si le serveur passif dispose de trois connexions en meilleur &eacute;tat.</li>
<li>Les connexions combin&eacute;es avec Link Aggregation comptent comme une seule connexion. Par exemple, si deux connexion sont combin&eacute;es, et que l'une d'elle est d&eacute;faillante mais que l'autre fonctionne toujours, la connexion est toujours consid&eacute;r&eacute;e comme en bon &eacute;tat.</li>
</ul>

</div>

</body>
</html>
