<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>High Availability</title>


 </head>
 <body>
<h2>&Eacute;tat du stockage</h2>
	<p>Cette page affiche l&apos;&eacute;tat des volumes de stockage et iSCSI LUN (niveau bloc) sur le serveur actif et le serveur passif du cluster high-availability.</p>
    <p>Parce que la capacit&eacute; et les configurations des volumes correspondants et des iSCSI LUN (niveau bloc) sur le serveur actif et le serveur passif doivent &ecirc;tre identiques, les volumes et les iSCSI LUN (niveau bloc) sur les deux serveurs sont affich&eacute;s ensemble comme des unit&eacute;s simples. Par cons&eacute;quent, si vous souhaitez consulter l&apos;&eacute;tat des volumes et iSCSI LUN (niveau bloc) &agrave; la fois du serveur actif et du serveur passif, vous devez aller &agrave; page <b>&Eacute;tat du stockage</b> [lorsque vous acc&eacute;dez &agrave; un cluster high-availability, seuls les volumes et iSCSI LUN (niveau bloc) sur le serveur actif sont visibles dans le <b>Gestionnaire de stockage</b>].</p>

    <p>Cette page contient les informations suivantes&nbsp;:</p>
		<ul>
			<li><b>Nom&nbsp;:</b> Affiche les noms des volumes et iSCSI LUN (niveau bloc).</li>
			<li><b>Utilis&eacute;&nbsp;:</b> Affiche le pourcentage de capacit&eacute; utilis&eacute;e des volumes et iSCSI LUN (niveau bloc).</li>
			<li><b>Taille utilis&eacute;e/totale&nbsp;:</b>  Affiche la capacit&eacute; totale et utilis&eacute;e des volumes et iSCSI LUN (niveau bloc).</li>
            <li><b>&Eacute;tat :</b> Affiche l&apos;&eacute;tat des volumes, iSCSI LUN (niveau bloc) et des caches SSD.</li>
            <li><b>Description&nbsp;:</b> Affiche la description des erreurs ou autres informations relatives au volume, iSCSI LUN (niveau bloc) et le cache SSD.</li>
		</ul>
<h4>Pour r&eacute;parer un volume ou iSCSI LUN (niveau bloc) d&eacute;fectueux&nbsp;:</h4>
	<ul>
		<li>Si un disque dur sur l&apos;un des serveurs est plant&eacute;, vous pouvez aller &agrave; la page <a href="disk.html">&Eacute;tat du disque</a> pour d&eacute;terminer quel disque dur est plant&eacute; et doit &ecirc;tre remplac&eacute;. Dans ce cas, faites comme suit&nbsp;:<ol>
            	<li>Remplacez le disque dur plant&eacute; (pour les &eacute;tapes relatives &agrave; l&apos;installation du disque dur, veuillez consulter le <i>Guide d&apos;installation rapide</i> pour votre produit Synology).</li>
                <li>Allez &agrave; la page <b>&Eacute;tat du stockage</b> et cliquez sur <b>R&eacute;parer</b>.</li>
            </ol>
        </li>
        <li>Si le serveur passif est hors ligne, l&apos;&eacute;tat des volumes et iSCSI LUN (niveau bloc) indiquera qu&apos;une erreur s&apos;est produite, et aucun des disques sur le serveur passif n&apos;appara&icirc;tra sur la page &Eacute;tat du disque. Dans ce cas, vous pouvez tenter de r&eacute;soudre le probl&egrave;me en proc&eacute;dant comme suit&nbsp;:<ol>
            	<li>Assurez-vous que le serveur passif est aliment&eacute;.</li>
                <li>V&eacute;rifiez toutes les alimentations.</li>
                <li>Examinez toutes les connexions.</li>
            </ol>
        </li>
        <li>Si une erreur de syst&egrave;me de fichiers se produit sur un volume ou iSCSI LUN (niveau bloc) sur l&apos;un des serveurs, veuillez proc&eacute;der comme suit&nbsp;:<ul>
            	<li>Allez &agrave; la page <b>&Eacute;tat du stockage</b>.</li>
                <li>Cliquez sur <b>R&eacute;parer.</b></li>
            </ul>
        </li>
	</ul>

<p><span class="note_head">Remarque&nbsp;:</span>  La limite des volumes et iSCSI LUN (niveau bloc) sur un cluster high-availability est 64.</p>

 </body>
</html>
