<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Backup e replica&ccedil;&atilde;o</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Backup do LUN</h2>
<p>Na guia <b>Backup</b> de <b>Backup e restaura&ccedil;&atilde;o</b>, voc&ecirc; pode usar <b>Backup do LUN local</b> para fazer backup dos iSCSI LUNs de seu DiskStation para pastas compartilhadas locais. Voc&ecirc; tamb&eacute;m pode usar <b>Backup do LUN de rede</b> para fazer o backup para outro DiskStation.</p>

<h4>Para fazer backup do iSCSI LUN:</h4>
<ol>
<li>
Selecione <b>Criar</b> &gt; <b>Tarefa de backup do LUN</b> para abrir o <b>Assistente de backup do LUN</b> e clique em <b>Avan&ccedil;ar</b>.
</li>
<li>
Quando solicitado, selecione um tipo de destino, selecione uma das seguintes op&ccedil;&otilde;es:
</li>
<ul>
<li>
<b>Backup do LUN local</b>: selecione essa op&ccedil;&atilde;o para fazer backup do LUN do DiskStation para uma pasta compartilhada local ou para um armazenamento externo conectado &agrave; porta USB ou eSATA de seu DiskStation.
</li>
<li><b>Backup do LUN da rede</b>: selecione essa op&ccedil;&atilde;o para fazer backup do LUN de seu DiskStation para outro DiskStation.
</li>
</ul>
<li>
Quando solicitado, especifique o destino do backup e o LUN de origem e defina a programa&ccedil;&atilde;o de backup.
</li>
<li>
Siga o assistente para completar a configura&ccedil;&atilde;o.
</li>
</ol>
<p>Depois da cria&ccedil;&atilde;o da tarefa de backup, o DiskStation executar&aacute; a tarefa de backup de acordo com a programa&ccedil;&atilde;o e armazenar&aacute; o backup do LUN no destino. O backup do LUN &eacute; usado apenas para fins de backup. Para acessar o backup do LUN, consulte <a href="restore.html">Para restaurar o backup do LUN</a> para obter mais informa&ccedil;&otilde;es.</p>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Os LUNs normais de arquivo e de n&iacute;vel de bloco ser&atilde;o inclu&iacute;dos no backup como imagens de arquivo no destino. Se restaurados, os LUNs de N&iacute;vel de Bloco ser&atilde;o alterados para LUNs de Arquivo.</li>
<li>Cada tarefa de backup pode incluir apenas um LUN como origem de backup.</li>
<li>O backup dos LUNs n&atilde;o pode ser feito em um disco externo com o formato FAT, FAT32, HFS, HFS Plus ou NTFS.</li>
<li>Antes de executar o Backup do LUN da rede, entre no DiskStation de destino para ter certeza de que o seu servi&ccedil;o de backup da rede est&aacute; ativado em <b>Backup e replica&ccedil;&atilde;o </b> &gt; <b>Servi&ccedil;os de backup</b>.</li>
<li>Se o DiskStation se conecta a outra rede atrav&eacute;s de um roteador, certifique-se de ter especificado uma regra de encaminhamento de porta para o servi&ccedil;o iSCSI (porta TCP 3260) no roteador antes de realizar o backup do LUN da rede.</li>
</ul>
</div>


<div class="section">
<h4>Sobre o backup completo e o backup incremental:</h4>
<p>
O DiskStation executar&aacute; um backup completo do LUN selecionado pela primeira vez e posteriormente realizar&aacute; backups incrementais. Entretanto, se o nome da pasta compartilhada ou o nome do diret&oacute;rio do destino do backup for alterado, o DiskStation realizar&aacute; um backup completo da tarefa novamente.
</p>
</div>
</body></html>
