<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>還原</title>
<link href="../../../../help/help.css" type="text/css" rel="stylesheet" />
<link href="../../../../help/scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../../../help/scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../../../help/scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Restaurar</h2>
<p>V&aacute; para <strong>Backup e restaura&ccedil;&atilde;o</strong> e clique em <strong>Restaurar</strong> no canto inferior esquerdo para restaurar os dados do backup.</p>
<h4><a name="restore"></a>Para restaurar o backup de dados/LUN*:</h4>
<ol class="disable-eds14">
<li>Clique em <b>Restaurar</b> no canto inferior esquerdo, selecione <strong>Dados</strong> ou <strong>LUN</strong>* e selecione uma tarefa de backup para restaurar.</li>
<li>O sistema pedir&aacute; que voc&ecirc; selecione suas configura&ccedil;&otilde;es, as diversas vers&otilde;es de dados de backup ou outras. Depende de que tipo de tarefa de backup voc&ecirc; deseja restaurar.</li>
<li>Se a tarefa de backup for criptografada, voc&ecirc; precisar&aacute; de uma senha/chave de criptografia para a restaura&ccedil;&atilde;o bem-sucedida.</li>
<li>Siga o assistente para concluir a restaura&ccedil;&atilde;o.</li>
</ol>
<div class="section enable-eds14">
  <h4>Nota:</h4>
<ul>
<li>Ao restaurar um pacote n&atilde;o instalado, o sistema instalar&aacute; automaticamente a mesma vers&atilde;o ou a vers&atilde;o mais recente do aplicativo. Se o aplicativo estiver instalado, mas for de uma vers&atilde;o mais antiga que a vers&atilde;o de backup, o sistema ir&aacute; atualiz&aacute;-lo automaticamente para a vers&atilde;o de backup original.</li>
<li>Os aplicativos de backup do DSM 5.1 ou superior n&atilde;o podem ser restaurados no DSM 5.0 ou inferior. </li>
</ul>
</div>
<div class="section disable-eds14">
<h4>Nota:</h4>
<ul>
<li>Ap&oacute;s a conclus&atilde;o da restaura&ccedil;&atilde;o, os LUNs de n&iacute;vel de bloqueio e de n&iacute;vel de arquivo ser&atilde;o restaurados nos LUNs de n&iacute;vel de arquivo.*</li>
<li>Durante a restaura&ccedil;&atilde;o de um pacote, se o pacote n&atilde;o estiver instalado, o sistema instalar&aacute; automaticamente a vers&atilde;o mais recente ou a mesma vers&atilde;o do aplicativo. Se o aplicativo estiver instalado, mas for de uma vers&atilde;o mais antiga que a vers&atilde;o de backup, o sistema ir&aacute; atualiz&aacute;-lo automaticamente para a vers&atilde;o de backup original.</li>
<li>Os aplicativos de backup do DSM 5.1 ou superior n&atilde;o podem ser restaurados no DSM 5.0 ou inferior. </li>
</ul>
</div>
<h4><a name="restore"></a>Para restaurar um &uacute;nico arquivo ou pasta para tarefa de backup multivers&atilde;o:</h4>
<ol>
<li>Selecione a tarefa de backup desejada no painel esquerdo e abra o <strong>Explorador de backup</strong> (clicando no &iacute;cone da lupa). &Eacute; necess&aacute;ria uma senha/chave de criptografia se a tarefa de backup estiver criptografada.</li>
<li>Localize a vers&atilde;o do backup desejado com a barra da linha do tempo ou atrav&eacute;s do &iacute;cone calend&aacute;rio.</li>
<li>Selecione um arquivo ou pasta contido e clique em <strong>Restaurar</strong>, <strong>Copiar para...</strong> ou <strong>Baixar</strong> para recuperar o arquivo/pasta selecionado. As tr&ecirc;s op&ccedil;&otilde;es tamb&eacute;m estar&atilde;o dispon&iacute;veis se voc&ecirc; clicar com o bot&atilde;o direito no arquivo/pasta.</li>
</ol>
<h4>Para pesquisar uma vers&atilde;o espec&iacute;fica:</h4>
<p>Para aumentar a velocidade de pesquisa do arquivo, voc&ecirc; pode usar palavras-chave para filtrar o arquivo/pasta desejada. Os arquivos/pastas n&atilde;o correspondentes ser&atilde;o ocultados.</p>
<ol>
  <li>Abra o <strong>Explorador de backup</strong> e clique no &iacute;cone do funil no canto superior direito.</li>
  <li>No menu suspenso, voc&ecirc; pode filtrar os arquivos/pastas pelos crit&eacute;rios abaixo:</li>
  <ul>
    <li><strong>Palavra-chave</strong>: Digite o nome de qualquer arquivo ou pasta. Voc&ecirc; pode usar curingas [*] (representando um ou mais caracteres) e [?] (representando um caractere aleat&oacute;rio) em suas palavras-chave. Por exemplo, [a<span class="note_content">*</span>n] pode representar [a<span class="note_content">ctio</span>n], [a<span class="note_content">ttentio</span>n], ou [an].</li>
    <li><strong>Tipo de Arquivo</strong>: Selecione de <strong>Qualquer</strong>, <strong>Qualquer pasta</strong> ou <strong>Qualquer arquivo</strong> para refinar sua pesquisa.</li>
    <li><strong>Tamanho (KB)</strong>: Selecione <strong>Qualquer</strong> ou selecione <strong>igual a</strong>, <strong>maior que</strong>, <strong>menor que </strong>e digite um valor.</li>    
    <li><strong>Data de modifica&ccedil;&atilde;o</strong>: Selecione entre <strong>Hoje</strong>, <strong>Ontem</strong>, <strong>Semana passada</strong> ou <strong>M&ecirc;s passado</strong>, ou <strong>Personalizar</strong> para digitar uma data de in&iacute;cio e final a fim de localizar vers&otilde;es dentro de um intervalo espec&iacute;fico.</li>
  </ul>
  <li>Para aplicar seus filtros, clique em <strong>Filtro</strong>.</li>
  <li>Para aplicar os mesmos filtros em outra vers&atilde;o de backup, basta alterar a vers&atilde;o desejada com a barra da linha do tempo.</li>
  <li>Para restabelecer sua pesquisa filtrada, clique no bot&atilde;o <strong>Redefinir</strong>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>O explorador de backup est&aacute; dispon&iacute;vel apenas para tarefas de backup multivers&atilde;o.</li>
<li>O explorador de backup tem fun&ccedil;&otilde;es limitadas quando o destino do backup &eacute; definido em DSM 5.1 ou inferior.</li>
<li dir="ltr">A configura&ccedil;&atilde;o do sistema e dos aplicativos pode ser restaurada apenas atrav&eacute;s de <strong>Restaurar</strong>.</li>
<li>A fun&ccedil;&atilde;o filtro est&aacute; dispon&iacute;vel apenas para tarefas de backup n&atilde;o criptografadas.</li>
<li>As pastas/arquivos recuperados usando <strong>Copiar para...</strong> ou <strong>Baixar</strong> perder&atilde;o suas configura&ccedil;&otilde;es de privil&eacute;gio originais.</li>
</ul>
</div>
<h4><a name="restore"></a>Para restaurar tarefas de backup de outro destino de backup:</h4>
<ol>
<li>Clique em <b>Restaurar</b> no canto inferior esquerdo e selecione <strong>Dados</strong> ou <strong>LUN</strong>*.</li>
<li>Voc&ecirc; pode selecionar e restaurar qualquer um dos tipos de tarefa de backup:
<ul>
<li>Para restaurar o backup de dados: Clique em <strong>Dados</strong> &gt; <strong>Restaurar de reposit&oacute;rios existentes</strong> e selecione o destino de backup desejado para restaurar os dados.</li>
<li>Para restaurar o backup do LUN: Clique em <strong>LUN</strong>*.</li>
</ul>
</li>
<li>Siga as instru&ccedil;&otilde;es do assistente. &Eacute; necess&aacute;ria uma senha/chave de criptografia se a tarefa a restaurar estiver criptografada.</li>
<li>Clique em <strong>Aplicar</strong> para concluir a restaura&ccedil;&atilde;o.</li>
</ol>
<div class="section enable-eds14">
<h4>Nota:</h4>
<ul>
  <li>O Embedded DataStation s&oacute; pode restaurar pastas compartilhadas para dispositivos externos ext3/ext4.</li>
  
<li>O Embedded DataStation n&atilde;o suporta a restaura&ccedil;&atilde;o de aplicativos sem um dispositivo externo ext3/ext4.</li>
</ul>
</div>
<p>____<br /> * Dispon&iacute;vel apenas em modelos espec&iacute;ficos.</p>
</body></html>
