<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Backup e Replica&ccedil;&atilde;o</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head> 
<body>
<h2>Sincroniza&ccedil;&atilde;o da pasta compartilhada</h2>
<p>O servi&ccedil;o Sincroniza&ccedil;&atilde;o de pasta compartilhada permite que os usu&aacute;rios sincronizem as pastas compartilhadas de um produto Synology (a origem) para outro produto Synology (o destino) na LAN ou na Internet. Ele funciona com base nas pastas compartilhadas. Ao sincronizar, se j&aacute; houver uma pasta com o mesmo nome (por exemplo, SharedFolder) no produto Synology de destino, a pasta no destino ser&aacute; renomeada como &ldquo;SharedFolder_1&rdquo;. Se essa pasta n&atilde;o existir, ela ser&aacute; criada na correspondente ou na primeira dispon&iacute;vel. O privil&eacute;gio de acesso dessa pasta no DiskStation de destino ser&aacute; definido como padr&atilde;o, o que significa que nenhum privil&eacute;gio ser&aacute; especificado para essa pasta.</p>
<p>Na primeira vez, a sincroniza&ccedil;&atilde;o da pasta compartilhada far&aacute; uma sincroniza&ccedil;&atilde;o integral das pastas compartilhadas selecionadas. Posteriormente, apenas os arquivos alterados ser&atilde;o sincronizados. Os arquivos que tiverem sido removidos da origem tamb&eacute;m ser&atilde;o removidos do destino.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>
A sincroniza&ccedil;&atilde;o de pasta compartilhada &eacute; uma solu&ccedil;&atilde;o de sincroniza&ccedil;&atilde;o &uacute;nica, o que significa que os arquivos da origem ser&atilde;o sincronizados com o destino, mas n&atilde;o no sentido inverso. Se voc&ecirc; est&aacute; procurando por uma solu&ccedil;&atilde;o de sincroniza&ccedil;&atilde;o de duas vias, use o <strong>Cloud Station</strong>.</li></ul></div>

<h3>Ativar o servi&ccedil;o</h3>
<h4>Para ativar a sincroniza&ccedil;&atilde;o da pasta compartilhada:</h4>
<p>Voc&ecirc; precisa ativar o servi&ccedil;o no DiskStation de destino. Para fazer isso, v&aacute; para <b>Backup e replica&ccedil;&atilde;o</b> &gt; <b>Sincroniza&ccedil;&atilde;o da pasta compartilhada</b>. Na guia <b>Servidor</b>, marque <b>Ativar servi&ccedil;o de sincroniza&ccedil;&atilde;o da pasta compartilhada</b> para ativ&aacute;-la.</p>
<h4>Para conectar pastas compartilhadas da origem para o produto Synology de destino:</h4> 
<p>&Eacute; poss&iacute;vel sincronizar as pastas compartilhadas de uma origem para v&aacute;rios servidores de destino diferentes. Al&eacute;m disso, come&ccedil;ando do DSM 4.1, a sincroniza&ccedil;&atilde;o da pasta compartilhada fornece o recurso de sincroniza&ccedil;&atilde;o de pasta compartilhada de v&aacute;rias fontes, o que permite que v&aacute;rios clientes sincronizem suas pastas compartilhadas em um &uacute;nico DiskStation. Se diferentes clientes sincronizarem uma pasta compartilhada id&ecirc;ntica com um DiskStation ao mesmo tempo, haver&aacute; um conflito e ser&aacute; necess&aacute;rio desvincular a pasta compartilhada antes que outro cliente possa sincroniz&aacute;-la com o destino. Se desejar desvincular a pasta compartilhada, v&aacute; para <b>Sincroniza&ccedil;&atilde;o da Pasta Compartilhada</b> &gt; <b>Servidor</b>, clique em <b>Lista de Conex&otilde;es</b>, selecione uma conex&atilde;o e clique em <b>Desvincular</b></b> no lado do destino. </li>
</ul>
<p>Agora, voc&ecirc; pode iniciar a sincroniza&ccedil;&atilde;o das pastas compartilhadas da origem para o DiskStation de destino. Siga as se&ccedil;&otilde;es abaixo para continuar.</p>

<h3>Gerenciar tarefas de sincroniza&ccedil;&atilde;o</h3>
<p>Atrav&eacute;s do Assistente de sincroniza&ccedil;&atilde;o da pasta compartilhada, voc&ecirc; pode criar facilmente uma tarefa de sincroniza&ccedil;&atilde;o.</p>
<h4>Para criar uma tarefa de sincroniza&ccedil;&atilde;o:</h4>
<ol>
<li>V&aacute; para <b>Backup e replica&ccedil;&atilde;o</b> &gt; <b>Sincroniza&ccedil;&atilde;o da pasta compartilhada</b> &gt; <strong>Cliente</strong>.</li>
<li>Clique em <b>Criar</b>.</li>
<li>Digite um nome para a tarefa.</li>
<li>Selecione a pasta compartilhada que deseja sincronizar com o destino. Marque a caixa de sele&ccedil;&atilde;o abaixo para confirmar e clique em <b>Avan&ccedil;ar</b> para continuar.</li>
<li>Configure o destino e as seguintes op&ccedil;&otilde;es de sincroniza&ccedil;&atilde;o:</li>
<ul>
<li><b>Ativar criptografia de transfer&ecirc;ncia:</b> Criptografa dados durante a transfer&ecirc;ncia. Isso oferece mais seguran&ccedil;a, enquanto a transfer&ecirc;ncia n&atilde;o criptografada oferece melhor desempenho. Voc&ecirc; pode escolher de acordo com suas necessidades.
</li> 
<li><b>Ativar compress&atilde;o de transfer&ecirc;ncia:</b> Comprime dados durante a transfer&ecirc;ncia. Economiza largura de banda da rede, mas aumenta a carga da CPU.</li>
<li><b>Ativar sincroniza&ccedil;&atilde;o de n&iacute;vel de bloqueio:</b> Transfere apenas dados diferenciais em vez de arquivos inteiros. Economiza largura de banda da rede, mas aumenta a carga da CPU.</li>
</ul>
<li>Configure a programa&ccedil;&atilde;o da tarefa:</li>
<ul>
<li><b>Executar a sincroniza&ccedil;&atilde;o a cada [n&uacute;mero] horas</b> ou <b>Executar a sincroniza&ccedil;&atilde;o a cada [n&uacute;mero] minutos</b>: execute a tarefa de sincroniza&ccedil;&atilde;o com um intervalo espec&iacute;fico de minutos ou horas. O tempo come&ccedil;a a contar a partir da meia noite. E o intervalo n&atilde;o pode ultrapassar 24 horas.</li>
<li><b>Executar a sincroniza&ccedil;&atilde;o autom&aacute;tica todos os dias &agrave;s (hh:mm)</b>: Executa a tarefa de sincroniza&ccedil;&atilde;o diariamente na hora especificada.</li>
<li><b>Executar a sincroniza&ccedil;&atilde;o manualmente</b>: executa a sincroniza&ccedil;&atilde;o apenas quando realizada manualmente.</li>
<li><b>Executar sincroniza&ccedil;&atilde;o na modifica&ccedil;&atilde;o</b>: executa a tarefa de sincroniza&ccedil;&atilde;o imediatamente quando ocorrer qualquer mudan&ccedil;a na pasta compartilhada de origem.</li>
</ul>
<li>Clique em <b>Aplicar</b>. Agora, voc&ecirc; pode ver a tarefa de sincroniza&ccedil;&atilde;o na lista de tarefas, que ser&aacute; realizada de acordo com a programa&ccedil;&atilde;o especificada.</li></ol>
<h4>Para gerenciar uma tarefa de sincroniza&ccedil;&atilde;o:</h4>
<ol>
<li>
Selecione a tarefa na lista de tarefas.
</li>
<li>
Execute um dos seguintes procedimentos:
</li>
<ul>
<li>
Clique em <b>Editar</b> para editar a tarefa.
</li>
<li>
Clique em <b>Excluir</b> para excluir a tarefa.
</li> 
<li>
Se a tarefa de sincroniza&ccedil;&atilde;o n&atilde;o estiver em andamento, clique em <b>Sincronizar Agora</b> para realizar a tarefa imediatamente.
</li>
<li>
Se a tarefa de sincroniza&ccedil;&atilde;o estiver em andamento, clique em <b>Cancelar</b> para interromper a tarefa em andamento.
</li>

<div class="section">
<h4>Nota:</h4>
<p>
Se a programa&ccedil;&atilde;o de uma tarefa de sincroniza&ccedil;&atilde;o estiver definida como <b>Executar sincroniza&ccedil;&atilde;o na modifica&ccedil;&atilde;o</b>, clicar em <b>Cancelar</b> interromper&aacute; a tarefa de sincroniza&ccedil;&atilde;o em andamento. Entretanto, se for feita qualquer altera&ccedil;&atilde;o no conte&uacute;do de qualquer pasta compartilhada monitorada pela tarefa de sincroniza&ccedil;&atilde;o, a Sincroniza&ccedil;&atilde;o da pasta compartilhada retomar&aacute; a tarefa novamente.
</p>
</div>

<li>
Clique em <b>Sincroniza&ccedil;&atilde;o integral</b> para sincronizar todos os dados. A Sincroniza&ccedil;&atilde;o da pasta compartilhada executar&aacute; uma sincroniza&ccedil;&atilde;o completa pela primeira vez e sincronizar&aacute; apenas as partes modificadas ap&oacute;s a primeira sincroniza&ccedil;&atilde;o. Clicar nesse bot&atilde;o pode ajud&aacute;-lo a sincronizar manualmente todos os dados novamente.
</li>
</ul>
</ol>

<div class="section disable-eds14">
<h4>Mais informa&ccedil;&otilde;es</h4>
<ol>
<li>O nome da tarefa deve ter de 1 a 32 caracteres Unicode e n&atilde;o deve conter os seguintes caracteres:<br> <span class="letterSpace5">! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~ </span></li>
<li>Se voc&ecirc; sincronizar pastas compartilhadas do sistema de arquivos ext4 a ext3, pode encontrar erros quando o &uacute;ltimo contiver mais de 32.000 pastas.</li>
<li>Se as pastas compartilhadas no DiskStation de destino tiverem sido sincronizadas com outro DiskStation antes, a sincroniza&ccedil;&atilde;o da pasta compartilhada executar&aacute; uma Sincroniza&ccedil;&atilde;o integral da tarefa.</li>
<li>Para realizar as tarefas de sincroniza&ccedil;&atilde;o da pasta compartilhada, &eacute; necess&aacute;rio ter privil&eacute;gios de administrador no DiskStation de destino. Voc&ecirc; ter&aacute; a senha da conta de administrador ou estar&aacute; no grupo administrativo.</li>
<li>Ao sincronizar o DiskStation pela Internet, voc&ecirc; pode digitar o nome do servidor com seu endere&ccedil;o IP externo ou seu nome de host. Entretanto, se voc&ecirc; selecionar digitar seu nome de host, o nome deve estar no formato FQDN (Nome de dom&iacute;nio totalmente qualificado), como &ldquo;www.synology.com&rdquo;.</li>
<li>Para o encaminhamento de portas, a sincroniza&ccedil;&atilde;o da pasta compartilhada usa a porta 22 para a transfer&ecirc;ncia criptografada e a porta 873 para a transfer&ecirc;ncia n&atilde;o criptografada.</li>
<li>Os dispositivos de armazenamento externo n&atilde;o s&atilde;o suportados pela Sincroniza&ccedil;&atilde;o da pasta compartilhada.</li>
<li>As pastas compartilhadas criptografadas precisam ser montadas manualmente com a chave de criptografia no destino.</li>
<li>A sincroniza&ccedil;&atilde;o da pasta compartilhada programada n&atilde;o ser&aacute; executada na hora especificada se n&atilde;o forem feitas altera&ccedil;&otilde;es na pasta compartilhada selecionada.</li>
<li>Para obter melhor desempenho, sugerimos que cada tarefa de sincroniza&ccedil;&atilde;o inclua menos de 200 pastas compartilhadas.</li>
<li>A fun&ccedil;&atilde;o <strong>User Home</strong> ser&aacute; desativada no DiskStation de destino se a pasta compartilhada <strong>homes</strong> for sincronizada do DiskStation de origem para o DiskStation de destino.</li>

<li>Para os modelos com CPUs que n&atilde;o sejam Intel, voc&ecirc; pode sincronizar at&eacute; 100.000 pastas compartilhadas (incluindo subpastas) usando a Sincroniza&ccedil;&atilde;o de pasta compartilhada.</li>
 <li>A Sincroniza&ccedil;&atilde;o de pastas compartilhadas pode fazer backup das configura&ccedil;&otilde;es da ACL do Windows quando o sistema de arquivos do destino for ext4.</li>
 
 <li>A sincroniza&ccedil;&atilde;o de pastas compartilhadas ir&aacute; falhar se voc&ecirc; estiver sincronizando para um servidor de destino que tenha o mesmo nome que o seu DiskStation.</li>
 
<li>As permiss&otilde;es avan&ccedil;adas da pasta compartilhada na origem n&atilde;o ser&atilde;o sincronizadas no destino. Al&eacute;m disso, uma regra apenas leitura para usu&aacute;rios do grupo administrators ser&aacute; criada no destino. </li> 

  </ol>
</div>
<div class="section enable-eds14">
<h4>Mais informa&ccedil;&otilde;es</h4>
<ol>
<li>O nome da tarefa deve ter de 1 a 32 caracteres Unicode e n&atilde;o deve conter os seguintes caracteres:<br> <span class="letterSpace5">! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~ </span></li>
<li>Se voc&ecirc; sincronizar pastas compartilhadas do sistema de arquivos ext4 a ext3, pode encontrar erros quando o &uacute;ltimo contiver mais de 32.000 pastas.</li>
<li>Se as pastas compartilhadas no DiskStation de destino tiverem sido sincronizadas com outro DiskStation antes, a sincroniza&ccedil;&atilde;o da pasta compartilhada executar&aacute; uma Sincroniza&ccedil;&atilde;o integral da tarefa.</li>
<li>Para realizar as tarefas de sincroniza&ccedil;&atilde;o da pasta compartilhada, &eacute; necess&aacute;rio ter privil&eacute;gios de administrador no DiskStation de destino. Voc&ecirc; ter&aacute; a senha da conta de administrador ou estar&aacute; no grupo administrativo.</li>
<li>Ao sincronizar o DiskStation pela Internet, voc&ecirc; pode digitar o nome do servidor com seu endere&ccedil;o IP externo ou seu nome de host. Entretanto, se voc&ecirc; selecionar digitar seu nome de host, o nome deve estar no formato FQDN (Nome de dom&iacute;nio totalmente qualificado), como &ldquo;www.synology.com&rdquo;.</li>
<li>Para o encaminhamento de portas, a sincroniza&ccedil;&atilde;o da pasta compartilhada usa a porta 22 para a transfer&ecirc;ncia criptografada e a porta 873 para a transfer&ecirc;ncia n&atilde;o criptografada.</li>
<li>Os dispositivos de armazenamento externo n&atilde;o s&atilde;o suportados pela Sincroniza&ccedil;&atilde;o da pasta compartilhada.</li>
<li>As pastas compartilhadas criptografadas precisam ser montadas manualmente com a chave de criptografia no destino.</li>
<li>A sincroniza&ccedil;&atilde;o da pasta compartilhada programada n&atilde;o ser&aacute; executada na hora especificada se n&atilde;o forem feitas altera&ccedil;&otilde;es na pasta compartilhada selecionada.</li>
<li>Para obter melhor desempenho, sugerimos que cada tarefa de sincroniza&ccedil;&atilde;o inclua menos de 200 pastas compartilhadas.</li>
<li>A fun&ccedil;&atilde;o <strong>User Home</strong> ser&aacute; desativada no DiskStation de destino se a pasta compartilhada <strong>homes</strong> for sincronizada do DiskStation de origem para o DiskStation de destino.</li>
<li>Para os modelos com CPUs que n&atilde;o sejam Intel, voc&ecirc; pode sincronizar at&eacute; 100.000 pastas compartilhadas (incluindo subpastas) usando a Sincroniza&ccedil;&atilde;o de pasta compartilhada.</li>
 
 <li>A sincroniza&ccedil;&atilde;o de pastas compartilhadas ir&aacute; falhar se voc&ecirc; estiver sincronizando para um servidor de destino que tenha o mesmo nome que o seu DiskStation.</li>
 
<li>As permiss&otilde;es avan&ccedil;adas da pasta compartilhada na origem n&atilde;o ser&atilde;o sincronizadas no destino. Al&eacute;m disso, uma regra apenas leitura para usu&aacute;rios do grupo administrators ser&aacute; criada no destino. </li> 
 
 </ol>
</div>
</body></html>
