<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
	<h2>Vis&atilde;o Geral</h2>
	<p>A vis&atilde;o geral mostra o status geral de seus espa&ccedil;os de armazenamento, incluindo o estado geral de todos os espa&ccedil;os, utiliza&ccedil;&atilde;o de discos r&iacute;gidos, uso do volume superior e uso do iSCSI LUN.</p>
		<h4>Estado do armazenamento</h4>
        <p>Existem tr&ecirc;s tipos de status:</p>
	  	<ul>
				<li><b>Em boas condi&ccedil;&otilde;es</b>: Todos os espa&ccedil;os de armazenamento est&atilde;o normais.</li>
				<li><B>Aten&ccedil;&atilde;o</B>: um espa&ccedil;o de armazenamento (volume ou iSCSI LUN) foi degradado, o cache SSD foi danificado ou uma parti&ccedil;&atilde;o do sistema falhou.</li>
				<li><b>Perigo</b>: um espa&ccedil;o de armazenamento (volume ou iSCSI LUN) foi danificado.</li>
			</ul>
			<p>Se ocorrerem v&aacute;rias anormalidades ao mesmo tempo, o estado ser&aacute; exibido na seguinte ordem: 1) Espa&ccedil;os de armazenamento (volume ou iSCSI LUN); 2) Cache SSD; e 3) Parti&ccedil;&atilde;o do sistema. Se ocorrer um problema, siga as instru&ccedil;&otilde;es sugeridas abaixo do status.</p>
		
		<h4>Informa&ccedil;&otilde;es do disco</h4>
        <p>Esta se&ccedil;&atilde;o exibe as informa&ccedil;&otilde;es de hardware e do disco r&iacute;gido. Voc&ecirc; pode verificar quantos discos r&iacute;gidos est&atilde;o sendo usados por quais espa&ccedil;os de armazenamento, pelo n&uacute;mero de discos r&iacute;gidos sobressalentes e pelo n&uacute;mero de slots de discos r&iacute;gidos dispon&iacute;veis.</p>
        
		<h4>Uso do volume superior</h4>
        <p>Esta se&ccedil;&atilde;o exibe a capacidade usada de um volume. Se o uso total atingir 90%, o gr&aacute;fico de pizza ficar&aacute; vermelho; mais de 80% ficar&aacute; amarelo e menos de 79% permanecer&aacute; azul.</p>
        
		<h4>Uso do iSCSI LUN</h4>
        <p>Esta se&ccedil;&atilde;o exibe as seguintes informa&ccedil;&otilde;es:</p>
        <ul>
         		<li><b>Relatado</b>:  a capacidade total alocada de todos os iSCSI LUN (n&iacute;vel de bloqueio) e iSCSI LUN (arquivo regular) no grupo RAID adicionado.</li>
                <li><b>Usado</b>: a capacidade total alocada no iSCSI LUN (arquivos regulares) e a capacidade total no iSCSI LUN (n&iacute;vel de bloqueio) adicionado.</li>
                <li><b>Salvo</b>:  O tamanho total <b>Relatado</b> menos o tamanho total <b>Usado</b>, exibindo o valor economizado nos custos de gerenciamento e compra de espa&ccedil;o de armazenamento.</li>
</ul>
        </li>
</body>
</html>
