 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Troca de Discos R&iacute;gidos em Volumes ou Grupos de Disco - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to replace a hard drive of an existing volume or disk group on DiskStation in order to increase storage capacity.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Troca de Discos R&iacute;gidos para Expandir a Capacidade de Armazenamento</h2>

<p>Ao usar certos tipos de RAID, voc&ecirc; pode expandir a capacidade de armazenamento de um volume ou grupo de discos, trocando os discos r&iacute;gidos antigos por discos de tamanho maior. Este artigo fornece informa&ccedil;&otilde;es importantes sobre o processo de expans&atilde;o, bem como um exemplo de como trocar os discos r&iacute;gidos existentes para expandir a capacidade de armazenamento.</p>

<div class="section">
  <h4>Nota:</h4>
<p>O procedimento descrito neste artigo funciona apenas com SHR, RAID 1, RAID 5 e RAID 6. Se voc&ecirc; planeja substituir m&uacute;ltiplos discos r&iacute;gidos, &eacute; necess&aacute;rio ter cuidado de substitu&iacute;-los um a um. Ap&oacute;s trocar um disco r&iacute;gido, voc&ecirc; deve reparar o volume ou o grupo de discos antes de trocar o pr&oacute;ximo. Para RAID 1, RAID 5 e RAID 6, a capacidade de volume ser&aacute; expandida quando todos os discos r&iacute;gidos forem trocados.</p>

</div>


<h3 class="list_head"><a name="t1"></a>  Antes de Iniciar</h3>

<p>Antes de trocar a unidade de disco r&iacute;gido, consulte as observa&ccedil;&otilde;es a seguir:<br/>

<ul>
<li><b>Dados de Backup:</b> Embora o processo de expans&atilde;o n&atilde;o v&aacute; apagar todos os dados existentes, recomendamos fazer backup de seus dados antes de prosseguir.</li>
<li><b>Status do Volume ou Grupo de Discos:</b> Antes de come&ccedil;ar, verifique se o status de seu volume ou grupo de discos est&aacute; <b>Normal</b>. Se n&atilde;o, voc&ecirc; dever&aacute; repar&aacute;-lo primeiro.</li>
<li><b>Os dados ainda est&atilde;o acess&iacute;veis durante a expans&atilde;o?</b> Os dados em seu sistema estar&atilde;o dispon&iacute;veis ao expandir volumes ou grupos de discos, embora o sistema possa suspender as conex&otilde;es temporariamente ao iniciar o processo.</li>
</ul>

<div class="section">
<h4>SHR (Synology Hybrid RAID)</h4>

<p>Como os volumes SHR otimizam a capacidade de armazenamento com base no n&uacute;mero e tamanho dos discos r&iacute;gidos instalados, siga as orienta&ccedil;&otilde;es abaixo para expandir a capacidade corretamente:</p>

<ul>
<li>Se as capacidades de todos os discos r&iacute;gidos existentes forem iguais, voc&ecirc; dever&aacute; trocar pelo menos dois discos r&iacute;gidos por outros maiores para expandir a capacidade de armazenamento. Por exemplo, se o volume SHR consistir em tr&ecirc;s discos r&iacute;gidos de 2 TB, ent&atilde;o &eacute; necess&aacute;rio substituir pelo menos dois discos r&iacute;gidos para expandir a capacidade do volume.</li>
<li>Se as capacidades dos discos r&iacute;gidos existentes forem diferentes, os novos discos r&iacute;gidos trocados dever&atilde;o ser iguais ou maiores do que o maior disco r&iacute;gido existente. Al&eacute;m disso, ser&aacute; necess&aacute;rio trocar o disco r&iacute;gido menor primeiro para otimizar o uso da capacidade. Por exemplo, se seu volume SHR consistir em tr&ecirc;s discos r&iacute;gidos com 4 TB, 3 TB e 2 TB, respectivamente, o novo disco r&iacute;gido trocado dever&aacute; ter pelo menos 4 TB. Al&eacute;m disso, ser&aacute; preciso trocar os discos r&iacute;gidos de 3 TB ou 2 TB primeiro.</i>
</li>
</ul>
</div>

<div class="section">
<h4>RAID 5 e RAID 6</h4>

<p>Ao trocar discos r&iacute;gidos de volumes RAID 5 ou RAID 6 ou grupos de discos, o menor disco r&iacute;gido dever&aacute; ser trocado primeiro. A capacidade de armazenamento dos volumes RAID 5 &eacute; (n&uacute;mero de discos r&iacute;gidos - 1) x (tamanho do menor disco r&iacute;gido) e RAID 6 &eacute; (n&uacute;mero de discos r&iacute;gidos - 2) x (tamanho do menor disco r&iacute;gido). Portanto, o menor disco r&iacute;gido dever&aacute; ser sempre trocado primeiro, para maximizar o uso do disco r&iacute;gido.</p>

<p>Por exemplo, se o volume RAID 5 contiver tr&ecirc;s discos r&iacute;gidos com 4 TB, 3 TB e 2 TB respectivamente, a capacidade dispon&iacute;vel de seu volume ser&aacute; de 4 TB. Se voc&ecirc; trocar discos r&iacute;gidos de 4 TB ou 3 TB, a capacidade do volume n&atilde;o mudar&aacute;. Para aumentar a capacidade de seu volume, o disco r&iacute;gido de 2 TB dever&aacute; ser trocado primeiro.</p>
</div>



<h3>Troca de Discos R&iacute;gidos para Expandir a Capacidade de Armazenamento</h3>

<p>Nas etapas abaixo, oferecemos um exemplo de troca de discos r&iacute;gidos de um volume SHR.</p>

<h4>Para trocar discos r&iacute;gidos:</h4>
<ol>
<li>Abra o <b>Gerenciador de armazenamento</b>.</li>
<img src="about:blank" class="help_image"/>
<li>V&aacute; para o <strong>Volume</strong> para ver qual disco r&iacute;gido existente &eacute; o menor.</li>
<img src="about:blank" class="help_image"/>

<li>Desligue seu DiskStation. (Ignore essa etapa se o seu DiskStation suportar a tecnologia de hot-swapping.)</li>
<li>Remova o menor dos discos r&iacute;gidos membros e instale um novo disco r&iacute;gido maior.</li>

<div class="section">
<h4>Nota:</h4>
<p>Para evitar ferimentos ou danos ao seu DiskStation, siga as instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do disco r&iacute;gido encontradas no <i>Guia de Instala&ccedil;&atilde;o R&aacute;pida</i> de seu produto Synology.</p>
</div>

<li>Ligue seu DiskStation.</li>
<li>Abra o <strong>Gerenciador de Armazenamento</strong> novamente.</li>
<li>V&aacute; para <strong>HDD/SSD</strong> para verificar se o novo disco r&iacute;gido foi reconhecido.</li>
<img src="about:blank" class="help_image"/>


<li>O status de seu volume dever&aacute; ser <b>Degradado</b>. Selecione o volume e clique em <strong>Gerenciar</strong>.</li>
<img src="about:blank" class="help_image"/>
<li>Selecione <b>Reparar</b>.</li>
<img src="about:blank" class="help_image"/>

<li>Selecione o disco r&iacute;gido de reposi&ccedil;&atilde;o para adicionar ao volume. Em seguida, siga as etapas no assistente para finalizar.</li>
<img src="about:blank" class="help_image"/>
<li>Repita o processo acima at&eacute; que todos os discos r&iacute;gidos desejados tenham sido trocados por outros maiores.</li>
</ol>






</body>
</html>
