 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Reparar Volumes ou Grupos de Discos - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on DiskStation using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Reparar Volumes ou Grupos de Discos</h2>

<p>Erros de volume podem ocorrer por v&aacute;rios motivos, como parti&ccedil;&otilde;es do sistema danificadas ou discos r&iacute;gidos com falhas.  Em alguns casos, &eacute; poss&iacute;vel seguir as etapas abaixo para diagnosticar o erro e corrigir o problema.</p>

<div class="section">
<h4>Notas:</h4>
<ul>
<li>A fun&ccedil;&atilde;o <strong>Reparar</strong> aqui descrita est&aacute; dispon&iacute;vel apenas para os tipos de RAID com redund&acirc;ncia de dados (por exemplo: RAID 1, RAID 5, RAID 6, etc.) Note que essa fun&ccedil;&atilde;o n&atilde;o repara discos r&iacute;gidos quebrados, nem garante que os dados dos volumes travados sejam resgatados.</li>
<li>Para volumes travados, recomendamos entrar em contato com o nosso <span class="last"><a href="https://account.synology.com/support/support_form.php?lang=enu" target="_blank">Suporte T&eacute;cnico</a> para obter assist&ecirc;ncia</span>.</li>
</ul>
</div>

<h3>Falhas em Parti&ccedil;&otilde;es do Sistema</h3>

<p>Quando as parti&ccedil;&otilde;es do sistema falharem, voc&ecirc; dever&aacute; ver uma mensagem informando que as parti&ccedil;&otilde;es do sistema n&atilde;o puderam ser acessadas.</p>
<h4>Para reparar parti&ccedil;&otilde;es do sistema:</h4>

<ol>
<li>Abra o <strong>Gerenciador de armazenamento</strong>.</li>
<img src="about:blank" class="help_image"/>

<li>V&aacute; para <strong>Vis&atilde;o Geral</strong> e clique no link marcado como <strong>Reparar.</strong> O sistema dever&aacute; reparar as parti&ccedil;&otilde;es do sistema.</li>

<img src="about:blank" class="help_image"/>
</ol>


<h3>Volumes Degradados</h3>


<p>Volumes ou grupos de discos se tornam <strong>degradados</strong> quando um disco r&iacute;gido falha, mas n&atilde;o h&aacute; perda de dados. Isso acontece apenas com os tipos de RAID que oferecem redund&acirc;ncia de dados, como SHR, RAID 1, RAID 5, RAID 6 e RAID 10. </p>
<p>Um volume ou grupo de discos degradado pode ser corrigido pela troca do disco r&iacute;gido com falha por um saud&aacute;vel e a repara&ccedil;&atilde;o do volume ou grupo de discos.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
  <li>O tamanho do novo disco r&iacute;gido deve ser maior ou igual ao tamanho do menor disco no volume.</li>
  <li>O status do novo disco r&iacute;gido deve ser <strong>Inicializado</strong> ou <strong>N&atilde;o Inicializado</strong>.</li>
</ul>

</div>

<h4> Para reparar um volume ou grupo de discos degradado:</h4>

<ol>

<li>V&aacute; para <strong>Gerenciador de Armazenamento</strong> &gt; <strong>Volume</strong> ou <strong>Grupo de Discos</strong> para confirmar que o status mudou para <strong>Degradado</strong>.</li> 
<img src="about:blank" class="help_image"/>

<li>Se assim for, v&aacute; para a guia <strong>HDD/SSD </strong>para ver qual unidade de disco r&iacute;gido falhou.</li>
<img src="about:blank" class="help_image"/>

<li>Remova a unidade de disco r&iacute;gido com falha e troque-a por uma nova.</li>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se seu DiskStation n&atilde;o suportar a fun&ccedil;&atilde;o de hot-swapping, lembre-se de deslig&aacute;-la antes de remover e instalar unidades de disco r&iacute;gido.</li>
<li>Os dados existentes no novo disco r&iacute;gido ser&atilde;o apagados.</li>
</ul>
</div>

<li>Ap&oacute;s a instala&ccedil;&atilde;o do novo disco r&iacute;gido, volte para a guia <strong>Volume</strong> ou <strong>Grupo de discos.</strong></li>

<li>Selecione um volume ou grupo de discos degradado.</li>

<li>Clique em <strong>Gerenciar</strong>.</li>  
<img src="about:blank" class="help_image"/>

<li>Selecione <strong>Reparar</strong> e clique em <strong>Avan&ccedil;ar</strong>. </li>  
<img src="about:blank" class="help_image"/>

<li>Selecione o novo disco r&iacute;gido que deseja adicionar ao volume. Em seguida, clique em <strong>Avan&ccedil;ar.</strong></li>
<img src="about:blank" class="help_image"/>

<li> Siga as instru&ccedil;&otilde;es do assistente para finalizar. </li>
</ol>




<h3>Reparo de volumes</h3>
<p>Para reparar um volume/Grupo de discos/iSCSI LUN degradado, &eacute; necess&aacute;rio substituir o disco com falha por um disco dispon&iacute;vel compat&iacute;vel com os seguintes crit&eacute;rios:</p>
<ul>
<li>Para os volumes RAID 1, RAID 5 ou RAID 6, o volume degradado pode ser reparado por um disco dispon&iacute;vel cujo tamanho &eacute; igual ou maior do que o tamanho do menor disco do volume RAID.</li>
<li>Para volumes SHR-1, o disco dispon&iacute;vel deve atender um dos seguintes crit&eacute;rios: (1) seu tamanho deve ser igual ou maior do que o tamanho do disco com defeito; (2) com o disco maior no volume RAID exclu&iacute;do, seu tamanho deve ser igual ou maior do que o tamanho do maior disco restante.

<ol>
<li>Exemplo 1: o SHR-1 &eacute; composto de discos de 3TB, 2TB, 2TB e 1TB. Se o disco de 3TB falhar, ele pode se reparado por um disco dispon&iacute;vel cujo tamanho &eacute; igual ou maior do que 2TB.</li>
<li>Exemplo 2: o SHR-1 &eacute; composto de discos de 4TB, 4TB, 2TB e 2TB. Se o disco de 4TB falhar, ele pode se reparado por um disco dispon&iacute;vel cujo tamanho &eacute; igual ou maior do que 4TB.</li>
<li>Exemplo 3: o SHR-1 &eacute; composto de discos de 4TB, 4TB, 2TB e 2TB. Se o disco de 2TB falhar, ele pode se reparado por um disco dispon&iacute;vel cujo tamanho &eacute; igual ou maior do que 2TB.</li>
</ol>
</li>
<li>Para volumes SHR-2, o disco dispon&iacute;vel deve atender um dos seguintes crit&eacute;rios: (1) seu tamanho deve ser igual ou maior do que o tamanho do disco com defeito; (2) com os dois discos maiores no volume RAID exclu&iacute;dos, seu tamanho deve ser igual ou maior do que o tamanho do maior disco restante.</li>
</ul>
<p>Se voc&ecirc; configurou os discos como hot spare que coincidem com os crit&eacute;rios acima, eles ser&atilde;o usados para reparar o volume/Grupo de discos/RAID Group/iSCSI LUN.</p>


<h3>Resolu&ccedil;&atilde;o de Volumes Travados</h3>

<p>Quando o status de um volume se torna <strong>Travado,</strong> n&atilde;o &eacute; poss&iacute;vel reparar o volume por si mesmo. Para resolver esse problema, recomendamos entrar em contato com o nosso <a href="https://account.synology.com/support/support_form.php?lang=enu" target="_blank">Suporte T&eacute;cnico</a> para obter ajuda.</p>

<div class="section">
<h4>Antes de Entrar em Contato com o Suporte:</h4>

<ul>
<li>Recupere seus dados de seu DiskStation copiando os arquivos para seu computador ou unidades externas atrav&eacute;s do File Station, Servi&ccedil;o de arquivos do Windows, FTP ou outros servi&ccedil;os de arquivo.</li>
<li>Mantenha a ordem dos discos r&iacute;gidos a mesma de quando o volume travou.</li>
<li>Realize um teste S.M.A.R.T. nos discos r&iacute;gidos problem&aacute;ticos. Para fazer isso, v&aacute; para <strong>Gerenciador de Armazenamento</strong> &gt; <strong>HDD/SSD</strong>. Selecione o disco r&iacute;gido em quest&atilde;o e clique em <strong>Teste S.M.A.R.T.</strong> <br />
</li>
</ul>
</div>
</body>
</html>
