 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Trocar Tipo de RAID de Volumes ou Grupos de Discos - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article provides instructions to change the RAID type of existing volumes and disk groups on your DiskStation.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Trocar Tipo de RAID de Volumes ou Grupos de Discos</h2>

<p>Volumes e grupos de disco podem um tipo de RAID por outro, sem perder os dados existentes. Por exemplo, voc&ecirc; pode criar um volume RAID 1 em seu DiskStation e mais tarde alterar para RAID 5, caso mais discos r&iacute;gidos sejam instalados. Este artigo fornece instru&ccedil;&otilde;es para trocar o tipo de RAID de volumes e grupos de discos existentes em seu DiskStation.</p>
<h3>Limita&ccedil;&otilde;es de Tipo de RAID</h3>

<p>Apenas alguns tipos de RAID podem ser trocados para outros tipos de RAID. Consulte os detalhes na tabela abaixo.</p>

<table>
  <tr>
    <th width="50%">Tipo de RAID</th>
    <th width="50%">Pode ser alterado para...</th>
  </tr>
  <tr>
    <td>Basic</td>
    <td>RAID 1<br /> RAID 5</td>
  </tr>
  <tr>
    <td>RAID 1</td>
    <td>RAID 5</td>
  </tr>
  <tr>
    <td>RAID 5</td>
    <td>RAID 6</td>
  </tr>

</table>

<div class="section">
<h4>Exemplo:</h4>
<p>O RAID 1 pode ser trocado para RAID 5, mas o RAID 5 n&atilde;o pode ser trocado para RAID 1.</p>
</div>


<h3>Requisitos de Disco R&iacute;gido</h3>

<p>Para trocar o tipo de RAID de um volume ou grupo de discos, deve haver um n&uacute;mero suficiente de discos r&iacute;gidos instalados em seu DiskStation. Consulte abaixo o n&uacute;mero m&iacute;nimo de discos r&iacute;gidos necess&aacute;rios para cada tipo de RAID.</p>

<table>
  <tr>
    <th width="50%">Tipo de RAID desejado</th>
    <th width="50%">Discos r&iacute;gidos necess&aacute;rios</th>
  </tr>
  <tr>
    <td>RAID 1</td>
    <td>2 ou 4</td>
  </tr>
  <tr>
    <td>RAID 5</td>
    <td>3</td>
  </tr>
  <tr>
    <td>RAID 6</td>
    <td>4</td>
  </tr>
</table>

<div class="section">
<h4>Exemplo:</h4>
<p>Para trocar um volume RAID 1 para RAID 5, voc&ecirc; vai precisar de pelo menos tr&ecirc;s discos r&iacute;gidos no total (ou seja, dois discos r&iacute;gidos pertencentes ao volume RAID 1 mais um disco r&iacute;gido livre a ser adicionado ao volume).</p>
</div>

<h3>Alterar o tipo de RAID</h3>

<p>No exemplo abaixo, vamos trocar um volume <strong>Basic</strong> para um volume <strong>RAID 1</strong>.</p>

<div class="section">
<h4>Antes de Come&ccedil;ar:</h4>
<ul>
<li>Verifique se o status de seu volume ou grupo de discos est&aacute; <b>Normal.</b></li>
<li>Ao adicionar novas unidades de disco r&iacute;gido a um volume ou grupo de discos, as novas unidades de disco r&iacute;gido dever&atilde;o ser maiores do que o menor disco r&iacute;gido no volume ou grupo de discos.</li>
<li>O status dos novos discos r&iacute;gidos deve ser <b>Iniciado</b> ou <b>N&atilde;o Iniciado</b>.</li></ul>
</div>

<h4>Para alterar o tipo RAID do volume:</h4>

<ol>
<li>Abra o <strong>Gerenciador de armazenamento</strong>.</li>
<img src="about:blank" class="help_image"/>
<li>V&aacute; para <b>Volume</b>.  (Se voc&ecirc; quiser alterar o tipo de RAID de um grupo de discos, v&aacute; para a guia <b>Grupo de Discos</b>).</li>
<li>Selecione o volume que deseja alterar e clique em <b>Gerenciar</b>.</li>
<img src="about:blank" class="help_image"/>

<li>Quando o assistente de instala&ccedil;&atilde;o for exibido, selecione <b>Alterar tipo de RAID</b>. Em seguida, clique em <b>Avan&ccedil;ar</b>.</li>
<img src="about:blank" class="help_image"/>


<li>Selecione o tipo de RAID para o qual voc&ecirc; deseja alterar o volume. Clique em <b>Avan&ccedil;ar</b>.</li>
<img src="about:blank" class="help_image"/>


<li>Selecione os discos r&iacute;gidos a serem adicionados ao volume. Em seguida, clique em <b>Avan&ccedil;ar</b>.</li>
<img src="about:blank" class="help_image"/>


<li>Siga as instru&ccedil;&otilde;es do assistente para finalizar. Observe que os dados existentes no disco r&iacute;gido adicionado devem ser exclu&iacute;dos.</li></ol>

</body>
</html>
