 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SSD TRIM - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="SSD TRIM improves the read and write performance of volumes created on SSDs, increasing efficiency as well as extending the lifetime of your SSDs.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SSD TRIM</h2>
<p>Se o volume consistir totalmente em SSDs (Unidades de Estado S&oacute;lido), recomendamos ativar o SSD TRIM. Esse recurso melhora o desempenho de grava&ccedil;&atilde;o e leitura dos volumes criados nos SSDs, aumentando a efici&ecirc;ncia al&eacute;m de prolongar a vida &uacute;til de seus SSDs.</p>
<h4>Para ativar o SSD TRIM:</h4>
<ol>
  <li>Abra o <strong>Gerenciador de Armazenamento</strong> e v&aacute; para <strong>Volume.</strong> </li>
  <li>Selecione um volume que consista inteiramente de SSDs e clique no bot&atilde;o <b>Configurar</b>.</li>
  <li>Na janela que aparece, v&aacute; para a aba <b>SSD TRIM,</b> e marque a caixa <strong>Ativar TRIM</strong>.</li>
  <li>Clique no bot&atilde;o <strong>Definir programa&ccedil;&atilde;o</strong> para escolher quando o sistema realizar&aacute; o SSD TRIM.</li>
  <li>Clique em <strong>OK</strong>.</li>
</ol>
<div class="section">
  <h4>Observa&ccedil;&atilde;o:</h4>
  <ul>
    <li>O SSD TRIM est&aacute; dispon&iacute;vel apenas em certos modelos de DiskStation e tipos de RAID. </li>
    <li>Alguns modelos de SSD n&atilde;o conseguem fazer o SSD TRIM em volumes RAID 5 e RAID 6. Consulte a lista de compatibilidade em <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</li>
    <li>O SSD TRIM n&atilde;o pode ser ativado nas seguintes situa&ccedil;&otilde;es:<ul>
        <li>O volume &eacute; montado com cache SSD.</li>
        <li>O pacote <strong>Time Backup</strong> est&aacute; instalado.</li>
        <li>Um cluster de high-availability foi criado com o <strong>Gerenciador de High Availability</strong>.</li>
      </ul>
    </li>
    <li>O SSD TRIM n&atilde;o pode ser ativado em iSCSI LUNs de n&iacute;vel de bloqueio.</li>
    <li>O desempenho do sistema ser&aacute; afetado ao executar o SSD TRIM. O tempo necess&aacute;rio para terminar a execu&ccedil;&atilde;o do TRIM varia de acordo com o tamanho do volume e o modelo do SSD.</li>
    <li>Quando o TRIM estiver habilitado em um volume, ele tamb&eacute;m poder&aacute; ser ativado em outros volumes criados no mesmo grupo de discos ou RAID Group.</li>
  </ul>
</div>
</body>
</html>
