<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Servicios de asistencia</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>Servicios de asistencia</h2>
<p>
Los servicios de asistencia incluyen herramientas de acceso remoto y producci&oacute;n de registros, que permiten a nuestros ingenieros de asistencia t&eacute;cnica ver, diagnosticar y resolver problemas t&eacute;cnicos en su DiskStation r&aacute;pidamente desde una oficina de Synology. Para hacer esto, vaya a <b>Centro de asistencia</b> &gt; <b>Servicios de asistencia</b>.
</p>

<h4>Para habilitar el acceso remoto: </h4>
<p>
Habilite el acceso remoto a su DiskStation solo cuando se lo pida alg&uacute;n ingeniero de asistencia t&eacute;cnica de Synology.
</p>
<ol>
<li>Marque la casilla de verificaci&oacute;n <b>Habilitar acceso remoto</b> y a continuaci&oacute;n haga clic en <b>Aplicar</b> para que los cambios sean efectivos.
</li>
<li>Proporcione a los ingenieros de asistencia t&eacute;cnica de Synology su contrase&ntilde;a de administrador y la clave de identificaci&oacute;n de asistencia por correo electr&oacute;nico.
</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>El acceso remoto se deshabilitar&aacute; autom&aacute;ticamente despu&eacute;s de 14 d&iacute;as. No se deber&aacute; deshabilitar antes de dicho periodo a no ser que se lo pida un ingeniero de asistencia t&eacute;cnica de Synology.
</li>
<li>Elimine cualquier contenido de su DiskStation que considere privado. 
</li>
<li>Aunque Synology no puede garantizar que proporcionar acceso remoto resolver&aacute; su problema, Synology realizar&aacute; los esfuerzos razonables para ofrecer servicios de asistencia de manera profesional.
</li>	
</ul>
</div>

<h4>Para generar registros: </h4>
<p>
Genere y proporcione registros &uacute;nicamente para los ingenieros de asistencia t&eacute;cnica de Synology.
</p>
<ol>
<li>Haga clic en <b>Generar registros</b> y a continuaci&oacute;n espere unos minutos antes de que se complete la descarga.
</li>
<li>Proporcione a los ingenieros de asistencia t&eacute;cnica los registros por correo electr&oacute;nico.
</li>
</ol>

<div class="section">
<h4>Cosas que deber&iacute;a saber acerca de nuestros servicios de asistencia</h4>
<ul>
<li>Respetamos su DiskStation como si fuera nuestro.</li>
<li>Su DiskStation solo se utilizar&aacute; con fines de diagn&oacute;stico del sistema. Synology no acceder&aacute; ni divulgar&aacute; ninguna otra informaci&oacute;n personal de su DiskStation. </li> 

</ul>
</div>

</body>
</html>
