<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Consultor de seguran&ccedil;a avan&ccedil;ado</title>

<link href="../../help.css" rel="stylesheet" type="text/css">
<link href="../../scrollbar/flexcroll.css" rel="stylesheet" type="text/css">
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>

<h2>Avan&ccedil;ado</h2>
<p>Pode ver e alterar as configura&ccedil;&otilde;es avan&ccedil;adas para o Consultor de seguran&ccedil;a.	</p>
<h3>Base de refer&ecirc;ncia de seguran&ccedil;a </h3>
<p>Pode escolher que regras de seguran&ccedil;a o Consultor de Seguran&ccedil;a verificar&aacute;, selecionando uma <strong>Base de seguran&ccedil;a</strong>. O n&uacute;mero e tipos de regras ir&aacute; variar para cada <strong>Base de seguran&ccedil;a</strong>. Efetue a sua escolha consoante as suas necessidades.  Est&aacute; a usar o seu DiskStation para trabalho e neg&oacute;cios ou lazer e fins pessoais? Pode escolher entre as seguintes op&ccedil;&otilde;es:</p>
<ul>
<li><strong>Para uso dom&eacute;stico e pessoal</strong>: O Consultor de Seguran&ccedil;a ir&aacute; realizar verifica&ccedil;&otilde;es essenciais para proteger o seu DiskStation contra ataques cibernautas comuns.</li>
<li><strong>Para trabalho e neg&oacute;cios</strong>: O Consultor de Seguran&ccedil;a ir&aacute; realizar verifica&ccedil;&otilde;es completas para cumprir os requisitos de seguran&ccedil;a para organiza&ccedil;&otilde;es.</li>
<li><strong>Personalizar</strong>: Selecione as regras de seguran&ccedil;a que pretende que o Consultor de seguran&ccedil;a verifique. </li></ul>
<h3>Agendar an&aacute;lise</h3>
<p> Pode definir uma agenda de an&aacute;lise regular ao clicar em <strong>Ativar agenda de an&aacute;lise regular</strong> e escolher a hora a que pretende que o Consultor de seguran&ccedil;a realize uma an&aacute;lise. O Consultor de seguran&ccedil;a ir&aacute; verificar as regras de acordo com a <strong>Base de refer&ecirc;ncia de seguran&ccedil;a</strong> que escolheu.</p>

</body>
</html>
