<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2>Configurar Centro de paquetes</h2>
<h4>Para administrar los paquetes que se permite instalar:</h4>
<ol>
<li>En la pesta&ntilde;a <strong>General</strong>, elija una de las siguientes opciones para el <strong>Nivel de confianza</strong> que desee:</li>
<ul>
<li><strong>Synology Inc.</strong>: Solo permite la instalaci&oacute;n de paquetes publicados por Synology Inc.</li>
<li><strong>Synology Inc. y editores de confianza</strong>: Solo permite la instalaci&oacute;n de paquetes publicados por Synology Inc. y editores de confianza. Los editores de confianza son aquellos que han obtenido la confianza de otra comunidad a trav&eacute;s de la adici&oacute;n de or&iacute;genes de paquetes o que tienen la confianza del usuario a mediante la importaci&oacute;n del certificado del editor.</li>
<li><strong>Cualquier editor</strong>: Permite la instalaci&oacute;n de cualquier paquete, independientemente del editor y de la integridad.</li>
</ul>
<li>Haga clic en <strong>OK</strong>.</li>
</ol>

<h4>Para importar un certificado de un editor de confianza:</h4>
<ol>
<li>En la pesta&ntilde;a <strong>Certificado</strong>, haga clic en <b>Importar</b>. </li>
<li>Haga clic en <strong>Explorar</strong> y seleccione el certificado del editor de confianza.</li>
<li>Haga clic en <strong>OK</strong>. </li>
</ol>

<h4>Para actualizar el certificado de Synology Inc.:</h4>
<p>Cuando est&eacute; conectado a Internet, el certificado de Synology Inc. se actualizar&aacute; autom&aacute;ticamente durante el proceso de instalaci&oacute;n del paquete. Para actualizar manualmente:</p>
<ol>
<li>En la pesta&ntilde;a <strong>Certificado</strong>, haga clic en <b>Importar</b>. </li>
<li>Haga clic en <strong>Explorar</strong> y seleccione el certificado de Synology Inc. que se puede descargar del <a href="http://www.synology.com/support/download" target="_blank">sitio web de Synology</a>.</li>
<li>Haga clic en <strong>OK</strong>. </li>
</ol>
<h4>Para habilitar notificaciones de actualizaciones de paquetes:</h4>
<ol>
<li>Haga clic en la ficha <b>Notificaci&oacute;n</b> y luego marque <b>Habilitar notificaci&oacute;n por correo electr&oacute;nico</b> y/o <b>Habilitar notificaci&oacute;n de escritorio</b>. La primera opci&oacute;n permite que DSM le env&iacute;e correos electr&oacute;nicos cuando haya disponibles nuevas actualizaciones, mientras que la segunda permite que DSM muestre un mensaje de notificaci&oacute;n en el v&eacute;rtice superior derecho de su escritorio DSM.</li>
<li>Haga clic en <b>OK</b>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<p>Para que las notificaciones por correo electr&oacute;nico surtan efecto, configure en primer lugar los ajustes de notificaci&oacute;n por correo electr&oacute;nico de DSM (en <b>Men&uacute; principal</b> &gt; <b>Panel de control</b> &gt; <b>Notificaci&oacute;n</b>).</p></div>

<h4>Para a&ntilde;adir un recurso de paquetes proporcionado por otra comunidad:</h4>
<ol>
<li>Haga clic en la ficha <b>Or&iacute;genes de paquetes</b>, haga clic en <strong>Agregar</strong> y luego escriba el nombre y la ubicaci&oacute;n de sus or&iacute;genes de paquetes. <br>La ubicaci&oacute;n puede ser una URL encontrada en Internet proporcionada por otro desarrollador/editor o comunidad.</li>
<li>Haga clic en <b>OK</b>. Cuando el origen del paquete se a&ntilde;ada correctamente, ver&aacute; una lista de paquetes en la pesta&ntilde;a <strong>Comunidad</strong>. </li>
</ol>

</body>
</html>
