<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Administrar paquetes</h2>
<p>Tras instalar paquetes en l&iacute;nea o manualmente, puede administrarlos en el Centro de paquetes para mantenerlos actualizados y en buen funcionamiento. En las siguientes instrucciones, se explica c&oacute;mo iniciar, actualizar, desinstalar, ejecutar o detener los paquetes, as&iacute; como solucionar problemas con los paquetes.</p>

<h4>Para actualizar paquetes, elija cualquiera de las siguientes opciones: </h4>
<p>La mejor forma de mantener en buen estado su DiskStation es manteniendo sus paquetes actualizados.</p>
<ul>
<li>Haga clic en <strong>Actualizar</strong> en el panel izquierdo para ver actualizaciones disponibles. Haga clic en los botones<strong> Actualizar</strong> o <strong>Actualizar todo</strong> para actualizar paquetes. </li>
<li>Haga clic en <b>Instalaci&oacute;n manual</b> para instalar un paquete cargando el archivo <b>.spk</b> (disponible en el <a href="http://www.synology.com/support/download.php" target="_blank">Centro de descargas</a> de Synology o en sitios web de terceros).</li>
<li>Las actualizaciones de paquetes aparecer&aacute;n seg&uacute;n las opciones de <strong>Configuraci&oacute;n</strong> &gt; <strong>Actualizaci&oacute;n autom&aacute;tica</strong>. Consulte <a href="configure.html">aqu&iacute;</a> para obtener m&aacute;s informaci&oacute;n.</li>
</ul>
<p><span class="note_head">Nota: </span>Si desea recibir una notificaci&oacute;n por correo electr&oacute;nico o en el escritorio cuando haya actualizaciones disponibles, haga clic en&nbsp;<b>Configuraci&oacute;n</b> &gt; <strong>General</strong> &gt; <strong>Notificaci&oacute;n</strong>, marque las casillas de verificaci&oacute;n y haga clic en <b>OK</b>.</p>

<h4>Para reparar paquetes, elija una de las siguientes opciones:</h4>
<p>Si se producen errores en un paquete de su DiskStation, debe repararlo para hacer que funcione de nuevo. A veces ocurre esto porque el paquete est&aacute; demasiado anticuado para ser compatible con la &uacute;ltima versi&oacute;n de DSM y otras veces faltan archivos de programa del paquete o estos est&aacute;n corruptos.&nbsp; Los paquetes que necesiten ser reparados aparecer&aacute;n bajo la categor&iacute;a <strong>Instalados</strong>. </p>
<ul>
	<li>Haga clic en los botones <strong>Reparar </strong>para reparar paquetes.</li>
	<li>Haga clic en <b>Instalaci&oacute;n manual</b> para reinstalar y reparar un paquete cargando el archivo <b>.spk</b> (disponible en el <a href="http://www.synology.com/support/download.php" target="_blank">Centro de descargas</a> de Synology o en sitios web de terceros). </li>
</ul>
<p><span class="note_head">Nota: </span>Al hacer clic en <strong>Reparar</strong>, instalar&aacute; la &uacute;ltima versi&oacute;n de este paquete en lugar de reparar la antigua. Si sigue teniendo problemas para instalar el paquete, p&oacute;ngase en contacto con su editor o desarrollador.</p>
<h4>Para desinstalar paquetes existentes:</h4>
<p>Haga clic en un paquete instalado y elija <b>Desinstalar</b> en el men&uacute; desplegable <b>Acci&oacute;n</b> para desinstalar el paquete.</p>

<h4>Para ejecutar o detener los servicios de paquete:</h4>
<p>Haga clic en un paquete instalado y elija <b>Ejecutar</b> o <b>Detener</b> en el men&uacute; desplegable <b>Acci&oacute;n</b> para ejecutar o detener el paquete.</p>


<h4>Para solucionar problemas de paquetes:</h4>
<p>Si encuentra alg&uacute;n problema sobre un paquete, pruebe lo siguiente:</p>
<ul>
	<li>Actualice el paquete a la versi&oacute;n m&aacute;s reciente. </li>
	<li>Elimine tanto el paquete como su base de datos (si existe) y vuelva a instalarlo.</li>
	<li>P&oacute;ngase en contacto con el editor o desarrollador del paquete para obtener ayuda y soporte. </li>
</ul>

<h4>Para buscar la informaci&oacute;n de contacto del editor de un paquete:</h4>
<p>Algunos paquetes del Centro de paquetes de Synology han sido creados y publicados por terceros, por lo que Synology no ofrece asistencia t&eacute;cnica para determinadas aplicaciones. P&oacute;ngase en contacto con los editores o desarrolladores de cada aplicaci&oacute;n para solicitar funciones, realizar preguntas o hacerles llegar cualquier otro comentario. Algunos paquetes tienen un editor adem&aacute;s de un desarrollador. El editor crea y pone el paquete a disposici&oacute;n de los productos de Synology, mientras que el desarrollador se encarga de las funcionalidades b&aacute;sicas del paquete.&nbsp; Si existe un editor, solicite asistencia al editor. </p>
<ol>
<li>Vaya a la p&aacute;gina de detalles de un paquete instalado.</li>
	<li>En la parte izquierda de la p&aacute;gina de detalles, encontrar&aacute; la informaci&oacute;n de contacto de su editor o desarrollador.</li>
	<li>&nbsp;Si desea solicitar una funci&oacute;n, realizar una pregunta o enviar un comentario sobre un paquete desarrollado por Synology, puede visitar la <a href="https://www.synology.com/company/contact_us" target="_blank">sitio web de Synology</a> y ponerse en contacto con nosotros directamente.</li>
</ol>

<h3>Iniciar aplicaciones</h3>
<p>Tras instalar y ejecutar los paquetes, puede iniciar las aplicaciones habilitadas de diversas formas.</p>
<h4>Para iniciar una aplicaci&oacute;n instalada y habilitada, realice una de las siguientes acciones:</h4>
<ul>
<li>Vaya a <b>Men&uacute; principal</b> &gt; <b>[Nombre de la aplicaci&oacute;n]</b>.</li>
<li>Abra <b>Men&uacute; principal</b> y arrastre la miniatura de la aplicaci&oacute;n al escritorio DSM y luego haga clic en <b>[Nombre de la aplicaci&oacute;n]</b> en el escritorio.</li>
<li>Vaya a <b>Men&uacute; principal</b> &gt; <b>[Nombre de la aplicaci&oacute;n]</b>. Haga clic con el bot&oacute;n secundario en su icono de la barra de tareas y elija <b>Clavar a la barra de tareas</b>. Cuando se cierre la aplicaci&oacute;n, su icono permanecer&aacute; clavado a la barra de tareas y podr&aacute; hacer clic para iniciar de nuevo la aplicaci&oacute;n.</li>
</ul>

</body>
</html>
