<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>C&oacute;pia de Seguran&ccedil;a de Dados</title>

<link href="../../../../help/help.css" type="text/css" rel="stylesheet" />
<link href="../../../../help/scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../../../help/scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../../../help/scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>C&oacute;pia de Seguran&ccedil;a</h2>

<p><strong>C&oacute;pia de Seguran&ccedil;a e Restauro</strong> permite-lhe salvaguardar v&aacute;rios tipos de dados (configura&ccedil;&otilde;es de sistema, pastas partilhadas e aplica&ccedil;&otilde;es/pacotes) no seu DiskStation, de forma manual ou agendada. Pode armazenar os dados de c&oacute;pia de seguran&ccedil;a em pastas partilhadas locais, servidores remotos e nuvens p&uacute;blicas (Amazon S3, Microsoft Azure, hicloud S3, e SFR NAS BACKUP). Com <strong>C&oacute;pia de Seguran&ccedil;a e Restauro</strong>, cada tarefa de c&oacute;pia de seguran&ccedil;a pode reter m&uacute;ltiplas vers&otilde;es de c&oacute;pia de seguran&ccedil;a e rod&aacute;-las atrav&eacute;s de pol&iacute;ticas de Reciclagem Inteligente.</p>


<h3>C&oacute;pia de Seguran&ccedil;a de Dados</h3>
<p><strong>C&oacute;pia de Seguran&ccedil;a e Restauro</strong> disponibiliza v&aacute;rias op&ccedil;&otilde;es de destino de c&oacute;pia de seguran&ccedil;a e formas de configurar uma tarefa de c&oacute;pia de seguran&ccedil;a.</p>

<h4>Para criar uma tarefa de c&oacute;pia de seguran&ccedil;a de dados:</h4>

<ol>
<li>Clique em <strong>+</strong> no canto inferior esquerdo, e selecione <strong>Tarefa de c&oacute;pia de seguran&ccedil;a de dados</strong> para abrir o Assistente de C&oacute;pia de Seguran&ccedil;a.</li>
<li>Selecione o tipo desejado de destino de c&oacute;pia de seguran&ccedil;a:
<ul>
<li>Pastas partilhadas locais/remotas ou dispositivos de armazenamento externos</li>
<li>Servidores rsync Remotos</li>
<li>Nuvens p&uacute;blicas (por ex., Amazon S3 e Microsoft Azure)</li>
</ul>
</li>
<li>Configure o tipo desejado da sua tarefa de c&oacute;pia de seguran&ccedil;a:
  <ul>
<li>Para criar toda uma nova tarefa, selecione <strong>Criar tarefa de c&oacute;pia de seguran&ccedil;a</strong>.</li>
<li>Para reutilizar os dados de c&oacute;pia de seguran&ccedil;a existentes em qualquer destino, selecione <strong>Reassociar a tarefa existente</strong>. Reassociar ajuda a aproveitar diretamente os dados de c&oacute;pia de seguran&ccedil;a de uma tarefa diferente.</li>
</ul>
</li>

<li>Siga as instru&ccedil;&otilde;es do assistente para concluir as defini&ccedil;&otilde;es. Selecione <strong>Ativar encripta&ccedil;&atilde;o do lado do cliente</strong> para encriptar os dados antes da transmiss&atilde;o para garantir a seguran&ccedil;a dos dados no destino da c&oacute;pia de seguran&ccedil;a.</li>
</ol>


<div class="section">
<h4>Notas:</h4>
<ul>
<li>Os nomes das tarefas podem incluir 1 a 32 caracteres Unicode mas n&atilde;o podem conter os seguintes caracteres:<br> <span class="letterSpace5">! &quot; # $ % &amp; ' ( ) * + , / : ; &lt; = &gt; ? @ [ ] \ ^ ` { } | ~</span></li>
<li>O comprimento m&aacute;ximo do caminho completo da pasta para c&oacute;pia de seguran&ccedil;a &eacute; 2048 caracteres.</li>
<li>Se forem carregados mais de 32000 ficheiros ou pastas para uma pasta partilhada EXT3 atrav&eacute;s de AFP, todas as tarefas de c&oacute;pia de seguran&ccedil;a que incluem a pasta partilhada ir&atilde;o falhar.</li>
<li>Uma pasta partilhada encriptada pode ser salvaguardada quando montada, e restaurada numa pasta encriptada/desencriptada. No entanto, ser&aacute; sempre restaurada como desencriptada /////////e n&atilde;o ser&aacute; automaticamente montada no arranque. &Eacute;-lhe pedido que insira ou importe a chave de encripta&ccedil;&atilde;o da pasta partilhada encriptada para a montar.</li>
<li>N&atilde;o &eacute; suportada a op&ccedil;&atilde;o de efetuar a c&oacute;pia de seguran&ccedil;a de uma pasta encriptada para outra pasta encriptada.</li>
<li>A utiliza&ccedil;&atilde;o de pastas remotas como origem da c&oacute;pia de seguran&ccedil;a ou destino da c&oacute;pia de seguran&ccedil;a n&atilde;o &eacute; suportada.</li>
<li>&Eacute; suportada a c&oacute;pia de seguran&ccedil;a para algumas aplica&ccedil;&otilde;es. Para verificar se um pacote espec&iacute;fico suporta a c&oacute;pia de seguran&ccedil;a e o respetivo conte&uacute;do e limita&ccedil;&otilde;es, consulte a p&aacute;gina de ajuda de cada aplica&ccedil;&atilde;o.</li>
<li class="enable-eds14">O DiskStation n&atilde;o suporta a c&oacute;pia de seguran&ccedil;a da aplica&ccedil;&atilde;o sem um dispositivo de escrita externo EXT3/EXT4.</li>
<li class="enable-eds14">O DiskStation s&oacute; pode realizar c&oacute;pia de seguran&ccedil;a de pastas partilhadas criadas em dispositivos externos EXT3/EXT4.</li>
</ul>
</div>


<div class="section disable-eds14">
<h4>Efetuar c&oacute;pia de seguran&ccedil;a das defini&ccedil;&otilde;es ACL do Windows:</h4>
<p>Tamb&eacute;m &eacute; poss&iacute;vel efetuar a c&oacute;pia de seguran&ccedil;a das defini&ccedil;&otilde;es ACL do Windows dos ficheiros de DiskStation, dependendo dos sistemas de ficheiros do destino:</p>

<ul>
<li>Todos os destinos de c&oacute;pias de seguran&ccedil;a podem copiar defini&ccedil;&otilde;es da ACL do Windows independentemente do sistema de ficheiros do destino</li>
</ul>
</div>

<h4>Para exportar dados de c&oacute;pia de seguran&ccedil;a para nuvens p&uacute;blicas ou Synology NAS remoto:</h4>
<p>Quando salvaguardar muitos dados para uma nuvem p&uacute;blica, recomendamos que exporte a vers&atilde;o inicial para um dispositivo de armazenamento externo (por ex., uma unidade USB) e entregue o dispositivo ao fornecedor do servi&ccedil;o de nuvem. A&iacute; o dispositivo pode ser ligado e os dados carregados diretamente para a nuvem. Desta forma pode reduzir de forma significativa o tempo necess&aacute;rio para a primeira c&oacute;pia de seguran&ccedil;a.</p>
<ol>
<li>Clique em <strong>+</strong> no canto inferior esquerdo, e selecione <strong>Synology NAS remoto</strong> no fornecedor de servi&ccedil;o de nuvem desejado.</li>
<li>Selecione <strong>Exportar para uma pasta partilhada local (incluindo um dispositivo de armazenamento externo)</strong>, e termine as defini&ccedil;&otilde;es. Quando solicitado, selecione <strong>Ativar encripta&ccedil;&atilde;o do lado do cliente</strong> para c&oacute;pia de seguran&ccedil;a de dados protegida.</li>
<li>Entregue o dispositivo de armazenamento externo ao fornecedor do Synology NAS remoto ou fornecedor do seri&ccedil;o de nuvem. Importe os dados exportados do dispositivo de armazenamento externo.</li>
<li>Uma vez confirmado, regresse a <strong>c&oacute;pia de seguran&ccedil;a e restauro</strong>, e clique em <strong>Reassociar agora</strong>.</li>
<li>Siga as instru&ccedil;&otilde;es do Assistente de Reassocia&ccedil;&atilde;o para associar o seu DiskStation ao reposit&oacute;rio. &Eacute; necess&aacute;ria uma palavra-passe/chave de encripta&ccedil;&atilde;o caso os dados exportados estejam encriptados.</li>
</ol>

<div class="section">
	<h4>Nota :</h4>
	<ul>
		<li>A encripta&ccedil;&atilde;o do lado do cliente n&atilde;o pode estar desativada uma vez configurada a tarefa, nem pode ser alterada a palavra-passe.</li>
		<li>Um reposit&oacute;rio de c&oacute;pia de seguran&ccedil;a apenas pode estar associado a uma tarefa de c&oacute;pia de seguran&ccedil;a.</li>
		<li>Se a pasta de origem de c&oacute;pia de seguran&ccedil;a for uma pasta partilhada encriptada ou sua subpasta, a pasta de origem pode ser montada ou desmontada quando cria a tarefa de c&oacute;pia de seguran&ccedil;a.</li>
		<li>As pastas partilhadas encriptadas n&atilde;o podem ser o destino da c&oacute;pia de seguran&ccedil;a.</li>
		<li>Se selecionar <strong>Ativar encripta&ccedil;&atilde;o do lado do cliente</strong>, a sua palavra-passe/chave de encripta&ccedil;&atilde;o &eacute; necess&aacute;ria para restaurar os dados nesta tarefa. <strong>A perda da palavra-passe/chave de encripta&ccedil;&atilde;o resulta na perda permanente dos dados</strong>.</li>
	</ul>
</div>

<h4>Para gerir tarefas de c&oacute;pia de seguran&ccedil;a:</h4>
<p>Selecione uma tarefa de c&oacute;pia de seguran&ccedil;a desejada no painel &agrave; esquerda, e clique nos bot&otilde;es em baixo para a gest&atilde;o correspondente:</p>
<ul>
<li><strong>Efetuar c&oacute;pia de seguran&ccedil;a agora</strong>: Efetuar uma c&oacute;pia de seguran&ccedil;a dos dados da tarefa selecionada imediatamente.</li>
<li><strong>Explorador de c&oacute;pia de seguran&ccedil;a</strong> (o &iacute;cone da lupa): Ver todas as vers&otilde;es de c&oacute;pia de seguran&ccedil;a existentes e copiar/restaurar/transferir os ficheiros nelas contidos.</li>
<li><strong>Lista de Vers&otilde;es</strong>: Veja a hora e estado de cria&ccedil;&atilde;o de todas as vers&otilde;es salvaguardadas, elimine vers&otilde;es anteriores espec&iacute;ficas ou bloqueie outras espec&iacute;ficas para reserva for&ccedil;ada.</li>
<li><strong>Editar</strong>: Modifique a origem, destino, agendamento de c&oacute;pia de seguran&ccedil;a e outras defini&ccedil;&otilde;es.</li>
<li><strong>Eliminar</strong>: Elimine a tarefa de c&oacute;pia de seguran&ccedil;a.</li>
<li><strong>Cancelar</strong>: Interrompa a tarefa de c&oacute;pia de seguran&ccedil;a em execu&ccedil;&atilde;o.</li>
</ul>


<h4>Para rodar vers&otilde;es:</h4>
<p>A rota&ccedil;&atilde;o de c&oacute;pia de seguran&ccedil;a &eacute; um mecanismo de gest&atilde;o de vers&otilde;es. Ajuda a gerir vers&otilde;es de c&oacute;pia de seguran&ccedil;a eliminando automaticamente as vers&otilde;es mais antigas e desnecess&aacute;rias, possivelmente libertando espa&ccedil;o de armazenamento. Pode ativar esta fun&ccedil;&atilde;o nas <strong>Defini&ccedil;&otilde;es de Tarefa</strong> ou configur&aacute;-la quando criar uma tarefa de c&oacute;pia de seguran&ccedil;a.</p>
<ol>
<li>Selecione a tarefa de c&oacute;pia de seguran&ccedil;a desejada no painel &agrave; esquerda, e clique em <strong>Editar</strong> ou <strong>Defini&ccedil;&otilde;es</strong>&gt; <strong>Defini&ccedil;&otilde;es de Tarefa</strong>.</li>
<li>Selecione <strong>Ativar rota&ccedil;&atilde;o de c&oacute;pia de seguran&ccedil;a</strong>, e escolha o modo de rota&ccedil;&atilde;o desejado:
<ul>
<li><strong>De vers&otilde;es mais antigas</strong>: Elimina as vers&otilde;es de c&oacute;pia de seguran&ccedil;a mais antigas quando as vers&otilde;es dispon&iacute;veis excedem o n&uacute;mero definido. </li>
<li><strong>Smart Recycle</strong>: Manter vers&otilde;es de c&oacute;pia de seguran&ccedil;a de acordo com estas pol&iacute;ticas:
  <ul>
<li><strong>Vers&otilde;es de hora a hora das &uacute;ltimas 24 horas</strong>: Manter a vers&atilde;o mais antiga criada cada hora.</li>
<li><strong>Vers&otilde;es di&aacute;rias do &uacute;ltimo 1 dia a 1 m&ecirc;s</strong>: Manter a vers&atilde;o mais antiga criada cada dia.</li>
<li><strong>Vers&atilde;o semanal ap&oacute;s 1 m&ecirc;s</strong>: Manter a vers&atilde;o mais antiga criada cada semana.</li>
</ul>
</li>
</ul>
</li>
<li>Especifique o m&aacute;ximo de <strong>n&uacute;mero de vers&otilde;es</strong>. Quando o n&uacute;mero de vers&atilde;o exceder este n&uacute;mero, a vers&atilde;o mais antiga &eacute; rodada.</li>
<li>Se tiver configurado um agendamento de c&oacute;pia de seguran&ccedil;a repetida em <strong>Agendamento</strong>, pode pr&eacute;-visualizar como ser&atilde;o retidas as suas vers&otilde;es de c&oacute;pia de seguran&ccedil;a e qual o ponto de recupera&ccedil;&atilde;o mais antigo na cronologia.</li>
<li>Clique em <strong>OK </strong> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>As vers&otilde;es bloqueadas nunca ser&atilde;o removidas.</li>
<li>Apenas as tarefas de c&oacute;pia de seguran&ccedil;a multi-vers&atilde;o fornecem rota&ccedil;&atilde;o de vers&atilde;o.</li>
<li>A rota&ccedil;&atilde;o de vers&atilde;o n&atilde;o suportada em DSM 5.1 ou inferior.</li>
<li>A rota&ccedil;&atilde;o ser&aacute; activada logo ap&oacute;s a altera&ccedil;&atilde;o da defini&ccedil;&atilde;o, ou da conclus&atilde;o da tarefa de c&oacute;pia de seguran&ccedil;a.</li>
<li>As vers&otilde;es bloqueadas s&atilde;o exclu&iacute;das quando se calcula o n&uacute;mero m&aacute;ximo de vers&otilde;es.</li>
</ul>

</div>












<h3>Notas sobre Tarefas de c&oacute;pia de seguran&ccedil;a de dados</h3>
<p>Para cada tipo de tarefa de c&oacute;pia de seguran&ccedil;a, leia as seguintes notas quanto a importantes detalhes de configura&ccedil;&atilde;o e sugest&otilde;es de resolu&ccedil;&atilde;o de problemas.</p>

<h4>Tarefas de c&oacute;pia de seguran&ccedil;a locais:</h4>
<ul>
<li>Se os dados no destino forem removidos durante a tarefa de c&oacute;pia de seguran&ccedil;a, ser&aacute; efetuada uma c&oacute;pia de seguran&ccedil;a completa quando a tarefa for efetuada na pr&oacute;xima vez.</li>
<li>Poder&aacute; ser necess&aacute;rio formatar novas unidades externas antes de serem utilizadas como destino da c&oacute;pia de seguran&ccedil;a. </li>
<li>Antes de criar uma tarefa de c&oacute;pia de seguran&ccedil;a, certifique-se de que j&aacute; anexou as unidades externas devidamente ao seu DiskStation. Pode aceder ao <b>Painel de controlo</b> &gt; <b>Dispositivos externos</b> para verificar o estado das unidades USB/eSATA. N&atilde;o &eacute; poss&iacute;vel selecionar unidades externas como destino da c&oacute;pia de seguran&ccedil;a se a unidade externa estiver a ser inicializada, formatada ou estiver avariada.</li>
<li>N&atilde;o &eacute; poss&iacute;vel selecionar pastas partilhadas remotas montadas como origem ou destino da c&oacute;pia de seguran&ccedil;a.</li>
<li>Se uma pasta partilhada encriptada estiver desmontada, n&atilde;o pode ser escolhida como destino da c&oacute;pia de seguran&ccedil;a.</li>
<li>N&atilde;o &eacute; poss&iacute;vel efetuar a c&oacute;pia de seguran&ccedil;a de miniaturas de imagens quando o sistema de ficheiros do destino for NTFS/FAT.</li>
</ul>





<h4>Tarefas de c&oacute;pia de seguran&ccedil;a rsync remotas:</h4>
<ul>
<li>Est&atilde;o dispon&iacute;veis os seguintes modos quando criar uma tarefa de c&oacute;pia de seguran&ccedil;a com servidores compat&iacute;veis com rsync como destino da c&oacute;pia de seguran&ccedil;a da rede: O <b>modo rsync daemon</b>, que &eacute; utilizado quando seleciona um m&oacute;dulo da c&oacute;pia de seguran&ccedil;a (pasta partilhada no servidor compat&iacute;vel com rsync) a partir do menu pendente junto de <b>M&oacute;dulo da c&oacute;pia de seguran&ccedil;a</b> e <b>modo remoto por linha de comandos</b> que &eacute; ativado apenas quando &eacute; introduzido um caminho absoluto (iniciando com &quot;/&quot;) no <b>M&oacute;dulo da c&oacute;pia de seguran&ccedil;a</b>.</li>
<li>Para os utilizadores Linux, s&oacute; as contas <strong>admin</strong>, <strong>root</strong> e <strong>rsync</strong> s&atilde;o permitidas para efetuar tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Se pretender aceder a um servidor de destino atrav&eacute;s da Internet utilizando o respetivo nome de anfitri&atilde;o, o nome do anfitri&atilde;o tem de ser um FQDN (Fully Qualified Domain Name &ndash; Nome de Dom&iacute;nio Totalmente Qualificado), por exemplo <strong>abc.bcd.com</strong>.</li>
<li>Quando efectuar uma c&oacute;pia de seguran&ccedil;a a partir de um dispositivo Synology NAS para outro, ser-lhe-&aacute; pedido para introduzir o nome de utilizador e a palavra-passe de uma conta no destino. Quando efetua uma c&oacute;pia de seguran&ccedil;a de pastas partilhadas para outro DiskStation, pode faz&ecirc;-lo de acordo com as defini&ccedil;&otilde;es de privil&eacute;gio de acesso das pastas. S&oacute; as pastas partilhadas para as quais a conta de utilizador especificada tiver privil&eacute;gios de acesso estar&atilde;o vis&iacute;veis. Se n&atilde;o conseguir encontrar a pasta partilhada pretendida no destino, verifique os seus privil&eacute;gios de acesso.</li>
<li>A transfer&ecirc;ncia de encripta&ccedil;&atilde;o &eacute; suportada apenas quando o servidor de destino suporta a c&oacute;pia de seguran&ccedil;a da rede encriptada e a palavra-passe de autentica&ccedil;&atilde;o n&atilde;o est&aacute; vazia.</li>
<li>O modo remoto por linha de comandos apenas suporta a transfer&ecirc;ncia de encripta&ccedil;&atilde;o.</li>
<li>Se estiver a salvaguardar ficheiros para um Synology NAS atrav&eacute;s de um cliente rsync, os nomes dos ficheiros devem estar com codifica&ccedil;&atilde;o UTF-8.</li>
<li>Se estiver a efetuar c&oacute;pias de seguran&ccedil;a de ficheiros para um Synology NAS atrav&eacute;s de um cliente compat&iacute;vel com rsync, s&oacute; pode efetuar a tarefa atrav&eacute;s de contas <strong>admin</strong>, <strong>root</strong> e <strong>rsync</strong> do DiskStation.</li>
<li>Se estiver a efetuar c&oacute;pias de seguran&ccedil;a de ficheiros do seu DiskStation para um servidor compat&iacute;vel com rsync, ir&aacute; necessitar de introduzir o nome e a palavra-passe da conta de c&oacute;pia de seguran&ccedil;a rsync. Tamb&eacute;m ter&aacute; de escolher o m&oacute;dulo de c&oacute;pia de seguran&ccedil;a correto com privil&eacute;gio de Escrita.</li>
</ul>



<h4>Tarefas de c&oacute;pia de seguran&ccedil;a Amazon S3:</h4>
<ul>
  <li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor Amazon S3 como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es, tais como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, a c&oacute;pia de seguran&ccedil;a para Amazon S3 RRS (Armazenamento de Redund&acirc;ncia Reduzida) e outras. Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
  <li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Bucket</strong> que selecionou no servidor Amazon S3 e o Valor Set KEY come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
  <li>A estrutura de dados do Amazon S3 inclui um par de Bucket e KEY sem qualquer estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
  <li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor Amazon S3 no mesmo Bucket.</li>
  <li>Cada Bucket no Amazon S3 deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
  <li>incluir entre 3 a 63 caracteres</li>
  <li>conter apenas letras min&uacute;sculas, n&uacute;meros, pontos (.) e tra&ccedil;os (-).</li><li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode terminar com um tra&ccedil;o (-), conter dois pontos seguidos ou conter tra&ccedil;os junto de pontos (por exemplo, &quot;my-.bucket.com&quot; e &quot;my.-bucket&quot; s&atilde;o inv&aacute;lidos).</li>
</ul>
<li>O comprimento m&aacute;ximo de uma Amazon S3 KEY &eacute; 1024 caracteres. Para garantir uma c&oacute;pia de seguran&ccedil;a com &ecirc;xito para Amazon S3, o comprimento m&aacute;ximo do caminho &eacute; 1024 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>
<li>Se ativar o suporte Amazon S3 RRS (Armazenamento de Redund&acirc;ncia Reduzida), apenas os dados modificados depois da op&ccedil;&atilde;o ter sido ativada ter&atilde;o uma c&oacute;pia de seguran&ccedil;a no armazenamento RRS, significando que os dados que j&aacute; t&ecirc;m c&oacute;pia de seguran&ccedil;a no armazenamento padr&atilde;o Amazon S3 n&atilde;o ter&atilde;o uma nova c&oacute;pia de seguran&ccedil;a no RRS. </li>
<li>O deslocamento de ficheiros com c&oacute;pia de seguran&ccedil;a de Amazon S3 para Amazon Glacier n&atilde;o &eacute; suportado. Se os ficheiros forem deslocados de Amazon S3 para Amazon Glacier atrav&eacute;s da consola de Gest&atilde;o AWS, as tarefas de c&oacute;pia de seguran&ccedil;a correspondentes poder&atilde;o falhar.</li>
<li>A c&oacute;pia de seguran&ccedil;a de ficheiros para buckets virtuais de estilo alojado com SSL n&atilde;o &eacute; suportada.</li>
<li>Para a realiza&ccedil;&atilde;o da transfer&ecirc;ncia de um ficheiro, esse ficheiro ser&aacute; dividido em partes. O tamanho de cada parte pode ser definido pela op&ccedil;&atilde;o <strong>Tamanho de cada parte no carregamento de m&uacute;ltiplas partes</strong> nas defini&ccedil;&otilde;es de tarefas com o valor predefinido de 512MB. Se o ambiente de rede n&atilde;o for est&aacute;vel, &eacute; recomendado que a op&ccedil;&atilde;o seja um n&uacute;mero menor.</li>

<li>O n&uacute;mero m&aacute;ximo de partes por carregamento &eacute; de 10000. O tamanho m&aacute;ximo de um ficheiro &eacute; o <strong>Tamanho de cada parte no carregamenteo de m&uacute;ltiplas partes</strong> multiplicado por 10000.</li>
<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li>
</ul>



<h4>Tarefas de c&oacute;pia de seguran&ccedil;a Microsoft Azure:</h4>
<ul>
<li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor Microsoft Azure como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es (por exemplo, a encripta&ccedil;&atilde;o de transfer&ecirc;ncia). Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Recipiente</strong> que selecionou no servidor Microsoft Azure e o nome definido de Blob come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
<li>A estrutura de dados do Microsoft Azure inclui um emparelhamento de Recipiente e Blob sem qualquer estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
<li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor Microsoft Azure no mesmo Recipiente.</li>
<li>Cada Recipiente no Microsoft Azure deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
<li>incluir entre 3 a 63 caracteres</li>
<li>conter apenas letras min&uacute;sculas, n&uacute;meros e tra&ccedil;os (-).</li>
<li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode conter dois pontos seguidos.</li>
</ul>
<li>O comprimento m&aacute;ximo de um nome Microsoft Azure Blob &eacute; 1024 caracteres. Para garantir uma tarefa de c&oacute;pia de seguran&ccedil;a com &ecirc;xito para Microsoft Azure, o comprimento m&aacute;ximo do caminho &eacute; 1024 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>

<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li>
<li>A mensagem de aviso de falha na autentica&ccedil;&atilde;o pode ser provocada por informa&ccedil;&otilde;es de autentica&ccedil;&atilde;o incorretas, um problema de liga&ccedil;&atilde;o &agrave; rede ou pelo facto de a hora no seu DiskStation e no servidor remoto n&atilde;o coincidirem. Para verificar a defini&ccedil;&atilde;o da hora no seu DiskStation, aceda a <strong>Painel de Controlo</strong> &gt; <strong>Op&ccedil;&otilde;es Regionais</strong> &gt; <strong>Hora</strong> para sincronizar a hora com o servidor NTP.</li>
</ul>



<h4>tarefas de c&oacute;pia de seguran&ccedil;a hicloud S3:</h4>
<ul>
<li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor hicloud S3 como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es (por exemplo, a encripta&ccedil;&atilde;o de transfer&ecirc;ncia). Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Bucket</strong> que selecionou no servidor hicloud S3 e o Valor Set KEY come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
<li>A estrutura de dados do hicloud S3 inclui um emparelhamento de Bucket e KEY sem qualquer estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
<li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor hicloud S3 no mesmo Bucket.</li>
<li>Cada Bucket no hicloud S3 deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
<li>incluir entre 3 a 63 caracteres</li>
<li>conter apenas letras min&uacute;sculas, n&uacute;meros, pontos (.) e tra&ccedil;os (-).</li>
<li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode terminar com um tra&ccedil;o (-), conter dois pontos seguidos ou conter tra&ccedil;os junto de pontos (por exemplo, &quot;my-.bucket.com&quot; e &quot;my.-bucket&quot; s&atilde;o inv&aacute;lidos).</li>
</ul>
<li>O comprimento m&aacute;ximo de uma hicloud S3 KEY &eacute; 255 caracteres. Para garantir uma c&oacute;pia de seguran&ccedil;a com &ecirc;xito para hicloud S3, o comprimento m&aacute;ximo do caminho &eacute; 255 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>
<li>Para a realiza&ccedil;&atilde;o da transfer&ecirc;ncia de um ficheiro, esse ficheiro ser&aacute; dividido em partes. O tamanho de cada parte pode ser definido pela op&ccedil;&atilde;o <strong>Tamanho de cada parte no carregamento de m&uacute;ltiplas partes</strong> nas defini&ccedil;&otilde;es de tarefas com o valor predefinido de 512MB. Se o ambiente de rede n&atilde;o for est&aacute;vel, &eacute; recomendado que seja definido um n&uacute;mero menor.</li>

<li>Hicloud suporta apenas um m&aacute;ximo de 1000 partes por transfer&ecirc;ncia. Significa isto que o tamanho de ficheiro total n&atilde;o poder&aacute; exceder 1000 multiplicado pelo tamanho da parte. Por exepmplo, se o Tamanho de Parte de Carregamento Multiparte estiver configurado para 8MB, n&atilde;o conseguir&aacute; enviar um ficheiro &uacute;nico acima de 8000MB. </li>

<li>A c&oacute;pia de seguran&ccedil;a da pasta partilhada encriptada n&atilde;o &eacute; suportada.</li> 

<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li>
</ul>


  

<h4>Tarefas de c&oacute;pia de seguran&ccedil;a SFR NAS BACKUP:</h4>
<ul>
<li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor SFR NAS BACKUP como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es, como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia e outras. Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Bucket</strong> que selecionou no servidor SFR NAS BACKUP e o Valor Set KEY come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
<li>A estrutura de dados do SFR NAS BACKUP inclui um emparelhamento de Bucket e Key numa estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
<li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor SFR NAS BACKUP no mesmo Bucket.</li>
<li>Cada Bucket do SFR NAS BACKUP deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
<li>incluir entre 3 a 63 caracteres</li>
<li>conter apenas letras min&uacute;sculas, n&uacute;meros, pontos (.) e tra&ccedil;os (-).</li>
<li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode terminar com um tra&ccedil;o (-), conter dois pontos seguidos ou conter tra&ccedil;os junto de pontos (por exemplo, &quot;my-.bucket.com&quot; e &quot;my.-bucket&quot; s&atilde;o inv&aacute;lidos).</li>
</ul>
<li>O comprimento m&aacute;ximo de uma SFR NAS BACKUP KEY &eacute; 1024 caracteres. Para garantir uma c&oacute;pia de seguran&ccedil;a com &ecirc;xito para o SFR NAS BACKUP, o comprimento m&aacute;ximo do caminho &eacute; 1024 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>
<li>Para a realiza&ccedil;&atilde;o da transfer&ecirc;ncia de um ficheiro, esse ficheiro ser&aacute; dividido em partes. O tamanho de cada parte pode ser definido pela op&ccedil;&atilde;o <strong>Tamanho de cada parte no carregamento de m&uacute;ltiplas partes</strong> nas defini&ccedil;&otilde;es de tarefas com o valor predefinido de 64MB. Se o ambiente de rede n&atilde;o for est&aacute;vel, &eacute; recomendado que seja definido um n&uacute;mero menor.</li>

<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li> 

</ul>

<h4>Outras tarefas de c&oacute;pia de seguran&ccedil;a compat&iacute;veis com S3:</h4>
<ul>
<li>Para usar outras nuvens compat&iacute;veis com S3, introduza o endere&ccedil;o IP/dom&iacute;nio da nuvem compat&iacute;vel com S3 desejada no campo <strong>Servidor S3</strong> quando solicitado.</li>
<li>Se houver problemas de utiliza&ccedil;&atilde;o, consulte a documenta&ccedil;&atilde;o relevante ou contacte o fornecedor do servi&ccedil;o de nuvem compat&iacute;vel com S3.</li>
</ul>

<h3>C&oacute;pia de Seguran&ccedil;a LUN*</h3>

<p>Pode usar <b>C&oacute;pia de seguran&ccedil;a LUN local</b> para salvaguardar os iSCSI LUNs no seu DiskStation para pastas partilhadas locais. Pode tamb&eacute;m utilizar <b>C&oacute;pia de Seguran&ccedil;a LUN de Rede (Synology Server)</b> para efectuar a c&oacute;pia de seguran&ccedil;a de outro DiskStation.</p>

<h4>Para efectuar c&oacute;pia de seguran&ccedil;a de um iSCSI LUN:</h4>
<ol>
<li>Clique em <strong>+</strong> no canto inferior esquerdo e selecione <strong>Tarefa de c&oacute;pia de seguran&ccedil;a LUN</strong>.
</li>
<li>
Quando lhe for pedido que escolha um tipo de destino, escolha um dos seguintes:
</li>
<ul>
<li>
<b>C&oacute;pia de Seguran&ccedil;a LUN Local</b>: Escolha esta op&ccedil;&atilde;o para efectuar a c&oacute;pia de seguran&ccedil;a LUN a partir de DiskStation para uma pasta partilhada local ou um meio de armazenamento externo que esteja ligado &agrave; porta USB ou eSATA de DiskStation.
</li>
<li><b>C&oacute;pia de Seguran&ccedil;a LUN de Rede (Synology Server)</b>: Escolha esta op&ccedil;&atilde;o para efectuar a c&oacute;pia de seguran&ccedil;a LUN a partir de DiskStation para outro DiskStation.
</li>
</ul>
<li>
Quando solicitado, especifique o destino da c&oacute;pia de seguran&ccedil;a e LUN de origem e defina o agendamento de c&oacute;pia de seguran&ccedil;a.
</li>
<li>
Siga o assistente para concluir a configura&ccedil;&atilde;o.
</li>
</ol>
<p>Ap&oacute;s a cria&ccedil;&atilde;o da tarefa de c&oacute;pia de seguran&ccedil;a, o DiskStation ir&aacute; efectuar a tarefa de c&oacute;pia de seguran&ccedil;a de acordo com o agendamento e armazenar a c&oacute;pia de seguran&ccedil;a LUN no destino. A c&oacute;pia de seguran&ccedil;a LUN &eacute; utilizada apenas para fins de c&oacute;pia de seguran&ccedil;a. Para aceder &agrave; c&oacute;pia de seguran&ccedil;a LUN, consulte <a href="restore.html">Para restaurar a c&oacute;pia de seguran&ccedil;a LUN</a> para obter mais informa&ccedil;&otilde;es.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>LUNs de Ficheiro Normal e N&iacute;vel de Bloqueio ter&atilde;o uma c&oacute;pia de seguran&ccedil;a como imagens de ficheiros no destino. Se forem restaurados, todos os LUNs de N&iacute;vel de Bloqueio ser&atilde;o alterados para LUNs de Ficheiro.</li>
<li>Cada tarefa de c&oacute;pia de seguran&ccedil;a pode apenas incluir um LUN como origem de c&oacute;pia de seguran&ccedil;a.</li>
<li>N&atilde;o &eacute; poss&iacute;vel efectuar c&oacute;pia de seguran&ccedil;a de LUNs para um disco externo com formato FAT, FAT32, HFS, HFS Plus ou NTFS.</li>
<li>Antes de efectuar a C&oacute;pia de Seguran&ccedil;a LUN de Rede, inicie sess&atilde;o no DiskStation de destino para certificar-se de que o respectivo servi&ccedil;o de C&oacute;pia de Seguran&ccedil;a da Rede est&aacute; activado em <b>Painel de Controlo</b> &gt; <b>Servi&ccedil;os de c&oacute;pia de seguran&ccedil;a</b>.</li>
<li>Se o DiskStation estabelecer liga&ccedil;&atilde;o &agrave; rede atrav&eacute;s de um router, certifique-se de que especificou uma regra de reencaminhamento de portas para o servi&ccedil;o iSCSI (porta TCP 3260) no router antes de efectuar a C&oacute;pia de Seguran&ccedil;a LUN de Rede.</li>
</ul>
</div>


<div class="section">
<h4>Acerca da C&oacute;pia de Seguran&ccedil;a Completa e C&oacute;pia de Seguran&ccedil;a Incremental:</h4>
<p>
DiskStation ir&aacute; efectuar uma c&oacute;pia de seguran&ccedil;a completa do LUN seleccionado pela primeira vez e, em seguida, efectuar uma c&oacute;pia de seguran&ccedil;a incremental. No entanto, se o nome da pasta partilhada ou nome do direct&oacute;rio do destino de c&oacute;pia de seguran&ccedil;a for alterado, DiskStation ir&aacute; efectuar novamente uma c&oacute;pia de seguran&ccedil;a completa.
</p>
</div>

<p>____<br /> * Apenas dispon&iacute;vel em modelos espec&iacute;ficos.</p>

</body></html>
