<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>C&oacute;pia de Seguran&ccedil;a LUN</h2>
<p>No separador <b>C&oacute;pia de Seguran&ccedil;a</b> de <b>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</b>, pode utilizar <b>C&oacute;pia de Seguran&ccedil;a LUN Local</b> para efectuar a c&oacute;pia de seguran&ccedil;a de iSCSI LUNs em DiskStation para pastas partilhadas locais. Pode tamb&eacute;m utilizar <b>C&oacute;pia de Seguran&ccedil;a LUN de Rede</b> para efectuar a c&oacute;pia de seguran&ccedil;a de outro DiskStation.</p>

<h4>Para efectuar c&oacute;pia de seguran&ccedil;a de um iSCSI LUN:</h4>
<ol>
<li>
Escolha <b>Criar</b> &gt; <b>Tarefa de c&oacute;pia de seguran&ccedil;a LUN</b> para abrir o <b>Assistente de C&oacute;pia de Seguran&ccedil;a LUN</b> e clique em <b>Seguinte</b>.
</li>
<li>
Quando lhe for pedido que escolha um tipo de destino, escolha um dos seguintes:
</li>
<ul>
<li>
<b>C&oacute;pia de Seguran&ccedil;a LUN Local</b>: Escolha esta op&ccedil;&atilde;o para efectuar a c&oacute;pia de seguran&ccedil;a LUN a partir de DiskStation para uma pasta partilhada local ou um meio de armazenamento externo que esteja ligado &agrave; porta USB ou eSATA de DiskStation.
</li>
<li><b>C&oacute;pia de Seguran&ccedil;a LUN de Rede</b>: Escolha esta op&ccedil;&atilde;o para efectuar a c&oacute;pia de seguran&ccedil;a LUN a partir de DiskStation para outro DiskStation.
</li>
</ul>
<li>
Quando solicitado, especifique o destino da c&oacute;pia de seguran&ccedil;a e LUN de origem e defina o agendamento de c&oacute;pia de seguran&ccedil;a.
</li>
<li>
Siga o assistente para concluir a configura&ccedil;&atilde;o.
</li>
</ol>
<p>Ap&oacute;s a cria&ccedil;&atilde;o da tarefa de c&oacute;pia de seguran&ccedil;a, o DiskStation ir&aacute; efectuar a tarefa de c&oacute;pia de seguran&ccedil;a de acordo com o agendamento e armazenar a c&oacute;pia de seguran&ccedil;a LUN no destino. A c&oacute;pia de seguran&ccedil;a LUN &eacute; utilizada apenas para fins de c&oacute;pia de seguran&ccedil;a. Para aceder &agrave; c&oacute;pia de seguran&ccedil;a LUN, consulte <a href="restore.html">Para restaurar a c&oacute;pia de seguran&ccedil;a LUN</a> para obter mais informa&ccedil;&otilde;es.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>LUNs de Ficheiro Normal e N&iacute;vel de Bloqueio ter&atilde;o uma c&oacute;pia de seguran&ccedil;a como imagens de ficheiros no destino. Se forem restaurados, todos os LUNs de N&iacute;vel de Bloqueio ser&atilde;o alterados para LUNs de Ficheiro.</li>
<li>Cada tarefa de c&oacute;pia de seguran&ccedil;a pode apenas incluir um LUN como origem de c&oacute;pia de seguran&ccedil;a.</li>
<li>N&atilde;o &eacute; poss&iacute;vel efectuar c&oacute;pia de seguran&ccedil;a de LUNs para um disco externo com formato FAT, FAT32, HFS, HFS Plus ou NTFS.</li>
<li>Antes de efectuar a C&oacute;pia de Seguran&ccedil;a LUN de Rede, inicie sess&atilde;o no DiskStation de destino para certificar-se de que o respectivo servi&ccedil;o de C&oacute;pia de Seguran&ccedil;a da Rede est&aacute; activado em <b>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</b> &gt; <b>Servi&ccedil;os de Apoio</b>.</li>
<li>Se o DiskStation estabelecer liga&ccedil;&atilde;o &agrave; rede atrav&eacute;s de um router, certifique-se de que especificou uma regra de reencaminhamento de portas para o servi&ccedil;o iSCSI (porta TCP 3260) no router antes de efectuar a C&oacute;pia de Seguran&ccedil;a LUN de Rede.</li>
</ul>
</div>


<div class="section">
<h4>Acerca da C&oacute;pia de Seguran&ccedil;a Completa e C&oacute;pia de Seguran&ccedil;a Incremental:</h4>
<p>
DiskStation ir&aacute; efectuar uma c&oacute;pia de seguran&ccedil;a completa do LUN seleccionado pela primeira vez e, em seguida, efectuar uma c&oacute;pia de seguran&ccedil;a incremental. No entanto, se o nome da pasta partilhada ou nome do direct&oacute;rio do destino de c&oacute;pia de seguran&ccedil;a for alterado, DiskStation ir&aacute; efectuar novamente uma c&oacute;pia de seguran&ccedil;a completa.
</p>
</div>
</body></html>
