<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a - Ajuda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Allow other users to back up data from their Synology product or rsync-compatible clients to your Synology product.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a</h2>
<p>As op&ccedil;&otilde;es em <strong>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</strong> &gt; <strong>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a</strong> permitem que outros utilizadores efetuem c&oacute;pias de seguran&ccedil;a dos respetivos dispositivos DiskStation ou de clientes compat&iacute;veis com rsync para o seu DiskStation.</p>
<h3>Ativa&ccedil;&atilde;o do Servi&ccedil;o de C&oacute;pia de Seguran&ccedil;a da Rede</h3>
<p>Se quiser realizar c&oacute;pia de seguran&ccedil;a de dados de um DiskStation ou do servidor rsync compat&iacute;vel para outro DiskStation ou permitir que outro dispositivo DiskStation realize tarefas de c&oacute;pia de seguran&ccedil;a remotas e guardar dados da c&oacute;pia de seguran&ccedil;a num volume do seu dispositivo DiskStation, ter&aacute; de ativar primeiro o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a da rede no servidor de destino antes de criar uma tarefa de c&oacute;pia de seguran&ccedil;a de rede. Pode fazer isto ao aceder ao <b>Painel de Controlo</b> &gt; <b>Privil&eacute;gios</b> e conceder o privil&eacute;gio <b>Destino da c&oacute;pia de seguran&ccedil;a de rede</b> a um utilizador. Pode ent&atilde;o criar um utilizador DSM com a devida aplica&ccedil;&atilde;o e os privil&eacute;gios de pasta partilhada no seu DiskStation. Quando a configura&ccedil;&atilde;o estiver conclu&iacute;da, os outros utilizadores podem utilizar os privil&eacute;gios do utilizador para efetuar c&oacute;pias de seguran&ccedil;a de rede a partir de DiskStation para as pastas partilhadas de destino em DiskStation.</p>

<h4>Para ativar o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a de uma vers&atilde;o:</h4>
<ol>
<li>Aceda a <b>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a</b> &gt; <b>Destino da C&oacute;pia de Seguran&ccedil;a da Rede</b> e marque <b>Ativar servi&ccedil;o de c&oacute;pia de seguran&ccedil;a da rede</b>.</li>
<li>Clique em <b>Aplicar</b>.</li>
<li>Aceda a <b>Painel de controlo</b> &gt; <b>Pasta Partilhada</b>, selecione uma pasta partilhada, clique em <b>Editar</b> &gt; <b>Permiss&otilde;es</b> e conceda o privil&eacute;gio <b>Leitura/Escrita</b> a um utilizador. Repita este passo para incluir mais pastas partilhadas que possam ser utilizadas como destinos da c&oacute;pia de seguran&ccedil;a.</li>
</ol>
<h4>Para ativar o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a de vers&atilde;o m&uacute;ltipla:</h4>
<ol>
  <li>Aceda a <strong>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a</strong> &gt; <b>Volume de destino da c&oacute;pia de seguran&ccedil;a de rede</b> e marque a caixa perto de <strong>Ativar o volume do destino da c&oacute;pia de seguran&ccedil;a da rede</strong>.</li>
  <li>Aceda a <b>Destino da c&oacute;pia de seguran&ccedil;a</b> e selecione um destino da c&oacute;pia de seguran&ccedil;a associado com um volume local.</li>
<li>Clique em <b>Editar</b> &gt; <b>Lista Autorizada</b> &gt;  <strong>Adicionar</strong> para adicionar o utilizador ou o grupo &agrave; lista.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se outras pessoas pretenderem efetuar uma c&oacute;pia de seguran&ccedil;a de rede a partir de um cliente que n&atilde;o seja DiskStation, apenas o podem fazer com os privil&eacute;gios <b>admin</b> ou <b>rsync</b> em DiskStation. Caso n&atilde;o queira partilhar as suas credenciais de <b>admin</b> com outras pessoas, pode aceder a <b>Painel de Controlo</b> &gt; <strong>Utilizador</strong> para criar um utilizador com o nome <b>rsync</b>, modificar os privil&eacute;gios e, em seguida, partilhar as credenciais de utilizador com outras pessoas.</li><li>Se realizar a c&oacute;pia de seguran&ccedil;a de rede de um DiskStation a executar uma vers&atilde;o do DSM anterior a 3.0 ou um cliente que n&atilde;o seja DiskStation, e pretenda guardar os dados da fonte da informa&ccedil;&atilde;o do <b>propriet&aacute;rio</b> e <b>grupo</b>, deve adicionar a <b>conta da c&oacute;pia de seguran&ccedil;a</b> ao grupo <b>administrators</b>, e efetuar c&oacute;pia de seguran&ccedil;a dos dados para a pasta partilhada <b>NetBackup</b>.</li>
</ul>
</div>
<h3>Ativa&ccedil;&atilde;o do Servi&ccedil;o de C&oacute;pia de Seguran&ccedil;a de Rede Utilizando a Configura&ccedil;&atilde;o Rsync Personalizada</h3>
<p> Pode ativar o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a de rede utilizando a configura&ccedil;&atilde;o rsync personalizada e configurar os privil&eacute;gios do utilizador e destino de c&oacute;pia de seguran&ccedil;a em DiskStation. Quando a configura&ccedil;&atilde;o estiver conclu&iacute;da, outros podem realizar a c&oacute;pia de seguran&ccedil;a rsync a partir dos dispositivos DiskStation ou clientes compat&iacute;veis com rsync para as pastas partilhadas de destino (ou &quot;m&oacute;dulos de c&oacute;pia de seguran&ccedil;a&quot;) no seu DiskStation.</p>
<h4>Para ativar o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a de rede utilizando a configura&ccedil;&atilde;o rsync personalizada:</h4>
<ol>
<li>Aceda a <b>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a</b> &gt; <b>Destino de C&oacute;pia de Seguran&ccedil;a da Rede</b>.</li>
<li>Assinale <b>Ativar o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a da rede</b>.</li>
<li>Assinale <b>Utilizar configura&ccedil;&atilde;o rsync personalizada</b>.</li>
<li>Clique em <b>Aplicar</b>.</li>
<img src="about:blank" class="help_image"/>

</ol>
<h4>Para configurar os privil&eacute;gios do utilizador e m&oacute;dulos de c&oacute;pia de seguran&ccedil;a em DiskStation:</h4>
<ol>
<li>
Inicie sess&atilde;o no seu dispositivo DiskStation atrav&eacute;s de Telnet ou SSH.
</li>
<li>Especifique o m&oacute;dulo de c&oacute;pia de seguran&ccedil;a e utilizadores autorizados no ficheiro de configura&ccedil;&atilde;o rsync &quot;<b>/etc/rsyncd.conf</b>&quot;. Para obter informa&ccedil;&otilde;es detalhadas, consulte a p&aacute;gina do manual de <b>rsyncd.conf</b> no seu cliente rsync ou <a href="http://rsync.samba.org/ftp/rsync/rsyncd.conf.html" target="_blank">aqui</a>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se a configura&ccedil;&atilde;o rsync personalizada for utilizada, DiskStation j&aacute; n&atilde;o poder&aacute; funcionar como servidor de destino para <b>Sincroniza&ccedil;&atilde;o de Pasta Partilhada</b>, <b>Time Backup</b> e <b>C&oacute;pia de Seguran&ccedil;a LUN</b>.</li>
</ul>
</div>

<h3>Ativa&ccedil;&atilde;o do Limite de Velocidade</h3>
<p>Pode ativar um limite de velocidade para controlar a largura de banda m&aacute;xima utiliz&aacute;vel para utilizadores e grupos que transferem dados atrav&eacute;s da c&oacute;pia de seguran&ccedil;a da rede.</p>
<h4>Para activar o limite de velocidade:</h4>
<ol>
  <li>Aceda a <b>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a</b> &gt; <b>Destino de C&oacute;pia de Seguran&ccedil;a da Rede</b>. Selecione a caixa marcada <b>Ativar limite de velocidade</b> ou <strong>Ativar limite de velocidade de acordo com um agendamento</strong> se pretender implementar um limite de velocidade apenas em horas espec&iacute;ficas. Esta &eacute; uma defini&ccedil;&atilde;o ao n&iacute;vel do servidor e ir&aacute; substituir as defini&ccedil;&otilde;es de grupos e utilizadores individuais. A escolha de <strong>Sem limite de velocidade</strong> desativa as defini&ccedil;&otilde;es do limite de velocidade de todos os utilizadores e grupos.</li>
  <li>Clique em <strong>Defini&ccedil;&otilde;es de Limite de Velocidade</strong> para modificar as defini&ccedil;&otilde;es de grupos ou utilizadores individuais. Para cada utilizador e grupo, pode selecionar uma das seguintes op&ccedil;&otilde;es:
    <ul>
      <li><strong>Aplicar Defini&ccedil;&otilde;es de Grupo:</strong> As defini&ccedil;&otilde;es do limite de velocidade ser&atilde;o iguais &agrave;s defini&ccedil;&otilde;es do grupo ao qual pertence o utilizador. </li>
      <li><strong>Nenhum:</strong> N&atilde;o ser&aacute; aplicado qualquer limite de velocidade quando os membros do grupo transferirem ficheiros com o servi&ccedil;o.</li>
      <li><strong>Constante:</strong> Ser&aacute; aplicado um limite de velocidade fixo e constante ao utilizador ou membros do grupo. Os limites de velocidade de carregamento e transfer&ecirc;ncia podem ser especificados nos campos &agrave; esquerda.</li>
      <li><strong>Vari&aacute;vel:</strong> &Eacute; poss&iacute;vel especificar e aplicar dois limites de velocidade diferentes aos membros do grupo ou utilizadores de acordo com um agendamento. Clique no bot&atilde;o <strong>Personalizar</strong> para modificar as defini&ccedil;&otilde;es do limite de velocidade e definir um agendamento.</li>
    </ul>
  </li>
 <li>Clique em <b>Aplicar</b>.</li> 
<img src="about:blank" class="help_image"/>

</ol>
<div class="section">
  <h4>Nota:</h4>
    <p>Quando definir o limite de velocidade para um utilizador, a sec&ccedil;&atilde;o <strong>Resultado</strong> apresenta o limite de velocidade real do utilizador de acordo com as defini&ccedil;&otilde;es de grupo e individuais. Por exemplo, se um utilizador &quot;Achilles&quot; tiver um limite de transfer&ecirc;ncia individual de 100 KB/s, mas pertencer a um grupo de utilizadores com um limite de transfer&ecirc;ncia de 500 KB/s, a sec&ccedil;&atilde;o <strong>Resultados</strong> apresenta &quot;0/500&quot;.</p>
</div>

<h3>Ativa&ccedil;&atilde;o do Servi&ccedil;o Time Backup</h3>
<p>O servi&ccedil;o Time Backup permite aos utilizadores efetuarem, remotamente, c&oacute;pias de seguran&ccedil;a de v&aacute;rias vers&otilde;es de pastas de outro DiskStation para este DiskStation. &Eacute; necess&aacute;rio que o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a da rede e o servi&ccedil;o Time Backup estejam ambos ativados.</p>
<h4>Para ativar os servi&ccedil;os da c&oacute;pia de seguran&ccedil;a da rede e do Time Backup:</h4>
<p>Aceda a <strong>Servi&ccedil;os de C&oacute;pia de Seguran&ccedil;a</strong> &gt; <b>Time Backup</b>. Assinale a caixa de verifica&ccedil;&atilde;o correspondente.</p>
<img src="about:blank" class="help_image"/>

<div class="section">
<h4>Nota:</h4>
<p>Apenas a conta de admin pode criar a liga&ccedil;&atilde;o de c&oacute;pia de seguran&ccedil;a para Time Backup remoto.</p>
</div>

</body>
</html>
