<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Destino da C&oacute;pia de Seguran&ccedil;a - Ajuda do Synology DSM</title>

<meta name="author" content="Synology Inc.">
<meta name="description" content="Define local, network or cloud backup destination for backup tasks.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Destino da c&oacute;pia de seguran&ccedil;a</h2>
<p>No separador <b>Destino da c&oacute;pia de seguran&ccedil;a</b> de <b>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</b>, pode definir um local, rede ou destino da c&oacute;pia de seguran&ccedil;a, antes de criar uma tarefa de c&oacute;pia de seguran&ccedil;a.</p>

<h4><a name="local_backup"></a>Para criar um destino da c&oacute;pia de seguran&ccedil;a local:</h4>
<p>&Eacute; necess&aacute;rio um destino da c&oacute;pia de seguran&ccedil;a local para efetuar a c&oacute;pia de seguran&ccedil;a dos dados do DiskStation para uma pasta partilhada local, volume ou unidade externa USB/eSATA. O destino da c&oacute;pia de seguran&ccedil;a tem de ser diferente da origem e a capacidade do destino tem de ser superior ao tamanho total dos dados para os quais ser&aacute; efetuada a c&oacute;pia de seguran&ccedil;a.</p>

<ol>
<li>Clique em <b>Criar</b>, escolha <b>Destino da C&oacute;pia de Seguran&ccedil;a Local</b> e, em seguida, clique em <b>Seguinte</b>.</li>
<img src="about:blank" class="help_image"/>

<li>Atribua um nome a este destino da c&oacute;pia de seguran&ccedil;a, selecione o destino onde os dados da c&oacute;pia de seguran&ccedil;a ir&atilde;o ser guardados e se deseja manter apenas a c&oacute;pia de seguran&ccedil;a mais recente ou conservar todas as vers&otilde;es da c&oacute;pia de seguran&ccedil;a.</li>
</ol>

<div class="section">
<h4>Notas:</h4>
<ul>
<li>Se os dados no destino forem removidos durante a tarefa de c&oacute;pia de seguran&ccedil;a, ser&aacute; efetuada uma c&oacute;pia de seguran&ccedil;a completa quando a tarefa for efetuada na pr&oacute;xima vez.</li>
<li>Poder&aacute; ser necess&aacute;rio formatar novas unidades externas antes de serem utilizadas como destino da c&oacute;pia de seguran&ccedil;a. </li>
<li>Antes de criar uma tarefa de c&oacute;pia de seguran&ccedil;a, certifique-se de que j&aacute; anexou as unidades externas devidamente ao seu DiskStation. Pode aceder ao <b>Painel de controlo</b> &gt; <b>Dispositivos externos</b> para verificar o estado das unidades USB/eSATA. N&atilde;o &eacute; poss&iacute;vel selecionar unidades externas como destino da c&oacute;pia de seguran&ccedil;a se a unidade externa estiver a ser inicializada, formatada ou estiver avariada.</li>
<li>N&atilde;o &eacute; poss&iacute;vel selecionar partilhas remotas montadas como origem ou destino da c&oacute;pia de seguran&ccedil;a.</li>
<li>Se uma pasta partilhada encriptada estiver desmontada, n&atilde;o pode ser escolhida como destino da c&oacute;pia de seguran&ccedil;a.</li>
<li>N&atilde;o &eacute; poss&iacute;vel efetuar a c&oacute;pia de seguran&ccedil;a de miniaturas de imagens quando o sistema de ficheiros do destino for NTFS/FAT.</li>
</ul>
</div>


<h4><a name="network_backup"></a>Para criar um destino da c&oacute;pia de seguran&ccedil;a da rede:</h4>
<p>&Eacute; necess&aacute;rio um destino da c&oacute;pia de seguran&ccedil;a da rede para efetuar a c&oacute;pia de seguran&ccedil;a dos dados do DiskStation para outro DiskStation ou para um servidor compat&iacute;vel com rsync pela rede. Est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es durante a cria&ccedil;&atilde;o de uma tarefa de c&oacute;pia de seguran&ccedil;a com destino da c&oacute;pia de seguran&ccedil;a da rede, como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, a compress&atilde;o, o n&iacute;vel de bloqueio da c&oacute;pia de seguran&ccedil;a, entre outras. Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade da tarefa de c&oacute;pia de seguran&ccedil;a.</p>

<ol>
<li>Antes de criar um destino da c&oacute;pia de seguran&ccedil;a da rede, em primeiro lugar, inicie sess&atilde;o no servidor de destino, aceda a <strong>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</strong> &gt; <strong>Servi&ccedil;os de C&oacute;pia de seguran&ccedil;a</strong> e ative o servi&ccedil;o de c&oacute;pia de seguran&ccedil;a da rede e/ou volume de destino da c&oacute;pia de seguran&ccedil;a de rede.</li>
<li>Para efetuar uma c&oacute;pia de seguran&ccedil;a do seu DiskStation, aceda a <strong>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</strong> &gt; <strong>Destino da C&oacute;pia de Seguran&ccedil;a</strong>. Clique em <strong>Criar</strong>, selecione <strong>Destino da C&oacute;pia de Seguran&ccedil;a de Rede</strong> e siga o assistente para concluir.</li>
<img src="about:blank" class="help_image"/>

<li>Com <strong>Destino da C&oacute;pia de Seguran&ccedil;a de Rede (Servidor do DiskStation)</strong>, pode guardar os dados da c&oacute;pia de seguran&ccedil;a numa pasta partilhada para manter a c&oacute;pia de seguran&ccedil;a mais recente ou guardar os dados da c&oacute;pia de seguran&ccedil;a num volume para manter vers&otilde;es m&uacute;ltiplas de c&oacute;pias de seguran&ccedil;a. Com <strong>Destino da C&oacute;pia de Seguran&ccedil;a da Rede (servidor compat&iacute;vel com rsync)</strong>, apenas pode manter a c&oacute;pia de seguran&ccedil;a mais recente.</li>

</ol>

<div class="section">
<h4>Notas:</h4>
<ul>
<li>Est&atilde;o dispon&iacute;veis os seguintes modos quando criar uma tarefa de c&oacute;pia de seguran&ccedil;a com servidores compat&iacute;veis com rsync como destino da c&oacute;pia de seguran&ccedil;a da rede: O <b>modo rsync daemon</b>, que &eacute; utilizado quando seleciona um m&oacute;dulo da c&oacute;pia de seguran&ccedil;a (pasta partilhada no servidor compat&iacute;vel com rsync) a partir do menu pendente junto de <b>M&oacute;dulo da c&oacute;pia de seguran&ccedil;a</b> e <b>modo remoto por linha de comandos</b> que &eacute; ativado apenas quando &eacute; introduzido um caminho absoluto (iniciando com &quot;/&quot;) no <b>M&oacute;dulo da c&oacute;pia de seguran&ccedil;a</b>.</li>
<li>Para os utilizadores Linux, s&oacute; as contas <strong>admin</strong>, <strong>root</strong> e <strong>rsync</strong> s&atilde;o permitidas para efetuar tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Se pretender aceder a um servidor de destino atrav&eacute;s da Internet utilizando o respetivo nome de anfitri&atilde;o, o nome do anfitri&atilde;o tem de ser um FQDN (Fully Qualified Domain Name &ndash; Nome de Dom&iacute;nio Totalmente Qualificado), por exemplo <strong>abc.bcd.com</strong>.</li>
<li>Quando efetuar uma c&oacute;pia de seguran&ccedil;a a partir de um dispositivo DiskStation para outro, ser-lhe-&aacute; pedido para introduzir o nome de utilizador e a palavra-passe de uma conta no destino. Especialmente se pretender efetuar uma c&oacute;pia de seguran&ccedil;a para um volume noutro DiskStation, &eacute; necess&aacute;rio especificar uma conta pertencente ao grupo <strong>administrators</strong>. Quando efetua uma c&oacute;pia de seguran&ccedil;a de pastas partilhadas para outro DiskStation, pode faz&ecirc;-lo de acordo com as defini&ccedil;&otilde;es de privil&eacute;gio de acesso das pastas. S&oacute; as pastas partilhadas para as quais a conta de utilizador especificada tiver privil&eacute;gios de acesso estar&atilde;o vis&iacute;veis. Se n&atilde;o conseguir encontrar a pasta partilhada pretendida no destino, verifique os seus privil&eacute;gios de acesso.</li>
<li>A encripta&ccedil;&atilde;o da c&oacute;pia de seguran&ccedil;a &eacute; suportada apenas quando o servidor de destino suporta a c&oacute;pia de seguran&ccedil;a da rede encriptada e a palavra-passe de autentica&ccedil;&atilde;o n&atilde;o est&aacute; vazia.</li>
<li>O modo remoto por linha de comandos apenas suporta a c&oacute;pia de seguran&ccedil;a encriptada.</li>
<li>Quando efetuar c&oacute;pias de seguran&ccedil;a para um servidor compat&iacute;vel com rsync, n&atilde;o poder&aacute; alterar o modo de encripta&ccedil;&atilde;o rsync depois de criadas as tarefas de c&oacute;pia de seguran&ccedil;a rsync. Para alterar a configura&ccedil;&atilde;o, crie uma nova tarefa de rsync. </li>
<li>Se pretender efetuar uma c&oacute;pia de seguran&ccedil;a de ficheiros para um DiskStation atrav&eacute;s de um cliente rsync, os nomes dos ficheiros devem estar com codifica&ccedil;&atilde;o UTF-8.</li>
<li>Se estiver a efetuar c&oacute;pias de seguran&ccedil;a de ficheiros para um DiskStation atrav&eacute;s de um cliente compat&iacute;vel com rsync, s&oacute; pode efetuar a tarefa atrav&eacute;s de contas <strong>admin</strong>, <strong>root</strong> e <strong>rsync</strong> do DiskStation.</li>
<li>Se estiver a efetuar c&oacute;pias de seguran&ccedil;a de ficheiros de um DiskStation para um servidor compat&iacute;vel com rsync, ir&aacute; necessitar de introduzir o nome e a palavra-passe da conta de c&oacute;pia de seguran&ccedil;a rsync. Tamb&eacute;m ter&aacute; de escolher o m&oacute;dulo de c&oacute;pia de seguran&ccedil;a correto com privil&eacute;gio de Escrita.</li>
</ul>
</div>

<h4><a name="cloudservice_backup"></a>Para criar um destino da c&oacute;pia de seguran&ccedil;a de Amazon S3:</h4>
<p>&Eacute; necess&aacute;rio um destino da c&oacute;pia de seguran&ccedil;a de Amazon S3 para efetuar a c&oacute;pia de seguran&ccedil;a dos dados do DiskStation para um servidor Amazon S3.</p>
  
<ol>
  <li>Clique em <b>Criar</b>, selecione <b>Destino da C&oacute;pia de Seguran&ccedil;a na Cloud P&uacute;blica</b>, depois em <b>Destino da C&oacute;pia de Seguran&ccedil;a Amazon S3</b> e, finalmente, em <b>Seguinte</b>.</li>
  
  <img src="about:blank" class="help_image"/>
  
  <li>Atribua um nome a este destino da c&oacute;pia de seguran&ccedil;a, insira as credenciais de in&iacute;cio de sess&atilde;o e preencha todos os campos necess&aacute;rios para definir a tarefa da c&oacute;pia de seguran&ccedil;a.</li>
</ol>

<div class="section">
<h4> Notas:</h4>
<ul>
  <li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor Amazon S3 como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es, tais como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, a c&oacute;pia de seguran&ccedil;a para Amazon S3 RRS (Armazenamento de Redund&acirc;ncia Reduzida) e outras. Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
  <li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Bucket</strong> que selecionou no servidor Amazon S3 e o Valor Set KEY come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
  <li>A estrutura de dados do Amazon S3 inclui um par de Bucket e KEY sem qualquer estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
  <li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor Amazon S3 no mesmo Bucket.</li>
  <li>Cada Bucket no Amazon S3 deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
  <li>incluir entre 3 a 63 caracteres</li>
  <li>conter apenas letras min&uacute;sculas, n&uacute;meros, pontos (.) e tra&ccedil;os (-).</li><li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode terminar com um tra&ccedil;o (-), conter dois pontos seguidos ou conter tra&ccedil;os junto de pontos (por exemplo, &quot;my-.bucket.com&quot; e &quot;my.-bucket&quot; s&atilde;o inv&aacute;lidos).</li>
</ul>
<li>O comprimento m&aacute;ximo de uma Amazon S3 KEY &eacute; 1024 caracteres. Para garantir uma c&oacute;pia de seguran&ccedil;a com &ecirc;xito para Amazon S3, o comprimento m&aacute;ximo do caminho &eacute; 1024 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>
<li>Se ativar o suporte Amazon S3 RRS (Armazenamento de Redund&acirc;ncia Reduzida), apenas os dados modificados depois da op&ccedil;&atilde;o ter sido ativada ter&atilde;o uma c&oacute;pia de seguran&ccedil;a no armazenamento RRS, significando que os dados que j&aacute; t&ecirc;m c&oacute;pia de seguran&ccedil;a no armazenamento padr&atilde;o Amazon S3 n&atilde;o ter&atilde;o uma nova c&oacute;pia de seguran&ccedil;a no RRS. </li>
<li>O deslocamento de ficheiros com c&oacute;pia de seguran&ccedil;a de Amazon S3 para Amazon Glacier n&atilde;o &eacute; suportado. Se os ficheiros forem deslocados de Amazon S3 para Amazon Glacier atrav&eacute;s da consola de Gest&atilde;o AWS, as tarefas de c&oacute;pia de seguran&ccedil;a correspondentes poder&atilde;o falhar.</li>
<li>A c&oacute;pia de seguran&ccedil;a de ficheiros para buckets virtuais de estilo alojado com SSL n&atilde;o &eacute; suportada.</li>
<li>Para a realiza&ccedil;&atilde;o da transfer&ecirc;ncia de um ficheiro, esse ficheiro ser&aacute; dividido em partes. O tamanho de cada parte pode ser definido pela op&ccedil;&atilde;o <strong>Tamanho de cada parte no carregamento de m&uacute;ltiplas partes</strong> nas defini&ccedil;&otilde;es de tarefas com o valor predefinido de 512MB. Se o ambiente de rede n&atilde;o for est&aacute;vel, &eacute; recomendado que a op&ccedil;&atilde;o seja um n&uacute;mero menor.</li>

<li>O n&uacute;mero m&aacute;ximo de partes por carregamento &eacute; de 10000. O tamanho m&aacute;ximo de um ficheiro &eacute; o <strong>Tamanho de cada parte no carregamenteo de m&uacute;ltiplas partes</strong> multiplicado por 10000.</li>
<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li>
</ul>
</div>
<h4>Para criar um destino de c&oacute;pia de seguran&ccedil;a de Microsoft Azure:</h4>
<p>&Eacute; necess&aacute;rio um destino da c&oacute;pia de seguran&ccedil;a de Microsoft Azure para efetuar a c&oacute;pia de seguran&ccedil;a dos dados do DiskStation para um servidor blob Microsoft Azure.</p>
  
<ol>
<li>Clique em <b>Criar</b>, selecione <b>Destino da C&oacute;pia de Seguran&ccedil;a na Cloud P&uacute;blica</b>, depois em <b>Destino da C&oacute;pia de Seguran&ccedil;a Microsoft Azure</b> e, finalmente, em <b>Seguinte</b>.</li>
<img src="about:blank" class="help_image"/>
<li>Atribua um nome ao destino da sua c&oacute;pia de seguran&ccedil;a, insira as credenciais de in&iacute;cio de sess&atilde;o e preencha todos os campos necess&aacute;rios para definir a tarefa da c&oacute;pia de seguran&ccedil;a.</li>
</ol>

<div class="section">
<h4> Notas:</h4>
<ul>
<li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor Microsoft Azure como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es (por exemplo, a encripta&ccedil;&atilde;o de transfer&ecirc;ncia). Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Recipiente</strong> que selecionou no servidor Microsoft Azure e o nome definido de Blob come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
<li>A estrutura de dados do Microsoft Azure inclui um emparelhamento de Recipiente e Blob sem qualquer estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
<li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor Microsoft Azure no mesmo Recipiente.</li>
<li>Cada Recipiente no Microsoft Azure deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
<li>incluir entre 3 a 63 caracteres</li>
<li>conter apenas letras min&uacute;sculas, n&uacute;meros e tra&ccedil;os (-).</li>
<li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode conter dois pontos seguidos.</li>
</ul>
<li>O comprimento m&aacute;ximo de um nome Microsoft Azure Blob &eacute; 1024 caracteres. Para garantir uma tarefa de c&oacute;pia de seguran&ccedil;a com &ecirc;xito para Microsoft Azure, o comprimento m&aacute;ximo do caminho &eacute; 1024 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>

<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li>
<li>A mensagem de aviso de falha na autentica&ccedil;&atilde;o pode ser provocada por informa&ccedil;&otilde;es de autentica&ccedil;&atilde;o incorretas, um problema de liga&ccedil;&atilde;o &agrave; rede ou pelo facto de a hora no seu DiskStation e no servidor remoto n&atilde;o coincidirem. Para verificar a defini&ccedil;&atilde;o da hora no seu DiskStation, aceda a <strong>Painel de Controlo</strong> &gt; <strong>Op&ccedil;&otilde;es Regionais</strong> &gt; <strong>Hora</strong> para sincronizar a hora com o servidor NTP.</li>
</ul>
</div>

<h4>Para criar um destino de c&oacute;pia de seguran&ccedil;a hicloud S3:</h4>
<p>&Eacute; necess&aacute;rio um destino da c&oacute;pia de seguran&ccedil;a hicloud S3 se for efetuar c&oacute;pia de seguran&ccedil;a dos dados do DiskStation para um servidor hicloud S3.</p>
  
<ol>
<li>Clique em <b>Criar</b>, selecione <b>Destino da C&oacute;pia de Seguran&ccedil;a na Cloud P&uacute;blica</b> e depois <b>Destino da C&oacute;pia de Seguran&ccedil;a hicloud S3</b>.</li>
<img src="about:blank" class="help_image"/>
<li>Atribua um nome a este destino da c&oacute;pia de seguran&ccedil;a, insira as credenciais de in&iacute;cio de sess&atilde;o e preencha todos os campos necess&aacute;rios para definir a tarefa da c&oacute;pia de seguran&ccedil;a.</li>
</ol>

<div class="section">
<h4> Notas:</h4>
<ul>
<li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor hicloud S3 como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es (por exemplo, a encripta&ccedil;&atilde;o de transfer&ecirc;ncia). Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Bucket</strong> que selecionou no servidor hicloud S3 e o Valor Set KEY come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
<li>A estrutura de dados do hicloud S3 inclui um emparelhamento de Bucket e KEY sem qualquer estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
<li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor hicloud S3 no mesmo Bucket.</li>
<li>Cada Bucket no hicloud S3 deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
<li>incluir entre 3 a 63 caracteres</li>
<li>conter apenas letras min&uacute;sculas, n&uacute;meros, pontos (.) e tra&ccedil;os (-).</li>
<li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode terminar com um tra&ccedil;o (-), conter dois pontos seguidos ou conter tra&ccedil;os junto de pontos (por exemplo, &quot;my-.bucket.com&quot; e &quot;my.-bucket&quot; s&atilde;o inv&aacute;lidos).</li>
</ul>
<li>O comprimento m&aacute;ximo de uma hicloud S3 KEY &eacute; 255 caracteres. Para garantir uma c&oacute;pia de seguran&ccedil;a com &ecirc;xito para hicloud S3, o comprimento m&aacute;ximo do caminho &eacute; 255 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>
<li>Para a realiza&ccedil;&atilde;o da transfer&ecirc;ncia de um ficheiro, esse ficheiro ser&aacute; dividido em partes. O tamanho de cada parte pode ser definido pela op&ccedil;&atilde;o <strong>Tamanho de cada parte no carregamento de m&uacute;ltiplas partes</strong> nas defini&ccedil;&otilde;es de tarefas com o valor predefinido de 512MB. Se o ambiente de rede n&atilde;o for est&aacute;vel, &eacute; recomendado que seja definido um n&uacute;mero menor.</li>

<li>Hicloud suporta apenas um m&aacute;ximo de 1000 partes por transfer&ecirc;ncia. Significa isto que o tamanho de ficheiro total n&atilde;o poder&aacute; exceder 1000 multiplicado pelo tamanho da parte. Por exepmplo, se o Tamanho de Parte de Carregamento Multiparte estiver configurado para 8MB, n&atilde;o conseguir&aacute; enviar um ficheiro &uacute;nico acima de 8000MB. </li>

<li>A c&oacute;pia de seguran&ccedil;a da pasta partilhada encriptada n&atilde;o &eacute; suportada.</li> 

<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li>
</ul>
</div>

<h4>Para criar um destino da c&oacute;pia de seguran&ccedil;a SFR NAS BACKUP:</h4>
<p>&Eacute; necess&aacute;rio um destino da c&oacute;pia de seguran&ccedil;a SFR NAS BACKUP se for efetuar c&oacute;pia de seguran&ccedil;a dos dados do DiskStation para um servidor SFR NAS BACKUP.</p>
  
<ol>
<li>Clique em <b>Criar</b>, selecione <b>Destino da C&oacute;pia de Seguran&ccedil;a na Cloud P&uacute;blica</b>, depois em <b>Destino da C&oacute;pia de Seguran&ccedil;a SFR NAS BACKUP</b> e, finalmente, em <b>Seguinte</b>.</li>
<img src="about:blank" class="help_image"/>
<li>Atribua um nome a este destino da c&oacute;pia de seguran&ccedil;a, insira as credenciais de in&iacute;cio de sess&atilde;o e preencha todos os campos necess&aacute;rios para definir a tarefa da c&oacute;pia de seguran&ccedil;a.</li>
</ol>

<div class="section">
<h4> Notas:</h4>
<ul>
<li>Quando criar tarefas de c&oacute;pia de seguran&ccedil;a com o servidor SFR NAS BACKUP como destino da c&oacute;pia de seguran&ccedil;a da rede, est&atilde;o dispon&iacute;veis v&aacute;rias op&ccedil;&otilde;es, como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia e outras. Tenha em aten&ccedil;&atilde;o que algumas op&ccedil;&otilde;es, tal como a encripta&ccedil;&atilde;o de transfer&ecirc;ncia, poder&atilde;o reduzir a velocidade das tarefas de c&oacute;pia de seguran&ccedil;a.</li>
<li>Os ficheiros de c&oacute;pia de seguran&ccedil;a s&atilde;o armazenados no <strong>Bucket</strong> que selecionou no servidor SFR NAS BACKUP e o Valor Set KEY come&ccedil;a com um nome de diret&oacute;rio &agrave; sua escolha e termina com o caminho completo do ficheiro.</li>
<li>A estrutura de dados do SFR NAS BACKUP inclui um emparelhamento de Bucket e Key numa estrutura de pastas. A c&oacute;pia de seguran&ccedil;a da pasta vazia n&atilde;o &eacute; suportada.</li>
<li>Se um ficheiro do qual foi feita uma c&oacute;pia de seguran&ccedil;a n&atilde;o for modificado, n&atilde;o ser&aacute; efetuada novamente uma c&oacute;pia de seguran&ccedil;a para o servidor SFR NAS BACKUP no mesmo Bucket.</li>
<li>Cada Bucket do SFR NAS BACKUP deve ter um nome exclusivo. Al&eacute;m disso, o nome deve:</li>
<ul>
<li>incluir entre 3 a 63 caracteres</li>
<li>conter apenas letras min&uacute;sculas, n&uacute;meros, pontos (.) e tra&ccedil;os (-).</li>
<li>come&ccedil;ar e terminar com um n&uacute;mero ou uma letra e n&atilde;o pode terminar com um tra&ccedil;o (-), conter dois pontos seguidos ou conter tra&ccedil;os junto de pontos (por exemplo, &quot;my-.bucket.com&quot; e &quot;my.-bucket&quot; s&atilde;o inv&aacute;lidos).</li>
</ul>
<li>O comprimento m&aacute;ximo de uma SFR NAS BACKUP KEY &eacute; 1024 caracteres. Para garantir uma c&oacute;pia de seguran&ccedil;a com &ecirc;xito para o SFR NAS BACKUP, o comprimento m&aacute;ximo do caminho &eacute; 1024 menos o nome da pasta de destino especificado durante a cria&ccedil;&atilde;o da tarefa.</li>
<li>Para a realiza&ccedil;&atilde;o da transfer&ecirc;ncia de um ficheiro, esse ficheiro ser&aacute; dividido em partes. O tamanho de cada parte pode ser definido pela op&ccedil;&atilde;o <strong>Tamanho de cada parte no carregamento de m&uacute;ltiplas partes</strong> nas defini&ccedil;&otilde;es de tarefas com o valor predefinido de 64MB. Se o ambiente de rede n&atilde;o for est&aacute;vel, &eacute; recomendado que seja definido um n&uacute;mero menor.</li>

<li>Os nomes de ficheiros n&atilde;o devem conter qualquer caractere n&atilde;o UTF-8 ou de controlo.</li> 

</ul>
</div>
<h4>Para gerir o destino da c&oacute;pia de seguran&ccedil;a:</h4>
<p>Selecione um destino da c&oacute;pia de seguran&ccedil;a existente e clique num dos bot&otilde;es abaixo:</p>
<ul>
<li><strong>Editar:</strong> Modifica as defini&ccedil;&otilde;es do destino seleccionado da c&oacute;pia de seguran&ccedil;a.</li>
<li><strong>Eliminar:</strong> Elimina o destino seleccionado da c&oacute;pia de seguran&ccedil;a.</li>
</ul>

<h3>Efetuar a c&oacute;pia de seguran&ccedil;a para Pasta Partilhada</h3>
<p>Este tipo de destino da c&oacute;pia de seguran&ccedil;a apenas mant&eacute;m a c&oacute;pia de seguran&ccedil;a mais recente. Por predefini&ccedil;&atilde;o, ap&oacute;s a conclus&atilde;o da c&oacute;pia de seguran&ccedil;a inicial, os ficheiros que foram removidos da origem s&atilde;o removidos do destino quando uma tarefa for efetuada na pr&oacute;xima vez. No entanto, se preferir manter os ficheiros no destino mesmo depois de serem eliminados da origem, ative a op&ccedil;&atilde;o <b>Reservar os ficheiros de c&oacute;pia de seguran&ccedil;a no destino</b> quando criar tarefas de c&oacute;pia de seguran&ccedil;a.</p>

<h3>Efetuar a cópia de segurança para o Volume</h3>
<p>Este tipo de destino da cópia de segurança tem de ser um volume de rede ou local num dispositivo DiskStation (excluindo dispositivos de armazenamento externos). Irá arquivar versões múltiplas de cópias de segurança, pelo que pode restaurar facilmente quaisquer pastas de um determinado momento.</p>

<h4>Para eliminar os dados guardados de uma tarefa de c&oacute;pia de seguran&ccedil;a:</h4>
<ol>
<li>Aceda ao separador <strong>Destino da C&oacute;pia de Seguran&ccedil;a</strong> e amplie o destino da c&oacute;pia de seguran&ccedil;a que cont&eacute;m a tarefa que pretende eliminar.</li> 
<li>Clique no &iacute;cone <b>eliminar</b> na sua <b>Tarefa de c&oacute;pia de seguran&ccedil;a</b> selecionada e depois em <strong>Eliminar</strong> na caixa de di&aacute;logo.</li>
</ol>
<h4>Para eliminar os dados guardados de uma vers&atilde;o de c&oacute;pia de seguran&ccedil;a:</h4>
<ol>
<li>Aceda ao separador <strong>Destino da C&oacute;pia de Seguran&ccedil;a</strong> e amplie o destino da c&oacute;pia de seguran&ccedil;a que cont&eacute;m a vers&atilde;o da tarefa que pretende eliminar.</li> <li>Clique no &iacute;cone <strong>Informa&ccedil;&otilde;es da Vers&atilde;o da C&oacute;pia de Seguran&ccedil;a</strong> na sua <strong>Tarefa de C&oacute;pia de Seguran&ccedil;a</strong> selecionada.</li>
<li>Selecione a vers&atilde;o da c&oacute;pia de seguran&ccedil;a que pretende eliminar e clique no &iacute;cone <b>eliminar</b>.</li>
</ol>

<h4><a name="lock_version"></a>Para bloquear uma vers&atilde;o de c&oacute;pia de seguran&ccedil;a para evitar que seja removida durante a rota&ccedil;&atilde;o de c&oacute;pia de seguran&ccedil;a:</h4>
<ol>
<li>Aceda ao separador <strong>Destino da C&oacute;pia de Seguran&ccedil;a</strong> e amplie o destino da c&oacute;pia de seguran&ccedil;a que cont&eacute;m a vers&atilde;o da tarefa que pretende bloquear.</li>
<li>Clique no &iacute;cone <strong>Informa&ccedil;&otilde;es da Vers&atilde;o da C&oacute;pia de Seguran&ccedil;a</strong> na sua <strong>Tarefa de C&oacute;pia de Seguran&ccedil;a</strong> selecionada.</li>
<li>Selecione a vers&atilde;o da c&oacute;pia de seguran&ccedil;a que pretende bloquear e clique no &iacute;cone <strong>bloquear</strong>.</li>
</ol>

<h4>Para gerir o privil&eacute;gio de um destino da c&oacute;pia de seguran&ccedil;a:</h4>
<ol>
<li>Selecione um destino da c&oacute;pia de seguran&ccedil;a associado a um volume local e clique em <b>Editar</b>.</li>
<li> Clique em <strong>Lista de Autoriza&ccedil;&atilde;o</strong> e depois em <strong>Adicionar</strong> para adicionar o utilizador ou grupo &agrave; lista.</li>
</ol>

<h4>Para configurar um destino da c&oacute;pia de seguran&ccedil;a com um propriet&aacute;rio:</h4>
<ol>
<li>Selecione um destino da c&oacute;pia de seguran&ccedil;a associado a um volume local e clique no &iacute;cone <b>Propriedade</b> na sua <b>Tarefa de c&oacute;pia de seguran&ccedil;a</b> selecionada.</li>
<li>Em <strong>Privil&eacute;gio de C&oacute;pia de Seguran&ccedil;a</strong>, selecione um <b>Propriet&aacute;rio</b> no menu pendente.</li>
</ol>

<h4>Para permitir um utilizador ou grupo no DiskStation para a leitura e restauro dos dados guardados de uma tarefa de c&oacute;pia de seguran&ccedil;a:</h4>
<ol>
<li>Selecione um destino da c&oacute;pia de seguran&ccedil;a associado a um volume local e clique no &iacute;cone <b>Propriedade</b> na sua <b>Tarefa de c&oacute;pia de seguran&ccedil;a</b> selecionada.</li>
<li> Clique em <strong>Lista de Autoriza&ccedil;&atilde;o</strong> e depois em <strong>Adicionar</strong> para adicionar o utilizador ou grupo &agrave; lista.</li>
</ol>

<div class="section">
<h4> Notas:</h4>
<ul>
	<li>O propriet&aacute;rio predefinido de uma tarefa de c&oacute;pia de seguran&ccedil;a &eacute; o utilizador que criou a tarefa.</li>
	<li>Apenas o propriet&aacute;rio da tarefa de c&oacute;pia de seguran&ccedil;a pode executar a tarefa. No entanto, as tarefas de c&oacute;pia de seguran&ccedil;a criadas antes do DSM 5.1 n&atilde;o disp&otilde;em dessa limita&ccedil;&atilde;o, pelo que qualquer utilizador pertencente ao grupo <b>administrators</b> pode executar esta tarefa de c&oacute;pia de seguran&ccedil;a.</li>
	<li>O propriet&aacute;rio da tarefa e os utilizadores pertencentes ao grupo <b>administrators</b> podem eliminar os dados guardados de uma tarefa de c&oacute;pia de seguran&ccedil;a.</li>
	<li>O propriet&aacute;rio da tarefa, os utilizadores pertencentes ao grupo <b>administrators</b> e os utilizadores na <b>Lista Autorizada</b>podem restaurar os dados guardados de uma tarefa de c&oacute;pia de seguran&ccedil;a.</li>
	<li>Apenas os utilizadores pertencentes ao grupo <b>administrators</b> podem configurar um destino da c&oacute;pia de seguran&ccedil;a local com privil&eacute;gios de acesso e uma tarefa de c&oacute;pia de seguran&ccedil;a num destino de c&oacute;pia de seguran&ccedil;a local com um propriet&aacute;rio e uma lista autorizada.</li>
	<li>Os dados guardados de uma tarefa de c&oacute;pia de seguran&ccedil;a consomem a quota de armazenamento do propriet&aacute;rio da tarefa. </li>
	<li>Se um volume n&atilde;o tiver um destino da c&oacute;pia de seguran&ccedil;a, apenas os utilizadores pertencentes ao grupo <b>administrators</b> podem criar o primeiro destino da c&oacute;pia de seguran&ccedil;a no volume.</li>
	<li>Apenas os utilizadores pertencentes ao grupo <b>administrators</b> podem eliminar os dados guardados de um destino da c&oacute;pia de seguran&ccedil;a completo.</li>
    
    	<li>Cada c&oacute;pia de seguran&ccedil;a cont&eacute;m configura&ccedil;&atilde;o do sistema e metadata do ficheiro.</li>
	<li>A c&oacute;pia de seguran&ccedil;a da pasta partilhada encriptada n&atilde;o &eacute; suportada.</li>
    
	<li>Bloqueio de vers&atilde;o n&atilde;o suportado em DSM 5.1 ou inferior.</li>
    
</ul>
</div>
</body></html>
