<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>還原</title>

<link href="../../../../help/help.css" type="text/css" rel="stylesheet" />
<link href="../../../../help/scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../../../help/scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../../../help/scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Restaurar</h2>
<p>Aceda a <strong>C&oacute;pia de seguran&ccedil;a e Restauro</strong>, e clique em <strong>Restauro</strong> no canto inferior esquerdo, para salvaguardar os dados.</p>


<h4><a name="restore"></a>Para restaurar a c&oacute;pia de seguran&ccedil;a de dados/LUN*:</h4>
<ol class="disable-eds14">
<li>Clique em <b>Restauro</b> no canto inferior esquerdo, selecione <strong>Dados</strong> ou <strong>LUN</strong>*, e selecione uma tarefa de c&oacute;pia de seguran&ccedil;a para restaurar.</li>
<li>Ser&aacute; solicitado que selecione a configura&ccedil;&atilde;o do sistema, diferentes vers&otilde;es dos dados da c&oacute;pia de seguran&ccedil;a, entre outros. Depende do tipo de tarefa de c&oacute;pia de seguran&ccedil;a que deseja restaurar.</li>
<li>Se a tarefa de c&oacute;pia de seguran&ccedil;a estiver encriptada, precisa da palavra-passe/chave de encripta&ccedil;&atilde;o para restauro com &ecirc;xito.</li>
<li>Siga o assistente para concluir o restauro.</li>
</ol>
<div class="section enable-eds14">
  <h4>Nota:</h4>
<ul>
<li>Quando restaura um pacote desinstalado, o sistema ir&aacute; instalar automaticamente a mesma ou a vers&atilde;o mais recente da aplica&ccedil;&atilde;o. Se a aplica&ccedil;&atilde;o estiver instalada, mas se for uma vers&atilde;o mais antiga que a da c&oacute;pia de seguran&ccedil;a, o sistema ir&aacute; atualiz&aacute;-la automaticamente para a vers&atilde;o da c&oacute;pia de seguran&ccedil;a original.</li>
<li>As aplica&ccedil;&otilde;es com c&oacute;pia de seguran&ccedil;a efetuada no DSM 5.1 ou superior n&atilde;o podem ser restauradas em DSM 5.0 ou inferior. </li>
</ul>
</div>

<div class="section disable-eds14">
<h4>Nota:</h4>
<ul>
<li>Depois de conclu&iacute;do o restauro, os LUNs de n&iacute;vel de bloco e n&iacute;vel de ficheiro ser&atilde;o restaurados em LUNs de n&iacute;vel de ficheiro.*</li>
<li>Ao restaurar um pacote, se o pacote n&atilde;o estiver instalado, o sistema ir&aacute; instalar automaticamente o mesmo ou a vers&atilde;o mais recente da aplica&ccedil;&atilde;o. Se a aplica&ccedil;&atilde;o estiver instalada, mas se for uma vers&atilde;o mais antiga que a da c&oacute;pia de seguran&ccedil;a, o sistema ir&aacute; atualiz&aacute;-la automaticamente para a vers&atilde;o da c&oacute;pia de seguran&ccedil;a original.</li>
<li>As aplica&ccedil;&otilde;es com c&oacute;pia de seguran&ccedil;a efetuada no DSM 5.1 ou superior n&atilde;o podem ser restauradas em DSM 5.0 ou inferior. </li>
</ul>
</div>


<h4><a name="restore"></a>para restaurar s&oacute; um ficheiro ou pasta para tarefa de c&oacute;pia de seguran&ccedil;a multi-vers&atilde;o:</h4>
<ol>
<li>Selecione a tarefa de c&oacute;pia de seguran&ccedil;a desejada no painel esquerdo, e abra <strong>Explorador de C&oacute;pias de Seguran&ccedil;a</strong> (clicando no &iacute;cone da lupa). &Eacute; necess&aacute;ria a palavra-passe/chave de encripta&ccedil;&atilde;o caso a tarefa de c&oacute;pia de seguran&ccedil;a esteja encriptada.</li>
<li>Localize a vers&atilde;o da c&oacute;pia de seguran&ccedil;a desejada com a barra de cronologia ou atrav&eacute;s do &iacute;cone de calend&aacute;rio.</li>
<li>Selecione um ficheiro ou pasta, e clique em <strong>Restauro</strong>, <strong>Copiar para...</strong> ou <strong>Transferir</strong> para obter o ficheiro/pasta selecionado. As tr&ecirc;s op&ccedil;&otilde;es tamb&eacute;m est&atilde;o dispon&iacute;veis caso clique com o bot&atilde;o direito no ficheiro/pasta.</li>
</ol>
<h4>Para procurar uma vers&atilde;o espec&iacute;fica:</h4>
<p>Para acelerar a pesquisa de ficheiros, pode usar palavras-chave para filtrar o ficheiro/pasta desejado. Os ficheiros/pastas n&atilde;o correspondidos ser&atilde;o ocultados.</p>

<ol>
  <li>Abra o <strong>Explorador de C&oacute;pia de Seguran&ccedil;a</strong>, e clique no &iacute;cone de funil no canto superior direito.</li>
  <li>No menu pendente, pode filtrar ficheiros/pastas de acordo com os seguintes crit&eacute;rios:</li>
  <ul>
    <li><strong>Palavra-chave</strong>: Introduza o nome de qualquer ficheiro ou pasta Pode utilizar caracteres universais [*] (representando um ou mais caracteres) e [?] (representando um caracter aleat&oacute;rio) nas suas palavras-chave. Por exemplo, [a<span class="note_content">*</span>o] pode representar [a<span class="note_content">c&ccedil;&atilde;</span>o], [a<span class="note_content">ten&ccedil;&atilde;</span>o], ou [ao].</li>
    <li><strong>Tipo de Ficheiro</strong>: Escolha de entre <strong>Qualquer</strong>, <strong>Qualquer Pasta</strong>, ou <strong>Qualquer Ficheiro</strong> para ajustar a sua pesquisa.</li>
    <li><strong>Tamanho (KB)</strong>: Escolha <strong>Qualquer, </strong>ou selecione <strong>igual a</strong>, <strong>maior que</strong>, <strong>menor que </strong>e depois introduza um valor.</li>    
    <li><strong>Data de Modifica&ccedil;&atilde;o</strong>: escolha entre <strong>Hoje</strong>, <strong>Ontem</strong>, <strong>A semana passada</strong>, <strong>O m&ecirc;s passado</strong> ou <strong>Personalizar</strong> para introduzir as datas inicial e final de forma a encontrar vers&otilde;es num determinado per&iacute;odo.</li>

  </ul>
  <li>Para aplicar os seus filtros, clique em <strong>Filtrar</strong>.</li>
  <li>Para aplicar os mesmos filtros a outra vers&atilde;o de c&oacute;pia de seguran&ccedil;a, basta mudar para a vers&atilde;o desejada com a barra de cronologia.</li>
  <li>Para repor a pesquisa filtrada, clique no bot&atilde;o <strong>Repor</strong>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>O Explorador de C&oacute;pia de Seguran&ccedil;a est&aacute; apenas dispon&iacute;vel em tarefas de c&oacute;pia de seguran&ccedil;a multi-vers&atilde;o.</li>
<li>O Explorador de C&oacute;pia de Seguran&ccedil;a tem fun&ccedil;&otilde;es limitadas quando o destino da c&oacute;pia de seguran&ccedil;a estiver definido na DSM 5.1 ou inferior.</li>
<li dir="ltr">A configura&ccedil;&atilde;o do sistema e aplica&ccedil;&otilde;es podem apenas ser restauradas atrav&eacute;s de <strong>Restaurar</strong>.</li>
<li>A fun&ccedil;a&otilde; de filtro est&aacute; apenas dispon&iacute;vel em tarefas de c&oacute;pia de seguran&ccedil;a n&atilde;o encriptadas.</li>
<li>Ficheiros/pastas obtidas usando <strong>Copiar para...</strong> ou <strong>Transferir</strong> perder&atilde;o as defini&ccedil;&otilde;es originais de privil&eacute;gio.</li>
</ul>
</div>


<h4><a name="restore"></a>Para restaurar tarefas de c&oacute;pias de seguran&ccedil;a de outro destino da c&oacute;pia de seguran&ccedil;a:</h4>
<ol>
<li>Clique em <b>Restauro</b> no canto inferior esquerdo e selecione <strong>Data</strong> ou <strong>LUN</strong>*.</li>
<li>Pode selecionar e restaurar qualquer tipo de tarefas de c&oacute;pia de seguran&ccedil;a:
<ul>
<li>Para restaurar c&oacute;pia de seguran&ccedil;a de dados: CLique em <strong>Dados</strong> &gt; <strong>Restaurar de reposit&oacute;rios existentes</strong>, e selecione o destino de c&oacute;pia de seguran&ccedil;a desejado para restaurar dados.</li>
<li>Para restaurar a c&oacute;pia de seguran&ccedil;a LUN: Clique em <strong>LUN</strong>*.</li>
</ul>

</li>
<li>Siga as instru&ccedil;&otilde;es do assistente. &Eacute; necess&aacute;ria a palavra-passe/chave de encripta&ccedil;&atilde;o caso a tarefa de restauro esteja encriptada.</li>
<li>Clique em <strong>Aplicar</strong> para concluir o restauro.</li>
</ol>
<div class="section enable-eds14">
<h4>Nota:</h4>
<ul>

  <li>A Embedded DataStation s&oacute; pode restaurar pastas partilhadas para dispositivos externos ext3/ext4.</li>
  
<li>A Embedded DataStation n&atilde;o suporta a restaura&ccedil;&atilde;o da aplica&ccedil;&atilde;o sem um dispositivo externo ext3/ext4.</li>

</ul>
</div>

<p>____<br /> * Apenas dispon&iacute;vel em modelos espec&iacute;ficos.</p>
</body></html>
