<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>C&oacute;pia de seguran&ccedil;a e Replica&ccedil;&atilde;o</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head> 
<body>
<h2>Sincroniza&ccedil;&atilde;o de Pasta Partilhada</h2>
<p>O servi&ccedil;o de Sincroniza&ccedil;&atilde;o de Pasta Partilhada permite ao utilizador sincronizar pastas partilhadas de um produto Synology (origem) para outros produtos Synology (destino) numa LAN ou atrav&eacute;s da Internet. Funciona na base de pastas partilhadas. Ao sincronizar, caso j&aacute; exista uma pasta com o mesmo nome (por exemplo, PastaPartilhada) no produto Synology de destino, a pasta no destino ser&aacute; renomeada como &quot;PastaPartilhada_1&quot;. Caso a pasta n&atilde;o exista, esta ser&aacute; criada na correspondente ou na primeira dispon&iacute;vel. Os privil&eacute;gios de acesso a esta pasta no DiskStation de destino ser&atilde;o os predefinidos, ou seja, nenhuns privil&eacute;gios estar&atilde;o especificados para esta pasta.</p>
<p>A Sincroniza&ccedil;&atilde;o de Pasta Partilhada far&aacute; uma sincroniza&ccedil;&atilde;o completa da(s) pasta(s) partilhada(s) na primeira vez. Posteriormente, apenas os ficheiros alterados ser&atilde;o sincronizados. Os ficheiros removidos da origem ser&atilde;o tamb&eacute;m removidos do destino.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>
A Sincroniza&ccedil;&atilde;o de Pasta Partilhada &eacute; uma solu&ccedil;&atilde;o de sincroniza&ccedil;&atilde;o de uma via, significando que os ficheiros na fonte ser&atilde;o sincronizados com o destino, mas n&atilde;o o contr&aacute;rio. Se estiver &agrave; procura de uma solu&ccedil;&atilde;o de sincroniza&ccedil;&atilde;o de 2 vias, use a <strong>Cloud Station</strong>.</li></ul></div>

<h3>Ativa&ccedil;&atilde;o do Servi&ccedil;o</h3>
<h4>Para ativar a Sincroniza&ccedil;&atilde;o de Pasta Partilhada:</h4>
<p>Ter&aacute; de ativar o servi&ccedil;o no DiskStation de destino. Para isso, aceda a <b>C&oacute;pia de seguran&ccedil;a e Duplica&ccedil;&atilde;o</b> &gt; <b>Sincroniza&ccedil;&atilde;o de Pasta Partilhada</b>. No separador <b>Servidor</b>, assinale <b>Ativar servi&ccedil;o de Sincroniza&ccedil;&atilde;o de Pasta Partilhada</b> para ativar.</p>
<h4>Para ligar pastas partilhadas da origem para o produto Synology de destino:</h4> 
<p>Pode sincronizar pastas partilhadas de uma origem para muitos servidores de destino diferentes. Al&eacute;m disso, a partir do DSM 4.1, a Sincroniza&ccedil;&atilde;o de Pasta Partilhada disp&otilde;e da funcionalidade de Sincroniza&ccedil;&atilde;o da Pasta Partilhada de diversas origens, o que permite a v&aacute;rios clientes sincronizar as suas pastas partilhadas para um DiskStation. Se clientes diferentes sincronizarem uma pasta partilhada id&ecirc;ntica para um DiskStation, simultaneamente, ocorrer&aacute; um conflito e dever&aacute; desassociar a pasta partilhada antes de outro cliente pode sincronizar esta pasta para o destino. Se pretender dissociar a pasta partilhada, aceda a <b>Sincroniza&ccedil;&atilde;o de Pasta Partilhada</b> &gt; <b>Servidor</b>, clique em <b>Lista de Liga&ccedil;&atilde;o</b>, selecione uma liga&ccedil;&atilde;o e clique em <b>Dissociar</b></b> no lado do destino. </li>
</ul>
<p>De seguida, j&aacute; pode come&ccedil;ar a sincronizar pastas partilhadas, da origem para o DiskStation de destino. Siga as sec&ccedil;&otilde;es abaixo para continuar.</p>

<h3>Gest&atilde;o de Tarefas de Sincroniza&ccedil;&atilde;o</h3>
<p>Com o Assistente da Sincroniza&ccedil;&atilde;o de Pasta Partilhada, pode facilmente criar tarefas de sincroniza&ccedil;&atilde;o.</p>
<h4>Para criar uma tarefa de sincroniza&ccedil;&atilde;o:</h4>
<ol>
<li>Aceda a <b>C&oacute;pia de Seguran&ccedil;a e Duplica&ccedil;&atilde;o</b> &gt; <b>Sincroniza&ccedil;&atilde;o de Pasta Partilhada</b> &gt; <strong>Cliente</strong>.</li>
<li>Clique em <b>Criar</b>.</li>
<li>Introduza um nome para esta tarefa.</li>
<li>Selecione a pasta partilhada que pretende sincronizar para o destino. Marque a caixa de verifica&ccedil;&atilde;o abaixo para confirmar e clique em <b>Seguinte</b> para continuar.</li>
<li>Configure o destino e as seguintes op&ccedil;&otilde;es de sincroniza&ccedil;&atilde;o:</li>
<ul>
<li><b>Ativar a encripta&ccedil;&atilde;o de transfer&ecirc;ncia:</b> Encripta dados durante a transfer&ecirc;ncia. O modo encriptado permite melhor seguran&ccedil;a, enquanto o modo n&atilde;o encriptado proporciona melhor desempenho. Pode escolher de acordo com as suas necessidades.
</li> 
<li><b>Ativar a compress&atilde;o de transfer&ecirc;ncia:</b> Comprime dados durante a transfer&ecirc;ncia. Poupa largura de rede mas aumenta a utiliza&ccedil;&atilde;o da CPU.</li>
<li><b>Ativar n&iacute;vel de bloqueio da sincroniza&ccedil;&atilde;o:</b> Transfere apenas dados diferentes em vez dos ficheiros completos. Poupa largura de rede mas aumenta a utiliza&ccedil;&atilde;o da CPU.</li>
</ul>
<li>Configure o agendamento da tarefa:</li>
<ul>
<li><b>Executar a sincroniza&ccedil;&atilde;o a cada [n&uacute;mero] horas</b> ou <b>Executar a sincroniza&ccedil;&atilde;o a cada [n&uacute;mero] minutos</b>: Executa tarefas de sincroniza&ccedil;&atilde;o a intervalos de minutos ou horas espec&iacute;ficos. A contagem inicia-se a partir da meia-noite. Os intervalos n&atilde;o podem ser superiores a 24 horas.</li>
<li><b>Executar sincroniza&ccedil;&atilde;o autom&aacute;tica diariamente &agrave;s (hh:mm)</b>: Executa tarefas de sincroniza&ccedil;&atilde;o diariamente a uma determinada hora.</li>
<li><b>Executar sincroniza&ccedil;&atilde;o manualmente</b>: A sincroniza&ccedil;&atilde;o &eacute; realizada apenas manualmente.</li>
<li><b>Executar sincroniza&ccedil;&atilde;o  quando ocorrerem modifica&ccedil;&otilde;es</b>: Executa tarefas de sincroniza&ccedil;&atilde;o imediatamente ap&oacute;s a ocorr&ecirc;ncia de uma altera&ccedil;&atilde;o na pasta partilhada de origem.</li>
</ul>
<li>Clique em <b>Aplicar</b>. Poder&aacute; agora ver a tarefa de sincroniza&ccedil;&atilde;o na lista de tarefas, a qual ser&aacute; executada de acordo com o agendamento especificado.</li></ol>
<h4>Para gerir uma tarefa de sincroniza&ccedil;&atilde;o:</h4>
<ol>
<li>
Selecione a tarefa na lista de tarefas.
</li>
<li>
Execute qualquer dos seguintes procedimentos:
</li>
<ul>
<li>
Clique em <b>Editar</b> para editar a tarefa.
</li>
<li>
Clique em <b>Eliminar</b> para eliminar a tarefa.
</li> 
<li>
Se a tarefa de sincroniza&ccedil;&atilde;o n&atilde;o estiver a decorrer, clique em <b>Sincronizar Agora</b> para executar imediatamente a tarefa.
</li>
<li>
Caso a tarefa de sincroniza&ccedil;&atilde;o esteja a decorrer, clique em <b>Cancelar</b> para interromper a tarefa em execu&ccedil;&atilde;o.
</li>

<div class="section">
<h4>Nota:</h4>
<p>
Se o agendamento de uma tarefa de sincroniza&ccedil;&atilde;o estiver definido como <b>Executar sincroniza&ccedil;&atilde;o aquando de modifica&ccedil;&otilde;es</b>, ao clicar em <b>Cancelar</b> interromper&aacute; a tarefa de sincroniza&ccedil;&atilde;o a decorrer. Contudo, caso sejam efectuadas altera&ccedil;&otilde;es ao conte&uacute;do de qualquer pasta partilhada monitorizada pela tarefa de sincroniza&ccedil;&atilde;o, a Sincroniza&ccedil;&atilde;o de Pasta Partilhada retomar&aacute; novamente a tarefa.
</p>
</div>

<li>
Clique em <b>Sincroniza&ccedil;&atilde;o Completa</b> para sincronizar todos os dados. A sincroniza&ccedil;&atilde;o de pasta partilhada executar&aacute; uma sincroniza&ccedil;&atilde;o completa na primeira vez e apenas das partes modificadas ap&oacute;s a primeira sincroniza&ccedil;&atilde;o. Clicar neste bot&atilde;o poder&aacute; ajudar a sincronizar mais uma vez manualmente todos os dados.
</li>
</ul>
</ol>

<div class="section disable-eds14">
<h4>Mais Informa&ccedil;&atilde;o</h4>
<ol>
<li>O nome da tarefa deve ser formada por caracteres Unicode de 1 a 32 e n&atilde;o dever&aacute; ter os seguintes caracteres:<br> <span class="letterSpace5">! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~ </span></li>
<li>Caso sincronize pastas partilhadas do sistema de ficheiros ext4 a ext3, poder&aacute; encontrar erros quando uma pasta tiver mais de 32.000 ficheiros.</li>
<li>Se as pastas partilhadas no DiskStation de destino tiverem sido sincronizadas antes com outro DiskStation, a Sincroniza&ccedil;&atilde;o de Pasta Partilhada realizar&aacute; uma sincroniza&ccedil;&atilde;o completa.</li>
<li>Para realizar tarefas de Sincroniza&ccedil;&atilde;o de Pasta Partilhada, necessita de privil&eacute;gios de administrador do DiskStation de destino. Dever&aacute; ter a palavra-passe de administrador ou pertencer ao grupo de administra&ccedil;&atilde;o.</li>
<li>Ao sincronizar com o DiskStation atrav&eacute;s da Internet, pode introduzir o nome do servidor com o endere&ccedil;o IP externo ou o nome de anfitri&atilde;o. No entanto, se introduzir o nome de anfitri&atilde;o, o nome deve estar no formato FQDN (Nome de Dom&iacute;nio Totalmente Qualificado), por exemplo, &quot;www.synology.com&quot;.</li>
<li>Para reencaminhamento de porta, a Sincroniza&ccedil;&atilde;o de Pasta Partilhada utiliza a porta 22 para transfer&ecirc;ncias encriptadas e a porta 873 para transfer&ecirc;ncias n&atilde;o encriptadas.</li>
<li>Dispositivos de armazenamento externos n&atilde;o s&atilde;o suportados pela Sincroniza&ccedil;&atilde;o de Pasta Partilhada.</li>
<li>As pastas partilhadas encriptadas necessitam de ser montadas manualmente com chave de encripta&ccedil;&atilde;o no destino.</li>
<li>A Sincroniza&ccedil;&atilde;o de Pasta Partilhada agendada n&atilde;o ser&aacute; executada na hora especificada se n&atilde;o forem feitas altera&ccedil;&otilde;es &agrave; pasta partilhada selecionada.</li>
<li>Para o melhor desempenho, sugerimos que cada tarefa de sincroniza&ccedil;&atilde;o inclua menos de 200 pastas partilhadas.</li>
<li>A fun&ccedil;&atilde;o <strong>Home do Utilizador</strong> ser&aacute; desativada no DiskStation de destino se a pasta partilhada <strong>homes</strong> for sincronizada a partir do DiskStation de origem para o DiskStation de destino.</li>

<li>Para modelos com CPUs n&atilde;o Intel, pode sincronizar at&eacute; 100.000 pastas partilhadas (incluindo subpastas) utilizando a Sincroniza&ccedil;&atilde;o de Pasta Partilhada.</li>
 <li>A Sincroniza&ccedil;&atilde;o de Pasta Partilhada pode efectuar a c&oacute;pia de seguran&ccedil;a das defini&ccedil;&otilde;es ACL do Windows quando o sistema de ficheiros do destino for ext4.</li>
 
 <li>A Sincroniza&ccedil;&atilde;o de Pasta Partilhada n&atilde;o ser&aacute; bem sucedida se a sincroniza&ccedil;&atilde;o for efetuada para um servidor de destino que partilhe o mesmo nome com o seu DiskStation.</li>
 
<li>Permiss&otilde;es Avan&ccedil;adas de Pasta Partilhada na fonte n&atilde;o ser&atilde;o sincronizadas com o destino. Mais, uma regra apenas de leitura para utilizadores do grupo de administradores ser&aacute; criada no destino. </li> 

  </ol>
</div>
<div class="section enable-eds14">
<h4>Mais Informa&ccedil;&atilde;o</h4>
<ol>
<li>O nome da tarefa deve ser formada por caracteres Unicode de 1 a 32 e n&atilde;o dever&aacute; ter os seguintes caracteres:<br> <span class="letterSpace5">! &quot; # $ % &amp; ' ( ) * + , / : ; &lt;= &gt; ? @ [ ] \ ^ ` { } | ~ </span></li>
<li>Caso sincronize pastas partilhadas do sistema de ficheiros ext4 a ext3, poder&aacute; encontrar erros quando uma pasta tiver mais de 32.000 ficheiros.</li>
<li>Se as pastas partilhadas no DiskStation de destino tiverem sido sincronizadas antes com outro DiskStation, a Sincroniza&ccedil;&atilde;o de Pasta Partilhada realizar&aacute; uma sincroniza&ccedil;&atilde;o completa.</li>
<li>Para realizar tarefas de Sincroniza&ccedil;&atilde;o de Pasta Partilhada, necessita de privil&eacute;gios de administrador do DiskStation de destino. Dever&aacute; ter a palavra-passe de administrador ou pertencer ao grupo de administra&ccedil;&atilde;o.</li>
<li>Ao sincronizar com o DiskStation atrav&eacute;s da Internet, pode introduzir o nome do servidor com o endere&ccedil;o IP externo ou o nome de anfitri&atilde;o. No entanto, se introduzir o nome de anfitri&atilde;o, o nome deve estar no formato FQDN (Nome de Dom&iacute;nio Totalmente Qualificado), por exemplo, &quot;www.synology.com&quot;.</li>
<li>Para reencaminhamento de porta, a Sincroniza&ccedil;&atilde;o de Pasta Partilhada utiliza a porta 22 para transfer&ecirc;ncias encriptadas e a porta 873 para transfer&ecirc;ncias n&atilde;o encriptadas.</li>
<li>Dispositivos de armazenamento externos n&atilde;o s&atilde;o suportados pela Sincroniza&ccedil;&atilde;o de Pasta Partilhada.</li>
<li>As pastas partilhadas encriptadas necessitam de ser montadas manualmente com chave de encripta&ccedil;&atilde;o no destino.</li>
<li>A Sincroniza&ccedil;&atilde;o de Pasta Partilhada agendada n&atilde;o ser&aacute; executada na hora especificada se n&atilde;o forem feitas altera&ccedil;&otilde;es &agrave; pasta partilhada selecionada.</li>
<li>Para o melhor desempenho, sugerimos que cada tarefa de sincroniza&ccedil;&atilde;o inclua menos de 200 pastas partilhadas.</li>
<li>A fun&ccedil;&atilde;o <strong>Home do Utilizador</strong> ser&aacute; desativada no DiskStation de destino se a pasta partilhada <strong>homes</strong> for sincronizada a partir do DiskStation de origem para o DiskStation de destino.</li>
<li>Para modelos com CPUs n&atilde;o Intel, pode sincronizar at&eacute; 100.000 pastas partilhadas (incluindo subpastas) utilizando a Sincroniza&ccedil;&atilde;o de Pasta Partilhada.</li>
 
 <li>A Sincroniza&ccedil;&atilde;o de Pasta Partilhada n&atilde;o ser&aacute; bem sucedida se a sincroniza&ccedil;&atilde;o for efetuada para um servidor de destino que partilhe o mesmo nome com o seu DiskStation.</li>
 
<li>Permiss&otilde;es Avan&ccedil;adas de Pasta Partilhada na fonte n&atilde;o ser&atilde;o sincronizadas com o destino. Mais, uma regra apenas de leitura para utilizadores do grupo de administradores ser&aacute; criada no destino. </li> 
 
 </ol>
</div>
</body></html>
