<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>


<h2>Configurar o centro de pacotes</h2>
<h4>Para gerenciar quais pacotes t&ecirc;m permiss&atilde;o para serem instalados:</h4>
<ol>
<li>Na guia <strong>Geral</strong>, selecione uma das op&ccedil;&otilde;es a seguir para definir o <strong>N&iacute;vel de Confian&ccedil;a</strong> desejado:</li>
<ul>
<li><strong>Synology Inc.</strong>: Permite apenas a instala&ccedil;&atilde;o de pacotes publicados pela Synology Inc.</li>
<li><strong>Synology Inc. e editores confi&aacute;veis</strong>: Permite apenas a instala&ccedil;&atilde;o de pacotes publicados pela Synology Inc. e editores confi&aacute;veis. Editores confi&aacute;veis s&atilde;o editores que obtiveram a confian&ccedil;a da comunidade de terceiros adicionando a origem do pacote ou s&atilde;o confi&aacute;veis para o usu&aacute;rio atrav&eacute;s da importa&ccedil;&atilde;o de um certificado do editor.</li>
<li><strong>Qualquer editor</strong>: Permite a instala&ccedil;&atilde;o de qualquer pacote, independentemente da editora e integridade.</li>
</ul>
<li>Clique em <strong>OK</strong>.</li>
</ol>

<h4>Para importar o certificado de um editor confi&aacute;vel:</h4>
<ol>
<li>Na guia <strong>Certificado</strong>, clique em <b>Importar</b>. </li>
<li>Clique em <strong>Procurar</strong> e selecione o certificado do editor confi&aacute;vel.</li>
<li>Clique em <strong>OK</strong>. </li>
</ol>

<h4>Para atualizar o certificado da Synology Inc.:</h4>
<p>Quando voc&ecirc; estiver conectado &agrave; internet, o certificado da Synology Inc. ser&aacute; atualizado automaticamente durante o processo de instala&ccedil;&atilde;o do pacote. Para atualizar manualmente:</p>
<ol>
<li>Na guia <strong>Certificado</strong>, clique em <b>Importar</b>. </li>
<li>Clique em <strong>Procurar</strong> e selecione o certificado da Synology Inc., que pode ser baixado no <a href="http://www.synology.com/support/download" target="_blank">site da Synology</a>.</li>
<li>Clique em <strong>OK</strong>. </li>
</ol>
<h4>Para habilitar as notifica&ccedil;&otilde;es sobre as atualiza&ccedil;&otilde;es do pacote:</h4>
<ol>
<li>Clique na guia <b>Notifica&ccedil;&atilde;o</b> e depois clique em <b>Ativar notifica&ccedil;&atilde;o por e-mail</b> e/ou <b>Ativar notifica&ccedil;&atilde;o na &aacute;rea de trabalho</b>. A primeira op&ccedil;&atilde;o permite que o DSM envie e-mails quando houver novas atualiza&ccedil;&otilde;es dispon&iacute;veis enquanto a &uacute;ltima permite que o DSM exiba uma mensagem de notifica&ccedil;&atilde;o no canto superior direito da &aacute;rea de trabalho do DSM.</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Para que as notifica&ccedil;&otilde;es por e-mail entrem em vigor, ajuste as configura&ccedil;&otilde;es de notifica&ccedil;&atilde;o de e-mail do DSM (em <b>Menu principal</b> &gt; <b>Painel de controle</b> &gt; <b>Notifica&ccedil;&atilde;o</b>).</p></div>

<h4>Para adicionar uma origem de pacote fornecida por uma comunidade de terceiros:</h4>
<ol>
<li>Clique na guia <b>Origens de Pacotes</b>, clique em <strong>Adicionar</strong> e digite o nome e o local das origens de pacotes. <br>O local pode ser um URL encontrado na Internet fornecido por um desenvolvedor/editor ou comunidade de terceiros.</li>
<li>Clique em <b>OK</b>. Quando a origem do pacote for adicionada com sucesso, voc&ecirc; ver&aacute; uma lista de pacotes na guia <strong>Comunidade</strong>. </li>
</ol>

</body>
</html>
