<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Odes&iacute;l&aacute;n&iacute; souborů nebo složek</h2>
<p>Soubory nebo složky můžete z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače odes&iacute;lat na zař&iacute;zen&iacute; DiskStation pomoc&iacute; n&aacute;sleduj&iacute;c&iacute;ch metod.</p>
<p>Chcete-li z&iacute;skat kompletn&iacute; př&iacute;stup k&nbsp;n&iacute;že popsan&yacute;m funkc&iacute;m odes&iacute;l&aacute;n&iacute;, nainstalujte si nejdř&iacute;ve aplikačn&iacute; prostřed&iacute; Java Runtime Environment (JRE) a&nbsp;přehr&aacute;vač Flash Player.  </p>


<h4>Metoda&nbsp;1:</h4>
<ol>
<li>
V&nbsp;horn&iacute; č&aacute;sti lev&eacute;ho panelu vyberte c&iacute;lovou složku zař&iacute;zen&iacute; DiskStation. 
</li>
<li>
Klikněte na možnost <b>Odeslat</b>, vyberte položku <strong>Odeslat a&nbsp;přeskočit</strong> nebo <strong>Odeslat a&nbsp;přepsat</strong> a&nbsp;vyberte soubory nebo složky z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače. </li>
</ol>
<h4>Metoda&nbsp;2:</h4>
<ol>
	<li>Přejděte do č&aacute;sti <strong>Nastaven&iacute;</strong>, za&scaron;krtněte položku <strong>Proch&aacute;zet soubory z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače pomoc&iacute; stanice File Station</strong> a&nbsp;aktualizac&iacute; webov&eacute; str&aacute;nky zobraz&iacute;te v&nbsp;doln&iacute; č&aacute;sti lev&eacute;ho panelu složky m&iacute;stn&iacute;ho poč&iacute;tače.</li>
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<p>Možnost <strong>Proch&aacute;zet soubory z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače pomoc&iacute; stanice File Station</strong> bude aktivov&aacute;na až po instalaci a&nbsp;povolen&iacute; prostřed&iacute; JRE na poč&iacute;tači.</p>
</div>
	<li>V&nbsp;doln&iacute; č&aacute;sti lev&eacute;ho panelu vyberte složku v&nbsp;m&iacute;stn&iacute;m poč&iacute;tači. V&nbsp;hlavn&iacute; oblasti je nyn&iacute; zobrazen obsah vybran&eacute; složky.
	</li>
	<li>V&nbsp;hlavn&iacute; č&aacute;sti vyberte soubory nebo složky a&nbsp;pot&eacute; klikněte na možnost <b>Odeslat</b>. 
</li>
	<li>V&nbsp;zobrazen&eacute;m okně vyberte c&iacute;lovou složku zař&iacute;zen&iacute; DiskStation.
	</li>
	<li>Chcete-li v c&iacute;lov&eacute; složce přepsat soubory nebo složky se stejn&yacute;m n&aacute;zvem, vyberte v&nbsp;prav&eacute;m horn&iacute;m rohu tohoto okna možnost <b>Přepsat</b>. V&nbsp;opačn&eacute;m př&iacute;padě vyberte možnost <b>Přeskočit</b>.
</li>
	<li>Kliknut&iacute;m na tlač&iacute;tko <b>OK</b> zah&aacute;j&iacute;te odes&iacute;l&aacute;n&iacute;.
</li>
</ol>
<h4>Metoda&nbsp;3:</h4>
<ol>
<li>Přejděte do č&aacute;sti <strong>Nastaven&iacute;</strong>, za&scaron;krtněte položku <strong>Proch&aacute;zet soubory z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače pomoc&iacute; stanice File Station</strong> a&nbsp;aktualizac&iacute; webov&eacute; str&aacute;nky zobraz&iacute;te v&nbsp;doln&iacute; č&aacute;sti lev&eacute;ho panelu složky m&iacute;stn&iacute;ho poč&iacute;tače.</li>
<li>
V&nbsp;lev&eacute;m panelu přet&aacute;hněte složku z&nbsp;poč&iacute;tače (doln&iacute; č&aacute;sti) do libovoln&eacute; složky zař&iacute;zen&iacute; DiskStation (horn&iacute; č&aacute;st).
</li>
<li>
V&nbsp;zobrazen&eacute; automaticky otev&iacute;ran&eacute; nab&iacute;dce zadejte, zda chcete soubory se stejn&yacute;m n&aacute;zvem v&nbsp;c&iacute;lov&eacute; složce přepsat nebo vynechat.
</li>
</ol>
<h4>Metoda&nbsp;4:</h4>
<ol>
<li>
V&nbsp;horn&iacute; č&aacute;sti lev&eacute;ho panelu vyberte c&iacute;lovou složku zař&iacute;zen&iacute; DiskStation.
</li>

<li>
Vyberte soubory na plo&scaron;e poč&iacute;tače nebo v&nbsp;prohl&iacute;žeči souborů (např&iacute;klad pomoc&iacute; aplikace Průzkumn&iacute;k Windows nebo Mac Finder) a přet&aacute;hněte je do File Station ve webov&eacute;m prohl&iacute;žeči.
</li>

<li>
V&nbsp;zobrazen&eacute;m dialogov&eacute;m okně zadejte, zda chcete soubory se stejn&yacute;m n&aacute;zvem v&nbsp;c&iacute;lov&eacute; složce přepsat nebo vynechat.</li>
<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li><b>Metodu&nbsp;4</b> podporuj&iacute; pouze někter&eacute; prohl&iacute;žeče: Chrome, Firefox, Safari&nbsp;5.1 nebo nověj&scaron;&iacute;. Pokud za&scaron;krtnete možnost <strong>Proch&aacute;zet soubory z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače pomoc&iacute; stanice File Station</strong>, nen&iacute; tato metoda podporov&aacute;na v&nbsp;syst&eacute;mu Mac.</li>
<li>
V&nbsp;př&iacute;padě v&yacute;&scaron;e zm&iacute;něn&yacute;ch webov&yacute;ch prohl&iacute;žečů lze složky nebo pr&aacute;zdn&eacute; soubory přesouvat přetažen&iacute;m pouze tehdy, pokud je možnost <strong>Proch&aacute;zet soubory z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače pomoc&iacute; stanice File Station</strong> za&scaron;krtnuta. V&nbsp;opačn&eacute;m př&iacute;padě nelze složky a&nbsp;pr&aacute;zdn&eacute; soubory pomoc&iacute; <strong>Metody&nbsp;4</strong> odes&iacute;lat.</li>
	<li>
Chcete-li odes&iacute;lat pomoc&iacute; <b>Metody&nbsp;4</b> a&nbsp;použ&iacute;v&aacute;te prohl&iacute;žeč Chrome pro syst&eacute;m Linux a&nbsp;k&nbsp;syst&eacute;mu&nbsp;DSM se přihla&scaron;ujete přes protokol HTTPS, mus&iacute;te importovat důvěryhodn&yacute; certifik&aacute;t (v&nbsp;č&aacute;sti <b>Ovl&aacute;dac&iacute; panel</b> &gt; <b>Zabezpečen&iacute;</b> &gt; <strong>Certifik&aacute;t</strong>).
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ol>
<li>
Do fronty odes&iacute;l&aacute;n&iacute; můžete přidat až 1&nbsp;000&nbsp;souborů.
</li>
	<li>
	Pokud použ&iacute;v&aacute;te prohl&iacute;žeč Google Chrome, Firefox, Safari&nbsp;5.1 nebo nověj&scaron;&iacute; a&nbsp;byla za&scaron;krtnuta možnost <strong>Proch&aacute;zet soubory z&nbsp;m&iacute;stn&iacute;ho poč&iacute;tače pomoc&iacute; stanice File Station</strong>, lze odes&iacute;lat tak&eacute; soubory vět&scaron;&iacute; než 4&nbsp;GB. V&nbsp;opačn&eacute;m př&iacute;padě lze odes&iacute;lat vždy jen soubory o max.&nbsp;velikosti 2&nbsp;GB.</li>
	<li>
V&nbsp;ne&scaron;ifrovan&eacute; sd&iacute;len&eacute; složce by měl n&aacute;zev souboru/složky obsahovat maxim&aacute;lně 255&nbsp;znaků (maxim&aacute;lně 80&nbsp;znaků pro jazyky nepouž&iacute;vaj&iacute;c&iacute; latinku). V&nbsp;&scaron;ifrovan&eacute; sd&iacute;len&eacute; složce lze použ&iacute;t maxim&aacute;lně 143&nbsp;znaků (maxim&aacute;lně 47&nbsp;znaků pro jazyky nepouž&iacute;vaj&iacute;c&iacute; latinku).
</li>
<li>
N&aacute;zev souboru/složky nesm&iacute; obsahovat n&aacute;sleduj&iacute;c&iacute; znaky: \ / : * ? &quot; &gt; |.
</li>
<li>
N&aacute;zev souboru/složky nesm&iacute; zač&iacute;nat znakem &bdquo;_&ldquo;.
</li>
<li>Soubory o&nbsp;velikosti 0&nbsp;kB můžete odes&iacute;lat pouze tehdy, pokud bylo nainstalov&aacute;no prostřed&iacute; JRE.</li>
</ol>
</div>


<div class="section">
<h4>Odstraňov&aacute;n&iacute; pot&iacute;ž&iacute;</h4>
<p>Pokud proch&aacute;zen&iacute; m&iacute;stn&iacute;ch položek uložen&yacute;ch na poč&iacute;tači Mac pomoc&iacute; prohl&iacute;žeče Safari nefunguje spr&aacute;vně, postupujte takto:</p>
<ol>
<li>Na poč&iacute;tači Mac otevřete prohl&iacute;žeč Safari a&nbsp;z&nbsp;nab&iacute;dky Safari vyberte možnost <strong>Preferences</strong> (Předvolby).</li>
<li>Na kartě <strong>Zabezpečen&iacute;</strong> klikněte na možnost <strong>Spr&aacute;va nastaven&iacute; webov&eacute; str&aacute;nky</strong>.</li>
<li>V&nbsp;č&aacute;sti <strong>Java</strong> vyberte svou &bdquo;webovou str&aacute;nku&ldquo; DSM.</li>
<li>Vyberte možnost <strong>Run in Unsafe Mode</strong> (Spustit v&nbsp;nenouzov&eacute;m režimu).</li>
</ol>
</div>



</body>
</html>
