<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Cuenta de correo electr&oacute;nico - Ayuda de Synology DSM</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Cuenta de correo electr&oacute;nico</h2>
<p>Puede agregar sus cuentas de correo electr&oacute;nico en <b>Personal</b> &gt; <b>Cuenta de correo electr&oacute;nico</b> y enviar archivos almacenados en File Station como ficheros adjuntos desde direcciones de correo electr&oacute;nico agregadas aqu&iacute;.</p>
<p>Los proveedores de servicios de correo electr&oacute;nico compatibles son Gmail, Outlook, Yahoo!, AOL y servidores SMTP personalizados.</p>

<h4>Para agregar una cuenta de correo electr&oacute;nico:</h4>
<ol>
<li>Haga clic en <b>Agregar</b> y elija el proveedor de servicios de la cuenta de correo electr&oacute;nico que desea configurar.</li>
<li>Introduzca su direcci&oacute;n de correo electr&oacute;nico, la contrase&ntilde;a y el nombre de remitente.</li>
<li>Marque <b>Utilizar esta cuenta de correo electr&oacute;nico como cuenta predeterminada</b> si prefiere dejar que File Station utilice esta cuenta de correo electr&oacute;nico de manera predeterminada cuando haya configurado varias cuentas.</li>
<li>Haga clic en <b>Sincronizar contactos</b> para sincronizar los contactos de correo electr&oacute;nico en DiskStation si su proveedor de servicios de correo electr&oacute;nico (Gmail, Outlook y Yahoo!) es compatible con esta funci&oacute;n. Tenga en cuenta que los contactos que se sincronizar&aacute;n ser&aacute;n los de la cuenta de coreo electr&oacute;nico que ha proporcionado en la ventana de autenticaci&oacute;n que aparece, en lugar de los de la cuenta que haya introducido en el paso anterior. Por tanto, si encuentra una cuenta diferente o no deseada en la ventana de autenticaci&oacute;n, c&aacute;mbiela manualmente por la cuenta de correo electr&oacute;nico que desee o por la que haya introducido anteriormente.</li>
<li>Haga clic en <b>Aplicar</b> para guardar la configuraci&oacute;n.</li>
</ol>
	
<h4>Para editar una cuenta de correo electr&oacute;nico:</h4>
<p>Elija en la lista la cuenta de correo electr&oacute;nico deseada y a continuaci&oacute;n haga clic en <b>Editar</b>.</p>

<h4>Para eliminar una cuenta de correo electr&oacute;nico:</h4>
<p>Elija en la lista la cuenta de correo electr&oacute;nico deseada y a continuaci&oacute;n haga clic en <b>Eliminar</b>.</p>
<div class="section">
<h4>Nota:</h4>	
<ul>
<li>La cuenta predeterminada no se puede eliminar, a no ser que no exista ninguna otra cuenta. Si desea eliminar una cuenta de correo electr&oacute;nico que est&eacute; definida como predeterminada en estos momentos, establezca otra cuenta como predeterminada antes de continuar.</li>
</ul>
</div>

<h4>Para cambiar la cuenta de correo electr&oacute;nico predeterminada:</h4>
<p>Elija en la lista la cuenta de correo electr&oacute;nico que desea establecer como cuenta predeterminada y a continuaci&oacute;n haga clic en <b>Configurar como predeterminada</b>.</p>


<h4>Para enviar los archivos como ficheros adjuntos:</h4>
<ol>
<li>Haga clic con el bot&oacute;n secundario en cualquier archivo en File Station y elija <b>Enviar como ficheros adjuntos de correo electr&oacute;nico</b>.</li>
<li>Si ha agregado m&aacute;s de una cuenta de correo electr&oacute;nico, puede elegir la cuenta de correo electr&oacute;nico remitente deseada en la lista desplegable para enviar los archivos a un recipiente especificado.</li>
</ol>
</body>
</html>
