<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Medieindekseringstjeneste</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Konverteringsindstillinger</h2>
<p>N&aring;r du uploader billeder eller videoer til brug med Medieserver eller Photo Station, oprettes miniaturer, der giver en bedre s&oslash;geoplevelse. Du kan indstille miniaturekvaliteten og overv&aring;ge konverteringsstatus.</p>
<p>Hvis du i mellemtiden vil se videoer i den delte mappe <strong>photo</strong> p&aring; Photo Station p&aring; dine mobilenheder, kan du aktivere videokonvertering og ogs&aring; se den konverteringsstatus.</p>
<h4>S&aring;dan indstiller du miniaturekvalitet:</h4>
<ol>
<li>
V&aelig;lg en kvalitet fra rullelisten.
</li>
<li>
Klik p&aring; <b>Anvend</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Bem&aelig;rk: </span>
<ul>
<li>Oprettelse af miniaturer i h&oslash;j kvalitet vil tage mere tid.</li>
</ul>
</div>
<h4>S&aring;dan aktiverer du videokonvertering for mobilenheder:</h4>
<ol>
<li>Marker <strong>Aktiver videokonvertering for mobilenheder</strong>.</li>
<li>Klik p&aring;<strong> Anvend</strong>, hvorefter du kan se videoer p&aring; dine mobilenheder p&aring; farten.
</li>
</ol>

<div class="section">
<span class="note_head">Bem&aelig;rk: </span>
<ul>
<li>Du kan kun konvertere de videoer, der er uploadet til den delte mappe <strong>photo</strong> p&aring; Photo Station til det format, der underst&oslash;ttes af mobilenheder.</li>
<li>MP4-filer bliver ikke konverteret.</li>
</ul>
</div>
<h4>S&aring;dan f&aring;r du vist billed-/videokonverteringsstatus:</h4>
<ol>
<li>N&aring;r billeder eller videoer uploades til DiskStation, skal du klikke p&aring; ikonet <strong>Konverteringsstatus</strong>, der vises &oslash;verst til h&oslash;jre p&aring; proceslinjen. </li>
<li>
G&oslash;r et af f&oslash;lgende i det vindue, der vises:
</li>
<ul>
<li>
I afsnittet <b>Konverteringsstatus</b> overv&aring;ger du status for oprettelsen af miniaturen, som foreg&aring;r i baggrunden.
</li>
<li>
G&oslash;r f&oslash;lgende for midlertidigt at standse konverteringsstatus:
</li>
<ol>
<li>
V&aelig;lg <b>Forsinkelse i [antal] time(r)</b> i rullemenuen, og klik p&aring; <b>Afbryd midlertidigt</b> for midlertidigt at standse status. (Som standard v&aelig;lges <b>Forsinkelse i 1 time(r)</b>).
</li>
<li>Konverteringsstatus vil blive genoptaget efter den angivne forsinkelsestid, eller ogs&aring; kan du klikke p&aring; <b>Forts&aelig;t</b> for at genoptage processen med det samme.
</li>
</ol>
<div class="section">
<span class="note_head">Bem&aelig;rk: </span>
<ul>
<li>Da konverteringsstatus kr&aelig;ver flere CPU-ressourcer, vil midlertidig standsning af processen spare systemressourcer til andre igangv&aelig;rende opgaver.</li>
</ul>
</div>
</ul>
<li>
N&aring;r konverteringsprocessen er f&aelig;rdig vil ikonet p&aring; proceslinjen forsvinde.
</li>
</ol>

<div class="section">
<span class="note_head">Bem&aelig;rk: </span>
<ul>
<li>Da Photo Station-uploader giver bedre ydelse ved miniatureoprettelse, anbefales det at bruge Photo Station-uploader, hvis du vil uploade store m&aelig;ngder billeder/videoer til dit Photo Station-bibliotek.</li>
</ul>
</div>

</body>
</html>