<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Multimediedatabase</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Systemdatabase</h1>
<p> DiskStation bruger en systemdatabase til at holde styr p&aring; multimediefiler og logangivelser, der er gemt i delte mapper oprettet p&aring; de eksterne lagerenheder, f.eks. <b>usbshare1</b>.</p>
<p> <span class="note_head">Vigtigt: </span>Hvis du &oslash;nsker adgang til pakkedata, der er gemt p&aring; de eksterne lagerenheder, der er tilsluttet til DiskStation, eller hvis du vil se DSM's logregistrering under <b>Hovedmenu</b> &gt; <strong>Logcenter</strong>, skal systemdatabasen f&oslash;rst aktiveres. Ellers bliver alle relaterede tjenester utilg&aelig;ngelige. </p>
<h4>S&aring;dan aktiverer du systemdatabasen:</h4>
<ol>
  <li> Marker <b>Aktiver systemdatabase</b>. </li>
  <li> G&oslash;r et af f&oslash;lgende:
    <ul>
      <li> V&aelig;lg <b>Automatisk konfiguration</b>, hvis du &oslash;nsker, at DSM automatisk skal v&aelig;lge en delt mappe til lagring af systemdatabasen. Hvis den eksterne lagerenhed, der indeholder den delte mappe fjernes, vil DSM automatisk v&aelig;lge en anden delt mappe til lagring af databasen. </li>
      <li> V&aelig;lg<b>Flyt den aktuelle database til den valgte delte mappe</b>, og v&aelig;lg s&aring; i rullemenuen at flytte den aktuelle database til en anden delt mappe, der er oprettet p&aring; den eksterne enhed. </li>
      <li>V&aelig;lg <strong>V&aelig;lg en af de eksisterende databaser</strong>, og v&aelig;lg s&aring; fra rullemenuen en eksisterende database, hvis der er mere end en ekstern enhed tilsluttet til din DiskStation.</li>
    </ul>
  </li>
  <li> Klik p&aring; <b>Anvend</b>. </li>
</ol>
<p> <span class="note_head">Advarsel: </span>Hvis du vil forhindre databasen i at blive &oslash;delagt, skal du s&oslash;rge for, at du har skubbet lagerenheden ud under <b>Hovedmenu</b> &gt; <b>Kontrolpanel</b> &gt; <strong>Eksterne enheder</strong> &gt; <strong>Eksterne enheder </strong>eller ved at klikke p&aring; ikonet for eksterne enheder &oslash;verst til h&oslash;jre, f&oslash;r du fjerner den fra DiskStation. </p>
</body>
</html>
