<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">

<title>Automatisk blokering</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Automatisk blokering</h2>

<p>Automatisk blokering s&aelig;tter dig i stand til at forhindre uautoriseret login. N&aring;r tjenesten er blev aktiveret, vil IP-adressen bliver blokeret, hvis der er for mange mislykkede login-fors&oslash;g. Fejlede login-fors&oslash;g via SSH, Telnet, rsync, Sikkerhedskopiering af netv&aelig;rk, Synkronisering af delt mappe, FTP, WebDAV, Mobile programmer til Synology, File Station eller DSM vil akkumuleres. Du kan ogs&aring; have en tilladelsesliste, der omfatter IP-adresser, som aldrig blokeres.</p>

<h4>S&aring;dan konfigurerer du automatisk blokering:</h4>
<ol>
<li>G&aring; til fanen <strong>Generelt</strong>, og marker <b>Aktiver automatisk blokering</b>.</li>
<li>Indtast et tal for <b>Login-fors&oslash;g</b> og <b>Inden for (minutter)</b> for at blokere en IP-adresse efter en angivet antal mislykkede login-fors&oslash;g inden for det angivne antal minutter.</li>
<li>Marker <b>Aktiver blokeringsudl&oslash;b</b>, og indtast et tal, der vil fjerne en blokeret IP-adresse efter det angivne antal dage.  Blokerede IP-adresser vil forblive p&aring; blokeringslisten, medmindre du manuelt fjerner den fra listen, hvis denne mulighed ikke er markeret, eller hvis <b>Oph&aelig;v blokering efter (dage)</b> er angivet til 0.</li>

<li>Klik p&aring; <b>Anvend</b>.</li>
</ol>

<h4>S&aring;dan tilf&oslash;jer du blokerede IP-adresser:</h4>
<p>Klik p&aring; fanen <strong>Blokeringsliste</strong>, og v&aelig;lg et af f&oslash;lgende fra rullemenuen <strong>Opret</strong>:</p>
<ul>
<li><strong>Tilf&oslash;j IP-adresse</strong></li>
<p>Indtast en IP-adresse, og angive udl&oslash;bstiden.<p/>
<li><strong>Importer IP-adresseliste</strong></li>
<p>Importer en tekstfil, der viser IP-adresser for at tilf&oslash;je et antal IP-adresse og angive udl&oslash;bsdato p&aring; samme tid. Marker det relevante afkrydsningsfelt, hvis du vil overskrive eksisterende IP-adresser. Hvis denne mulighed ikke er valgt, bliver kopierede IP-adresser sprunget over.</p>
<p>For at importere en fil skal filen opfylde f&oslash;lgende kriterier:</p>
<ul>
<li>Filen skal v&aelig;re en almindelig tekstfil.</li>
<li>Hver linje i filen kan kun indeholde &eacute;n IP-adresse.</li>
<li>Kommentarlinjer begynder med et # (pundtegn).</li>
<p>Hvis den valgte fil har korrekt format, vil du se alle IP-adresserne i forh&aring;ndsvisningsomr&aring;det. Klik p&aring; <strong>OK</strong> for at importere.</p>
</ul>
</ul>

<h4>S&aring;dan fjerner du blokerede IP-adresser:</h4>
<ol>
<li>
Klik p&aring; fanen <b>Blokeringsliste</b> for at kontrollere de blokerede IP-adresser.
</li>
<li>
V&aelig;lg de IP-adresser, du vil fjerne fra listen, og klik p&aring; <b>Fjern</b>.
</li>
</ol>


<h4>S&aring;dan tilf&oslash;jer du tilladte IP-adresser:</h4>
<p>Klik p&aring; fanen <strong>Tilladelsesliste</strong>, og v&aelig;lg et af f&oslash;lgende fra rullemenuen <strong>Opret</strong>:</p>
<ul>
<li><strong>Tilf&oslash;j IP-adresse</strong></li>
<p>Indtast en IP-adresse.<p/>
<li><strong>Importer IP-adresseliste</strong></li>
<p>Importer en tekstfil, der viser IP-adresser for at tilf&oslash;je et antal IP-adresse p&aring; samme tid. Marker det relevante afkrydsningsfelt, hvis du vil overskrive eksisterende IP-adresser. Hvis denne mulighed ikke er valgt, bliver kopierede IP-adresser sprunget over.</p>
<p>For at importere en fil skal filen opfylde f&oslash;lgende kriterier:</p>
<ul>
<li>Filen skal v&aelig;re en almindelig tekstfil.</li>
<li>Hver linje i filen kan kun indeholde &eacute;n IP-adresse.</li>
<li>Kommentarlinjer begynder med et # (pundtegn).</li>
<p>Hvis den valgte fil har korrekt format, vil du se alle IP-adresserne i forh&aring;ndsvisningsomr&aring;det. Klik p&aring; <strong>OK</strong> for at importere.</p>
</ul>
</ul>

<h4>S&aring;dan fjerner du tilladte IP-adresser:</h4>
<ol>
<li>
Klik p&aring; fanen <b>Tilladelsesliste</b> for at kontrollere de tilladte IP-adresser.
</li>
<li>
V&aelig;lg de IP-adresser, du vil fjerne fra listen, og klik p&aring; <b>Fjern</b>. </li>
</ol>


</body>
</html>
