<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bluetooth</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Denne side indeholder muigheder til administration af Bluetooth-adaptere og tilslutning af Bluetooth-enheder til din DiskStation. N&aring;r de er tilsluttet kan nogle Bluetooth-enheder, f.eks. h&oslash;jttalere eller hovedtelefoner, v&aelig;lges som lydoutput til Audio Station, s&aring; du nemt kan lytte til musik, der er gemt p&aring; din DiskStation.</p>
<h2>Introduktion</h2>
<p>Tilslut en USB Bluetooth-adapter til en USB-port p&aring; din DiskStation. Der vises en liste over Bluetooth-adaptere i venstre side af hovedsiden til Bluetooth. Oplysninger og muligheder, der er relateret til Bluetooth-enheder vises til h&oslash;jre.</p>
<h4>S&aring;dan aktiverer eller deaktiverer du Bluetooth-adaptere:</h4>
<ol>
<li>V&aelig;lg en Bluetooth-adapter.</li>
<li>Klik p&aring; <strong>Avancerede indstillinger</strong>.</li>
<li>Marker feltet <strong>Aktiver Bluetooth</strong></li>
<li>Klik p&aring; <strong>OK</strong> for at gemme indstillinger.</li>
</ol>
<h2>Administration af Bluetooth-enheder</h2>
<p>N&aring;r der tilsluttes til en ny Bluetooth-enhed, skal du s&oslash;rge for, at den kan registreres, er inden for 10 m fra DiskStation og bruger A2DP (Advanced Audio Distribution Profile). Se i brugervejledningen til Bluetooth-enheden for at f&aring; flere detaljer om konfiguration.</p>
<h4>S&aring;dan tilslutter du en Bluetooth-enhed:</h4>
<ol>
<li>P&aring; <strong>Bluetooth</strong>-hovedsiden v&aelig;lger du den Bluetooth-enhed, de vil tilslutte til DiskStation. Hvis enheden ikke vises, skal du klikke p&aring; <strong>Opdater</strong> for at s&oslash;ge efter enheder i n&aelig;rheden.</li>
<li>V&aelig;lg enheden, n&aring;r den vises.</li>
<li>Klik p&aring; <strong>Opret forbindelse</strong>.</li>
<li>Indtast pinkoden til enheden efter behov.</li>
</ol>
<h4>S&aring;dan ser du oplysninger om Bluetooth-enheden:</h4>
<ol>
<li>V&aelig;lg en tilsluttet Bluetooth-enhed.</li>
<li>Klik p&aring; <strong>Oplysninger</strong>.</li>
<li>Der vises en vindue, som viser oplysninger, f.eks. Bluetooth-adresse, navn, type og status.</li>
</ol>
<h4>S&aring;dan fjerner du en Bluetooth-enhed:</h4>
<ol>
<li>V&aelig;lg en Bluetooth-enhed, som du ikke vil bruge med din DiskStation l&aelig;ngere.</li>
<li>Klik p&aring; <strong>Fjern</strong>.</li>
</ol>
<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Ved afspilning af musik via Bluetooth-h&oslash;jttalere eller hovedtelefoner kan du opleve afspilningsproblemer, hvis indstillinger for din Bluetooth-adapter &aelig;ndres, eller du opretter forbindelse med for mange Bluetooth-enheder p&aring; samme tid.</li>
<li>Afh&aelig;ngigt af enheden vil en par Bluetooth-h&oslash;jttalere, som er tilsluttet til din DiskStation, som senere tilsluttes ti en anden DiskStation (eller Bluetooth-musikafspiller) glemme din DiskStation. I det tilf&aelig;lde vil en fejl opst&aring;r ved fors&oslash;g p&aring; at afspille musik med h&oslash;jttalerne. L&oslash;s dette problem ved at fjerne h&oslash;jttalerne og pr&oslash;ve at tilslutte dem igen.</li>
</ul>

</div>
</body>
</html>
