<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Bruger</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Indstillinger for adgangskode</h2>
<p>Klik p&aring; knappen <strong>Indstillinger for adgangskode</strong> for at se og &aelig;ndre nedenst&aring;ende indstillinger.</p>

<h3>Nulstil glemte adgangskoder</h3>
<p>Dette afsnit inkluderer en mulighed markeret <strong>Tillad ikke-admin-brugere at nulstille glemte adgangskoder via e-mail</strong>. N&aring;r denne mulighed er markeret, vises et link, som er markeret <strong>Har du glemt din adgangskode?</strong> p&aring; DSM's loginside. Hvis en bruger glemmer sin adgangskode, kan han klikke p&aring; dette link og indtaste brugernavnet. I det tilf&aelig;lde vil systemet sende en meddelelse til bruger, der indeholder et link til nulstilling af hans glemte adgangskode. </p>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>F&oslash;r du aktiverer denne mulighed, skal du s&oslash;rge for, at du allerede har aktiveret SMTP-e-mail-underretninger. Det g&oslash;r du ved at g&aring; til <strong>Kontrolpanel</strong> &gt; <strong>Underretning</strong> &gt; <strong>Generelt</strong>. Hvis underretninger ikke aktiveres, kan systemet ikke sende meddelelser til brugere, der &oslash;nsker at nulstille adgangskoder.</li>
<li>Hvis du vil modtage meddelelser fra systemet, skal du angive en e-mail-adresse i afsnittet Brugeroplysninger for kontiene.</li>
<li>Brugere, der h&oslash;rer til gruppen <strong>administrators</strong> kan ikke nulstille adgangskoder med denne mulighed.</li>
<li>Dom&aelig;nebrugere kan ikke nulstille adgangskoder med denne mulighed.</li>
<li>LDAP-brugere kan nulstille adgangskoder med denne mulighed, n&aring;r blot DiskStation bruges som LDAP-katalogserver.</li>

</ul>
</div>


<h3>Adgangskodestyrke</h3>
<p>Du kan konfigurere regler for adgangskodestyrke for bruger p&aring; ding DiskStation .</p>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<p>Regler for adgangskodestyrke g&aelig;lder kun for nye adgangskoder. F.eks. g&aelig;lder nye regler for adgangskodestyrke kun, n&aring;r der oprettes en ny brugerkonto, eller n&aring;r en eksisterende bruger &aelig;ndrer sin adgangskode. Eksisterende adgangskoder, og dem, der h&oslash;rer til importerede brugerkonti, udelukkes fra nye adgangskoderegler.</p>
</div>
<h4>S&aring;dan aktiverer du regler for adgangskodestyrke:</h4>
<ol>
<li>Marker afkrydsningsfeltet <b>Anvend regler for adgangskodestyrke</b> for at aktivere begr&aelig;nsninger for adgangskode.</li>
<li>V&aelig;lg mere end &eacute;n begr&aelig;nsning for adgangskoder fra reglerne nedenfor:</li>
<ul>
<li><b>Udeluk navn og beskrivelse p&aring; bruger fra adgangskode</b>: Adgangskoden m&aring; ikke indeholde brugernavn eller beskrivelse p&aring; bruger. UTF-8-kodede tegn er ekskluderet.</li>
<li><b>Tillad b&aring;de store og sm&aring; bogstaver</b>: Der kan bruges b&aring;de store og sm&aring; bogstaver i adgangskoden.</li>
<li><b>Inkluder numerisk tegn</b>: Adgangskoden skal indeholde mindst &eacute;t numerisk tegn (0 - 9).</li>
<li><b>Inkluder s&aelig;rligt tegn</b>: Adgangskoden skal indeholde mindst et ASCII-tegn (i.e., ~, `, !, @, #, $, %, ^, &amp;, *, (, ), -, _, =, +, [, {, ], }, \, |, ;, :, ', &quot;, &lt;, &gt;, /, ?).</li>
<li><b>Mindste adgangskodel&aelig;ngde</b>: Adgangskoden skal v&aelig;re mindst den v&aelig;rdi, der er angivet i tekstfeltet. L&aelig;ngden skal v&aelig;re et tal mellem 6 og 127.</li>
</ul>
<li>Klik p&aring; <b>Anvend</b> for at gemme indstillingerne.</li>
</ol>
 
</body>
</html>

