<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Delt mappe</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Delt mappe</h1>
<p>Delte mapper er de grundl&aelig;ggende biblioteker, hvor du kan gemme filer og mapper p&aring; din DiskStation. F&oslash;r du lagrer nogen filer p&aring; din DiskStation, skal du oprette mindst &eacute;n delt mappe. Data, der er lagret p&aring; delte mapper, kan v&aelig;re private eller delte med bestemt brugere eller brugergrupper i overensstemmelse med adgangsprivilegier, der kan tilpasses. Delte mapper kan ogs&aring; krypteres under oprettelse, s&aring; du f&aring;r et ekstra lag beskyttelse.</p>

<h3>Delte standardmapper</h3>

<p>Nedenfor er en liste over delte mapper, som automatisk oprettes, n&aring;r bestemte programmer, tjenester eller pakker installeres eller aktiveres.</p> 

<table>
<tr>
<th>Navn</th>
<th>Beskrivelse</th>
</tr>
<tr>
<th>public</th>
<td>Mappen <strong>public</strong> oprettes automatisk, n&aring;r DiskStation f&oslash;rst konfigureres.*</td>
</tr>
<tr>
<th>web</th>
<td>Mappen <strong>web</strong> er standardlagerplaceringen for indholdet p&aring; et websted, som DiskStation er v&aelig;rt for. Den vil automatisk blive oprettet n&aring;r <strong>Web Station</strong> aktiveres.</td>
</tr>
<tr>
<th>photo</th>
<td>Mappen <strong>photo</strong> bruges til at lagre billeder og videoer, som du vil dele p&aring; Photo&nbsp;Station. Den oprettes automatisk, n&aring;r <strong>Photo Station</strong> eller<strong> DLNA/UPnP-medieserver</strong> aktiveres.</td>
</tr>
<tr>
<th>music</th>
<td>Mappen <strong>music</strong> bruges til at lagre musik, som du vil lytte til p&aring; Audio Station. Den vil automatisk blive oprettet n&aring;r <strong>Audio Station</strong> aktiveres.</td>
</tr>
<tr>
<th>video</th>
<td>Mappen <strong>video</strong> bruges til at gemme videoer, som du vil gennemg&aring; via DLNA/UPnP-enheder. Den vil automatisk blive oprettet n&aring;r <strong>Medieserver</strong> aktiveres.</td>
</tr>
<tr>
<th>surveillance</th>
<td>Mappen <strong>surveillance</strong> bruges til at gemme optagelser fra Surveillance&nbsp;Station. Den vil automatisk blive oprettet n&aring;r <strong>Surveillance Station</strong> aktiveres. Den er skrivebeskyttet, og det er kun systemadministratoren, der har adgang til den.</td>
</tr>
<tr>
<th>home</th>
<td>Mappen <strong>home</strong> giver privat plads til hver bruger, hvor denne kan lagre data, som kun den bruger kan f&aring; adgang til. Den oprettes automatisk, n&aring;r funktionen <strong>Brugerstart</strong> aktiveres.</td>
</tr>
<tr>
<th>homes</th>
<td>Mappen <strong>homes</strong> indeholder startmapper for alle brugere. Den oprettes automatisk, n&aring;r funktionen <strong>Brugerstart</strong> aktiveres. Kun systemadministratoren har adgang til den og kan styre alle brugeres startmapper.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>Mappen <strong>NetBackup</strong> oprettes automatisk, n&aring;r <strong>Netv&aelig;rksbackup</strong> aktiveres.</td>
</tr>
<tr>
<th>usbshare</th>
<td>Mappen <strong>usbshare[nummer]</strong> oprettes automatisk, n&aring;r du tilslutter et eksternt USB-drev til USB-porten p&aring; DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>Mappen <strong>satashare</strong> oprettes automatisk, n&aring;r du tilslutter et eksternt eSATA-drev til eSATA-porten p&aring; DiskStation.*</td>
</tr>
</table>

<p>____<br> * Findes kun p&aring; bestemte modeller</p>

</body>
</html>
