<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Delt mappe</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Administrer avancerede tilladelser til delt mappe</h2>

<p>Side <strong>Kontrolpanel</strong> &gt; <strong>Delt mappe</strong> &gt; <strong>Rediger</strong> &gt; <strong>Avanceret</strong> indeholder nedenst&aring;ende valgmuligheder til at kunne yderligere finindstille adgangstilladelser til en delt mappe.</p>

<h3>Avancerede delingstilladelser</h3>
<p>Avancerede delingstilladelser giver et ekstra lag kontrol til at styre adgangstilladelserne til delte mapper. N&aring;r det er aktiveret, kan brugere og grupper kun se eller &aelig;ndre indholdet for en delt mappe, hvis brugeren eller gruppen har f&aring;et b&aring;de avancerede delingstilladelser <em>og</em> Windows ACL-tilladelser (findes under <strong>Delt mappe</strong> &gt; <strong>Rediger</strong> &gt; <strong>Tilladelser</strong>).</p>

<h4>S&aring;dan aktiverer du avancerede delingstilladelser:</h4>

<ol>
<li>Marker feltet <strong>Aktiver avancerede delingstilladelser</strong>.</li>
<li>Klik p&aring; <strong>Avancerede delingstilladelser</strong> for at &aelig;ndre avancerede delingstilladelser til den delte mappe. </li>
</ol>

<div class="section">
  <h4>Bem&aelig;rk:</h4>
<ul>
<li>Avancerede delingstilladelser anvendes, n&aring;r en bruger f&aring;r adgang til en delt mappe via f&oslash;lgende filtjenester: Windows File Sharing, Apple File Sharing, File Station, FTP og WebDAV.</li>
</ul>
</div>

<h3>Avancerede indstillinger</h3>

<p>Om n&oslash;dvendigt kan du placere yderligere begr&aelig;nsninger p&aring; brugere, n&aring;r de har adgang til en delt mappe via File Station, FTP eller WebDAV.</p>
	<ul>
    <li><strong>Deaktiver biblioteksgennemgang:</strong> Aktivering af denne mulighed begr&aelig;nser brugere i at se indholdet af den delte mappe.</li>
    <li><strong>Deaktiver &aelig;ndring af eksisterende filer:</strong> Aktivering af denne mulighed begr&aelig;nser brugere i at flytte, slette eller &aelig;ndre filer i den delte mappe. Bem&aelig;rk, brugere kan stadig se, downloade/uploade, kopiere eller udtr&aelig;kke indhold fra den delte mappe.</li>
    <li><strong>Deaktiver fildownload:</strong> Aktivering af denne mulighed begr&aelig;nser brugere i at downloade indholdet af den delte mappe.</li>
    </ul>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<p>Ovenst&aring;ende begr&aelig;nsninger g&aelig;lder ikke for brugere, der h&oslash;rer til gruppen <strong>administrators</strong>.</p>
</div>
</body>
</html>
