<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Nettverksinnstillinger</h2>
	<p>Denne siden inneholder tre faner som viser nettverksinnstillingene for high-availability-skyen, den aktive medlemsserveren og den passive medlemsserveren.</p>
  
	<h3>HA-skyfane</h3>
  	<p>N&aring;r du oppretter en high-availability-sky, genererer systemet en felles IP-adresse for at high-availability-skyens IP skal motta innkommende tilkoblinger. Ytterligere IP-adresser for high-availability-skyen kan opprettes om n&oslash;dvendig. IP-adressene til aktiverte nettverksgrensesnitt p&aring; den aktive serveren vil bli vist i denne fanen (nettverksgrensesnittet som brukes av Hjerteslag-tilkoblingen blir ikke vist p&aring; denne siden, siden nevnte grensesnitt vil bli brukt til datakopiering mellom de to serverne). Denne fanen viser informasjonen nedenfor:</p>
    	<ul>
        	<li><b>Nettverksgrensesnitt:</b> De aktiverte nettverksgrensesnittene p&aring; den aktive serveren.</li>
            <li><b>Tilkobling:</b> Viser om dette grensesnittet er tilkoblet eller ikke.</li>
            <li><b>IP-adresse:</b> N&aring;r du oppretter en high-availability-sky, genererer systemet en felles IP-adresse for at high-availability-skyens IP skal motta innkommende tilkoblinger. Du kan koble til high-availability-skyen med denne IP-adressen n&aring;r du &oslash;nsker &aring; logge inn p&aring; DiskStation Manager (DSM), uansett hvilken Synology-server som er aktiv server. Dette forhindrer at du m&aring; koble til forskjellige IP-adresser n&aring;r overf&oslash;ring av tjenester forekommer.</li>
            <li><b>Delnettmaske: </b>Den tilknyttede delnettmasken for den gitte IP-adressen for high-availability-sky.</li>
		</ul>
<h4>Slik redigerer du IP-adresse og delnettmaske:</h4>
	<ol>
		<li>Velg IP-adressen eller delnettmasken du vil redigere og klikk p&aring; <b>Rediger</b>, eller dobbeltklikk i feltet for &aring; starte redigeringen.</li>
   <li>Merk av i boksene <b>Aktiver</b> for &aring; aktivere eller deaktivere hvert enkelt grensesnitt. Du kan aktivere flere enn ett nettverksgrensesnitt for sky, men det opprinnelige nettverskgrensesnittet som ble konfigurert under opprettingen av skyen kan ikke deaktiveres.</li>
    </ol>
<h4>Slik endrer du high-availability-skyens servernavn:</h4>
 	<ol>
    	<li>Klikk p&aring; <b>Endre nettverksinnstillinger</b> for &aring; vise high-availability-skynavnet og endre innstillingene.</li>
   		<li>Klikk p&aring; <b>Bruk</b> for &aring; lagre gjeldende innstillinger for navn og IP-adresse for high-availability-sky.</li>
   		<li>For &aring; forkaste gjeldende endringer, klikker du p&aring; <b>Avbryt</b>. </li>
  </ol>

<h3>Faner for aktiv og passiv server (vises som servernavn)</h3>
<p>Disse fanene viser statusen til nettverksgrensesnitt p&aring; den aktive eller passive serveren. Blant disse, vil Hjerteslag-tilkobling okkupere ett nettverksgrensesnitt b&aring;de p&aring; den aktive og den passiver serveren. Disse fanene viser f&oslash;lgende informasjon:</p>
	<ul>
    	<li><b>Nettverksgrensesnitt:</b> Det fysiske nettverksgrensesnittet p&aring; serveren.</li>
    	<li><b>IP-adresse:</b>Den tildelte IP-adressen for det gitte nettverksgrensesnittet.</li>
    	<li><b>Delnettmaske:</b>Den tilknyttede delnettmasken for den gitte IP-adressen.</li>
    	<li><b>Beskrivelse:</b> Viser informasjon for det gitte netterverksgrensesnittet og tilgjengeligheten til dets tilknyttede IP-adresse. Dette feltet vil vise f&oslash;lgende mulige forhold:</li>
		<ol>
			<li><b>Tilgjengelig original IP-adresse</b>: Den originale IP-adressen som er tildelt grensesnittet for den aktive serveren er tilgjengelig for data og tjenester.</li>
			<li><b>Utilgjengelig original IP-adresse</b>: Den originale IP-adressen som er tildelt grensesnittet p&aring; den passive serveren er ikke tilgjengelig.</li>
			<li><b>IP for Hjerteslag-tilkobling, utilgjengelig fra intranettet</b>: Den originale IP-adressen som automatisk ble tildelt Hjerteslag-tilkoblingen er ikke tilgjengelig for data og tjenester.</li>
		</ol>
	</ul>
</body>
</html>