<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Tjenesteoverv&aring;kning</h2>

<p>Denne siden lar deg overv&aring;ke bestemte tjenester. Hvis en overv&aring;ket tjeneste svikter p&aring; den aktive serveren, vil systemet overf&oslash;re tjenester til den ventende passive serveren (s&aring; lenge den passive serveren fungerer som normalt). F&oslash;lgende seksjoner vises p&aring; denne siden:</p>

<ul>
  <li><b>Tjeneste:</b> Viser tjenester som kan overv&aring;kes.</li>
  <li><b>Status: </b> Viser om tjenester kj&oslash;rer eller ikke.</li>
  <li><b>Bytt n&aring;r tjeneste svikter: </b> Merk av i boksen ved siden av tjenesten for &aring; starte overv&aring;king. Systemet vil overf&oslash;re tjenester hvis den valgte tjenesten svikter.</li>
</ul>

<h4>Slik overv&aring;ker du en tjeneste:</h4>

<ol>
<li>Finn tjenesten du vil overv&aring;ke. Merk av ved siden av den.</li>
<li>Klikk p&aring; <b>Bruk</b> for &aring; lagre innstillingene.</li>
</ol>

<div class="section">
<h4>St&oslash;ttede tjenester</h4>
<p>Tjenester som kan overv&aring;kes er som f&oslash;lger: Windows-filtjeneste, iSCSI Target, FTP, Mac-filtjeneste, NFS-tjeneste.</p>
</div>

<div class="section">
<h4>Overf&oslash;r tjenester n&aring;r nettverkstilkoblingen blir brutt</h4>
<p>Hvis dette alternativet aktiveres, vil systemet overf&oslash;re tjenester til den passive serveren n&aring;r nettverkstilkoblingen til den aktive serveren brytes eller svikter, og nettverkstilkoblingen til den passive serveren fungerer som normalt.</p>

<ul>
<li>Overf&oslash;ring av tjenester vil kun utl&oslash;ses hvis den passive serveren har bedre tilkoblinger. For eksempel, hvis den aktive serveren har tre tilkoblinger og en av dem svikter, vil systemet kun utl&oslash;se en overf&oslash;ring av tjenester hvis den passive serveren har tre eller flere fungerende tilkoblinger.</li>
<li>Tilkoblinger kombinert med Link Aggregation teller som &eacute;n tilkobling. For eksempel, hvis to tilkoblinger er kombinert og en av dem svikter mens den andre fortsatt fungerer, vil tilkoblingen fortsatt telle som fungerende.</li>
</ul>

</div>

</body>
</html>
