<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
  <h2>Sl&aring; av og tilbakestill</h2>
  <p>Anvisningene nedenfor leder deg gjennom prosedyrene med &aring; sl&aring; av, fjerne eller tilbakestille en high-availability-sky.</p>

  <h4> Slik sl&aring;r du av high-availability-skyen med Synology High Availability:</h4>
  <p>N&aring;r du vil sl&aring; av en high-availability-sky for &aring; transportere serverne til en ny fysisk plassering eller utf&oslash;re vedlikehold, uten &aring; fjerne konfigurasjonene for high-availability-skyen, f&oslash;lger du disse anvisningene.</p>
  <ol>
   <li>Logg inn p&aring; DSM.</li>
   <li>&Aring;pne Synology High Availability.</li>
   <li>Klikk p&aring; knappen som er merket med <b>Administrasjon</b>.</li>
   <li>Velg <b>Sl&aring; av HA-sky</b>.</li>
   <li>En bekreftelsesmelding vises. Klikk p&aring; <b>Ja</b> for &aring; bekrefte.</li>
  </ol>

  <h4>Slik sl&aring;r du av en high-availability-sky manuelt:</h4>
  <p> High-availability-skyen kan ogs&aring; sl&aring;s av manuelt med str&oslash;mknappene du finner p&aring; hver enkel server. </p>
  <ol>
   <li>Trykk og hold inne str&oslash;mknappen p&aring; en av serverne (aktiv eller passiv) til den gir fra seg et lydsignal.</li>
   <li>Etter at en server er fullstendig sl&aring;tt av, venter du i minst 30 sekunder (serveren som fortsatt er tilkoblet trenger tid til &aring; lagre innstillinger).</li>
   <li>Trykk og hold inne str&oslash;mknappen p&aring; den andre serveren til den gir fra seg et lydsignal.</li>
   <li>Vent til serveren er fullstendig sl&aring;tt av.</li>
  </ol>
<div class="section">
<h4>Sl&aring; p&aring; servere:</h4>   
<p>N&aring;r du vil sl&aring; p&aring; serverne igjen, b&oslash;r b&aring;de den aktive og den passive serveren sl&aring;s p&aring; samtidig (eller innenfor et fem minutters mellomrom). Hvis du kun sl&aring;r p&aring; &eacute;n av serverne, vil den pr&oslash;ve &aring; sl&aring; p&aring; den andre serveren ved &aring; kringkaste en Wake on LAN-melding.</p>
<h4>Unormal avslutting:</h4>
<p>N&aring;r en high-availability-sky opprettes, vil alternativet om &aring; starte p&aring; nytt etter str&oslash;msvikt i Kontrollpanel automatisk aktiveres. Hvis serverne avsluttes p&aring; unormal m&aring;te p&aring; grunn av str&oslash;msvikt, vil de automatisk sl&aring; seg p&aring; igjen n&aring;r str&oslash;mmen er gjenopprettet.</p>
</div>

<h4>Slik fjerner du en high-availability-sky:</h4>
 <p>N&aring;r du vil frigj&oslash;re begge serverne og fjerne en high-availability-sky for &aring; tilknytte en annen server, f&oslash;lger du disse anvisningene.</p>
  <ol>
   <li>G&aring; til siden <b>Oversikt</b>.</li>
   <li>Klikk p&aring; knappen <b>Administrasjon</b>.</li> 
   <li>Velg <b>Fjern HA-sky</b>.</li>
  </ol>
  <p>Etter bekreftelsen vil systemet fjerne high-availability-skyen. Statusfeltet vil vise fremdriften i fjerningsprosessen. N&aring;r high-availability-skyen har blitt fjernet, blir du dirigert til den opprinnelige IP-adressen til den aktive serveren. Statusen til begge serverne blir endret til <b>Frittst&aring;ende</b>.</li>
  
 <h4>Slik tilbakestiller du en sammenbrutt high-availability-sky:</h4>
  <p>Hvis du ikke f&aring;r tilgang til DSM eller Synology High Availability, p&aring; grunn av en delt hjerne-feil eller andre svikter, kan du pr&oslash;ve &aring; tvinge high-availability-skyen til &aring; frigj&oslash;re serverne ved &aring; trykke p&aring; knappen <b>Reset</b> som du finner p&aring; serverne dine.</p>
  <ol>
   <li>Trykk og hold inne knappen <b>Reset</b> (vanligvis plassert p&aring; bakpanelet til en server) til serveren gir fra seg et lydsignal.
   <li>Systemet vil fjerne high-availability-skyen, og statusen til begge serverne vil endres til <b>Frittst&aring;ende</b></li>
   <li>Ved &aring; trykke p&aring; knappen <b>Reset</b>, gjenoppretter du ogs&aring; enkelte innstillinger til standardinnstillingene, som IP-adresse, DNS og admins passord, i tillegg til det f&oslash;lgende:</li>
   <ul>
    <li>Admins passord vil tilbakestilles til tomt felt.</li>
    <li>Guest-konto vil deaktiveres.</li>
    <li>DHCP vil aktiveres p&aring; IP, DNS, Gateway og andre nettverksgrensesnitt.</li>
    <li>JumboFrames vil deaktiveres, og MTU vil angis til 1500.</li>
    <li>Management Port vil tilbakestilles til 5000/5001.</li>
    <li>PPPoE vil tilbakestilles til standardinnstillingen.</li>
    <li>Automatisk IP-blokkering vil deaktiveres (den blokkerte IP-adressen vil ikke slettes).</li>
    <li>Link Aggregation vil deaktiveres.</li>
    <li>Brannmurregler vil deaktiveres (reglene vil ikke bli slettet).</li>
   </ul>
  </ol>

<div class="section">
<h4>Merk:</h4>
<p>Under prosedyren med &aring; fjerne en high-availability-sky, kan det bli enkelte ufullstendige dataskriveoperasjoner. For &aring; s&oslash;rge for fullstendige data, utf&oslash;rer du datakopiering basert p&aring; den aktive serveren fordi den passive serveren kan mangle enkelte dataoppdateringer.</p>
</div>
 </body>
</html>
