 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SSD TRIM - Ayuda de Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="SSD TRIM improves the read and write performance of volumes created on SSDs, increasing efficiency as well as extending the lifetime of your SSDs.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SSD TRIM</h2>
<p>Si un volumen est&aacute; formado completamente por SSD (Unidades de estado s&oacute;lido), recomendamos habilitar el SSD TRIM. Esta caracter&iacute;stica mejora el rendimiento de lectura y escritura de vol&uacute;menes creados en SSD, aumentando la eficiencia adem&aacute;s de ampliar la vida &uacute;til de las SSD.</p>
<h4>Para habilitar SSD TRIM:</h4>
<ol>
  <li>Abra <strong>Administrador de almacenamiento</strong> y vaya a <strong>Volumen</strong>. </li>
  <li>Seleccione un volumen que est&eacute; formado completamente por SSD y a continuaci&oacute;n haga clic en el bot&oacute;n <b>Configurar</b>.</li>
  <li>En la ventana que aparecer&aacute;, vaya a la pesta&ntilde;a <b>SSD TRIM</b> y marque la casilla <strong>Habilitar TRIM</strong>.</li>
  <li>Haga clic en el bot&oacute;n <strong>Configurar programa</strong> para elegir cuando el sistema realizar&aacute; el SSD TRIM.</li>
  <li>Haga clic en <strong>OK</strong>.</li>
</ol>
<div class="section">
  <h4>Nota:</h4>
  <ul>
    <li>SSD TRIM solo est&aacute; disponible en algunos modelos de DiskStation y tipos de RAID. </li>
    <li>Algunos modelos de SSD no son capaces de realizar SSD TRIM en vol&uacute;menes RAID 5 y RAID 6. Consulte la lista de compatibilidad en <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</li>
    <li>SSD TRIM no se puede habilitar en las siguientes situaciones:<ul>
        <li>El volumen se ha montado con cach&eacute; de SSD.</li>
        <li>El paquete <strong>Time Backup</strong> est&aacute; instalado.</li>
        <li>Se ha creado un cl&uacute;ster de high-availability con el <strong>Administrador de High Availability</strong>.</li>
      </ul>
    </li>
    <li>SSD TRIM no se puede habilitar con iSCSI LUNs a nivel de bloques.</li>
    <li>El rendimiento del sistema se ver&aacute; afectado cuando se est&eacute; realizando SSD TRIM. El tiempo necesario para realizar TRIM depende del tama&ntilde;o del volumen y del modelo de SSD.</li>
    <li>Cuando TRIM est&aacute; habilitado en un volumen, tambi&eacute;n lo estar&aacute; en otros vol&uacute;menes creados en el mismo grupo de discos o RAID group.</li>
  </ul>
</div>
</body>
</html>
