<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Biztons&aacute;gi ment&eacute;s &eacute;s replik&aacute;ci&oacute;</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>LUN biztons&aacute;gi ment&eacute;s</h2>
<p>A(z) DiskStation rendszeren tal&aacute;lhat&oacute; iSCSI LUN-ok helyi megosztott mapp&aacute;kba t&ouml;rt&eacute;nő biztons&aacute;gi ment&eacute;s&eacute;hez haszn&aacute;lja a <b>Biztons&aacute;gi ment&eacute;s &amp; replik&aacute;ci&oacute;</b> ablak <b>Biztons&aacute;gi ment&eacute;s</b> f&uuml;l&eacute;n tal&aacute;lhat&oacute; <b>Helyi LUN biztons&aacute;gi ment&eacute;s</b> elemet. A <b>H&aacute;l&oacute;zati LUN biztons&aacute;gi ment&eacute;s</b> funkci&oacute;val m&aacute;sik DiskStation rendszerre is menthet.</p>

<h4>iSCSI LUN biztons&aacute;gi ment&eacute;se:</h4>
<ol>
<li>
V&aacute;lassza a <b>L&eacute;trehoz&aacute;s</b> &gt; <b>LUN biztons&aacute;gi ment&eacute;si feladat</b> elemet, ekkor megny&iacute;lik a <b>LUN biztons&aacute;gi ment&eacute;s var&aacute;zsl&oacute;</b> - kattintson a <b>Tov&aacute;bb</b> gombra.
</li>
<li>
Amikor a rendszer felk&eacute;ri, hogy v&aacute;lasszon c&eacute;lt&iacute;pust, v&aacute;lasszon a k&ouml;vetkezők k&ouml;z&uuml;l:
</li>
<ul>
<li>
<b>Helyi LUN biztons&aacute;gi ment&eacute;s</b>: Ezt az opci&oacute;t v&aacute;lasztva a LUN biztons&aacute;gi ment&eacute;se a(z) DiskStation rendszerről helyi megosztott mapp&aacute;ba vagy a(z) DiskStation k&eacute;sz&uuml;l&eacute;k USB- vagy eSATA-portj&aacute;hoz csatlakoztatott k&uuml;lső t&aacute;rol&oacute;ra v&eacute;gezhető.
</li>
<li><b>H&aacute;l&oacute;zati LUN biztons&aacute;gi ment&eacute;s</b>: Ezt az opci&oacute;t v&aacute;lasztva a LUN biztons&aacute;gi ment&eacute;se a(z) DiskStation rendszerről m&aacute;sik DiskStation k&eacute;sz&uuml;l&eacute;kre v&eacute;gezhető.
</li>
</ul>
<li>
A k&eacute;rd&eacute;sre adja meg a biztons&aacute;gi ment&eacute;s c&eacute;lhely&eacute;t &eacute;s a forr&aacute;s LUN-t, majd &aacute;ll&iacute;tsa be a ment&eacute;s időz&iacute;t&eacute;s&eacute;t.
</li>
<li>
A be&aacute;ll&iacute;t&aacute;s befejez&eacute;s&eacute;hez k&ouml;vesse a var&aacute;zsl&oacute; utas&iacute;t&aacute;sait.
</li>
</ol>
<p>A biztons&aacute;gi ment&eacute;si feladat l&eacute;trehoz&aacute;sa ut&aacute;n a(z) DiskStation k&eacute;sz&uuml;l&eacute;k az &uuml;temez&eacute;s szerint elv&eacute;gzi a biztons&aacute;gi ment&eacute;si feladatot, &eacute;s elt&aacute;rolja a LUN biztons&aacute;gi m&aacute;solat&aacute;t a c&eacute;lhelyen. A LUN biztons&aacute;gi m&aacute;solata csak biztons&aacute;gi ment&eacute;s c&eacute;lj&aacute;ra szolg&aacute;l. A biztons&aacute;gi m&aacute;solatba ker&uuml;lt LUN el&eacute;r&eacute;s&eacute;hez l&aacute;sd <a href="restore.html">LUN helyre&aacute;ll&iacute;t&aacute;sa biztons&aacute;gi m&aacute;solatb&oacute;l</a>.</p>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Mind a normál fájl, mind pedig a zárószintű LUN-ok fájlképként kerülnek biztonsági mentésre a célhelyen. Ha helyreállításra kerülnek, valamennyi zárószintű LUN fájl LUN-ra változik.</li>
<li>Minden egyes biztons&aacute;gi ment&eacute;si feladat forr&aacute;sa csak egy LUN lehet.</li>
<li>A LUN-ok nem biztons&aacute;gi menthetők FAT, FAT32, HFS, HFS Plus vagy NTFS form&aacute;tum&uacute; k&uuml;lső lemezre.</li>
<li>H&aacute;l&oacute;zati LUN biztons&aacute;gi ment&eacute;s v&eacute;grehajt&aacute;sa előtt jelentkezzen be a c&eacute;l DiskStation eszk&ouml;zre &eacute;s győződj&ouml;n meg r&oacute;la, hogy annak H&aacute;l&oacute;zati biztons&aacute;gi ment&eacute;s szolg&aacute;ltat&aacute;sa enged&eacute;lyezve van a <b>Biztons&aacute;gi ment&eacute;s &eacute;s replik&aacute;ci&oacute;</b> &gt; <b>Biztons&aacute;gi ment&eacute;s szolg&aacute;ltat&aacute;sok</b> men&uuml;pontban.</li>
<li>Ha a(z) DiskStation routeren kereszt&uuml;l csatlakozik a h&aacute;l&oacute;zathoz, h&aacute;l&oacute;zati LUN biztons&aacute;gi ment&eacute;s v&eacute;grehajt&aacute;sa előtt győződj&ouml;n meg r&oacute;la, hogy az iSCSI szolg&aacute;ltat&aacute;shoz a routeren meg van adva porttov&aacute;bb&iacute;t&aacute;si szab&aacute;ly (3260-as TCP-port).</li>
</ul>
</div>


<div class="section">
<h4>A teljes biztons&aacute;gi ment&eacute;s &eacute;s a n&ouml;vekm&eacute;nyes ment&eacute;s:</h4>
<p>
A(z) DiskStation az első alkalommal teljes biztons&aacute;gi ment&eacute;st k&eacute;sz&iacute;t a kiv&aacute;lasztott LUN-r&oacute;l, az ezt k&ouml;vető alkalmakkor pedig n&ouml;vekm&eacute;nyes (r&eacute;szleges) ment&eacute;st k&eacute;sz&iacute;t. Ha viszont a biztons&aacute;gi ment&eacute;s c&eacute;lhelyek&eacute;nt szolg&aacute;l&oacute; megosztott mappa vagy k&ouml;nyvt&aacute;rn&eacute;v megv&aacute;ltozik, a(z) DiskStation &uacute;jra teljes biztons&aacute;gi ment&eacute;st k&eacute;sz&iacute;t a feladat keret&eacute;ben.
</p>
</div>
</body></html>
