<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Dosya Bağlantılarını Paylaş</h2>

<p>DiskStation &uuml;r&uuml;n&uuml;n&uuml;zde saklanan dosyalar veya klas&ouml;rler hızlı ve kolay bir şekilde paylaşılabilir. Bir dosya veya klas&ouml;re sağ tıklayın ve <strong>Dosya linklerini paylaş</strong> &ouml;ğesini se&ccedil;in. Bu işlem arkadaşlara veya diğer kullanıcılara g&ouml;nderilebilecek bir bağlantı ve QR kodu oluşturur. DSM hesapları olsa da olmasa da se&ccedil;ilen dosya veya klas&ouml;r&uuml; indirmek i&ccedil;in bağlantıyı takip edebilirler.</p>


<h4>Dosya linklerini paylaşmak i&ccedil;in:</h4>
<ol>
<li>Paylaşmak istediğiniz dosyaları veya klas&ouml;rleri se&ccedil;in.</li>
<li>Se&ccedil;ilen dosyalara veya klas&ouml;rlere sağ tıklayın ve <b>Eylem</b> men&uuml;s&uuml;ne tıklayın. Ardından <b>Dosya linklerini paylaş</b> &ouml;ğesini se&ccedil;in.</li>
<li>G&ouml;z&uuml;ken pencerede g&ouml;r&uuml;nt&uuml;lenen bağlantıları ve QR kodlarını paylaşın.</li>
<li>Aşağıdaki se&ccedil;enekler de değiştirilebilir:
<ul>
 <li><strong>Ge&ccedil;erlilik s&uuml;resi</strong>: Paylaşımlı bağlantılar i&ccedil;in ge&ccedil;erli erişim periyotlarını ve erişim zamanlarını &ouml;zelleştirebilirsiniz. 
  <ul>
<li><strong>Ge&ccedil;erlilik s&uuml;resini &ouml;zelleştir</strong>: Oluşturma sonrasında paylaşımlı bir bağlantının ne kadar s&uuml;reyle aktif kalacağını belirleyebilirsiniz. Belirtilen periyodu ge&ccedil;tikten sonra bağlantı ge&ccedil;ersiz hale gelecektir.</li>
<li><strong>Ge&ccedil;erli erişim s&uuml;relerini &ouml;zelleştir</strong>: Bir paylaşımlı bağlantıya ka&ccedil; defa erişilebileceğini belirleyebilirsiniz. Belirtilen s&uuml;releri ge&ccedil;tikten sonra bağlantı ge&ccedil;ersiz hale gelecektir.</li>
</ul>
</li>
<li><strong>DSM kullanıcılarıyla paylaş</strong>: Bağlantıyı, a&ccedil;ılır listeden se&ccedil;mek suretiyle DSM kullanıcıları veya gruplarıyla paylaşabilirsiniz. Misafir hesap veya kullanıcı grubu ile paylaşım yapamayacağınıza dikkat edin.</li>

<li><strong>Başkalarıyla paylaş</strong>: DSM olmayan kullanıcılar dahil olmak &uuml;zere, parola korumalı bağlantıları diğer kişilerle paylaşabilirsiniz.</li>

</ul>
</li>
</ol>

<h4> gofile.me bağlantılarını etkinleştirmek i&ccedil;in: </h4> 
<ol>
<li><strong>Denetim Masası</strong> &gt; <strong>QuickConnect</strong> &ouml;ğesine gidin ve <strong>QuickConnect'i etkinleştir</strong> se&ccedil;eneğinin işaretlendiğinden emin olun. QuickConnect'i kurmadıysanız, bunu bu sayfada yapabilirsiniz.</li>
<li>Ardından, <strong>Gelişmiş</strong> &uuml;zerine tıklayın ve <strong>Dosya Paylaşımı</strong> &ouml;ğesinin işaretlendiğinden emin olun.</li>
<li>Paylaşımlı dosyalar gofile.me paylaşım bağlantısına erişilerek DSM hesabı olmadan indirilebilir.</li> 
</ol>
<h3>&Ouml;zelleştirilen Paylaşımlı Bağlantı Sayfası</h3>
<p>File Station paylaşımlı bağlantı sayfasını stilize etmek i&ccedil;in size &ccedil;eşitli se&ccedil;enekler sunar.</p>
<ol>
<li><strong>File Station</strong> &gt; <strong>Ayarlar</strong> &gt; <strong>Paylaşımlı Bağlantılar</strong> &gt; <strong>&Ouml;zel</strong> &ouml;ğesine gidin.</li>
<li><strong>Paylaşımlı bağlantı sayfasını &ouml;zelleştir</strong> &ouml;ğesini se&ccedil;in ve <strong>&Ouml;zel ayarlar</strong>'a tıklayın.</li>
<li>Sayfayı aşağıdaki iki yolla &ouml;zelleştirebilirsiniz:
  <ul>
<li><strong>Şablon</strong>: Bir varsayılan şablon se&ccedil;in.</li>
<li><strong>Arkaplan</strong>: K&uuml;&ccedil;&uuml;k resme veya <strong>+</strong> &uuml;zerine tıklayarak varsayılan bir duvar kağıdı, DiskStation sunucunuzda bir g&ouml;r&uuml;nt&uuml; veya &ouml;nceden uygulanan bir g&ouml;r&uuml;nt&uuml; se&ccedil;in.</li>
<li><strong>Logo</strong>: K&uuml;&ccedil;&uuml;k resim veya <strong>+</strong> &uuml;zerine tıklayarak karşıya y&uuml;klenen bir g&ouml;r&uuml;nt&uuml; (1 MB'tan daha k&uuml;&ccedil;&uuml;k), DiskStation sunucunuzda bir g&ouml;r&uuml;nt&uuml; veya &ouml;nceden uygulanan bir g&ouml;r&uuml;nt&uuml; se&ccedil;in. Logo d&ouml;rt k&ouml;şeden herhangi bir birisine konumlandırılabilir.</li>
</ul>
</li>
<li>Herhangi bir ayarlamaya gerek olup olmadığını g&ouml;rmek i&ccedil;in <strong>&Ouml;nizleme</strong>'ye tıklayın.</li>
<li>Ayarları uygulamak i&ccedil;in <strong>Tamam</strong> &uuml;zerine tıklayın.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ol>
<li>&Ouml;zelleştirilen ayarlar oluşturma zamanlarından bağımsız olarak t&uuml;m paylaşılan bağlantılara uygulanırlar.</li>
<li>Sadece şu bi&ccedil;imlerdeki g&ouml;r&uuml;nt&uuml;leri duvar kağıdı/logo olarak uygulayabilirsiniz: .jpe, jpeg, .jpg, .bmp, .gif ve .png</li></ol>
</div>

<h3>Paylaşılan Linkleri Y&ouml;netme</h3>
<p>Mevcut paylaşılan bağlantılar <strong>Ara&ccedil;lar</strong> &gt; <strong>Paylaşılan Linkler Y&ouml;neticisi</strong> &ouml;ğesine gidilerek y&ouml;netilebilir. A&ccedil;ılan pencerede, mevcut paylaşılan bağlantıları d&uuml;zenlemek, paylaşmak veya kaldırmak i&ccedil;in se&ccedil;enekler vardır.</p>

<div class="section">
<h4>Not:</h4>
<ol>
  <li>1000 adede kadar paylaşımlı bağlantı oluşturabilirsiniz.</li>
  <li>Her paylaşılan bağlantının <strong>Durum</strong> kısmı aşağıdakilerden birisini g&ouml;r&uuml;nt&uuml;ler:
<ul>
<li><b>Ge&ccedil;erli</b>: Paylaşılan link d&uuml;zg&uuml;n &ccedil;alışıyor.</li>
<li><b>S&uuml;resi dolmuş</b>: Paylaşılan bağlantının ge&ccedil;erlilik s&uuml;resi dolmuş.</li>
<li><b>Ge&ccedil;ersiz</b>: Paylaşılan dosya ve klas&ouml;r artık mevcut değil veya dosya veya klas&ouml;re erişmek i&ccedil;in uygun ayrıcalığa sahip değilsiniz.</li>
<li><b>Hen&uuml;z y&uuml;r&uuml;rl&uuml;kte değil</b>: Paylaşılan link hen&uuml;z etkin hale gelmedi.</li>
</ul>
</li>
</ol>

</div>
</body>
</html>
