<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Dosyaları veya Klas&ouml;rleri Karşıya Y&uuml;kleyin</h2>
<p>Bilgisayarınızdan DiskStation sunucusuna dosya veya klas&ouml;r y&uuml;klemek i&ccedil;in aşağıdaki y&ouml;ntemlerden birini kullanın.</p>
<p>Aşağıda g&ouml;sterilen karşıya y&uuml;kleme işlevlerine tam erişime sahip olmak i&ccedil;in, &ouml;ncelikle en son Java Runtime Environment (JRE) ve Flash Player s&uuml;r&uuml;mlerini y&uuml;kleyin. </p>


<h4>Y&ouml;ntem 1:</h4>
<ol>
<li>
Sol panelin &uuml;st kısmından DiskStation &uuml;zerinde bir hedef klas&ouml;r se&ccedil;in. 
</li>
<li>
<b>Karşıya Y&uuml;kle</b>'ye tıklayın, <strong>Karşıya Y&uuml;kle - Atla</strong> ya da <strong>Karşıya Y&uuml;kle - &Uuml;zerine yaz</strong>'ı, ardından da yerel bilgisayarınızdan dosyaları veya klas&ouml;rleri se&ccedil;in. </li>
</ol>
<h4>Y&ouml;ntem 2:</h4>
<ol>
	<li>Yerel bilgisayarınızda sol panelin alt kısmındaki dosyaları g&ouml;rmek i&ccedil;in<strong>Ayarlar</strong>'a gidin,<strong>File Station ile yerel bilgisayar dosyalarına G&ouml;zat</strong>'ı tıklayın ve web sayfasını yenileyin.</li>
<div class="section">
<h4>Not:</h4>
<p><strong>File Station ile yerel bilgisayar dosyalarına g&ouml;zat </strong> se&ccedil;eneği yalnızca bilgisayarınızda JRE y&uuml;klenip etkinleştirildikten sonra etkili olacaktır.</p>
</div>
	<li>Sol panelin alt kısmından yerel bilgisayarınız &uuml;zerinde bir klas&ouml;r se&ccedil;in. Şimdi ana b&ouml;l&uuml;m se&ccedil;ilen klas&ouml;r&uuml;n i&ccedil;eriğini g&ouml;sterir.
	</li>
	<li>Ana b&ouml;l&uuml;mde istediğiniz dosya veya klas&ouml;rleri se&ccedil;in ve ardından <b>Karşıya y&uuml;kle</b> se&ccedil;imini yapın. 
</li>
	<li>Beliren pencerede DiskStation &uuml;zerindeki bir hedef klas&ouml;r&uuml; se&ccedil;in.
	</li>
	<li>Hedef klas&ouml;rdeki aynı isimli dosya veya klas&ouml;rlerin &uuml;zerine yazılmasını istiyorsanız pencerenin sağ &uuml;st k&ouml;şesinde <b>&Uuml;zerine yaz</b> se&ccedil;imini yapın. Aksi halde <b>Atla</b>'yı se&ccedil;in.
</li>
	<li>Y&uuml;klemeyi başlatmak i&ccedil;in <b>Tamam</b> &uuml;zerine tıklayın.
</li>
</ol>
<h4>Y&ouml;ntem 3:</h4>
<ol>
<li>Yerel bilgisayarınızda sol panelin alt kısmındaki dosyaları g&ouml;rmek i&ccedil;in<strong>Ayarlar</strong>'a gidin,<strong>File Station ile yerel bilgisayar dosyalarına G&ouml;zat</strong>'ı tıklayın ve web sayfasını yenileyin.</li>
<li>
Sol panelde, bilgisayarınızdan bir klas&ouml;r&uuml; (alt kısım) DiskStation (&uuml;st kısım) &uuml;zerindeki bir klas&ouml;re s&uuml;r&uuml;kleyin.
</li>
<li>
A&ccedil;ılan men&uuml;de, hedef klas&ouml;rde aynı ada sahip dosyaların/klas&ouml;rlerin &uuml;zerine yazmayı mı yoksa bu dosyaları atlamayı mı istediğinizi se&ccedil;in.
</li>
</ol>
<h4>Y&ouml;ntem 4:</h4>
<ol>
<li>
Sol panelin &uuml;st kısmından DiskStation &uuml;zerinde bir hedef klas&ouml;r se&ccedil;in.
</li>

<li>
Bilgisayarınızın masa&uuml;st&uuml; veya dosya gezgini (&ouml;rneğin Windows Explorer veya Mac Finder) &uuml;zerinde dosyaları se&ccedil;in ve ardından bunları s&uuml;r&uuml;kleyip web tarayıcıda File Station'a bırakın.
</li>

<li>
A&ccedil;ılan iletişim kutusunda, hedef klas&ouml;rde aynı ada sahip dosyaların &uuml;zerine yazmayı mı yoksa bu dosyaları atlamayı mı istediğinizi se&ccedil;in.</li>
<div class="section">
<h4>Not:</h4>
<ul>
<li><b>Y&ouml;ntem 4</b> yalnız belirli tarayıcılarda desteklenir: Chrome, Firefox, Safari 5.1 veya &uuml;st&uuml;. Ancak, <strong>File Station ile yerel bilgisayar dosyalarına g&ouml;zat</strong> se&ccedil;eneği işaretliyken Mac i&ccedil;in desteklenmez.</li>
<li>
Klas&ouml;rleri ya da boş dosyaları da yalnızca yukarıda listelenen tarayıcılar i&ccedil;in <strong>File Station ile yerel bilgisayar dosyalarına g&ouml;zat</strong> se&ccedil;eneği işaretliyken s&uuml;r&uuml;kleyip bırakabilirsiniz. Aksi halde, klas&ouml;rleri ve boş dosyaları <strong>Y&ouml;ntem 4</strong>'&uuml; kullanarak karşıya y&uuml;kleyemezsiniz.</li>
	<li>
Linux i&ccedil;in Chrome kullanıyorsanız ve DSM'de HTTPS protokol&uuml; aracılığıyla oturum a&ccedil;mışsanız, <b>Y&ouml;ntem 4</b> kullanarak y&uuml;kleme yapabilmek i&ccedil;in g&uuml;venilir sertifika (<b>Denetim Masası</b> &gt; <b>G&uuml;venlik</b> &gt; <strong>Sertifika</strong> &ouml;ğesinde) almanız gerekir.
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Not:</h4>
<ol>
<li>
Karşıya y&uuml;kleme kuyruğunuza 1000 dosyaya kadar ekleyebilirsiniz.
</li>
	<li>
	Boyutu 4 GB &uuml;zerinde olan dosyaları, Google Chrome, Firefox, Safari 5.1 ya da &uuml;st&uuml;n&uuml; kullanıyorsanız veya <strong>File Station ile yerel bilgisayar dosyalarına g&ouml;zat</strong> se&ccedil;eneği işaretli olduğunda karşıya y&uuml;kleyebilirsiniz. Aksi halde, bir seferde yalnızca 2 GB boyutuna kadar dosya y&uuml;kleyebilirsiniz.</li>
	<li>
Şifrelenmemiş bir paylaşımlı klas&ouml;rde, dosya/klas&ouml;r adı 255 karakteri (Latin alfabesini kullanmayan diller i&ccedil;in yaklaşık 80 karaktere kadar); şifrelenmiş paylaşımlı klas&ouml;rde ise en fazla 143 karakter (Latin alfabesini kullanmayan diller i&ccedil;in yaklaşık 47 karaktere kadar) ge&ccedil;memelidir.
</li>
<li>
Dosya/klas&ouml;r adı aşağıdaki karakterleri i&ccedil;ermemelidir: \ / : * ? &quot; &gt; |.
</li>
<li>
Dosya/klas&ouml;r adı _ ile başlayamaz.
</li>
<li>Boyutu 0 KB olan dosyaları yalnızca JRE y&uuml;klediğinizde karşıya y&uuml;kleyebilirsiniz.</li>
</ol>
</div>


<div class="section">
<h4>Sorun Giderme</h4>
<p>Safari kullanarak Mac'inizdeki yerel &ouml;ğelere g&ouml;z atamıyorsanız, l&uuml;tfen aşağıdakileri yapın:</p>
<ol>
<li>Mac'inizde, Safari'yi a&ccedil;ın ve Safari men&uuml;s&uuml;nden <strong>Tercihler</strong> &ouml;ğesini se&ccedil;in.</li>
<li><strong>G&uuml;venlik</strong> sekmesinde <strong>Web Sitesi Ayarlarını Y&ouml;net</strong> &uuml;zerine tıklayın.</li>
<li><strong>Java</strong> altında, DSM &quot;web sitenizi&quot; se&ccedil;in.</li>
<li><strong>G&uuml;vensiz Modda &Ccedil;alıştır</strong> &ouml;ğesini se&ccedil;in.</li>
</ol>
</div>



</body>
</html>
