<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Odtwarzanie na ekranie telewizora zawartości multimedialnej zapisanej na serwerze NAS Synology</title>
</head>

<body class="tutorial-content-box" >

<h1>Odtwarzanie na ekranie telewizora zawartości multimedialnej zapisanej na serwerze NAS Synology</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_media_server/enjoy_multimedia_contents_stored_on_synology_nas_with_big_screens.jpg" width="600" height="301" />
<h2>Przegląd</h2>
<p>Serwer NAS Synology może pełnić funkcję serwera multimedi&oacute;w w sieci lokalnej, umożliwiając komputerom i urządzeniom domowym, takim jak telewizory, systemy stereofoniczne i konsole Sony PlayStation3 oraz Xbox 360, odtwarzanie przechowywanej na nim zawartości multimedialnej. Są to <b>cyfrowe adaptery multimedi&oacute;w</b> (DMA) obsługujące standardy DLNA/UPnP. Aby m&oacute;c przesyłać strumieniowo zawartość multimedialną z serwera NAS Synology w celu odtwarzania jej na urządzeniach DMA, należy skonfigurować ustawienia odtwarzania multimedi&oacute;w. Na przykład zarządzanie ustawieniami przeglądania plik&oacute;w multimedialnych oraz zwiększanie kompatybilności plik&oacute;w. Ta funkcja jest dostępna w pakiecie <strong>Serwer multimedi&oacute;w</strong>.</p>

<h3 class="list_head">1. Instalacja pakietu Serwer multimedi&oacute;w</h3>
<p>Aby zainstalować pakiet Serwer multimedi&oacute;w, przejdź do pozycji <b>Centrum pakiet&oacute;w</b>, odszukaj pakiet <b>Serwer multimedi&oacute;w</b>, a następnie kliknij przycisk <b>Zainstaluj</b>.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_install_media_server.png" width="640" border="1" />

<h3 class="list_head">2. Przesyłanie plik&oacute;w multimedialnych do serwera NAS Synology</h3>
<p>Po instalacji pakietu Serwer multimedi&oacute;w na serwerze NAS zostaną automatycznie utworzone i zindeksowane domyślne foldery wsp&oacute;łdzielone, <b>photo</b>, <b>music</b> i <b>video</b>. Wystarczy teraz przesłać pliki multimedialne, takie jak zdjęcia, utwory i filmy wideo do odpowiednich folder&oacute;w, aby te pliki stały się dostępne dla urządzeń DMA.</p>
<div class="code_div"><b>Uwaga:</b> zamontowanych folder&oacute;w wsp&oacute;łdzielonych z serwer&oacute;w zdalnych nie można dodać jako folder&oacute;w indeksowanych. Na serwerze NAS Synology można utworzyć do 100 indeksowanych folder&oacute;w.</div>

<h3 class="list_head">3. Konfigurowanie ustawień przeglądania dla posiadanego odtwarzacza multimedi&oacute;w</h3>
<p>Można ustalić spos&oacute;b przeglądania plik&oacute;w multimedialnych na serwerze NAS Synology za pośrednictwem urządzeń DMA.</p>
<ol>
<li>Przejdź do pozycji <b>Menu gł&oacute;wne &gt; Serwer multimedi&oacute;w</b>.</li>
<li>Kliknij pozycję <b>Ustawienia przeglądania</b> w panelu po lewej stronie.</li>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_browsing_settings.png" width="640" border="1" />
<li>Aby uzyskać więcej informacji, kliknij przycisk <b>Pomoc</b> w prawym g&oacute;rnym rogu okna <b>Serwer multimedi&oacute;w</b>.</li>
</ol>
<h3 class="list_head">4. Rozszerzanie zgodności z adapterem DMA</h3>
<p>Jeśli posiadany telewizor DLNA/UPnP lub adapter DMA nie odtwarza prawidłowo zawartości multimedialnej zapisanej na serwerze NAS, można spr&oacute;bować skonfigurować ustawienia opcji <b>Zgodność z DMA</b> w aplikacji Serwer multimedi&oacute;w.</p>
<img src="../../images/HomeTheater/1x/home_theater_media_server/media_server_dma_compatibility.png" width="640" border="1" />
<div class="code_div"><b>Uwaga:</b>
<ol>
  <li>Aby sprawdzić, czy urządzenie DMA zostało prawidłowo zainstalowane i odszukane przez serwer NAS w sieci lokalnej, kliknij przycisk <b>Lista urządzeń</b>. Wyświetlona zostanie lista urządzeń DMA wraz z informacjami o urządzeniach.</li>
  <li>Upewnij się, że pole <b>Ogranicz dostęp do Serwera multimedi&oacute;w nowo wykrywanym urządzeniom UPnP/DLNA</b> nie jest zaznaczone. W przeciwnym wypadku Serwer multimedi&oacute;w nie będzie dostępny dla urządzeń DMA.</li>
</ol>
</div>
<p>Aby uzyskać więcej informacji na temat wsparcia technicznego dotyczącego plik&oacute;w multimedialnych w innych formatach, kliknij przycisk Pomoc w prawym g&oacute;rnym rogu okna Serwer multimedi&oacute;w.</p>
<h3 class="list_head">5. Uzyskiwanie dostępu do plik&oacute;w multimedialnych przechowywanych na serwerze NAS przy użyciu telewizora DLNA</h3>
<p>Urządzenia DLNA/UPnP i DMA można łatwo podłączyć do sieci domowej. Po połączeniu do sieci domowej serwera NAS Synology i urządzeń DLNA można przeglądać wybrane foldery i słuchać muzyki lub oglądać filmy zapisane na serwerze NAS na ekranie telewizora.</p>
<div class="code_div"><b>Uwaga:</b> Pełną listę telewizor&oacute;w oraz urządzeń DMA obsługujących standardy DLNA/UPnP i zweryfikowanych przez firmę Synology można uzyskać <a href="https://www.synology.com/compatibility?search_by=category&category=dlna_devices&p=1&not_recommend_mode=false" target="_blank">tutaj</a>.</div>
<p>Proces konfigurowania ustawień zależy od urządzenia DMA obsługującego standard DLNA. Aby uzyskać więcej informacji na temat dostępu do plik&oacute;w multimedialnych zapisanych na serwerze NAS za pośrednictwem DLNA należy zapoznać się z instrukcjami urządzenia klienckiego.</p>
</div>
<div class="page-info">
  <ul>
    <li>Kolejne w tym temacie: <a href="home_theater_videos.html">Podział na kategorie i odtwarzanie plik&oacute;w wideo w aplikacji Video Station</a> </li>
  </ul>
</div>
</body>

</html>