<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>F&aacute;jlok &eacute;s mapp&aacute;k t&ouml;m&ouml;r&iacute;t&eacute;se</h2>
<ol>
<li>V&aacute;lasszon a fő ter&uuml;leten a DiskStation k&eacute;sz&uuml;l&eacute;ken tal&aacute;lhat&oacute; f&aacute;jlok vagy mapp&aacute;k k&ouml;z&uuml;l.</li>
<li>V&aacute;lassza ki a <b>T&ouml;m&ouml;r&iacute;t&eacute;s &bdquo;(f&aacute;jln&eacute;v)&rdquo;.zip f&aacute;jlba</b> lehetős&eacute;get a <b>Műveletek</b> leg&ouml;rd&uuml;lő men&uuml;ből a t&ouml;m&ouml;r&iacute;t&eacute;s megkezd&eacute;s&eacute;hez.</li>
<li>Ha a t&ouml;m&ouml;r&iacute;t&eacute;s befejeztekor nem l&aacute;tja a zip f&aacute;jlt, a f&aacute;jl l&aacute;that&oacute;v&aacute; t&eacute;tel&eacute;hez v&aacute;lassza a <b>Friss&iacute;t&eacute;s</b> lehetős&eacute;get a <b>Műveletek</b> leg&ouml;rd&uuml;lő men&uuml;ből.</li>
<li>Ha az arch&iacute;vumot &aacute;t szeretn&eacute; nevezni, titkos&iacute;tani szeretn&eacute;, vagy k&uuml;l&ouml;nb&ouml;ző t&ouml;m&ouml;r&iacute;t&eacute;si szintek vagy &uuml;zemm&oacute;dok haszn&aacute;lat&aacute;val szeretn&eacute; archiv&aacute;lni, v&aacute;lassza helyette a <b>Hozz&aacute;ad&aacute;s az arch&iacute;vumhoz...</b> lehetős&eacute;get.</li>
</ol>
<ol><span class="note_head">Megjegyz&eacute;s:</span><li>A helyi sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;n a <b>File Station</b> haszn&aacute;lat&aacute;val nem t&ouml;m&ouml;r&iacute;thet f&aacute;jlokat vagy mapp&aacute;kat.</li>
<li>T&aacute;mogatott arch&iacute;vumform&aacute;tumok: .zip, .7z.</li>
<li>Amennyiben a <strong>Hozz&aacute;ad&aacute;sa az arch&iacute;vumhoz...</strong> pont <strong>Arch&iacute;vumform&aacute;tum</strong> opci&oacute;j&aacute;n&aacute;l a .zip lehetős&eacute;get v&aacute;lasztja, meghat&aacute;rozhatja a k&iacute;v&aacute;nt k&oacute;dlapot a .zip f&aacute;jl sz&aacute;m&aacute;ra.</li>
</ol>
</body>
</html>
