<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />


<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>F&aacute;jlok vagy mapp&aacute;k felt&ouml;lt&eacute;se</h2>
<p>A k&ouml;vetkező m&oacute;dszerekkel t&ouml;lthet fel f&aacute;jlt vagy mapp&aacute;t a sz&aacute;m&iacute;t&oacute;g&eacute;pről a DiskStation k&eacute;sz&uuml;l&eacute;kre.</p>
<p>Ha teljes hozz&aacute;f&eacute;r&eacute;st szeretne az al&aacute;bb bemutatott felt&ouml;lt&eacute;si funkci&oacute;khoz, elősz&ouml;r telep&iacute;tse a leg&uacute;jabb Java Runtime Environment (JRE) &eacute;s Flash Player alkalmaz&aacute;sokat. </p>


<h4>1. m&oacute;dszer:</h4>
<ol>
<li>
A bal oldali panel felső r&eacute;sz&eacute;ből v&aacute;lasszon ki egy a(z) DiskStation k&eacute;sz&uuml;l&eacute;ken tal&aacute;lhat&oacute; c&eacute;lmapp&aacute;t. 
</li>
<li>
Kattintson a <b>Felt&ouml;lt&eacute;s</b> lehetős&eacute;gre, v&aacute;lassza a <strong>Felt&ouml;lt&eacute;s - Kihagy&aacute;s</strong> vagy <strong>Felt&ouml;lt&eacute;s - Fel&uuml;l&iacute;r&aacute;s</strong> lehetős&eacute;get, majd v&aacute;lasszon ki helyi sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;ről f&aacute;jlokat vagy mapp&aacute;kat. </li>
</ol>
<h4>2. m&oacute;dszer:</h4>
<ol>
	<li>Ha a baloldali panel als&oacute; r&eacute;sz&eacute;n szeretn&eacute; megtekinteni helyi sz&aacute;m&iacute;t&oacute;g&eacute;pe mapp&aacute;it, menjen a <strong>Be&aacute;ll&iacute;t&aacute;sok</strong> lehetős&eacute;gre, jel&ouml;lje be a <strong>Helyi sz&aacute;m&iacute;t&oacute;g&eacute;p f&aacute;jljainak tall&oacute;z&aacute;sa File Stationnel</strong> lehetős&eacute;get, majd friss&iacute;tse a weboldalt.</li>
<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>A <strong>Helyi sz&aacute;m&iacute;t&oacute;g&eacute;p f&aacute;jljainak tall&oacute;z&aacute;sa File Stationnel</strong> lehetős&eacute;g csak azut&aacute;n l&eacute;p hat&aacute;lyba, ha telep&iacute;tette &eacute;s enged&eacute;lyezte sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;n a JRE alkalmaz&aacute;st.</p>
</div>
	<li>A bal oldali panel als&oacute; r&eacute;sz&eacute;ről v&aacute;lasszon ki egy mapp&aacute;t a helyi sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;n. A főr&eacute;sz most a kiv&aacute;lasztott mappa tartalm&aacute;t jelen&iacute;ti meg.
	</li>
	<li>V&aacute;lassza ki a főr&eacute;szen a k&iacute;v&aacute;nt f&aacute;jlokat vagy mapp&aacute;kat, majd kattintson a <b>Felt&ouml;lt&eacute;s</b> lehetős&eacute;gre. 
</li>
	<li>A megjelenő ablakban v&aacute;lasszon ki egy, a DiskStation k&eacute;sz&uuml;l&eacute;ken tal&aacute;lhat&oacute; c&eacute;lmapp&aacute;t.
	</li>
	<li>Az ablak jobb felső sark&aacute;ban v&aacute;lassza ki a <b>Fel&uuml;l&iacute;r&aacute;s</b> lehetős&eacute;get, ha a c&eacute;lmapp&aacute;ban ugyanolyan n&eacute;vvel tal&aacute;lhat&oacute; f&aacute;jlokat vagy mapp&aacute;kat fel&uuml;l szeretn&eacute; &iacute;rni. Egy&eacute;bk&eacute;nt v&aacute;lassza a <b>Kihagy&aacute;s</b> lehetős&eacute;get.
</li>
	<li>A felt&ouml;lt&eacute;s megkezd&eacute;s&eacute;hez kattintson az <b>OK</b> gombra.
</li>
</ol>
<h4>3. m&oacute;dszer:</h4>
<ol>
<li>Ha a baloldali panel als&oacute; r&eacute;sz&eacute;n szeretn&eacute; megtekinteni helyi sz&aacute;m&iacute;t&oacute;g&eacute;pe mapp&aacute;it, menjen a <strong>Be&aacute;ll&iacute;t&aacute;sok</strong> lehetős&eacute;gre, jel&ouml;lje be a <strong>Helyi sz&aacute;m&iacute;t&oacute;g&eacute;p f&aacute;jljainak tall&oacute;z&aacute;sa File Stationnel</strong> lehetős&eacute;get, majd friss&iacute;tse a weboldalt.</li>
<li>
A baloldali panelen h&uacute;zzon egy mapp&aacute;t a sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;ről (az als&oacute; r&eacute;szről) a(z) DiskStation b&aacute;rmelyik mapp&aacute;j&aacute;ba (a felső r&eacute;szre).
</li>
<li>
A felbukkan&oacute; men&uuml;ben v&aacute;lassza ki, hogy a c&eacute;lmapp&aacute;ban ugyanolyan n&eacute;ven tal&aacute;lhat&oacute; f&aacute;jlokat/mapp&aacute;kat fel&uuml;l&iacute;rni vagy kihagyni szeretn&eacute;-e.
</li>
</ol>
<h4>4. m&oacute;dszer:</h4>
<ol>
<li>
A bal oldali panel felső r&eacute;sz&eacute;ből v&aacute;lasszon ki egy a(z) DiskStation k&eacute;sz&uuml;l&eacute;ken tal&aacute;lhat&oacute; c&eacute;lmapp&aacute;t.
</li>

<li>
Jel&ouml;lje ki a f&aacute;jlokat a sz&aacute;m&iacute;t&oacute;g&eacute;p asztal&aacute;n vagy a f&aacute;jlkezelőben (p&eacute;ld&aacute;ul Windows Int&eacute;ző vagy Mac Finder), majd h&uacute;zza őket a webb&ouml;ng&eacute;szőben a File Stationre.
</li>

<li>
A felbukkan&oacute; p&aacute;rbesz&eacute;dpanelen v&aacute;lassza ki, hogy a c&eacute;lmapp&aacute;ban ugyanolyan n&eacute;ven tal&aacute;lhat&oacute; f&aacute;jlokat fel&uuml;l&iacute;rni vagy kihagyni szeretn&eacute;-e.</li>
<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>A <b>4. m&oacute;dszert</b> csak egyes b&ouml;ng&eacute;szők t&aacute;mogatj&aacute;k: Chrome, Firefox, Safari 5.1 &eacute;s &uacute;jabb verzi&oacute;k. A Mac azonban nem t&aacute;mogatja, ha a <strong>Helyi sz&aacute;m&iacute;t&oacute;g&eacute;p f&aacute;jljainak tall&oacute;z&aacute;sa File Stationnel</strong> lehetős&eacute;g be ven jel&ouml;lve.</li>
<li>
A mapp&aacute;kat vagy az &uuml;res f&aacute;jlokat h&uacute;zhatja is, de csak akkor, ha a <strong>Helyi sz&aacute;m&iacute;t&oacute;g&eacute;p f&aacute;jljainak tall&oacute;z&aacute;sa File Stationnel</strong> lehetős&eacute;g a fent felsorolt b&ouml;ng&eacute;szők eset&eacute;n be ven jel&ouml;lve. M&aacute;sk&uuml;l&ouml;nben a <strong>4. m&oacute;dszer</strong> haszn&aacute;lat&aacute;val nem tud felt&ouml;lteni mapp&aacute;kat vagy &uuml;res f&aacute;jlokat.</li>
	<li>
Ha Chrome for Linux programot haszn&aacute;l &eacute;s a HTTPS protokoll haszn&aacute;lat&aacute;val jelentkezett be a DSM-be, akkor megb&iacute;zhat&oacute; tan&uacute;s&iacute;tv&aacute;nyt kell import&aacute;lnia, ha <b>4. m&oacute;dszer</b> haszn&aacute;lat&aacute;val akar felt&ouml;lteni (be&aacute;ll&iacute;t&aacute;s helye: <b>Vez&eacute;rlőpult</b> &gt; <b>Biztons&aacute;g</b> &gt; <strong>Tan&uacute;s&iacute;tv&aacute;ny</strong>).
</li>
</ul>
</div>
</ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ol>
<li>
Ak&aacute;r 1000 f&aacute;jlt is hozz&aacute;adhat a felt&ouml;lt&eacute;si sorhoz.
</li>
	<li>
	Ak&aacute;r 4 GB m&eacute;ret feletti f&aacute;jlokat is felt&ouml;lthet, ha Google Chrome, Firefox, Safari 5.1 vagy &uacute;jabb verzi&oacute;j&uacute; b&ouml;ng&eacute;szőt haszn&aacute;l, vagy ha be van jel&ouml;lve a <strong>Helyi sz&aacute;m&iacute;t&oacute;g&eacute;p f&aacute;jljainak tall&oacute;z&aacute;sa File Stationnel</strong> lehetős&eacute;g. Egy&eacute;bk&eacute;nt egyszerre csak legfeljebb 2 GB-nyi f&aacute;jlok t&ouml;lthetők fel.</li>
	<li>
Egy titkos&iacute;tatlan megosztott mapp&aacute;ban a f&aacute;jlok/mapp&aacute;k neve nem haladhatja meg a 255 karaktert (ez max. nagyj&aacute;b&oacute;l 80 karakter a nem latin betűkkel &iacute;r&oacute; nyelveken); egy titkos&iacute;tott megosztott mapp&aacute;ban a limit 143 karakter (max. nagyj&aacute;b&oacute;l 47 karakter a nem latin betűkkel &iacute;r&oacute; nyelveken).
</li>
<li>
A f&aacute;jlok/mapp&aacute;k neve nem tartalmazhatja a k&ouml;vetkező karaktereket: \ / : * ? &quot; &gt; |.
</li>
<li>
F&aacute;jl/mappa neve nem kezdődhet &quot;._&quot; karakterrel.
</li>
<li>Csak akkor t&ouml;lthet fel 0 KB m&eacute;retű f&aacute;jlokat, ha a JRE telep&iacute;tve van.</li>
</ol>
</div>


<div class="section">
<h4>Hibaelh&aacute;r&iacute;t&aacute;s</h4>
<p>Ha nem tudja megfelelően b&ouml;ng&eacute;szni Safari haszn&aacute;lat&aacute;val a Mac g&eacute;p&eacute;n t&aacute;rolt helyi elemeket, tegye a k&ouml;vetkezőket:</p>
<ol>
<li>A Mac g&eacute;p&eacute;n nyissa meg a Safari programot, &eacute;s a Safari men&uuml;ből v&aacute;lassza ki a <strong>Preferenci&aacute;k</strong> lehetős&eacute;get.</li>
<li>Kattintson a <strong>Weboldal be&aacute;ll&iacute;t&aacute;sainak kezel&eacute;se</strong> lehetős&eacute;gre a <strong>Biztons&aacute;g</strong> f&uuml;l&ouml;n.</li>
<li>A <strong>Java</strong> men&uuml;pontban v&aacute;lassza ki a DSM &quot;weboldalt.&quot;</li>
<li>V&aacute;lassza a <strong>Futtat&aacute;s nem biztons&aacute;gos &uuml;zemm&oacute;dban</strong> lehetős&eacute;get.</li>
</ol>
</div>



</body>
</html>
