<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Acessibilidade</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Acessibilidade</h2>

<p>Com a funcionalidade de acessibilidade integrada, DiskStation Manager proporciona pistas auditivas para ajudar utilizadores com dificuldades visuais a navegar e gerir os servi&ccedil;os/defini&ccedil;&otilde;es DSM.</p> 

<h3>Configura&ccedil;&atilde;o de Acessibilidade DSM</h3>

<p>Para maximizar a acessibilidade, sugerimos que configure o ambiente de funcionamento da seguinte forma:</p>

<ul>
<li>Instale o leitor de ecr&atilde; <a href="http://www.nvaccess.org/download/" target="_blank">NVDA</a> (dispon&iacute;vel apenas no ambiente Windows) no seu computador local.</li>
<li>Instale o navegador web <a href="https://www.mozilla.org/firefox/desktop/" target="_blank">Mozilla Firefox</a> mais recente.</li>
<li>Use auscultadores ou altifalantes, e ajuste o volume para se ajustar &agrave;s suas necessidades.</li>
<li>Use NVDA no modo de focagem (prima a tecla NVDA + Espa&ccedil;o para a comuta&ccedil;&atilde;o de modo). A tecla NVDA predefinida &eacute; Insert.</li>
<li>Navegue pelo DSM com as seguintes teclas de atalho:
  <table width="200" border="1">
  <tbody>
    <tr>
      <th>Tecla de atalho</th>
      <th>Descri&ccedil;&atilde;o</th>
    </tr>
    <tr>
      <td align="center">Separador</td>
      <td>Mude para outras sec&ccedil;&otilde;es da interface do utilizador</td>
    </tr>
    <tr>
      <td align="center">Teclas de seta</td>
      <td>Mude para itens dentro da mesma sec&ccedil;&atilde;o de interface do utilizador</td>
    </tr>
    <tr>
      <td align="center">Introduza</td>
      <td>Abrir as aplica&ccedil;&otilde;es/janelas</td>
    </tr>
    <tr>
      <td align="center">Esc</td>
      <td>Fechar aplica&ccedil;&otilde;es/janelas</td>
    </tr>
  </tbody>
</table>
</li>
</ul>




<p>A funcionalidade de acessibilidade est&aacute; agora operacional nas seguintes &aacute;reas do DSM:</p>

<ul>
<li>P&aacute;gina de in&iacute;cio de sess&atilde;o DSM, ambiente de trabalho e barra de tarefas</li>
<li><strong>Menu Principal</strong></li>
<li><strong>Painel de Controlo</strong></li>
<li><strong>File Station</strong></li>
</ul>


<div class="section">
<h4>Nota:</h4>
<p>Para detalhes acerca do funcionamento NVDA, consulte o respetivo <a href="http://www.nvaccess.org/files/nvda/documentation/userGuide.html" target="_blank">guia do utilizador</a>.</p>

</div>


<h3>Guias de atalhos de teclado DSM</h3>

<p>Juntamente com a funcionalidade de acessibilidade, DSM proporciona um vasto conjunto de atalhos de teclado para implementar uma gest&atilde;o eficiente e sem sobressaltos. Prima Shift + ? para localizar os atalhos:</p>

<ul>
<li><strong>Atalhos de teclado do ambiente de trabalho</strong>: Teclas de atalho para funcionamento com janelas e mais</li>
<li><strong>Atalhos de teclado componente</strong>: Teclas de atalho para controlar componentes da interface do utilizador (por ex., listas, bot&otilde;es e campos de pesquisa)</li>
</ul>

<p>Para suspender atalhos relativos ao ambiente de trabalho, cancele a op&ccedil;&atilde;o <strong>Ativar atalhos de teclado do ambiente de trabalho</strong>.</p>











</body>
</html>
