<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Backup de dados em meu PC/Mac usando o Cloud Station</title>
</head>
<body class="tutorial-content-box" >
<h1>Backup de dados em meu PC/Mac usando o Cloud Station</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/backup_from_PC/07_1_back_up_your_data_from_pc.png" />
<h2>Vis&atilde;o geral</h2>
<p>O Cloud Station Server n&atilde;o &eacute; apenas um sofisticado software de sincroniza&ccedil;&atilde;o entre plataformas. Os usu&aacute;rios podem us&aacute;-lo como um meio mais inteligente de fazer backup de seus computadores pessoais. Uma solu&ccedil;&atilde;o de backup em tempo real, o Cloud Station Backup &eacute; instant&acirc;neo e economiza largura de banda, oferecendo uma prote&ccedil;&atilde;o melhor com at&eacute; 32 vers&otilde;es hist&oacute;ricas de um &uacute;nico arquivo.</p>
<h3 class="list_head">Configura&ccedil;&atilde;o do Cloud Station Server no Synology NAS</h3>
<ol>
<li>V&aacute; para <b>Centro de pacotes</b>, encontre o <b>Cloud Station Server</b> e em seguida clique em&nbsp;<strong>Instalar</strong>.</li>
 
<li>Abra o <strong>Cloud Station Server</strong>.</li>
<li>V&aacute; para <strong>Vis&atilde;o geral</strong> e clique em <strong>Baixar agora</strong> em <strong>Cloud Station Backup</strong>. (Voc&ecirc; tamb&eacute;m pode baixar o Cloud Station Backup de <a href="https://www.synology.com/en-us/support/download" target="_blank">Centro de Download Synology</a>.)</li>
<img src="../../images/Backup/1x/backup_from_PC/download_backup.png" border="1" />
<li>Inicie o instalador em seu computador e siga as instru&ccedil;&otilde;es para instalar o Cloud Station Backup. </li>
<li>Ap&oacute;s a instala&ccedil;&atilde;o, execute o <strong>Cloud Station Backup</strong> em seu computador. Clique em <strong>Iniciar Agora</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/start_now.png" border="1" />
<li>Digite o endere&ccedil;o do Synology NAS executando o Cloud Station Server (ou QuickConnect ID), nome de usu&aacute;rio e senha. (Voc&ecirc; tamb&eacute;m pode clicar no &iacute;cone &agrave; direita e o Cloud Station Backup pesquisar&aacute; automaticamente outro Synology NAS dentro de sua LAN). Clique em <strong>Avan&ccedil;ar</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/enter_credentials.png" border="1" />
<li>Selecione sua origem de backup e desmarque qualquer subpasta que n&atilde;o deseje sincronizar. </li>
<img src="../../images/Backup/1x/backup_from_PC/backup_settings_source.png" border="1" />
<li>Selecione uma pasta em seu Synology NAS clicando em <strong>Selecionar</strong>. O Cloud Station Backup criar&aacute; uma pasta de backup em seu destino selecionado com o nome do seu computador.</li>
<img src="../../images/Backup/1x/backup_from_PC/backup_destination.png" border="1" />
<li>Clique em <strong>Regras de backup</strong> se desejar definir filtros ou regras de sincroniza&ccedil;&atilde;o.</li>

<li>Clique em <strong>Avan&ccedil;ar</strong> para analisar suas configura&ccedil;&otilde;es de backup, em seguida clique em <strong>Conclu&iacute;do</strong>.</li>
<img src="../../images/Backup/1x/backup_from_PC/summary.png" border="1" />
<li>Voc&ecirc; pode visualizar o andamento do seu backup no aplicativo principal.</li>
<img src="../../images/Backup/1x/backup_from_PC/progress.png" border="1" />
</ol>
<h3 class="list_head">Baixar ou restaurar uma vers&atilde;o anterior de um arquivo sincronizado no Cloud Station Server</h3>
<ol>
  <li>V&aacute; para <strong>Cloud Station Server </strong>&gt; <strong>Hist&oacute;rico de vers&otilde;es</strong> e localize o arquivo ou a pasta que deseja restaurar.</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/version_history.png" />
  <li>Selecione o arquivo que deseja recuperar e clique em <strong>A&ccedil;&atilde;o</strong>. Clique em <strong>Procurar vers&otilde;es anteriores</strong>. Se um arquivo for exclu&iacute;do ou removido acidentalmente de seu computador, voc&ecirc; pode clicar em <strong>Restaurar</strong> para restaur&aacute;-lo. </li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions_server.png" />
<li>Selecione a vers&atilde;o do arquivo que deseja baixar e clique em <strong>Download</strong>. Ou, se voc&ecirc; tem certeza de que quer a vers&atilde;o selecionada restaurada, clique em <strong>Restaurar</strong> e ela substituir&aacute; a vers&atilde;o atual.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/previous_versions.png" />
</ol>
  <h3 class="list_head">5. Maior prote&ccedil;&atilde;o para seus dados</h3>
  
<p>Para saber mais maneiras de proteger e fazer backup de seus dados, clique <a href="https://www.synology.com/knowledgebase/tutorials#BackupRestore" target="_blank">aqui</a> para ver tutoriais detalhando outros servi&ccedil;os de backup dispon&iacute;veis no DSM.</p>
</div>
<div class="page-info">
  <ul>
    <li>A seguir nesse t&oacute;pico: <a href="backup_backup.html">Fa&ccedil;a backup dos dados de seu Synology NAS</a> </li>
  </ul>
</div>
</body>
</html>
