<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Acesse seu Synology NAS pela Internet e compartilhe arquivos</title>
</head>

<body class="tutorial-content-box" >

<h1> Acesse seu Synology NAS pela Internet e compartilhe arquivos</h1>
<p><img src="../../images/BuildCloud/1x/quickconnect/01.jpg"/></p>

<h2>Vis&atilde;o geral</h2>
<p>Com o QuickConnect voc&ecirc; pode facilmente se conectar ao seu Synology NAS pela Internet sem precisar criar regras de encaminhamento de portas ou outras configura&ccedil;&otilde;es de rede complicadas. O QuickConnect permite que voc&ecirc; se conecte por um endere&ccedil;o personaliz&aacute;vel ​​simples, como <b>Quickconnect.to/exemplo</b>. </p>
<h3 class="list_head">1. Configure o QuickConnect </h3>
<ol>
	<li>V&aacute; para <b>Painel de controle</b> &gt; <b>QuickConnect</b>.</li>
	<li>Marque a caixa <b>Habilitar QuickConnect</b>.</li><img src="../../images/BuildCloud/1x/quickconnect/01.png" alt="" width="680" height="258"/>
	<li>Se voc&ecirc; n&atilde;o tiver uma conta Synology, clique em <b>Faça login ou cadastre-se para ter uma conta Synology</b>. Insira as informa&ccedil;&otilde;es necess&aacute;rias e clique em <b>OK</b>. Se voc&ecirc; j&aacute; tiver uma conta Synology, digite as informa&ccedil;&otilde;es de sua conta. </li><img src="../../images/BuildCloud/1x/quickconnect/02.png" alt="" width="680" height="388" />
	<li>Crie o seu pr&oacute;prio QuickConnect ID no campo <b>QuickConnect ID</b>. Em seguida, clique em <b>Aplicar</b>.</li><img src="../../images/BuildCloud/1x/quickconnect/03.png" alt="" width="680" height="388" />
	<li>As informa&ccedil;&otilde;es de seu link QuickConnect ser&atilde;o exibidas. Use esses links para acessar o Synology NAS. Nesse exemplo, o endere&ccedil;o do DSM &eacute; <b>http://Quickconnect.to/YourID</b>.
  </li><img src="../../images/BuildCloud/1x/quickconnect/04.png" alt="" width="680" height="388" />
	<li>Se voc&ecirc; n&atilde;o vir o link do DSM QuickConnect, clique em <b>Avan&ccedil;ado</b> e verifique se o DSM est&aacute; habilitado.
  </li><img src="../../images/BuildCloud/1x/quickconnect/05.png" alt="" width="680" height="388" />
	<li>Agora voc&ecirc; pode usar o link do DSM QuickConnect para acessar seu Synology NAS!</li><img src="../../images/BuildCloud/1x/quickconnect/02.jpg" alt="" width="680" height="458" />
</ol>
<h3 class="list_head">2. Compartilhe arquivos em seus NAS usando o QuickConnect</h3>
<p>Com o QuickConnect habilitado, voc&ecirc; pode facilmente compartilhar arquivos armazenados em seu Synology NAS com qualquer pessoa, sem se preocupar com o encaminhamento de portas.</p>
<ol>
	<li>Primeiro ative a conex&atilde;o HTTPS para compartilhar seus arquivos com seguran&ccedil;a. V&aacute; para <b>Painel de controle &gt; Rede. </b></li>
	<li>Marque a caixa <b>Habilitar conex&atilde;o HTTPS</b> e clique em <b>Aplicar</b>.
	</li><img src="../../images/BuildCloud/1x/quickconnect/06.png" alt="" width="680" height="348" />
	<li>Em seguida, habilite o compartilhamento de arquivos para o QuickConnect. V&aacute; para <b>Painel de controle &gt; QuickConnect</b>.</li>
	<li>Clique em <b>Avan&ccedil;ado</b> e verifique se a caixa de <b>compartilhamento de arquivos</b> est&aacute; marcada.
	</li><img src="../../images/BuildCloud/1x/quickconnect/07.png" alt="" width="680" height="305" />
    <div class="section"> <h4>Nota:</h4> <p>Ao configurar as configura&ccedil;&otilde;es avan&ccedil;adas do QuickConnect, recomendamos que voc&ecirc; fa&ccedil;a login no DSM com o endere&ccedil;o IP local ou nome de dom&iacute;nio do Synology NAS.</p> </div>
  <li>Voc&ecirc; est&aacute; pronto para come&ccedil;ar a compartilhar arquivos usando o QuickConnect. Abra o <b>File Station</b> e clique com o bot&atilde;o direito do mouse no arquivo ou pasta que voc&ecirc; deseja compartilhar. Em seguida, clique em <b>Compartilhar links do arquivo</b> no menu de contexto.</li>
  <img src="../../images/BuildCloud/1x/quickconnect/08.png" alt="" width="680" height="326" />
	<li>Um link de compartilhamento de arquivos ser&aacute; gerado. Basta compartilhar esse link com a fam&iacute;lia e amigos para fazer o download do arquivo/pasta compartilhada.
  </li><img src="../../images/BuildCloud/1x/quickconnect/09.png" alt="" width="680" height="241" />
</ol>
<div class="section">
  <ul>
    <li>Anteriormente nesse t&oacute;pico: <a href="cloud_sync_files.html">Sincroniza&ccedil;&atilde;o de arquivos com o Cloud Station</a> </li>
  </ul>
</div>
</body>

</html>
