<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Guia de introdu&ccedil;&atilde;o ao Audio Station</title>
</head>
<body class="tutorial-content-box" >
<h1>Sincronize arquivos entre o Synology NAS e o computador usando o Cloud Station</h1>
<div class="tutorials_content">
<img src="../../images/BuildCloud/1x/cloud_sync_files/02_1_build_your_private_cloud_CloudStation.png"/>
<h2>Vis&atilde;o geral</h2>
<p>O Cloud Station para Synology NAS &eacute; um aplicativo de sincroniza&ccedil;&atilde;o de arquivos que permite que voc&ecirc; sincronize facilmente os arquivos em seu Synology NAS com outros dispositivos, tais como computadores ou dispositivos m&oacute;veis (com o DS cloud). Instale o <strong>Cloud Station Server</strong> em seu Synology NAS e o <strong>Cloud Station Drive</strong> em seu computador para sincronizar automaticamente os arquivos armazenados em seu computador com seu Synology NAS.</p>
<h3 class="list_head">Configure a conex&atilde;o entre o Synology NAS e o computador</h3>
<ol>
<li>V&aacute; para <b>Centro de pacotes</b>, encontre o <b>Cloud Station Server</b> e em seguida clique em&nbsp;<strong>Instalar</strong>.</li>
 
  <li>Abra o <strong>Cloud Station Server</strong>.</li>
  <li>Na guia <strong>Vis&atilde;o geral</strong>, clique no bot&atilde;o sob <strong>Cloud Station Drive</strong> para baixar o <strong>Cloud Station Drive </strong>para o seu sistema operacional. (Voc&ecirc; tamb&eacute;m pode baixar o Cloud Station de <a href="https://www.synology.com/en-us/support/download" target="_blank">Centro de Download Synology</a>.)</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/download_drive.png" />
<li>Abra o instalador de seu computador e siga as instru&ccedil;&otilde;es na tela.</li>
<li>Ap&oacute;s a instala&ccedil;&atilde;o, execute o <strong>Cloud Station</strong> em seu computador. Clique em <strong>Iniciar Agora</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/start_now.png" />
<li>Digite o endere&ccedil;o do Synology NAS executando o Cloud Station (ou QuickConnect ID), nome de usu&aacute;rio e senha. Voc&ecirc; pode clicar no &iacute;cone de pesquisa &agrave; direita para pesquisar os IPs dentro de sua LAN. Clique em <strong>Avan&ccedil;ar</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/enter_credentials.png" />
<li>Selecione as pasta que deseja sincronizar em seu Synology NAS e no seu computador clicando no &iacute;cone <strong>Editar</strong>. Voc&ecirc; pode ent&atilde;o clicar em <strong>Avan&ccedil;ado</strong> para ajustar as configura&ccedil;&otilde;es de sincroniza&ccedil;&atilde;o</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/select_folders.png" />
<li>Desmarque qualquer pasta que n&atilde;o deseje sincronizar.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/selective_sync_folder.png" />
<li>Defina o tamanho m&aacute;ximo do arquivo ou nomes de arquivo da lista negra ou tipos de arquivos para que n&atilde;o sejam sincronizados.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/selective_sync_files.png" />
<li>Selecione se deseja sincronizar bidirecionalmente ou apenas baixar os dados de seu Synology NAS.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/sync_direction.png" />
<li>Clique em <strong>Conclu&iacute;do</strong> para completar a configura&ccedil;&atilde;o.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/done.png" />
<li>Voc&ecirc; pode encontrar o &iacute;cone do Cloud Station na bandeja do seus sistema. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/system_tray.png" />
<li>Clique no &iacute;cone da bandeja do sistema para abrir o menu da bandeja. Aqui voc&ecirc; pode visualizar o andamento e o status de seus arquivos. Aqui voc&ecirc; pode visualizar o andamento e o status de seus arquivos. Clique em <strong>Aplicativo principal</strong> para abrir o Cloud Station. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/15.png" />
<li>Na abertura, o sistema mostrar&aacute; algumas dicas sobre como usar o Cloud Station. Clique na seta para a direita para ver mais dicas ou clique em <strong>Tutoriais on-line</strong> para obter mais informa&ccedil;&otilde;es. Se n&atilde;o precisar de dicas, marque a caixa ao lado de <strong>N&atilde;o mostrar isso novamente</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/tutorial.png" />
<li>Agora voc&ecirc; pode gerenciar suas tarefas de sincroniza&ccedil;&atilde;o no <strong>Cloud Station Drive</strong>. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/main_app_manage.png" />
</ol>
<h3 class="list_head">Baixe uma vers&atilde;o anterior de um arquivo sincronizado</h3>
<ol>
<li>Clique no &iacute;cone <strong>Cloud Station Drive</strong> na bandeja do seu sistema e no &iacute;cone da pasta.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/main_app_menu.png" />
<li>Clique com o bot&atilde;o direito no arquivo selecionado e escolha <strong>Synology Cloud Station</strong> &gt; <strong>Procurar vers&otilde;es anteriores</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions.png" />
<li>Localize a vers&atilde;o que deseja baixar e clique no &iacute;cone de download.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/save_previous_versions.png" />
</ol>
<h3 class="list_head">Baixar ou restaurar uma vers&atilde;o anterior de um arquivo sincronizado no Cloud Station Server</h3>
<ol>
  <li>V&aacute; para <strong>Cloud Station Server </strong>&gt; <strong>Hist&oacute;rico de vers&otilde;es</strong> e localize o arquivo ou a pasta que deseja restaurar.</li>
  <img src="../../images/BuildCloud/1x/cloud_sync_files/version_history.png" />
  <li>Selecione o arquivo que deseja recuperar e clique em <strong>A&ccedil;&atilde;o</strong> &gt; <strong>Procurar vers&otilde;es anteriores</strong>.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/browse_previous versions_server.png" />
<li>Selecione a vers&atilde;o do arquivo que deseja baixar e clique em <strong>Download</strong>. Ou, se voc&ecirc; tem certeza de que quer a vers&atilde;o selecionada restaurada, clique em <strong>Restaurar</strong> e ela substituir&aacute; a vers&atilde;o atual.</li>
    <img src="../../images/BuildCloud/1x/cloud_sync_files/previous_versions.png" />
</ol>
<h3 class="list_head">Observa&ccedil;&otilde;es importantes</h3>  
  <ol>
<li>Sempre mantenha vers&otilde;es hist&oacute;ricas no caso de um arquivo ser removido ou substitu&iacute;do por acidente.</li>
<li>Em <strong>Configura&ccedil;&otilde;es globais</strong>, voc&ecirc; pode configurar se um arquivo ser&aacute; buscado novamente em seu NAS ou exclu&iacute;do em seu NAS quando voc&ecirc; excluir um arquivo do computador.</li>
</ol>
<h3 class="list_head">Sincroniza&ccedil;&atilde;o de dados com seus dispositivos m&oacute;veis</h3>
<p>O DS cloud est&aacute; dispon&iacute;vel gr&aacute;tis na <a href="https://itunes.apple.com/us/app/ds-cloud/id590216612?mt=8" target="_blank">Apple App Store</a> e <a href="https://play.google.com/store/apps/details?id=com.synology.dscloud" target="_blank">Google Play Store</a>. Tamb&eacute;m &eacute; poss&iacute;vel escanear o c&oacute;digo QR abaixo para baixar diretamente.</p>
<img src="../../images/BuildCloud/1x/cloud_sync_files/QR_code.png" />
</div>
<div class="page-info">
  <ul>
    <li>A seguir nesse t&oacute;pico: <a href="cloud_set_up_quickconnect.html">Acesse seu Synology NAS pela Internet e compartilhe arquivos</a> </li>
  </ul>
</div>
</body>
</html>
