<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Armazenamento de arquivos no Synology NAS de um PC Windows na rede local</title>
</head>

<body class="tutorial-content-box" >

<h1>Aproveite as m&uacute;sicas armazenadas em seu Synology NAS com o Audio Station</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_music/03_3_set_up_your_home_theater_AudeoStation.png" />
<h2>Vis&atilde;o geral</h2>
<p>Com o Audio Station voc&ecirc; pode organizar, pesquisar e reproduzir as m&uacute;sicas armazenadas em seu Synology NAS atrav&eacute;s da Internet. O Audio Station tamb&eacute;m suporta uma grande sele&ccedil;&atilde;o de tipos de arquivos para que voc&ecirc; possa aproveitar suas m&uacute;sicas em qualquer formato e da maneira que quiser. Voc&ecirc; tamb&eacute;m pode baixar o DS Audio, um aplicativo m&oacute;vel que complementa o Audio Station e que permite que voc&ecirc; acesse as m&uacute;sicas do Synology NAS quando estiver em tr&acirc;nsito. 
</p>
<h3 class="list_head">1. Instala&ccedil;&atilde;o do Audio&nbsp;Station</h3>
<ol>
<li>V&aacute; para <b>Centro de pacotes</b> e encontre o <b>Audio Station</b>. Clique em <b>Instalar</b>.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/01.png" />
</ol>

<h3 class="list_head">2. Armazene arquivos de &aacute;udio na pasta music</h3>
<ol>
<li>V&aacute; para <b>File Station</b> &gt; <b>music</b> e clique em <b>Carregar</b>.</li> <img src="../../images/HomeTheater/1x/home_theater_music/03.png" />
<li>Selecione os arquivos que deseja carregar em sua pasta <b>music</b> de seu computador local.</li>
</ol>

<h3 class="list_head">3. Procurar m&uacute;sica</h3>
<p>Depois de carregar os arquivos de m&uacute;sica, voc&ecirc; pode reproduzir e navegar pelas suas m&uacute;sicas no Audio Station. Se quiser habilitar o acesso e navegar em seus arquivos de m&uacute;sica quando voc&ecirc; n&atilde;o estiver em sua rede local, recomendamos a habilita&ccedil;&atilde;o do QuickConnect  em <b>Painel de controle</b> &gt; <b>QuickConnect</b>. Se voc&ecirc; n&atilde;o tiver uma conta Synology, poder&aacute; abrir uma em minutos e dar ao seu DiskStation um <b>QuickConnect ID</b>. Com essa op&ccedil;&atilde;o habilitada, voc&ecirc; poder&aacute; entrar no DSM e acessar suas m&uacute;sicas de qualquer lugar. Voc&ecirc; tamb&eacute;m pode usar seu <b>QuickConnect ID</b> para entrar no DS audio para n&atilde;o ter o aborrecimento de precisar memorizar seu endere&ccedil;o IP. </p>
<h4>3.1 Biblioteca</h4>
<p> A biblioteca cont&eacute;m m&uacute;sicas na pasta compartilhada <b>music</b> ou qualquer outra pasta indexada de seu Synology NAS. Na guia <b>Biblioteca</b>, suas m&uacute;sicas s&atilde;o classificadas em categorias para lhe oferecer op&ccedil;&otilde;es diferentes e para que voc&ecirc; possa navegar facilmente em suas m&uacute;sicas de acordo com suas necessidades e prefer&ecirc;ncias. Al&eacute;m disso, ela permite que voc&ecirc; encontre facilmente qualquer m&uacute;sica que esteja procurando. &Eacute; poss&iacute;vel clicar em cada categoria para realizar sua pesquisa ou selecionar a categoria em que voc&ecirc; deseja pesquisar do menu suspenso na barra de pesquisa. </p>

  <img src="../../images/HomeTheater/1x/home_theater_music/08.png" width="640" height="392" />
</ul>
<div class="code_div"><b>Nota:</b> Para adicionar uma pasta como pasta indexada, entre no DSM como admin (ou um usu&aacute;rios que perten&ccedil;a ao grupo administrators), e v&aacute; para <b>Painel de controle</b> &gt; <b>Biblioteca de m&iacute;dia</b> &gt; <b>Pasta indexada</b>. </div>
<h4>3.2. Modos de exibi&ccedil;&atilde;o</h4>
<p>Os &iacute;cones no canto superior direito do Audio Station permitem que voc&ecirc; alterne entre diferentes modos de exibi&ccedil;&atilde;o nos quais &eacute; poss&iacute;vel navegar em sua biblioteca de m&uacute;sicas.</p>
<ul>
<li><b>A exibi&ccedil;&atilde;o de lista</b> permite a exibi&ccedil;&atilde;o de suas m&uacute;sicas como uma lista, exibindo o nome da m&uacute;sica, o artista, o &aacute;lbum, a dura&ccedil;&atilde;o da m&uacute;sica, o n&uacute;mero da faixa e a classifica&ccedil;&atilde;o.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/05.png" width="640" height="392" />
<li><b>Arte</b> exibe o nome da faixa, o nome do &aacute;lbum e a arte do &aacute;lbum.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/06.png" width="640" height="392" />
<li><b>Fila de reprodu&ccedil;&atilde;o</b> exibe a fila de reprodu&ccedil;&atilde;o em tela cheia com as capas dos &aacute;lbuns e os t&iacute;tulos ou letras das m&uacute;sicas.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/07.png" width="640" height="392" />
</ul>
<h3 class="list_head">4. Compartilhamento p&uacute;blico</h3>
<p>A fun&ccedil;&atilde;o de compartilhamento p&uacute;blico do Audio Station permite que voc&ecirc; compartilhe m&uacute;sicas com o p&uacute;blico fornecendo a voc&ecirc; um link que voc&ecirc; pode enviar para as pessoas que n&atilde;o est&atilde;o em sua rede ou que n&atilde;o t&ecirc;m um Synology NAS. Quando elas tiverem o link, poder&atilde;o ouvir as m&uacute;sicas. </p>
<h4>4.1. Compartilhamento de m&uacute;sicas com o p&uacute;blico</h4>
<ol>
<li>Clique com o bot&atilde;o direito na m&uacute;sica que deseja compartilhar e selecione <b>Compartilhar com o p&uacute;blico</b>.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/09.png" width="640" height="392" />
<li>Existem duas op&ccedil;&otilde;es quando voc&ecirc; estiver compartilhando m&uacute;sicas com o p&uacute;blico: <ul>
  <li>Se voc&ecirc; selecionar uma &uacute;nica m&uacute;sica para compartilhar, na caixa de di&aacute;logo que aparece, marque a caixa ao lado de <b>Compartilhar com o p&uacute;blico</b> para habilitar o link de compartilhamento.</li> 
  <img src="../../images/HomeTheater/1x/home_theater_music/10.png" width="561" height="190" />
<li>Se voc&ecirc; selecionar v&aacute;rias m&uacute;sicas para compartilhar, ser&aacute; criada uma lista de reprodu&ccedil;&atilde;o. Voc&ecirc; pode nomear sua lista de reprodu&ccedil;&atilde;o assim como ter a op&ccedil;&atilde;o de especificar um per&iacute;odo de validade para o link marcando a caixa ao lado de <b>Personalizar per&iacute;odo de validade</b> e clicando em OK.</li>
  <img src="../../images/HomeTheater/1x/home_theater_music/11.png" width="560" height="320" /></ul>
<li>Copie o link e envie-o para a pessoa com a qual voc&ecirc; deseja compartilhar a lista de reprodu&ccedil;&atilde;o ou clique em <b>Ir para o link</b> para acessar o link diretamente. </li>
</ol>
<div class="code_div"><b>Nota:</b> Voc&ecirc; pode encontrar listas de reprodu&ccedil;&atilde;o compartilhadas que voc&ecirc; criou acessando a guia <b>Lista de reprodu&ccedil;&atilde;o</b>. As m&uacute;sicas compartilhadas individualmente ser&atilde;o adicionadas a uma lista de reprodu&ccedil;&atilde;o padr&atilde;o chamada <b>M&uacute;sicas compartilhadas</b> que tamb&eacute;m pode ser encontrada l&aacute;.
  </div>

<h3 class="list_head">5. Organize e reproduza m&uacute;sicas em seus dispositivos m&oacute;veis</h3>
<p>O DS audio funciona no iPad/iPhone/iPod touch, dispositivos Android e Windows Phones. O aplicativo est&aacute; dispon&iacute;vel gr&aacute;tis na <a href="http://itunes.apple.com/us/app/ds-audio/id321495303?mt=8" target="_blank">Apple App Store</a>,&nbsp;<a href="https://play.google.com/store/apps/details?id=com.synology.DSaudio&amp;hl=en" target="_blank">Google Play</a> e &nbsp;<a href="http://www.windowsphone.com/en-US/apps/30d353e3-9ca6-458a-a88e-c972fc3e04d6" target="_blank">Windows Phone Store</a>. Tamb&eacute;m &eacute; poss&iacute;vel escanear o c&oacute;digo QR abaixo para baixar instantaneamente.</p>
<img src="../../images/HomeTheater/1x/home_theater_music/12.png" width="758" height="217" /></div>
<div class="section">
  <ul>
    <li>Anteriormente nesse t&oacute;pico: <a href="home_theater_videos.html">Organize e reproduza v&iacute;deos com o Video Station</a> </li>
  </ul>
</div>
</body>

</html>
