<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Cache SSD*</h2>
<p>A cache SSD pode melhorar o desempenho de acesso aleat&oacute;rio, armazenando dados acedidos frequentemente na cache SSD. A cache SSD pode ser montada num volume ou iSCSI LUN (N&iacute;vel de Bloco). Existem dois tipos de cache SSD:</p>
<ul>
<li><strong>Cache apenas de leitura</strong> pode consistir de 1 a 12 SSDs que podem ser respectivamente montados numa configura&ccedil;&atilde;o b&aacute;sica ou RAID 0, para melhorar a velocidade de leitura aleat&oacute;ria do espa&ccedil;o de armazenamento no qual est&aacute; montado.
<div class="section"><h4>Nota:</h4>
	<p>A cache SSD apenas de leitura armazena c&oacute;pias de dados do volume; deste modo n&atilde;o ocorre qualquer perda de dados, mesmo que encrave a cache apenas de leitura.</p>
	</div>
</li>
<li>A <strong>Cache de leitura e escrita</strong> pode ser instalada numa configura&ccedil;&atilde;o RAID 1 / RAID 5 / RAID 6, dependendo do n&uacute;mero de SSDs (at&eacute; 12 SSDs), para melhorar o desempenho de leitura e escrita aleat&oacute;ria do espa&ccedil;o de armazenamento onde est&aacute; instalada.</li>
</ul>

<p>Ambos os tipos de cache SSD implementam um algoritmo LRU (Least Recently Used, menos utilizado recentemente) para trocar os dados na cache.</p>

<div class="section">
<h4>Importante:</h4>
<p>Antes de instalar qualquer SSD para utiliza&ccedil;&atilde;o como cache, verifique as seguintes notas:</p>
<ul>
<li>O objectivo da activa&ccedil;&atilde;o da cache SSD &eacute; de aumentar o desempenho do acesso aleat&oacute;rio a uma pequena por&ccedil;&atilde;o de dados acedida com frequ&ecirc;ncia no espa&ccedil;o de armazenamento. Por exemplo, grandes opera&ccedil;&otilde;es de leitura ou escrita sequencial (por ex., transmiss&atilde;o v&iacute;deo em HD) e padr&otilde;es de leitura de dados completamente aleat&oacute;rios carecem de padr&otilde;es de leitura repetida, e por isso n&atilde;o beneficiam grandemente de cache SSD. Para aplica&ccedil;&otilde;es gerais, recomendamos que active a op&ccedil;&atilde;o <b>Ignorar I/O sequencial</b>, para que I/O sequencial ainda possa chegar &agrave;s uniaddes do espa&ccedil;o de armazenamento.</li>
<li>Consulte a lista de compatibilidade no <a href="http://www.synology.com/" target=_blank>site da Synology</a> para escolher o SSD a ser utilizado como cache no seu DiskStation.</li>
<li class="disable-alpine">A cache SSD requer um certo montante de mem&oacute;ria de sistema dependendo do tamanho da cache, pelo que a montagem de uma cache SSD maior poder&aacute; necessitar da atualiza&ccedil;&atilde;o da mem&oacute;ria de DiskStation. Para manter o sistema est&aacute;vel e r&aacute;pido, s&oacute; &eacute; poss&iacute;vel utilizar 1/4 da mem&oacute;ria do sistema pr&eacute;-instalado para a cache SSD. Cada 1 GB da cache do SSD requer, aproximadamente, 416 KB de mem&oacute;ria do sistema (a mem&oacute;ria expandida pode ser contada).** Por isso, se a configura&ccedil;&atilde;o da cache s&oacute; de leitura for de 2 x 128 GB SSD, o tamanho total da cache ser&aacute; de 256 GB e requer, pelo menos, 104 MB de mem&oacute;ria e se a configura&ccedil;&atilde;o da cache s&oacute; de leitura for de 2 x 128 GB SSD, o tamanho total da cache ser&aacute; de 128 GB e requer, pelo menos, 52 MB de mem&oacute;ria. Se a mem&oacute;ria for insuficiente, a cria&ccedil;&atilde;o da cache SSD ser&aacute; restrita ou o tamanho da cache SSD ser&aacute; limitado.</li>
<li class="enable-alpine">Cada 1 GB da cache do SSD requer, aproximadamente, 416 KB de mem&oacute;ria do sistema (a mem&oacute;ria expandida pode ser calculada) e o tamanho m&aacute;ximo da cache &eacute; 930 GB. Por isso, se a configura&ccedil;&atilde;o da cache s&oacute; de leitura for de 2 x 128 GB SSD, o tamanho total da cache ser&aacute; de 256 GB e requer, pelo menos, 104 MB de mem&oacute;ria e se a configura&ccedil;&atilde;o da cache s&oacute; de leitura for de 2 x 128 GB SSD, o tamanho total da cache ser&aacute; de 128 GB e requer, pelo menos, 52 MB de mem&oacute;ria. Se a mem&oacute;ria for insuficiente, a cria&ccedil;&atilde;o da cache SSD ser&aacute; restrita ou o tamanho da cache SSD ser&aacute; limitado.</li>
<li>Consulte as especifica&ccedil;&otilde;es do produto dos seus modelos no <a href="http://www.synology.com/" target=_blank>site da Synology</a> para obter informa&ccedil;&otilde;es sobre o tamanho m&aacute;ximo da cache SSD permitido no seu DiskStation.</li>
<li>Quando uma cache SSD de leitura-escrita fica degradada, a funcionalidade de cache ser&aacute; desactivada, e o sistema come&ccedil;a a escrever (ou seja, a sincronizar) dados em cache do SSD para os HDD. Depois de conclu&iacute;da a sincroniza&ccedil;&atilde;o de dados, n&atilde;o ocorrer&aacute; qualquer perda de dados mesmo que tenha avariado a cache de leitura-escrita.</li>
<li>A cache de leitura-escrita n&atilde;o pode ser utilizada juntamente com o Time Backup. Por exemplo, quando cria uma cache SSD de leitura-escrita, n&atilde;o ser&aacute; poss&iacute;vel executar o Time Backup. De igual modo, se estiver a executar o Time Backup, n&atilde;o ser&aacute; poss&iacute;vel criar uma cache SSD de leitura-escrita.</li>
</ul>
</div>

<h4>Para montar a cache SSD:</h4>
<ol>
  <li>Instale os SSDs no DiskStation. Primeiro, consulte as notas acima.</li>
  <li>Aceda a <strong>Gestor de Armazenamento</strong> &gt; <strong>Cache SSD</strong>. Clique em <b>Criar</b>.</li>
<li>Selecione o modo de cache (apenas dispon&iacute;vel para modelos que suportem cache de leitura e escrita).</li>
<li>Encontre o menu pendente e selecione o volume ou iSCSI LUN (N&iacute;vel de Bloqueio) no qual pretende montar a cache SSD.</li>
<li>Escolha os SSD a partir da lista. Os dados nos SSD ser&atilde;o eliminados, por isso, certifique-se de que n&atilde;o ser&atilde;o eliminados dados importantes.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>

<h4>Para parar a coloca&ccedil;&atilde;o em cache sequencial I/O: </h4>
<p>Se o seu volume alvo ou iSCSI LUN (N&iacute;vel de Bloco) tiver um excelente desempenho sequencial I/O, pode fazer com que a cache SSD pare a coloca&ccedil;&atilde;o em cache sequencial I/O e que aceda aos dados diretamente das suas unidades, para maior velocidade e melhor desempenho. </p>
<ol>
<li>Clique em <strong>Configurar</strong> para abrir a janela de defini&ccedil;&otilde;es.</li>
<li>Marque a op&ccedil;&atilde;o <strong>Ignorar sequencial I/O</strong>. </li>
</ol>


<h4>Para remover a cache SSD:</h4>
<ol>
<li>Clique <b>Remover</b> para remover permanentemente a cache SSD do DiskStation.</li>
<li>Para cache de leitura/escrita, a remo&ccedil;&atilde;o deve ser efetuada atrav&eacute;s deste procedimento (ainda que o seu DiskStation esteja desligado), dado que, caso contr&aacute;rio, pode ocorrer uma avaria do volume porque dados parciais se encontram apenas na cache.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Quando montar ou remover a cache SSD, o sistema interrompe todos os servi&ccedil;os associados (por exemplo, pastas partilhadas, pacotes instalados, liga&ccedil;&otilde;es atuais, etc.)</li>
<li>Se uma cache de leitura e escrita num espa&ccedil;o de armazenamento n&atilde;o for detetada durante o arranque, o sistema n&atilde;o ir&aacute; montar o espa&ccedil;o de armazenamento. Encontre e reinstale os SSD no DiskStation e reinicie para montar o espa&ccedil;o de armazenamento. Se n&atilde;o conseguir encontrar os SSD, pode ser necess&aacute;rio for&ccedil;ar a montagem do espa&ccedil;o de armazenamento. Consulte <a href="space.html">Volume</a> ou <a href="iscsilun.html">iSCSI LUN</a>.</li>
</ul>
</div>

<h4>Para reparar a cache SSD:</h4>
<ul>
<li><strong>Para cache de leitura e escrita:</strong> Se um dos SSD tiver avariado, siga os passos abaixo para repar&aacute;-lo.
  <ol>
<li>Substitua o SSD com falhas por um novo. (O novo SSD deve ser do mesmo modelo e tamanho do antigo).</li>
<li>Clique no bot&atilde;o <b>Reparar</b>.</li>
<li>Selecione o SSD a partir da lista.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>
</li>
<li><strong>Para cache s&oacute; de leitura:</strong> Se um dos SSD tiver avariado, remova a cache e substitua o SSD com problemas. De seguida, clique em <strong>Criar</strong> para criar uma nova configura&ccedil;&atilde;o da cache.</li>
</ul>


<h3>Aconselhamento da Cache SSD</h3>
<p>Esta fun&ccedil;&atilde;o permite calcular e visualizar o tamanho total e o n&uacute;mero de ficheiros acedidos recentemente num volume espec&iacute;fico. Se ainda n&atilde;o tiver criado quaisquer caches SSD no volume selecionado, esta informa&ccedil;&atilde;o pode ser referenciada ao avaliar o montante de cache SSD adequado para o seu sistema. Se j&aacute; tiver criado anteriormente uma cache SSD no volume selecionado, a an&aacute;lise e utiliza&ccedil;&atilde;o da cache tamb&eacute;m ser&aacute; mostrada aqui.</p>

<h4>Para utilizar o Consultor da Cache SSD</h4>

<ol>
<li>Clique em <b>Consultor da Cache SSD</b> para abrir o assistente.</li>
<li>Selecione um volume para calcular e depois clique em <b>Seguinte</b>.</li>
<li>O assistente come&ccedil;a automaticamente a totalizar o tamanho e n&uacute;mero de ficheiros acedidos recentemente no volume selecionado. A dura&ccedil;&atilde;o do c&aacute;lculo varia em fun&ccedil;&atilde;o do seu ambiente individual.</li>
</ol>
<p>_____<br> *A cache SSD apenas est&aacute; dispon&iacute;vel em alguns modelos.<br> <span class="disable-alpine" style="display: inline;">** Isto n&atilde;o se aplica a caches SSD de leitura-escrita criadas na DSM vers&atilde;o 5.1 ou anteriores. Ou seja, cada 1 GB de cache SSD criado antes de DSM 5.2 ainda requer 4 MB de mem&oacute;ria de sistema, mesmo quando usado no ambiente DSM 5.2.</span>
  </p>
</body>
</html>
