<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Hot Spare</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hot Spare*</h2>
<p>Discos hot spare s&atilde;o discos r&iacute;gidos de espera que podem reparar volume/grupo de disco/iSCSI LUN degradado substituindo automaticamente um disco com falhas. Discos hot spare podem ser globalmente atribu&iacute;dos para proteger qualquer volume/Grupo de Disco/iSCSI LUN dentro da sua DiskStation, desde que o volume/Grupo de Disco/iSCSI LUN corresponda aos seguintes crit&eacute;rios:</p>
<ul>
<li>O tipo RAID do volume/grupo de disco/iSCSI LUN deve ter protec&ccedil;&atilde;o de dados (por exemplo, RAID 1, RAID 5, RAID 6, RAID 10).</li>
<li>O tamanho do disco hot spare deve ser igual ou maior que o tamanho do disco mais pequeno volume/Grupo de Disco/iSCSI LUN.</li>
</ul>

<h4>Para configurar discos hot spare:</h4>
<ol>
<li>Clique em <b>Gerir</b>.</li>
<li>Aparece uma janela com o estado hot spare de cada volume/Grupo de Disco/iSCSI LUN, bem como os discos dispon&iacute;veis. O estado de volume/Grupo de disco/iSCSI LUN inclui o seguinte:</li>
<ul>
<li><strong>Atribu&iacute;do:</strong> O volume/Grupo de Disco/iSCSI LUN est&aacute; protegido por pelo menos um disco hot spare atribu&iacute;do.</li>
<li><strong>Dispon&iacute;vel:</strong> H&aacute; discos dispon&iacute;veis que podem proteger o volume/Grupo de Disco/iSCSI LUN, mas n&atilde;o foi ainda atribu&iacute;do um hot spare.</li>
<li><strong>N&atilde;o dispon&iacute;vel:</strong> N&atilde;o h&aacute; discos hot spare dispon&iacute;veis que possam proteger o volume/Grupo de Disco/iSCSI LUN.</li>
</ul>
<li>As sec&ccedil;&otilde;es <strong>Discos Dispon&iacute;veis</strong> mostram os discos r&iacute;gidos que podem ser configurados como discos hot spare. Para atribuir um disco hot spare, assinale a caixa de verifica&ccedil;&atilde;o junto do disco que deseja configurar como hot spare.</li>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>
<div class="section">
<h4>Nota:</h4> 
<ul>
<li>Quando um disco r&iacute;gido &eacute; configurado como disco hot spare, todos os dados no disco s&atilde;o eliminados. Antes de atribuir um disco hot spare, certifique-se de que o disco n&atilde;o cont&eacute;m dados importantes.</li>
<li>Um RAID constitu&iacute;do por HDDs n&atilde;o ser&atilde;o automaticamente reparados por discos SSD hot spare, e vice versa.</li>
</ul>
</div>

<h4>Para configurar as defini&ccedil;&otilde;es hot spare para volume/Grupo de Discos/iSCSI LUN:</h4>
<ol>
<li>Clique em <b>Configurar</b>.</li>
<li>No separador <b>Destinos Hot Spare</b>, volumes/Grupos de Disco/iSCSI LUNs que possam ser protegidos por discos hot spare ser&atilde;o listados. Se desmarcar as caixas, os volumes/Grupos de discos/iSCSI LUNs correspondentes n&atilde;o ser&atilde;o automaticamente reparados por discos hot spare quando degradados.</li>
<li>No separador <b>Hot Spare entre dispositivos</b>, pode permitir que os discos hot spare num dispositivo reparem um RAID degradado, localizado num dispositivo diferente.</li>
<li>Clique em <b>OK </b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>



<p>____<br /> *Apenas dispon&iacute;vel em alguns modelos.</p>

</body>
</html>
