<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
	<h2>Vis&atilde;o Geral</h2>
	<p>Vis&atilde;o geral apresenta o estado global dos seus espa&ccedil;os de armazenamento, incluindo estado geral de todos os espa&ccedil;os, utiliza&ccedil;&atilde;o do disco r&iacute;gido, utiliza&ccedil;&atilde;o m&aacute;xima do volume e utiliza&ccedil;&atilde;o de iSCSI LUN.</p>

		<h4>Estado do armazenamento</h4>
        <p>Existem tr&ecirc;s tipos de listas de estados:</p>
	  	<ul>
				<li><b>Saud&aacute;vel</b>: Todos os espa&ccedil;os de armazenamento est&atilde;o Normais.</li>
				<li><B>Aten&ccedil;&atilde;o</B>: Um espa&ccedil;o de armazenamento (volume ou iSCSI LUN) ficou degradado, a cache SSD falhou ou ocorreu um erro numa parti&ccedil;&atilde;o do sistema.</li>
				<li><b>Perigo</b>: Ocorreu um erro no espa&ccedil;o de armazenamento (volume ou iSCSI LUN).</li>
			</ul>
			<p>Se ocorrerem v&aacute;rias anormalidades simultaneamente, o estado de sa&uacute;de ser&aacute; apresentado pela seguinte ordem: 1) Espa&ccedil;os de armazenamento (volume ou iSCSI LUN); 2) cache SSD e 3) parti&ccedil;&atilde;o do sistema. Se ocorrer um problema, siga as instru&ccedil;&otilde;es sugeridas sob o estado.</p>
		
		<h4>Informa&ccedil;&atilde;o do Disco</h4>
        <p>Esta sec&ccedil;&atilde;o apresenta informa&ccedil;&atilde;o do disco r&iacute;gido e do hardware. Pode verificar agora quantos discos r&iacute;gidos est&atilde;o a ser usados porque espa&ccedil;os de armazenamento, o n&uacute;mero de discos r&iacute;gidos suplementares e o n&uacute;mero de entradas de discos r&iacute;gidos dispon&iacute;veis.</p>
        
		<h4>Utiliza&ccedil;&atilde;o do volume principal</h4>
        <p>Esta sec&ccedil;&atilde;o apresenta a capacidade usada de um volume. Se a utiliza&ccedil;&atilde;o total atingir 90%, o gr&aacute;fico circular fica vermelho, acima dos 80% fica amarelo e abaixo dos 79% fica azul.</p>
        
		<h4>Utiliza&ccedil;&atilde;o de iSCSI LUN</h4>
        <p>Esta sec&ccedil;&atilde;o apresenta a seguinte informa&ccedil;&atilde;o:</p>
        <ul>
         		<li><b>Reportado</b>:  As capacidades totais atribu&iacute;das adicionadas de todos os iSCSI LUN (N&iacute;vel de Bloco) e iSCSI LUN (Ficheiro Normal) no Grupo RAID.</li>
                <li><b>Utilizado</b>: Capacidade total atribu&iacute;da de iSCSI LUN (Ficheiros Normais) adicionada &agrave; capacidade total de iSCSI LUN (N&iacute;vel de Bloco).</li>
                <li><b>Guardado</b>:  Tamanho total <b>Reportado</b> menos o tamanho total <b>Usado</b>, apresentando o valor poupado em custos de compra e de gest&atilde;o de espa&ccedil;o de armazenamento.</li>
</ul>
        </li>
</body>
</html>
