<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Escolher um Tipo de RAID - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="A brief overview describing what RAID types are supported by Synology DiskStation Manager (DSM).">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Escolher um Tipo de RAID</h2>

<p>RAID (Redundant Array of Independent Disks) &eacute; uma tecnologia de armazenamento de dados que permite combinar v&aacute;rios discos r&iacute;gidos num &uacute;nico espa&ccedil;o de armazenamento. Existem diferentes tipos de RAID, cada um proporcionando n&iacute;veis diferentes de desempenho, capacidade de armazenamento e fiabilidade.</p>

<p>Este artigo fornece uma vis&atilde;o geral resumida dos tipos de RAID suportados pelo DiskStation, incluindo os requisitos para implementa&ccedil;&atilde;o, al&eacute;m das vantagens e desvantagens.</p>

<!--1-->

<h3>Tipos de RAID Suportados</h3>

<p>Esta tabela fornece uma vis&atilde;o geral dos diferentes tipos de RAID suportados pelo DiskStation, incluindo a capacidade de armazenamento, o n&uacute;mero m&iacute;nimo necess&aacute;rio de discos r&iacute;gidos para o tipo de RAID e o n&uacute;mero de falhas dos discos r&iacute;gidos que podem ser toleradas antes que ocorra a perda de dados. </p>

<table>

  <tr>

    <th>Tipo de Volume</th>
    <th>N&uacute;mero de HDD</th>

    <th>Falhas toler&aacute;veis do Disco R&iacute;gido</th>
    <th>Descri&ccedil;&atilde;o</th>

    <th>Capacidade do Volume</th>

  </tr>

  <tr>

    <td rowspan="3">SHR</td>
    <td>1</td>

    <td>0</td>
    <td rowspan="3">
    <div align="left">
    <ul>
    <li>Optimiza o tamanho do volume quando forem combinados discos com tamanhos diferentes.</li>
    <li>Proporciona redund&acirc;ncia de dados se o volume for constitu&iacute;do por dois ou mais discos r&iacute;gidos.</li>
    <li>Recomendado para utilizadores principiantes.</li>
    </ul>
    </div>
    </td>

    <td>1 x (tamanho do HDD)</td>

  </tr>
  <tr>
    <td>2-3</td>
    <td>1</td>
    <td rowspan="2">Optimizado pelo sistema.</td>
  </tr>
  <tr>
    <td>≧4</td>
    <td>1-2</td>
  </tr>
  
  <tr>

    <td>Basic</td>
    <td>1</td>

    <td>0</td>
    <td>
    <div align="left">
    <ul>
    <li>Constitu&iacute;do por um disco r&iacute;gido como unidade independente.</li>
    <li>N&atilde;o proporciona redund&acirc;ncia de dados.</li>
    </ul>
    </div>
    </td>

    <td>1 x (tamanho do HDD)</td>

  </tr>

  <tr>

    <td>JBOD</td>
    <td>≧1</td>

    <td>0</td>
    <td>
    <div align="left">
    <ul>
    <li>Combina um conjunto de discos r&iacute;gidos num &uacute;nico espa&ccedil;o de armazenamento, com capacidade igual &agrave; soma da capacidade de todos os discos r&iacute;gidos.</li>
    <li>N&atilde;o proporciona redund&acirc;ncia de dados.</li>
    </ul>
    </div>
    </td>

    <td>Soma de todos os tamanhos de HDD</td>

  </tr>

  <tr>

    <td>RAID 0</td>
    <td>≧2</td>

    <td>0</td>
    <td>
    <div align="left">
    <ul>
    <li>Disponibiliza &quot;distribui&ccedil;&atilde;o em faixas&quot;, um processo de divis&atilde;o de dados em blocos e de distribui&ccedil;&atilde;o dos blocos de dados por v&aacute;rios discos r&iacute;gidos para melhorar o desempenho.</li>
    <li>N&atilde;o proporciona redund&acirc;ncia de dados.</li>
    </ul>
    </div>
    </td>

    <td>Soma de todos os tamanhos de HDD</td>

  </tr>

  <tr>

    <td rowspan="3">RAID 1</td>
    <td>2</td>

    <td>1</td>
    <td rowspan="3">
    <div align="left">
    <ul>
    <li>Escreve simultaneamente dados id&ecirc;nticos em ambos os discos r&iacute;gidos.</li>
    <li>Proporciona redund&acirc;ncia de dados.</li>
    </ul>
    </div>
    </td>

    <td rowspan="3">Tamanho do HDD mais pequeno</td>

  </tr>
  <tr>
    <td>3</td>
    <td>2</td>
  </tr>
  <tr>
    <td>4</td>
    <td>3</td>
  </tr>

  <tr>

    <td>RAID 5</td>
    <td>≧3</td>

    <td>1</td>

    <td>
    <div align="left">
    <ul>
    <li>Implementa o striping a n&iacute;vel de bloqueio com dados de paridade distribu&iacute;dos por todos os discos r&iacute;gidos membros, proporcionando, desta forma, a redund&acirc;ncia de dados com maior efici&ecirc;ncia do que o RAID 1.</li>
    </ul>
    </div>
    </td>

    <td>(N &ndash; 1) x (tamanho do HDD mais pequeno)</td>

  </tr>

  <tr>

    <td>RAID 6</td>
    <td>≧4</td>

    <td>2</td>
    <td>
    <div align="left">
    <ul>
    <li>Implementa duas camadas de paridade de dados para guardar dados redundantes igual ao tamanho de dois discos r&iacute;gidos, proporcionando um maior n&iacute;vel de redund&acirc;ncia de dados do que o RAID 5.</li>
    </ul>
    </div>
    </td>

    <td>(N &ndash; 2) x (tamanho do HDD mais pequeno)</td>

  </tr>

  <tr>

    <td>RAID 10</td>
    <td>≧4<br /> (n&uacute;mero par)</td>

    <td>Metade do HDD total</td>
    <td>
    <div align="left">
    <ul>
    <li>Proporciona o desempenho do RAID 0 e o n&iacute;vel de protec&ccedil;&atilde;o de dados do RAID 1, combinando discos r&iacute;gidos em grupos de dois, nos quais os dados s&atilde;o espelhados.</li>
    </ul>
    </div>
    </td>

    <td>(N / 2) x (tamanho do HDD mais pequeno)</td>

  </tr>

</table>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Os tipos de RAID, exceto &quot;Basic&quot;, apenas est&atilde;o dispon&iacute;veis em alguns modelos, dependendo do n&uacute;mero de ranhuras para discos r&iacute;gidos e do n&uacute;mero dos que se encontram instalados.</li>
<li>&quot;N&quot; representa o n&uacute;mero total de unidades de disco r&iacute;gido presentes no volume.</li>
</ul>
</div>




<!--2-->
<h3>Synology Hybrid RAID (SHR)</h3>

<p>O Synology Hybrid RAID (SHR) &eacute; um sistema de gest&atilde;o RAID automatizado, concebido para simplificar a gest&atilde;o de armazenamento e cumprir as necessidades de novos utilizadores n&atilde;o familiarizados com os tipos de RAID. </p>
<p>O SHR pode combinar discos r&iacute;gidos de diferentes tamanhos para criar um volume de armazenamento com capacidade e desempenho optimizados, desperdi&ccedil;ando menos espa&ccedil;o no disco r&iacute;gido para armazenamento e dfisponibilizando uma solu&ccedil;&atilde;o mais flex&iacute;vel para o armazenamento.  Quando est&atilde;o inclu&iacute;dos discos r&iacute;gidos suficientes, o SHR permite 1 (ou 2, como redund&acirc;ncia) discos r&iacute;gidos, o que significa que o Volume SHR pode suportar a falha de um ou dois discos r&iacute;gidos sem implicar a perda de dados.</p>
<img src="about:blank" class="help_image"/>






<!--3-->

<h3>RAID 0</h3>
<p>O RAID 0 combina dois ou mais discos r&iacute;gidos para melhorar o desempenho e a capacidade, mas n&atilde;o proporciona a toler&acirc;ncia de falhas. A falha de um disco r&iacute;gido &uacute;nico resulta na perda de todos os dados do conjunto. O RAID 0 &eacute; &uacute;til para sistemas n&atilde;o cr&iacute;ticos, onde &eacute; exigido um equil&iacute;brio de desempenho/pre&ccedil;o elevado.</p>
<img src="about:blank" class="help_image"/>






<!--4-->

<h3>RAID 1</h3>
<p>O RAID 1 &eacute; mais frequentemente implementado com dois discos r&iacute;gidos. Os dados nos discos r&iacute;gidos s&atilde;o espelhados, proporcionando toler&acirc;ncia de falhas no caso de falha do disco r&iacute;gido. O desempenho de leitura &eacute; melhorado enquanto que o desempenho de escrita &eacute; id&ecirc;ntico a um disco r&iacute;gido &uacute;nico. A falha de um disco r&iacute;gido &uacute;nico pode ser suportada sem perda de dados. O RAID 1 &eacute; frequentemente utilizado quando a toler&acirc;ncia de falhas &eacute; fundamental, enquanto que o espa&ccedil;o e o desempenho n&atilde;o s&atilde;o requisitos cr&iacute;ticos.</p>
<img src="about:blank" class="help_image"/>



<!--5-->

<h3>RAID 5</h3>
<p>O RAID 5 proporciona uma toler&acirc;ncia de falhas e um desempenho de leitura melhorado. &Eacute; necess&aacute;rio um m&iacute;nimo de tr&ecirc;s discos r&iacute;gidos. O RAID 5 pode suportar a perda de dados de um disco r&iacute;gido &uacute;nico. Na eventualidade de uma falha do disco r&iacute;gido, os dados desse disco r&iacute;gido s&atilde;o reconstru&iacute;dos a partir da paridade distribu&iacute;da pelos discos r&iacute;gidos restantes. Como resultado, o desempenho de leitura e escrita sofrem um impacto significativo, enquanto que o conjunto RAID 5 est&aacute; num estado degradado. O RAID 5 &eacute; ideal o espa&ccedil;o e o custo s&atilde;o mais importantes que o desempenho.</p>
<img src="about:blank" class="help_image"/>



<!--6-->

<h3>RAID 6</h3>
<p>O RAID 6 &eacute; id&ecirc;ntico ao RAID 5, excepto no facto de proporcionar outra camada de striping e poder suportar duas falhas de discos r&iacute;gidos. &Eacute; necess&aacute;rio um m&iacute;nimo de quatro discos r&iacute;gidos. O desempenho do RAID 6 &eacute; inferior ao do RAID 5 devido a esta toler&acirc;ncia de falha adicional. O RAID 6 torna-se atractivo quando o espa&ccedil;o e o custo s&atilde;o importantes e &eacute; necess&aacute;rio o suporte de v&aacute;rias falhas dos discos r&iacute;gidos.</p>
<img src="about:blank" class="help_image"/>



<!--7-->

<h3>RAID 10</h3>
<p>RAID 10 combina os benef&iacute;cios de RAID 1 e RAID 0. O desempenho de leitura e escrita &eacute; melhorado, mas apenas metade do espa&ccedil;o total fica dispon&iacute;vel para armazenamento de dados. S&atilde;o necess&aacute;rios quatro ou mais discos r&iacute;gidos, o que torna o custo relativamente elevado, mas o desempenho &eacute; superior, proporcionando a simult&acirc;nea toler&acirc;ncia de falhas. Na realidade, um RAID 10 pode suportar v&aacute;rias falhas de discos r&iacute;gidos - desde que as falhas n&atilde;o ocorram no mesmo subgrupo. O RAID 10 &eacute; ideal para aplica&ccedil;&otilde;es com uma alta exig&ecirc;ncia de entrada/sa&iacute;da, como os servidores de bases de dados.</p>

<img src="about:blank" class="help_image"/>


</body>
</html>
