 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SSD TRIM - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="SSD TRIM improves the read and write performance of volumes created on SSDs, increasing efficiency as well as extending the lifetime of your SSDs.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SSD TRIM</h2>
<p>Se um volume for totalmente constitu&iacute;do por SSDs (Unidades de Estado S&oacute;lido), recomendamos a ativa&ccedil;&atilde;o de SSD TRIM. Esta funcionalidade melhora o desempenho de leitura e escrita de volumes criados em SSDs, melhorando a efici&ecirc;ncia, bem como prolongando a dura&ccedil;&atilde;o dos SSDs.</p>
<h4>Para ativar o SSD TRIM:</h4>
<ol>
  <li>Abra <strong>Gerir Armazenamento</strong> e aceda a <strong>Volume</strong>. </li>
  <li>Selecione um volume que seja totalmente constitu&iacute;do por SSDs e depois clique no bot&atilde;o <b>Configurar</b>.</li>
  <li>Na janela apresentada, aceda ao separador <b>SSD TRIM</b> e marque a caixa <strong>Ativar TRIM</strong>.</li>
  <li>Clique no bot&atilde;o <strong>Configurar agendamento</strong> para escolher quando o sistema ir&aacute; executar o SSD TRIM.</li>
  <li>Clique em <strong>OK</strong>.</li>
</ol>
<div class="section">
  <h4>Nota:</h4>
  <ul>
    <li>O SSD TRIM s&oacute; est&aacute; dispon&iacute;vel em determinados modelos do DiskStation e tipos de RAID. </li>
    <li>Alguns modelos SSD n&atilde;o s&atilde;o capazes de executar SSD TRIM em volumes RAID 5 e RAID 6. Consulte a lista de compatibilidade em <a href="http://www.synology.com/" target=_blank>www.synology.com</a>.</li>
    <li>O SSD TRIM n&atilde;o pode ser ativado nas seguintes situa&ccedil;&otilde;es:<ul>
        <li>Se o volume estiver montado com cache SSD.</li>
        <li>Se o pacote <strong>Time Backup</strong> estiver instalado.</li>
        <li>Se tiver sido criado um cluster de high-availability com <strong>Gestor de High Availability</strong>.</li>
      </ul>
    </li>
    <li>O SSD TRIM n&atilde;o pode ser ativado nos iSCSI LUNs de n&iacute;vel de bloqueio.</li>
    <li>O desempenho do sistema ser&aacute; afetado durante a execu&ccedil;&atilde;o do SSD TRIM. O tempo necess&aacute;rio para concluir a execu&ccedil;&atilde;o do TRIM varia de acordo com o tamanho do volume e modelo SSD.</li>
    <li>Quando o TRIM est&aacute; ativado num volume, tamb&eacute;m ser&aacute; ativado noutros volumes criados no mesmo Grupo de Discos ou RAID Group.</li>
  </ul>
</div>
</body>
</html>
