<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Korl&aacute;toz&aacute;sok &eacute;s rendszerk&ouml;vetelm&eacute;nyek - Synology DSM S&uacute;g&oacute;</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article explains the limitations of the Synology High Availability package.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 </head>
 <body>
 
 
<h2>Korl&aacute;toz&aacute;sok &eacute;s rendszerk&ouml;vetelm&eacute;nyek</h2>

 <p>A Synology High Availability alkalmaz&aacute;s&aacute;hoz k&eacute;t azonos, akt&iacute;v &eacute;s passz&iacute;v kiszolg&aacute;l&oacute;k&eacute;nt műk&ouml;dő Synology kiszolg&aacute;l&oacute;ra van sz&uuml;ks&eacute;g. Mielőtt a k&eacute;t kiszolg&aacute;l&oacute;t high-availability klaszterben egyes&iacute;ti, a rendszer a k&ouml;vetkező hardver- &eacute;s szoftverk&ouml;vetelm&eacute;nyek megl&eacute;t&eacute;t ellenőrzi, amelyek a high-availability klaszter l&eacute;trehoz&aacute;s&aacute;hoz sz&uuml;ks&eacute;gesek.</p>
 
  
 <h3>Rendszerk&ouml;vetelm&eacute;nyek</h3>
 
  <p>Vegye figyelembe a hardverrel &eacute;s szoftverrel kapcsolatos k&ouml;vetkező ir&aacute;nyelveket:</p>
  <ul>
   <li><b>Synology kiszolg&aacute;l&oacute;:</b> Az akt&iacute;v &eacute;s passz&iacute;v kiszolg&aacute;l&oacute; azonos modell kell legyen.</li>
   <li><b>Bőv&iacute;tőegys&eacute;g(ek):</b> Mind az akt&iacute;v, mind pedig a passz&iacute;v kiszolg&aacute;l&oacute;nak megfelelő csatlakoz&aacute;ssal kell rendelkeznie ugyanazon bőv&iacute;tőegys&eacute;ghez.</li>
   <li><b>Meghajt&oacute;k sz&aacute;ma &eacute;s t&iacute;pusa:</b> A meghajt&oacute; t&iacute;pusa csak SAS lehet. A DSM telep&iacute;t&eacute;se előtt legkevesebb 3 meghajt&oacute;t kell telep&iacute;tenie a bőv&iacute;tőegys&eacute;g(ek)be.</li>
   <li><b>K&uuml;lső USB-eszk&ouml;z:</b> Csak az USB-csatlakoztat&aacute;s&uacute; t&aacute;rhelyek t&aacute;mogatottak. Az egy&eacute;b k&uuml;lső USB-eszk&ouml;z&ouml;ket, &iacute;gy t&ouml;bbek k&ouml;z&ouml;tt a UPS-eszk&ouml;z&ouml;ket, Wi-Fi adaptereket, hangsz&oacute;r&oacute;kat, nyomtat&oacute;kat, Bluetooth adaptereket &eacute;s DVB adaptereket a rendszer nem t&aacute;mogatja. USB-t&aacute;rhelyet csak az akt&iacute;v kiszolg&aacute;l&oacute;n haszn&aacute;lhat, &eacute;s nem v&aacute;lthatja &aacute;t a passz&iacute;v kiszolg&aacute;l&oacute;ra.</li>

  </ul>

  <h3>H&aacute;l&oacute;zati k&ouml;rnyezet</h3>
  <p>Ne feledje a k&ouml;vetkező, h&aacute;l&oacute;zati be&aacute;ll&iacute;t&aacute;sokra vonatkoz&oacute; &uacute;tmutat&aacute;sokat, amikor high-availability klasztert pr&oacute;b&aacute;l meg kialak&iacute;tani.</p>
  <ul>
    <li><b>H&aacute;l&oacute;zati be&aacute;ll&iacute;t&aacute;sok:</b> A k&eacute;t kiszolg&aacute;l&oacute; k&ouml;z&ouml;tti heartbeat kapcsolatot megfelelően be kell &aacute;ll&iacute;tani. Mindk&eacute;t kiszolg&aacute;l&oacute; egyazon alh&aacute;l&oacute;zathoz kell csatlakozzon, &eacute;s a telep&iacute;t&eacute;s ut&aacute;n statikus IP-c&iacute;meket kell rajtuk be&aacute;ll&iacute;tani.</li>
    <li><b>LAN-portok sz&aacute;ma:</b> Mindk&eacute;t kiszolg&aacute;l&oacute;nak egyforma sz&aacute;m&uacute; LAN-porttal kell rendelkeznie. Ha a(z) DiskStation modellek valamelyike tov&aacute;bbi h&aacute;l&oacute;zatik&aacute;rtya-interf&eacute;sszel rendelkezik, a m&aacute;sikat is fel kell szerelni ugyanazzal a h&aacute;l&oacute;zatik&aacute;rtya-interf&eacute;sszel. </li>
    <li><b>Kapcsolat korl&aacute;toz&aacute;sai:</b> A high-availability klaszter nem t&aacute;mogatja a Wi-Fi h&aacute;l&oacute;zatot.</li>

  </ul>
  <div class="section">
    <h4>Megjegyz&eacute;s:</h4>
    <ul>
      <li>Az akt&iacute;v kiszolg&aacute;l&oacute;n a rendszer automatikusan enged&eacute;lyezi az NTP kiszolg&aacute;l&oacute;t.</li>
    </ul>
  </div>

<h3>Csomag- &eacute;s szoftverkorl&aacute;toz&aacute;sok</h3> 

<p>L&aacute;sd a csomaggal &eacute;s a szoftverrel kapcsolatos al&aacute;bbi korl&aacute;toz&aacute;sokat:</p>
	<ul>
	<li>A high-availability klaszter nem t&aacute;mogatja a k&ouml;vetkező csomagokat &eacute;s szolg&aacute;ltat&aacute;sokat:<ul><li>DVBLink Server</li>
		<li>A high-availability klaszter &uacute;jraind&iacute;t&aacute;s&aacute;nak/le&aacute;ll&iacute;t&aacute;s&aacute;nak funkci&oacute;ja a CMS-ben</li>
		<li>Time Backup</li>
		</ul>
	</li>
	<li>A megosztott t&aacute;rhellyel rendelkező high-availability klaszter nem konfigur&aacute;lhat&oacute; replik&aacute;ci&oacute;-alap&uacute; high-availability klaszterk&eacute;nt vagy haszn&aacute;lhat&oacute; azzal egy&uuml;tt.</li>
    </ul>

<h3>Adott bőv&iacute;tőegys&eacute;gek hozz&aacute;ad&aacute;sa</h3>
  <p>Mind az akt&iacute;v, mind pedig a passz&iacute;v kiszolg&aacute;l&oacute;nak csatlakoznia kell az adott bőv&iacute;tőegys&eacute;gekhez. Minden bőv&iacute;tőegys&eacute;gen k&eacute;t modul van.</p>
  <h4>Bőv&iacute;tőegys&eacute;gek be&aacute;ll&iacute;t&aacute;sa/hozz&aacute;ad&aacute;sa:</h4>
  <ul>
    <li>Egy modul k&eacute;t portot tartalmaz, amelyek k&ouml;z&uuml;l a bemeneti port a bal oldalon, a kimeneti port a jobb oldalon tal&aacute;lhat&oacute;. SAS-k&aacute;bel haszn&aacute;lat&aacute;val k&ouml;sse &ouml;ssze az egyik modul kimeneti portj&aacute;t a k&ouml;vetkező bőv&iacute;tőegys&eacute;g modulj&aacute;nak bemeneti portj&aacute;val.</li>
	<li>A bőv&iacute;tőegys&eacute;geket sorosan kell &ouml;sszek&ouml;tni a kiszolg&aacute;l&oacute;k megfelelő oldal&aacute;n elhelyezkedő modulokkal.</li>
    <li>Mind az akt&iacute;v, mind a passz&iacute;v kiszolg&aacute;l&oacute;nak a megfelelő sorrendben kell csatlakoznia a megosztott bőv&iacute;tőegys&eacute;gekhez.</li>
  </ul>


<div class="section">
<h4>Megjegyz&eacute;sek:</h4>
<p>A bőv&iacute;tőegys&eacute;g telep&iacute;t&eacute;s&eacute;re vonatkoz&oacute; r&eacute;szletes inform&aacute;ci&oacute;kat a kiszolg&aacute;l&oacute;k &eacute;s bőv&iacute;tőegys&eacute;gek gyorstelep&iacute;t&eacute;si &uacute;tmutat&oacute;j&aacute;ban tal&aacute;lhatja.</p>
</div>

   
 </body>
</html>
