<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

<meta charset="utf-8">
</head>
<body>

<h2> Figyel&eacute;s</h2>

<p>Ez az oldal h&aacute;rom lapot tartalmaz, amelyeken a rendszer&aacute;llapot, a szolg&aacute;ltat&aacute;sok &eacute;s a h&aacute;l&oacute;zati interf&eacute;sz &aacute;llapota figyelhető meg. Ez az oldal lehetőv&eacute; teszi bizonyos c&eacute;lok fel&uuml;gyelet&eacute;t. Ha egy fel&uuml;gyelt szolg&aacute;ltat&aacute;s nem műk&ouml;dik az akt&iacute;v kiszolg&aacute;l&oacute;n, a rendszer &aacute;tadja a feladatot a k&eacute;szenl&eacute;ti, passz&iacute;v kiszolg&aacute;l&oacute;nak (amennyiben a passz&iacute;v kiszolg&aacute;l&oacute; rendesen műk&ouml;dik). Ezen az oldalon a k&ouml;vetkező lapok l&aacute;that&oacute;k:</p>

<h3> Rendszer&aacute;llapot lap</h3>
<p>A rendszer&aacute;llapot alap&eacute;rtelmez&eacute;s szerint megfigyelt, &eacute;s nem tilthat&oacute; le. Az akt&iacute;v kiszolg&aacute;l&oacute; rendszerhib&aacute;ja feladat&aacute;tad&aacute;st v&aacute;lt ki. Ezen az oldalon a k&ouml;vetkező szakaszok l&aacute;that&oacute;k:</p>
<ul>
  <li><b>Akt&iacute;v kiszolg&aacute;l&oacute;&aacute;llapot:</b> Feladat&aacute;tv&eacute;tel, amennyiben az akt&iacute;v kiszolg&aacute;l&oacute; meghib&aacute;sodik, &eacute;s nem k&eacute;pes szolg&aacute;ltat&aacute;sokat biztos&iacute;tani. P&eacute;ld&aacute;ul, ha az akt&iacute;v kiszolg&aacute;l&oacute; mindk&eacute;t t&aacute;pegys&eacute;ge meghib&aacute;sodik.</li>
  <li><b>T&aacute;rol&oacute; kapcsol&oacute;d&aacute;sa:</b> Feladat&aacute;tv&eacute;tel, amennyiben egy meghajt&oacute; hi&aacute;nyzik az akt&iacute;v kiszolg&aacute;l&oacute;r&oacute;l, de jelen van a passz&iacute;v kiszolg&aacute;l&oacute;n.</li>
</ul>

<h3> Szolg&aacute;ltat&aacute;s lap</h3>
<p>A fel&uuml;gyelhető szolg&aacute;ltat&aacute;sok &eacute;s &aacute;llapotuk list&aacute;j&aacute;t mutatja. A feladat&aacute;tvitelt a szolg&aacute;ltat&aacute;sok rendellenes műk&ouml;d&eacute;se v&aacute;ltja ki. Ezen az oldalon a k&ouml;vetkező szakaszok l&aacute;that&oacute;k:</p>
<ul>
  <li><b>Szolg&aacute;ltat&aacute;s: </b> A fel&uuml;gyelhető szolg&aacute;ltat&aacute;sokat jelen&iacute;ti meg.</li>
  <li><b>&Aacute;llapot: </b> Jelzi, hogy a szolg&aacute;ltat&aacute;sok futnak-e vagy sem.</li>
  <li><b>Figyel&eacute;s: </b>Fel&uuml;gyelet&eacute;nek elind&iacute;t&aacute;s&aacute;hoz jel&ouml;lje be a szolg&aacute;ltat&aacute;s melletti jel&ouml;lőn&eacute;gyzetet. Ha a kijel&ouml;lt szolg&aacute;ltat&aacute;s nem műk&ouml;dik, a rendszer &aacute;tadja a feladatot.</li>
</ul>

<h4>Szolg&aacute;ltat&aacute;s fel&uuml;gyelete:</h4>

<ol>
<li>Keresse meg a fel&uuml;gyelni k&iacute;v&aacute;nt szolg&aacute;ltat&aacute;st. Győződj&ouml;n meg arr&oacute;l, hogy a szolg&aacute;ltat&aacute;s norm&aacute;l &aacute;llapotban fut.</li>
<li>Jel&ouml;lje be a mellette l&eacute;vő jel&ouml;lőn&eacute;gyzetet.</li>
<li>Kattintson az <b>Alkalmaz</b> gombra a be&aacute;ll&iacute;t&aacute;sok ment&eacute;s&eacute;hez.</li>
</ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>A fel&uuml;gyelhető szolg&aacute;ltat&aacute;sok a k&ouml;vetkezők: Windows f&aacute;jlszolg&aacute;ltat&aacute;s, iSCSI Target, FTP, Mac f&aacute;jlszolg&aacute;ltat&aacute;s, NFS szolg&aacute;ltat&aacute;s.</p>
</div>

<h3> H&aacute;l&oacute;zati interf&eacute;sz f&uuml;l</h3>
<p>Megjelen&iacute;ti a megfigyelhető logikai h&aacute;l&oacute;zati interf&eacute;szek list&aacute;j&aacute;t. A feladat&aacute;tvitelt a h&aacute;l&oacute;zati csatlakoz&aacute;s nem megfelelő műk&ouml;d&eacute;se v&aacute;ltja ki. (Bővebb inform&aacute;ci&oacute;kat az al&aacute;bbiak szerint szerezhet a Jegyzetekből.) Ezen az oldalon a k&ouml;vetkező szakaszok l&aacute;that&oacute;k:</p>
<ul>
  <li><b>H&aacute;l&oacute;zati interf&eacute;sz: </b> Megjelen&iacute;ti a megfigyelhető interf&eacute;szek list&aacute;j&aacute;t.</li>
  <li><b>Figyel&eacute;s: </b>Fel&uuml;gyelet&eacute;nek elind&iacute;t&aacute;s&aacute;hoz jel&ouml;lje be az interf&eacute;sz melletti jel&ouml;lőn&eacute;gyzetet.</li>
</ul>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>Ha a <strong>Figyel&eacute;s</strong> jel&ouml;lőn&eacute;gyzet be van jel&ouml;lve, a rendszer &aacute;tadja a feladatot a passz&iacute;v kiszolg&aacute;l&oacute;nak, amikor az akt&iacute;v kiszolg&aacute;l&oacute; h&aacute;l&oacute;zati csatlakoz&aacute;sa nem műk&ouml;dik vagy hib&aacute;s, &eacute;s a passz&iacute;v kiszolg&aacute;l&oacute; h&aacute;l&oacute;zati csatlakoz&aacute;sa m&eacute;g mindig rendesen műk&ouml;dik.</p>
<ul>
<li>A feladat&aacute;tad&aacute;s csak akkor v&aacute;lt&oacute;dik ki, ha a passz&iacute;v kiszolg&aacute;l&oacute; t&ouml;bb j&oacute;l műk&ouml;dő csatlakoz&aacute;ssal rendelkezik. Ha p&eacute;ld&aacute;ul az akt&iacute;v kiszolg&aacute;l&oacute; h&aacute;rom csatlakoz&aacute;ssal rendelkezik &eacute;s egy nem műk&ouml;dik, a rendszer csak akkor v&aacute;ltja ki a feladat&aacute;tad&aacute;st, ha a passz&iacute;v kiszolg&aacute;l&oacute; h&aacute;rom vagy t&ouml;bb j&oacute;l műk&ouml;dő kapcsolattal rendelkezik.</li>
<li>A Link Aggregationnel kombin&aacute;lt kapcsolatok egy kapcsolatnak sz&aacute;m&iacute;tanak. Ha p&eacute;ld&aacute;ul k&eacute;t kapcsolat van kombin&aacute;lva, &eacute;s az egyik&uuml;k nem műk&ouml;dik, de a m&aacute;sik m&eacute;g mindig műk&ouml;dik, a kapcsolat tov&aacute;bbra is j&oacute;l műk&ouml;dőnek fog sz&aacute;m&iacute;t&oacute;dni.</li>
</ul>
</div>

<h4>Egy interf&eacute;sz megfigyel&eacute;s&eacute;hez tegye a k&ouml;vetkezőket:</h4>

<ol>
<li>Keresse meg a megfigyelni k&iacute;v&aacute;nt interf&eacute;szt. Győződj&ouml;n meg arr&oacute;l, hogy a k&aacute;beleket megfelelően csatlakoztatta az akt&iacute;v &eacute;s a passz&iacute;v kiszolg&aacute;l&oacute;n.</li>
<li> Jel&ouml;lje be a mellette l&eacute;vő jel&ouml;lőn&eacute;gyzetet.</li>
<li>Kattintson az <b>Alkalmaz</b> gombra a be&aacute;ll&iacute;t&aacute;sok ment&eacute;s&eacute;hez.</li>
</ol>

</body>
</html>
