<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 <meta charset="utf-8">
</head>
 <body>
 <h2>H&aacute;l&oacute;zat</h2>
	<p>Ez az oldal a h&aacute;l&oacute;zati interf&eacute;szekhez tartoz&oacute; diagramot &eacute;s &aacute;llapott&aacute;bl&aacute;zatot tartalmazza.</p>
	<h3>Interf&eacute;szdiagram</h3>
	<p>Megjelen&iacute;ti a kijel&ouml;lt elemet a t&aacute;bl&aacute;zatban, &eacute;s k&uuml;l&ouml;nb&ouml;ző sz&iacute;nekkel jel&ouml;li az 1 Gbps &eacute;s 10 Gbps h&aacute;l&oacute;zati interf&eacute;szeket.</p>
  <h3>Interf&eacute;sz&aacute;llapotok t&aacute;bl&aacute;zata</h3>
	<p>Megjelen&iacute;ti az interf&eacute;sz &aacute;llapot&aacute;t mindk&eacute;t kiszolg&aacute;l&oacute;n, valamint az interf&eacute;sz megfigyel&eacute;si &aacute;llapot&aacute;t. Ez a t&aacute;bl&aacute;zat az al&aacute;bbi inform&aacute;ci&oacute;kat mutatja:</p>
  <ul>
    <li><b>H&aacute;l&oacute;zati interf&eacute;sz:</b> A kiszolg&aacute;l&oacute;n tal&aacute;lhat&oacute; fizikai h&aacute;l&oacute;zati interf&eacute;szt mutatja.</li>
    <li><b>Akt&iacute;v kiszolg&aacute;l&oacute;:</b> Az interf&eacute;sz &aacute;llapot&aacute;t &eacute;s a csatlakoz&aacute;si sebess&eacute;get mutatja az akt&iacute;v kiszolg&aacute;l&oacute;n.</li>
    <li><b>Passz&iacute;v kiszolg&aacute;l&oacute;/Ismeretlen kiszolg&aacute;l&oacute;:</b> Az interf&eacute;sz &aacute;llapot&aacute;t &eacute;s a csatlakoz&aacute;si sebess&eacute;get mutatja a passz&iacute;v kiszolg&aacute;l&oacute;n. Ez az oszlop a kiszolg&aacute;l&oacute; &aacute;llapot&aacute;nak megfelelő nevet mutatja.</li>
	<li><b>Bond:</b> A link aggregation be&aacute;ll&iacute;t&aacute;sokat mutatja.</li>
	<li><b>&Aacute;llapot:</b> A h&aacute;l&oacute;zat &aacute;llapot&aacute;t jelen&iacute;ti meg, ha az interf&eacute;sz megfigyelt. Az al&aacute;bbi &aacute;llapotok lehets&eacute;gesek:<ul>
			<li><b>Figyelem:</b> Csatlakoz&aacute;si hiba t&ouml;rt&eacute;nt a passz&iacute;v kiszolg&aacute;l&oacute;n, vagy az interf&eacute;sz csatlakoz&aacute;si sebess&eacute;ge k&uuml;l&ouml;nb&ouml;zik a k&eacute;t kiszolg&aacute;l&oacute;n;</li>
			<li><b>Hiba:</b> Csatlakoz&aacute;si hiba t&ouml;rt&eacute;nt az akt&iacute;v kiszolg&aacute;l&oacute;n; </li>
			<li><b>Norm&aacute;l:</b> Nem &eacute;szlelhető hiba.</li>
		</ul>
	</li>
	<li><b>Figyel&eacute;s:</b> A megfigyel&eacute;s &aacute;llapot&aacute;t jelen&iacute;ti meg, ha az interf&eacute;sz megfigyelt. A <b>Figyel&eacute;s</b> &gt; <b>H&aacute;l&oacute;zati interf&eacute;sz</b> oldalon jel&ouml;lheti be vagy sz&uuml;ntetheti meg a bejel&ouml;l&eacute;st a <b>Figyel&eacute;s</b> jel&ouml;lőn&eacute;gyzetben.</li>
  </ul>
</body>
</html>
