<!DOCTYPE html>
<html class="img-no-display">
 <head>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>High Availability</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

 <meta charset="utf-8">
</head>
 <body>
<h2>&bdquo;Tudathasad&aacute;sos&rdquo; hiba (split-brain)</h2>

<p>Ha egy high-availability klaszter rendesen műk&ouml;dik, csak az egyik tag-kiszolg&aacute;l&oacute; l&aacute;thatja el az akt&iacute;v kiszolg&aacute;l&oacute; szerep&eacute;t. Ebben az esetben a passz&iacute;v kiszolg&aacute;l&oacute; mind a heartbeat kapcsolaton, mind pedig a megosztott bőv&iacute;tőegys&eacute;gek seg&iacute;ts&eacute;g&eacute;vel az adatkapcsolaton kereszt&uuml;l &eacute;rz&eacute;keli az akt&iacute;v kiszolg&aacute;l&oacute; jelenl&eacute;t&eacute;t, ami megakad&aacute;lyozza az &aacute;tkapcsol&aacute;st. Ezenk&iacute;v&uuml;l a passz&iacute;v kiszolg&aacute;l&oacute; &eacute;szleli a megosztott t&aacute;rhely &aacute;llapot&aacute;t, hogy elker&uuml;lje az akt&iacute;v kiszolg&aacute;l&oacute; szerepk&ouml;r&eacute;nek t&eacute;ves &aacute;tv&eacute;tel&eacute;t, amikor az aktu&aacute;lis akt&iacute;v kiszolg&aacute;l&oacute; norm&aacute;lis műk&ouml;d&eacute;se sor&aacute;n hozz&aacute;f&eacute;r a megosztott bőv&iacute;tőegys&eacute;gekhez.</p>

<p>A heartbeat kapcsolat &eacute;s az &ouml;sszes adatkapcsolat elveszt&eacute;sekor, vagy ha a megosztott t&aacute;rhely &eacute;s a rendszer &aacute;llapota bizonytalann&aacute; v&aacute;lik, mindk&eacute;t kiszolg&aacute;l&oacute; akt&iacute;v kiszolg&aacute;l&oacute;kent &eacute;rz&eacute;kelheti mag&aacute;t. Ez a helyzet &bdquo;tudathasad&aacute;sos&rdquo; hibak&eacute;nt ismeretes. Ebben az esetben, a k&eacute;t kiszolg&aacute;l&oacute; egyidejű hozz&aacute;f&eacute;r&eacute;s&eacute;ből fakad&oacute; adats&eacute;r&uuml;l&eacute;s elker&uuml;l&eacute;se &eacute;rdek&eacute;ben, az egyik kiszolg&aacute;l&oacute; megk&iacute;s&eacute;rli folytatni a szolg&aacute;ltat&aacute;sok ny&uacute;jt&aacute;s&aacute;t, m&iacute;g a m&aacute;sik kiszolg&aacute;l&oacute; &uacute;jraindul, majd a csatlakoz&aacute;sok ellenőrz&eacute;s&eacute;t ig&eacute;nyli. Ebben a helyzetben a kliensfelhaszn&aacute;l&oacute;k csatlakoz&aacute;sa egy időre bizonytalann&aacute; v&aacute;lhat.</p>
        
 </body>
</html>
