<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;os de Backup - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Allow other users to back up data from their Synology NAS or rsync-compatible clients to your Synology NAS.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Servi&ccedil;o de backup</h2>
<p><strong>Servi&ccedil;o de backup</strong> permite que outros usu&aacute;rios fa&ccedil;am backup dos dados de seus dispositivos Synology NAS atrav&eacute;s do pacote. <strong>Backup e restaura&ccedil;&atilde;o</strong> em seu Synology NAS.</p>

<h3>Habilita&ccedil;&atilde;o do Servidor de backup Synology</h3>


<h4>Para habilitar o servi&ccedil;o de backup:</h4>

<p>Voc&ecirc; pode transformar seu Synology NAS em um destino de backup de dados/LUN para outro Synology NAS remoto.</p>

<ol>
<li>V&aacute; at&eacute; <strong>Painel de controle</strong> &gt; <strong>Servi&ccedil;o de backup</strong>.</li>
<li>Clique em <strong>Habilite o destino de backup para os servidores remotos Synology</strong>.</li>
<li>Clique em <strong>Aplicar</strong> para salvar as configura&ccedil;&otilde;es.</li>
<li>V&aacute; para <b>Painel de Controle</b> &gt; <b>Pasta Compartilhada</b>, selecione uma pasta compartilhada, clique em <b>Editar</b> &gt; <b>Permiss&otilde;es</b> e conceda o privil&eacute;gio <b>Leitura/Grava&ccedil;&atilde;o</b> aos usu&aacute;rios desejados. Repita essa etapa para incluir mais pastas compartilhadas que podem ser usadas como destinos de backup.</li>
</ol>



<div class="section">
<h4>Nota:</h4>
<ul>
<li>O Synology NAS remoto deve usar o pacote <strong>Backup e restaura&ccedil;&atilde;o</strong> para fazer backup de seus dados/LUN em seu Synology NAS.</li>
<li>Para permitir o backup LUN do Synology NAS remoto, v&aacute; para <strong>Painel de controle</strong> &gt; <strong>Servi&ccedil;os de arquivos</strong> &gt; <strong>rsync</strong> e selecione <strong>Habilitar servi&ccedil;o rsync</strong> no lado do destino.</li>
</ul>
</div>

<h4>Para atribuir privil&eacute;gios de backup:</h4>
<p>Atribua os privil&eacute;gios de backup adequados aos usu&aacute;rios para que esses usu&aacute;rios possam fazer backup dos dados de um Synology NAS de origem para o Synology NAS de destino.</p>

<ol>
<li>V&aacute; para <b>Painel de controle</b> &gt; ﻿<b>Privil&eacute;gios</b>, clique em <strong>Backup Synology</strong> &gt; <strong>Editar</strong>.</li>
<li>Atribuir <strong>Permitir</strong> privil&eacute;gios para os usu&aacute;rios de destino ou especificar melhor os endere&ccedil;os IP permitidos para os usu&aacute;rios espec&iacute;ficos.</li>
</ol>


</body>
</html>
