<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;o de indexa&ccedil;&atilde;o de m&iacute;dia</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Configura&ccedil;&otilde;es da convers&atilde;o</h2>
<p>Ao fazer upload de fotos ou v&iacute;deos para uso com o Servidor de m&iacute;dia ou Photo Station, ser&atilde;o criadas miniaturas para uma melhor experi&ecirc;ncia de navega&ccedil;&atilde;o. Voc&ecirc; pode configurar a qualidade das miniaturas e monitorar o andamento da convers&atilde;o.</p>
<p>Enquanto isso, se desejar ver v&iacute;deos na pasta compartilhada <strong>photo</strong> do Photo Station em seus dispositivos m&oacute;veis, pode habilitar a convers&atilde;o de v&iacute;deo e tamb&eacute;m ver o andamento da convers&atilde;o.</p>
<h4>Para definir a qualidade das miniaturas:</h4>
<ol>
<li>
Escolha uma qualidade no menu suspenso.
</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>
<div class="section">
<span class="note_head">Observa&ccedil;&atilde;o: </span>
<ul>
<li>A cria&ccedil;&atilde;o de miniaturas de alta qualidade demorar&aacute; mais tempo.</li>
</ul>
</div>
<h4>Para habilitar a convers&atilde;o de v&iacute;deo para dispositivos m&oacute;veis:</h4>
<ol>
<li>Marque <strong>Habilitar convers&atilde;o de v&iacute;deo para dispositivos m&oacute;veis</strong>.</li>
<li>Clique em <strong>Aplicar</strong> e voc&ecirc; poder&aacute; ver v&iacute;deos em seus dispositivos m&oacute;veis em viagem.
</li>
</ol>

<div class="section">
<span class="note_head">Observa&ccedil;&atilde;o: </span>
<ul>
<li>Apenas os v&iacute;deos atualizados para a pasta compartilhada <strong>photo</strong> do Photo Station podem ser convertidos no formato suportado por dispositivos m&oacute;veis.</li>
<li>Os arquivos em MP4 n&atilde;o ser&atilde;o convertidos.</li>
</ul>
</div>
<h4>Para ver o andamento da convers&atilde;o de fotos/v&iacute;deos:</h4>
<ol>
<li>Quando fotos e v&iacute;deos est&atilde;o sendo transferidos por upload para DiskStation, clique no &iacute;cone <strong>Andamento da convers&atilde;o</strong> que aparece no canto direito superior da barra de tarefas. </li>
<li>
Na janela que aparece, execute uma das seguintes a&ccedil;&otilde;es:
</li>
<ul>
<li>
Na se&ccedil;&atilde;o <b>Andamento da convers&atilde;o</b>, acompanhe o andamento e o status da cria&ccedil;&atilde;o de miniaturas executada em segundo plano.
</li>
<li>
Fa&ccedil;a o seguinte para pausar o andamento da convers&atilde;o:
</li>
<ol>
<li>
Escolha <b>Atrasar [n&uacute;mero] hora(s)</b> no menu suspenso e clique em <b>Pausar</b> para pausar o andamento. (Por padr&atilde;o, <b>Atrasar 1 hora(s)</b> &eacute; escolhido.)
</li>
<li>O andamento da convers&atilde;o continuar&aacute; ap&oacute;s o tempo de atraso especificado, ou voc&ecirc; pode clicar em <b>Continuar</b> para continuar o processo imediatamente.
</li>
</ol>
<div class="section">
<span class="note_head">Observa&ccedil;&atilde;o: </span>
<ul>
<li>Como o andamento da convers&atilde;o exige muitos recursos da CPU, pausar o processo pode economizar recursos do sistema para outras tarefas em andamento.</li>
</ul>
</div>
</ul>
<li>
Quando o andamento da convers&atilde;o estiver conclu&iacute;do, o &iacute;cone na barra de tarefas desaparecer&aacute;.
</li>
</ol>

<div class="section">
<span class="note_head">Observa&ccedil;&atilde;o: </span>
<ul>
<li>Como o Photo Station Uploader fornece um desempenho melhor para a cria&ccedil;&atilde;o de miniaturas, recomendamos o uso desse programa caso deseje carregar uma grande quantidade de fotos e v&iacute;deos em sua biblioteca do Photo Station.</li>
</ul>
</div>

</body>
</html>