<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;os Web</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Aplicativos da Web</h2>

<p>Com o recurso Web Station integrado e o suporte a PHP, &eacute; poss&iacute;vel hospedar um site em seu DiskStation de forma f&aacute;cil e criar sites din&acirc;micos para sua empresa ou por hobby. Al&eacute;m disso, o Centro de Pacotes fornece diversos pacotes de terceiros, como Gerenciamento de Conte&uacute;do, sistema de Gerenciamento de Relacionamento e e-Commerce. Uma pasta compartilhada padr&atilde;o chamada <b>web</b> ser&aacute; criada para armazenar os arquivos de seu site.</p>
<h4>Para habilitar o Web Station:</h4>
<ol>
<li>V&aacute; at&eacute; <strong>Painel de controle</strong> &gt; <strong>Servi&ccedil;os Web</strong>.</li>
<li>Marque <b>Ativar Web Station</b>.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Para uma melhor flexibilidade e seguran&ccedil;a, o Web Station usa o grupo de usu&aacute;rios <strong>http</strong> para executar tarefas. Portanto, para controlar as permiss&otilde;es de acesso de suas p&aacute;ginas web, mude as permiss&otilde;es de acesso do grupo <strong>http</strong> para cada pasta e arquivo correspondente. Por exemplo, para tornar o arquivo <strong>sample.htm</strong> na pasta compartilhada <strong>web</strong> acess&iacute;veis pelo Web Station, ser&aacute; necess&aacute;rio verificar se o grupo <strong>http</strong> tem as permiss&otilde;es de leitura/grava&ccedil;&atilde;o adequadas para a pasta compartilhada <strong>web</strong>, bem como o arquivo <strong>sample.htm</strong>.</li>

<li>O arquivo de p&aacute;gina inicial deve chamar <strong>index.htm</strong>, <strong>index.html</strong> ou <strong>index.php</strong>.</li>

<li>Ao utilizar a fun&ccedil;&atilde;o PHP mail(), o sistema ir&aacute; automaticamente buscar e usar a informa&ccedil;&atilde;o do servidor SMTP da p&aacute;gina <strong>Notifica&ccedil;&atilde;o</strong>. Certifique-se de ter habilitado as notifica&ccedil;&otilde;es de e-mail e digitado as informa&ccedil;&otilde;es corretas do servidor SMTP.</li>

<li>O caminho real da pasta compartilhada <b>web</b> &eacute; <b>/volume1/web</b>. Alguns aplicativos precisam que o usu&aacute;rio defina o caminho no arquivo de configura&ccedil;&atilde;o.</li>


<li>Os nomes <strong>blog</strong>, <strong>photo</strong>, <strong>photosrc</strong> e <strong>webdefault</strong> s&atilde;o nomes de pastas reservados. Esses nomes n&atilde;o podem ser usados pelo Web Station, portanto n&atilde;o crie pastas com esses nomes na pasta compartilhada <b>web</b>.</li>

<li>Voc&ecirc; pode personalizar a p&aacute;gina de erros criando um arquivo <b>missing.html</b>, <b>missing.htm</b> ou <b>missing.php</b>. Primeiro habilite o Web Station. Ent&atilde;o coloque o arquivo <b>missing.html</b>, <b>missing.htm</b>, ou <b>missing.php</b> na pasta compartilhada <b>web</b> no servidor. Quando usu&aacute;rios fazem o link para uma p&aacute;gina que n&atilde;o exista, ver&atilde;o esta p&aacute;gina de erro personalizada.</li>

<li>N&uacute;mero m&aacute;ximo de conex&otilde;es HTTP ativas: 256</li>

<li>N&uacute;mero m&aacute;ximo de hosts virtuais: 30</li>
</ul>
</div>

<h3>Habilitar host virtual para hospedagem de websites</h3>
<p>Voc&ecirc; pode hospedar v&aacute;rios sites em um &uacute;nico servidor com o recurso de host virtual. Para come&ccedil;ar, &eacute; preciso registrar um par de nomes de dom&iacute;nio e configurar a hospedagem virtual, seguindo as etapas abaixo.</p>
<h4>Para habilitar a Hospedagem Virtual:</h4>
<ol>
<li>Clique em <b>Host Virtual</b>.</li>
<li>Clique em <b>Criar</b>.</li>
<li>Informe um nome para a sub pasta da pasta compartilhada <b>web</b>, que ir&aacute; armazenar os arquivos do site.</li>
<li>Informe um nome de host para o website.</li>
<li>Informe uma porta para o website.</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<h3>Ativar Website pessoal</h3>
<P>O recurso de website pessoal &eacute; uma forma conveniente de permitir que usu&aacute;rios locais, usu&aacute;rios de dom&iacute;nio e usu&aacute;rios LDAP criem seus pr&oacute;prios websites pessoais.</p>
<h4>Para usu&aacute;rios locais</h4><p>Cada usu&aacute;rio local ter&aacute; um endere&ccedil;o &uacute;nico de site <strong>IP-do-servidor/~nome-do-usu&aacute;rio</strong> ou <strong>nome-do-servidor/~nome-do-usu&aacute;rio</strong>. Por exemplo:</p>
<ol>
<li>192.168.1.1/~ken</li>
<li>SynologyNAS/~ken</li>
</ol>
<h4 class="disable-eds14">Para usu&aacute;rios de dom&iacute;nio</h4>
<p class="disable-eds14">Cada usu&aacute;rio do dom&iacute;nio ter&aacute; um endere&ccedil;o &uacute;nico de site <strong>IP-do-servidor/~nome-do-dom&iacute;nio%5cnome-do-usu&aacute;rio</strong> ou <strong>nome-do-servidor/~nome-do-dom&iacute;nio%5cnome-do-usu&aacute;rio</strong>. Por exemplo:</p>
<ol class="disable-eds14">
<li>192.168.1.1/~testdomain<b>%5c</b>ken</li>
<li>SynologyNAS/~testdomain<b>%5c</b>ken</li>
</ol>

<h4 class="disable-eds14">Para usu&aacute;rios LDAP</h4>
<p class="disable-eds14">Cada usu&aacute;rio do LDAP ter&aacute; um endere&ccedil;o &uacute;nico de site <strong>IP-do-servidor/~nome-do-usu&aacute;rio@nome-do-dom&iacute;nio</strong> ou <strong>nome-do-servidor/~nome-do-usu&aacute;rio@nome-do-dom&iacute;nio</strong>. Por exemplo:</P>
<ol class="disable-eds14">
<li>192.168.1.1/~ken<b>@</b>testdomain</li>
<li>SynologyNAS/~ken<b>@</b>testdomain</li>
</ol>

<div class="section disable-eds14">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Antes de habilitar esse recurso, verifique se <strong>homes de usu&aacute;rios</strong> est&aacute; habilitado. Para usu&aacute;rios locais, v&aacute; para <b>Painel de Controle</b> &gt; <b>Usu&aacute;rio</b> &gt; <b>Avan&ccedil;ado</b>; para usu&aacute;rios do dom&iacute;nio, v&aacute; para <b>Painel de Controle</b> &gt; <b>Servi&ccedil;o de Diret&oacute;rio</b> &gt; <b>Usu&aacute;rio de Dom&iacute;nio</b> &gt; <b>P&aacute;gina Inicial do Usu&aacute;rio</b>; para usu&aacute;rios do LDAP, v&aacute; para <b>Painel de Controle</b> &gt; <b>Servi&ccedil;o de Diret&oacute;rio</b> &gt; <b>Usu&aacute;rios LDAP</b> &gt; <b>P&aacute;gina Inicial do Usu&aacute;rio</b>.</p>
</div>

<div class="section enable-eds14">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Antes de habilitar esse recurso, verifique se <strong>homes de usu&aacute;rios</strong> est&aacute; habilitado. Para usu&aacute;rios locais, v&aacute; para <b>Painel de Controle</b> &gt; <b>Usu&aacute;rio</b> &gt; <b>Avan&ccedil;ado</b>.</p>
</div>

<h4>Para criar um website pessoal:</h4>
<ol>
<li>Se voc&ecirc; tiver marcado <strong>Habilitar site pessoal</strong>, uma pasta <strong>www</strong> ser&aacute; criada automaticamente no diret&oacute;rio base do usu&aacute;rio.</li>
<li>O usu&aacute;rio agora poder&aacute; fazer o upload dos arquivos relacionados com o site (como p&aacute;ginas web e arquivos de som) para a pasta <strong>www</strong>.</li>
<li>Verifique se o usu&aacute;rio tem permiss&otilde;es de acesso apropriadas para os arquivos enviados.</li>
</ol>


<h4>Para personalizar a p&aacute;gina de erro:</h4>
<ol>
<li>Salve a p&aacute;gina de erro como <b>missing.html</b>, <b>missing.htm</b> ou <b>missing.php</b>.</li>
<li>Fa&ccedil;a o upload do arquivo para a pasta <strong>www</strong>.</li>
</ol>
<p>Quando usu&aacute;rios apontarem para uma p&aacute;gina que n&atilde;o existe no website local do usu&aacute;rio, a p&aacute;gina de erro personalizada ser&aacute; mostrada.<strong></strong></p>
<h4>Suporte e limita&ccedil;&otilde;es:</h4>
<p>Usu&aacute;rios locais somente podem acessar dados sob o seguinte:</p>
<ul>
<li>Sua pr&oacute;pria pasta principal</li>
<li>/var/tmp</li>
<li>/tmp</li>
<li>/volumeX/@tmp</li>
</ul>

<h2>Servi&ccedil;o HTTP</h2>

<p>Al&eacute;m dos n&uacute;meros de porta padr&atilde;o 80 (para HTTP) ou 443 (para HTTPS), n&uacute;meros de portas adicionais podem ser adicionados para acessar o Photo Station e o Web Station. Voc&ecirc; pode adicionar n&uacute;meros de porta de 1 a 65535 para HTTP ou HTTPS.</p>
<h4>Para adicionar um n&uacute;mero de porta para acesso HTTP ou HTTPS:</h4>
<ol>
<li>Selecione <b>Adicionar porta HTTP adicional</b> ou <b>Adicionar porta HTTPS adicional</b> (a op&ccedil;&atilde;o <strong>Habilitar conex&atilde;o HTTPS para servi&ccedil;os web</strong> deve ser habilitada anter de adicionar a porta para HTTPS).</li>
<li>Digite o n&uacute;mero da porta desejado no campo. </li>
</ol>


<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Os seguintes s&iacute;mbolos n&atilde;o s&atilde;o suportados: 20, 21, 22, 23, 25, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002, portas padr&atilde;o eMule: 4662 (TCP), 4672 (UDP), e faixa de portas FTP padr&atilde;o: a faixa real pode variar dependendo dos diferentes modelos.</li>
</ul>
</div>
</body>
</html>
