<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Privilégios - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology NAS provides rich applications services which can be accessed by local or domain users. Synology DiskStation Manager (DSM) provides flexible settings for controlling users' application privileges, making it easy to manage users' access to different applications.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Privilégios</h1>
<p>&Eacute; poss&iacute;vel visualizar e editar os privil&eacute;gios de usu&aacute;rios e grupos para servi&ccedil;os e aplicativos individuais. O DSM oferece configura&ccedil;&otilde;es flex&iacute;veis para controlar os privil&eacute;gios de aplicativos, tornando mais f&aacute;cil gerenciar o acesso de usu&aacute;rios e grupos a diferentes aplicativos.</p>
<h4>Para modificar os privil&eacute;gios de aplicativos de usu&aacute;rios e grupos:</h4>
<ol>
<li>V&aacute; at&eacute; <strong>Painel de controle</strong> &gt; <strong>﻿Privil&eacute;gios</strong>.</li>
<li>Selecione o aplicativo que voc&ecirc; deseja modificar. Clique em <b>Editar</b>.</li>
<li>Clique em <strong>Usu&aacute;rio</strong> para visualizar privil&eacute;gios individuais ou em <strong>Grupo</strong> para visualizar privil&eacute;gios de grupo. </li>
<li>Para cada usu&aacute;rio ou grupo, marque <strong>Permitir</strong> para permitir acesso ou <strong>Negar</strong> para negar acesso ao aplicativo selecionado. Dependendo do aplicativo, voc&ecirc; tamb&eacute;m pode selecionar <strong>Por IP</strong> para permitir/negar acesso com base no endere&ccedil;o IP.</li>
<li>Clique em <strong>OK</strong> para salvar suas altera&ccedil;&otilde;es.</li>
</ol>

<h4>Para visualizar os privil&eacute;gios de aplicativos de usu&aacute;rios que possuem diferentes endere&ccedil;os IP de rede:</h4>
<ol>
<li>V&aacute; at&eacute; <strong>Painel de controle</strong> &gt; <strong>﻿Privil&eacute;gios</strong>.</li>
<li> Clique em <strong>Visualizador de permiss&atilde;o</strong>.</li>
<li>Selecione um usu&aacute;rio em <strong>Nome de usu&aacute;rio</strong> e digite o endere&ccedil;o IP cujas permiss&otilde;es voc&ecirc; deseja visualizar em <strong>Endere&ccedil;o IP</strong>. </li>
</ol>

<h4>Para definir os privil&eacute;gios de aplicativos padr&atilde;o para todos os usu&aacute;rios:</h4>
<ol>
<li>V&aacute; at&eacute; <strong>Painel de controle</strong> &gt; <strong>﻿Privil&eacute;gios</strong>.</li>
<li>Selecione o aplicativo que voc&ecirc; deseja modificar. Clique em <b>Editar</b>.</li>
<li>Clique em <strong>Privil&eacute;gios padr&atilde;o</strong> e marque <strong>Conceder este privil&eacute;gio a todos</strong>. </li>
<li>Clique em <strong>OK</strong> para salvar suas altera&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Os privil&eacute;gios das contas <b>admin</b> e <b>guest</b> n&atilde;o podem ser modificados aqui.</li>
<li>Quando encontrar conflitos de privil&eacute;gios, a prioridade de privil&eacute;gios &eacute; a seguinte: Negar &gt; Permitir.</li>
<li>Nem todos os pacotes e servi&ccedil;os s&atilde;o compat&iacute;veis com configura&ccedil;&otilde;es de privil&eacute;gio de acesso <strong>Por IP</strong>.</li>
</ul>
</div>
</body>
</html>