<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Firewall</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_firewall"></a>Permitir / Negar</h2>
<p>
O firewall integrado pode impedir logins n&atilde;o autorizados e acesso aos servi&ccedil;os de controle. Al&eacute;m disso, voc&ecirc; pode escolher entre permitir ou negar acesso a certas portas de rede de endere&ccedil;os IP espec&iacute;ficos.</p>
<h4>Para criar uma regra de firewall:</h4>
<ol>
<li>V&aacute; para <b>Painel de controle</b> &gt; <b>Firewall</b> e selecione a interface de rede da coluna da esquerda de acordo com seu tipo de conex&atilde;o de rede.</li>
<li>Clique em <b>Criar</b>.</li>
<li>Na se&ccedil;&atilde;o <b>Portas</b>, selecione uma das seguintes op&ccedil;&otilde;es para a regra:</li>
<ul>
<li>Escolha <b>Todos</b> para aplicar as regras a todas as portas.</li>
<li>Escolha <b>Selecionar em uma lista de aplicativos integrados</b>.</li>
<li>Escolha <b>Personalizado</b> e clique em <b>Personalizado</b> e digite at&eacute; 15 portas separadas por v&iacute;rgulas, ou especifique um intervalo de porta.</li>
<li class="no">
Voc&ecirc; tamb&eacute;m pode especificar os protocolos.
</li>
</ul>
<li>Na se&ccedil;&atilde;o <b>IP de origem</b>, selecione uma das seguintes op&ccedil;&otilde;es para a regra:</li>
<ul>
<li>Escolha <b>Todos</b> para permitir ou negar a todos os endere&ccedil;os IP.</li>
<li>Digite um <b>Endere&ccedil;o IP de Host &uacute;nico</b>.</li>
<li>Digite uma <b>Subrede</b>. </li>
</ul>
<li>Na se&ccedil;&atilde;o <b>A&ccedil;&atilde;o</b>, selecione uma das seguintes op&ccedil;&otilde;es para a regra:</li>
<ul>
<li>Selecione <b>Permitir</b> para permitir o acesso de acordo com as configura&ccedil;&otilde;es de IP de origem e portas acima.</li>
<li>Selecione <b>Negar</b> para negar o acesso de acordo com as configura&ccedil;&otilde;es de IP de origem e portas acima.</li>
</ul>
</ol>
<p>
Voc&ecirc; poder&aacute; ver a regra de firewall criada na lista de regras.
</p>
<h4>Para excluir as regras do firewall, fa&ccedil;a o seguinte:</h4>
<ul>
<li>desmarque a caixa de sele&ccedil;&atilde;o da regra na coluna <b>Ativado</b> da lista</li>
<li>Exclua a regra do firewall</li>
</ul>
<p>
Voc&ecirc; tamb&eacute;m pode escolher <b>Permitir acesso</b> ou <b>Negar acesso</b> na parte inferior da lista de regras para permitir ou negar o acesso que n&atilde;o corresponda a nenhuma regra.
</p>
<ol>
<span class="note_head">Nota:</span>
<li>Você pode criar até 100 regras para uma interface de rede e pode reordenar as regras da lista arrastando e soltando.</li>
<li>As regras são priorizadas de acordo com as suas posições da lista.</li>
<li>Se o sistema tem várias portas de rede conectadas à mesma sub rede, as regras de firewall podem não funcionar corretamente.* </li>
<li>Quando se combinam múltiplas portas LAN com link aggregation, o firewall aplicará as regras da primeira interface de rede e reservará as regras da segunda interface de rede.</li>
</ol>
<p>____<br> * Aplicável apenas para modelos específicos.</p>
</body>
</html>
