<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Configura&ccedil;&atilde;o do roteador</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="router"></a>Configura&ccedil;&atilde;o do roteador</h2>
<p>Se seu dispositivo DiskStation estiver em uma rede de &aacute;rea local, outros dispositivos na Internet n&atilde;o poder&atilde;o conectar a ele.&Eacute; poss&iacute;vel regras de encaminhamento de portas em <strong>Painel de Controle</strong> &gt; <strong>Acesso Externo</strong> &gt; <strong>Configura&ccedil;&atilde;o de Roteador</strong> para deixar seu dispositivo DiskStation acess&iacute;vel na Internet.</p>
<h3><a name="leaf_routerconf"></a>Configurar roteador</h3>
<p>
Antes de adicionar regras de encaminhamento de portas, &eacute; necess&aacute;rio configurar uma conex&atilde;o entre o dispositivo DiskStation e o roteador.
</p>
<div class="section">
<h4>Nota:</h4>
<ol>
<li>
Para configurar as regras de encaminhamento de porta e atribuir endere&ccedil;os IP est&aacute;ticos, voc&ecirc; precisa ter privil&eacute;gios administrativos para o roteador.
</li>
<li>
Antes de configurar a conex&atilde;o do dispositivo DiskStation com um roteador UPnP, certifique-se de que o DSM tenha recuperado o endere&ccedil;o IP externo com &ecirc;xito do DiskStation (em <b>Painel de Controle</b> &gt; <b>Acesso Externo</b> &gt; <strong>DDNS</strong>).Caso contr&aacute;rio, verifique as configura&ccedil;&otilde;es da rede e do firewall de seu dispositivo DiskStation e do roteador UPnP.
</li>
</ol>
</div>
<p>Para configurar a conex&atilde;o do dispositivo DiskStation com seu roteador:
<ol>
  <li>
Clique em <b>Configurar roteador</b> para abrir o assistente de configura&ccedil;&atilde;o.O DSM come&ccedil;ar&aacute; testando os seguintes componentes/configura&ccedil;&otilde;es de rede antes de avan&ccedil;ar para a pr&oacute;xima etapa.
    <ul>
<li>Interface de rede</li>
<li>Conex&atilde;o do gateway</li>
<li>Conex&atilde;o com a Internet</li>
<li>Encaminhamento de porta</li>
<li>DNS</li>
  </ul>
  </li>
<li>Dependendo do tipo do seu roteador, realize o seguinte:
</li>
<ul>
<li>
Se o seu roteador n&atilde;o suportar UPnP, consulte a etapa 3.
</li>
<li>
Se o seu roteador UPnP foi testado e for compat&iacute;vel com o dispositivo DiskStation, clique em <b>Aplicar</b> ap&oacute;s observar o resumo das informa&ccedil;&otilde;es do roteador.A conex&atilde;o do dispositivo DiskStation para o roteador est&aacute; configurada com &ecirc;xito.
</li>
<li>
Se voc&ecirc; tiver um roteador UPnP sem comprova&ccedil;&atilde;o de compatibilidade com o dispositivo DiskStation, realize uma das seguintes a&ccedil;&otilde;es:</li>
<ul>
<li>
Se voc&ecirc; quiser configurar a conex&atilde;o automaticamente para o roteador, selecione <b>Autom&aacute;tico</b> e clique em <b>Avan&ccedil;ar</b> para que o sistema execute o teste de compatibilidade:</li>
<ul>
<li>
Se o roteador for compat&iacute;vel com o servi&ccedil;o de configura&ccedil;&atilde;o do roteador do dispositivo DiskStation, marque a caixa de sele&ccedil;&atilde;o para enviar o relat&oacute;rio de teste para ajudar a Synology a atualizar o banco de dados de compatibilidade do roteador e depois clique em <b>Aplicar</b>.A conex&atilde;o do dispositivo DiskStation para o roteador est&aacute; configurada com &ecirc;xito.
</li>
<li>
Se o roteador n&atilde;o for compat&iacute;vel com o servi&ccedil;o de configura&ccedil;&atilde;o do roteador do dispositivo DiskStation, marque a caixa de sele&ccedil;&atilde;o para enviar o relat&oacute;rio de teste para ajudar a Synology a atualizar o banco de dados de compatibilidade do roteador e depois clique em <b>Fechar</b> para sair do assistente de configura&ccedil;&atilde;o.
</li>
<div class="section">
<h4>Nota:</h4>
<p>Se o roteador n&atilde;o for compat&iacute;vel, voc&ecirc; ainda poder&aacute; configurar as regras de encaminhamento de portas na interface de usu&aacute;rio do roteador.Consulte <a href="http://www.synology.com/tutorials/how_to_internet.php?#t3.10" target="_blank">aqui</a> para obter mais informa&ccedil;&otilde;es.</a></p> 
</div>
</ul>
<li>
Se voc&ecirc; quiser configurar manualmente a conex&atilde;o para o roteador, selecione <b>Manual</b>, clique em <b>Avan&ccedil;ar</b> e consulte a etapa 3.
</li>
</ul>
</ul>
<li>
Se for exigido que voc&ecirc; configure manualmente a conex&atilde;o do dispositivo DiskStation com o roteador, fa&ccedil;a o seguinte:
</li>
<ol>
<li>
Escolha seu roteador no menu suspenso <b>Roteador</b>.
</li>
<div class="section">
<h4>Nota:</h4>
<p>Se voc&ecirc; n&atilde;o conseguir encontrar seu roteador aqui, clique em <b>Atualizar Lista</b> para obter a lista mais recente da Synology.</p>
</div>
<li>Configure o protocolo e a porta do seu roteador.O protocolo e a porta variam conforme o modelo do roteador.Se n&atilde;o conseguir conectar usando o <b>Protocolo</b> (HTTP) e <b>Porta</b> (80), consulte a documenta&ccedil;&atilde;o fornecida com o roteador para as configura&ccedil;&otilde;es corretas.</li>
<li>Se seu roteador exigir uma conta personalizada, marque <b>Usar conta personalizada</b> e preencha os campos <b>Conta</b> e <b>Senha</b>.
</li>
<li>
Clique em <b>Aplicar</b> para concluir.
</li>
</ol>
</ol>
<h3>Gerenciamento de regras de encaminhamento de porta</h3>
<p>A regra de encaminhamento de portas pode especificar as portas de destino do seu DiskStation que receber&atilde;o pacotes de portas espec&iacute;ficas do roteador.</p>
<p>Se seu DiskStation se conectar &agrave; Internet atrav&eacute;s de um roteador, clique em <b>Criar</b> para abrir o assistente de configura&ccedil;&atilde;o encaminhamento de portas.</p>
<p>H&aacute; duas maneiras de adicionar regras de encaminhamento de porta:</p>
<ul>
<li>Se quiser criar regras de encaminhamento de porta para servi&ccedil;os de sistema (por exemplo, FTP, Web Station, etc), selecione <b>Aplicativo integrado</b>.</li>
<li>Se desejar criar regras de encaminhamento de portas para outros servi&ccedil;os, selecione <b>Porta personalizada</b>.</li>
</ul>
<p>Voc&ecirc; pode usar a sintaxe a seguir para especificar os n&uacute;meros e o intervalo da porta:</p>
<ul>
<li>Use &quot;-&quot; para descrever o intervalo da porta, por exemplo: 6881-6890.</li>
<li>Use &quot;,&quot; para separar as portas, por exemplo: &ldquo;21,22&rdquo;, &ldquo;21,55536-55663&rdquo;.</li>
</ul>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Cada porta do gateway do roteador pode ser usada apenas para uma regra de envio.Se usar uma porta do roteador para duas ou mais regras isso causar&aacute; conflitos, e uma mensagem de aviso aparecer&aacute; na tela.Voc&ecirc; precisar&aacute; configurar outra porta na regra para evitar conflitos.</li>
<li>Alguns roteadores n&atilde;o permitem o uso de portas personalizadas para o envio de servi&ccedil;os de sistema. </li>
</ul>
</div>
<h4>Para salvar as regras:</h4>
<p>Clique em <b>Salvar</b> ap&oacute;s criar as regras.Caso contr&aacute;rio, as regras n&atilde;o ser&atilde;o aplicadas.</p>
<p>
Ap&oacute;s salvar as regras, voc&ecirc; ter&aacute; de esperar alguns minutos antes que as regras comecem a funcionar, dependendo dos modelos dos roteadores.
</p>
<h4>Par testar se as regras est&atilde;o funcionando ou n&atilde;o:</h4>
<p>Selecione as regras que deseja testar, e clique em <b>Testar Conex&atilde;o</b>.O resultado ser&aacute; exibido na coluna <b>Resultado do Teste de Conex&atilde;o</b>.</p>
<h3>Para configura&ccedil;&atilde;o do roteador sem fio*</h3>
<p>Se seu DiskStation estiver funcionando como um roteador sem fio, as regras de encaminhamento de porta s&atilde;o executadas diretamente pelo DiskStation.</p>
<h4>Para adicionar regras de encaminhamento de porta:</h4>
<ol>
<li>Clique em <b>Criar</b> para abrir a janela de configura&ccedil;&atilde;o. </p>
<li>Especifique o nome do <strong>Servi&ccedil;o</strong>, <strong>Protocolo</strong> (TCP ou UDP), <strong>Endere&ccedil;o IP Privado</strong>,<strong> Porta Privada</strong> e <strong>Porta P&uacute;blica</strong>.Voc&ecirc; pode usar a sintaxe a seguir para especificar os n&uacute;meros e o intervalo da porta:
<ul>
<li>Use &quot;-&quot; para descrever o intervalo da porta, por exemplo: 6881-6890.</li>
<li>Use &quot;,&quot; para separar as portas, por exemplo: &ldquo;21,22&rdquo;, &ldquo;21,55536-55663&rdquo;.</li>
</ul>
<li>Clique em <strong>Criar</strong> na parte inferior para concluir as configura&ccedil;&otilde;es.
</ol>
<div class="section">
<h4>Nota:</h4>
<p>A maioria dos roteadores permite que as portas da m&aacute;quina local e portas do roteador sejam diferentes ao se configurarem as regras de encaminhamento de porta.Se seu roteador suportar esse recurso:</p>
<ul>
<li>Ao salvar uma regra, se a porta do roteador j&aacute; estiver em uso por uma regra existente, uma nova porta do roteador ser&aacute; atribu&iacute;da.</li>
<li>Ao adicionar ou editar regras, voc&ecirc; pode especificar diretamente o n&uacute;mero da porta do roteador.</li>
</ul>
</div>
<h3>DMZ*</h3>
<p>Voc&ecirc; pode habilitar o DMZ em seu DiskStation quando a Configura&ccedil;&atilde;o do Mapa da Rede for o Roteador sem fio.Um host no DMZ pode se conectar diretamente &agrave; rede externa, livre da limita&ccedil;&atilde;o e prote&ccedil;&atilde;o do firewall.Ele geralmente &eacute; usado para a configura&ccedil;&atilde;o de servidores.</p>
<h4>Para habilitar a DMZ:</h4>
<ol>
<li>Clique em <strong>Configura&ccedil;&otilde;es de DMZ</strong> para abrir a janela de configura&ccedil;&atilde;o.</li>
<li>Marque a caixa de verifica&ccedil;&atilde;o <strong>Habilitar DMZ</strong>.</li>
<li>Digite o endere&ccedil;o do DMZ Host IP.</li>
<li>Clique em <strong>Aplicar</strong>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<p>Da rede externa, voc&ecirc; precisar&aacute; de um endere&ccedil;o IP externo recuperado pelo DiskStation para se conectar a um host no DMZ.</p>
</div>
<p>____<br> * Dispon&iacute;vel apenas em certos modelos ou de acordo com seu ambiente.
</p>
</body>
</html>
