
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="wireless"></a>Entrar em Redes Sem Fio*</h2>

<p>Voc&ecirc; pode conectar o dispositivo DiskStation a uma rede sem fio quando o dongle sem fio estiver conectado &agrave; porta USB. V&aacute; para <strong>Painel de Controle</strong> &gt; <strong>Sem Fio</strong> &gt; <strong>Configura&ccedil;&atilde;o de Mapa de Rede</strong> e escolha <strong>Entrar em uma Rede Sem Fio</strong>.</p>


<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Para obter uma lista completa dos dongles sem fio suportados, visitem <a href="https://www.synology.com/compatibility?search_by=category&category=usb_wifi_dongles&p=1&not_recommend_mode=false" target=_blank>www.synology.com</a>.</p>
</div>

<h4>Para configurar uma rede sem fio:</h4>
<p>V&aacute; para a guia <strong>Wi-Fi</strong>. Clique em <b>Configurar uma rede sem fio</b> e escolha entre as seguintes op&ccedil;&otilde;es (se j&aacute; estiver conectado a uma rede sem fio, clique antes em <b>Desconectar</b>).</p>
<ul>
<li><b>Ingressar em uma rede sem fio</b>: O assistente verificar&aacute; os pontos de acesso sem fio ou redes Ad-Hoc dispon&iacute;veis com sua for&ccedil;a de sinal e status de seguran&ccedil;a. Se o ponto de acesso que quiser acessar estiver bloqueado com prote&ccedil;&atilde;o de senha, o assistente pedir&aacute; que voc&ecirc; digite a senha.</li>
<li><b>Conectar a uma rede sem fio oculta</b>: Se o ponto de acesso n&atilde;o transmitir seu SSID (Nome de rede) por motivos de privacidade, ele n&atilde;o ser&aacute; descoberto durante a verifica&ccedil;&atilde;o. Voc&ecirc; pode conectar manualmente a esses pontos de acesso ocultos digitando a informa&ccedil;&atilde;o necess&aacute;ria de forma manual.</li>
<li><b>Criar uma Rede Ad-Hoc</b>: Al&eacute;m da rede de infraestrutura, na qual um ponto de acesso central (AP) conecta a rede sem fio a uma rede Ethernet com cabos, a rede Ad-Hoc tamb&eacute;m &eacute; amplamente usada. Em uma rede Ad-Hoc, todos os dispositivos sem fio dentro do alcance uns dos outros podem comunicar-se do modo ponto a ponto sem um ponto de acesso central. Para configurar uma rede ad-hoc, todos os dispositivos sem fio devem ser configurados para o modo ah-hoc em vez do modo de infraestrutura.</li>
</ul>
<p>____<br> * Dispon&iacute;vel apenas em modelos espec&iacute;ficos. <br></body>
</html>
