<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Bluetooth</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Bluetooth</h1>
<p>Essa p&aacute;gina fornece op&ccedil;&otilde;es para gerenciar adaptadores Bluetooth e conectar dispositivos Bluetooth ao seu DiskStation. Quando conectados, alguns dispositivos Bluetooth, como alto-falantes ou fones de ouvido, podem ser selecionados como sa&iacute;da de &aacute;udio do Audio Station, permitindo que voc&ecirc; ou&ccedil;a facilmente as m&uacute;sicas armazenadas em seu DiskStation.</p>
<h2>Introdu&ccedil;&atilde;o</h2>
<p>Conecte um adaptador Bluetooth USB a uma porta USB do seu DiskStation. Uma lista de adaptadores Bluetooth &eacute; exibida no lado esquerdo da p&aacute;gina principal do Bluetooth. As informa&ccedil;&otilde;es e op&ccedil;&otilde;es relacionadas aos dispositivos Bluetooth s&atilde;o exibidas &agrave; direita.</p>
<h4>Para habilitar ou desabilitar adaptadores Bluetooth:</h4>
<ol>
<li>Selecione um adaptador Bluetooth.</li>
<li>Clique em <strong>Configura&ccedil;&otilde;es avan&ccedil;adas</strong>.</li>
<li>Marque a caixa <strong>Habilitar Bluetooth</strong>.</li>
<li>Clique em <strong>OK</strong> para salvar as configura&ccedil;&otilde;es.</li>
</ol>
<h2>Gerenciamento de dispositivos Bluetooth</h2>
<p>Ao conectar-se a um novo dispositivo Bluetooth, certifique-se de que ele esteja vis&iacute;vel, localizado dentro de 10 metros do DiskStation e use A2DP (Perfil avan&ccedil;ado de distribui&ccedil;&atilde;o de &aacute;udio). Consulte o manual do usu&aacute;rio do dispositivo Bluetooth para obter mais informa&ccedil;&otilde;es sobre a configura&ccedil;&atilde;o.</p>
<h4>Para conectar-se a um dispositivo Bluetooth:</h4>
<ol>
<li>Na p&aacute;gina principal do <strong>Bluetooth</strong>, selecione um dispositivo Bluetooth que voc&ecirc; deseja conectar ao DiskStation. Se o dispositivo n&atilde;o aparecer, tente clicar em <strong>Atualizar</strong> para pesquisar os dispositivos pr&oacute;ximos.</li>
<li>Selecione o dispositivo quando ele aparecer.</li>
<li>Clique em <strong>Conectar</strong>.</li>
<li>Digite o PIN do seu dispositivo se necess&aacute;rio.</li>
</ol>
<h4>Para visualizar as informa&ccedil;&otilde;es do dispositivo Bluetooth:</h4>
<ol>
<li>Selecione um dispositivo Bluetooth conectado.</li>
<li>Clique em <strong>Informa&ccedil;&otilde;es</strong>.</li>
<li>Aparece uma janela exibindo informa&ccedil;&otilde;es tais como endere&ccedil;o, nome, tipo e status do Bluetooth.</li>
</ol>
<h4>Para remover um dispositivo Bluetooth:</h4>
<ol>
<li>Selecione um dispositivo Bluetooth que voc&ecirc; n&atilde;o queira usar mais com o DiskStation.</li>
<li>Clique em <strong>Remover</strong>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Ao reproduzir m&uacute;sica atrav&eacute;s de alto-falantes ou fones de ouvido Bluetooth, voc&ecirc; pode ter problemas de reprodu&ccedil;&atilde;o se as configura&ccedil;&otilde;es do seu adaptador Bluetooth forem modificadas ou se voc&ecirc; se conectar com muitos dispositivos Bluetooth ao mesmo tempo.</li>
<li>Dependendo do dispositivo, se um par de alto-falantes Bluetooth conectados ao seu DiskStation forem conectados posteriormente a outro DiskStation (ou reprodutor de m&uacute;sica Bluetooth), os alto-falantes podem esquecer o seu DiskStation. Nesse caso, ocorrer&aacute; um erro durante a tentativa de reprodu&ccedil;&atilde;o da m&uacute;sica com os alto-falantes. Para resolver esse problema, remova os alto-falantes e tente conect&aacute;-los novamente.</li>
</ul>
</div>
</body>
</html>
