<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DDNS</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>DDNS</h2>
<p>O DDNS (Servi&ccedil;o de Nome de Dom&iacute;nio Din&acirc;mico) simplifica a conex&atilde;o com o DiskStation atrav&eacute;s da Internet mapeando um nome de host com seu endere&ccedil;o IP.Por exemplo, o DDNS permite que voc&ecirc; acesse o DiskStation usando um nome de dom&iacute;nio (ex.: <i>www.john.synology.me</i>), sem necessidade de lembrar um endere&ccedil;o IP (ex.: <i>172.16.254.1</i>).</p>
<h3>Configura&ccedil;&atilde;o do DDNS</h3>
<p>Voc&ecirc; pode apontar um nome de host existente para o endere&ccedil;o IP do DiskStation ou registrar um novo fornecido pela Synology ou v&aacute;rios outros provedores de DDNS.Consulte cada provedor para obter mais informa&ccedil;&otilde;es relativas ao registro do nome de host.
</p>
<h4>Para configurar um nome de host DDNS:</h4>
<ol>
<li>Clique no bot&atilde;o <b>Adicionar</b>.</li>
<li>Uma caixa de di&aacute;logo aparece pedindo que voc&ecirc; edite as seguintes configura&ccedil;&otilde;es:
  <ul>
<li><strong>Provedor de servi&ccedil;os:</strong>Selecione um provedor de servi&ccedil;os.Para se registrar para obter um nome de host gr&aacute;tis fornecido pela Synology, selecione <b>Synology</b> do menu suspenso, clique em <b>Registrar agora</b> e digite os detalhes conforme indicado.</li>
<li><strong>Nome de host:</strong> Digite o nome de host do DDNS registrado, como <i>john.synology.me</i>.</li>
<li><strong>Nome de usu&aacute;rio:</strong> Digite o nome de usu&aacute;rio do provedor de DDNS.</li>
<li><strong>Senha:</strong> Digite a senha do provedor de DDNS.</li>
<li><strong>Endere&ccedil;o externo:</strong> Digite o endere&ccedil;o IP externo do DiskStation que usar&aacute; o nome de host.</li>
<li><strong>Pulsa&ccedil;&atilde;o:</strong> Habilite essa op&ccedil;&atilde;o para receber alertas sobre o status do nome de host mapeado (apenas para nomes de host fornecidos pela Synology).</li>
</ul>
</li>
<li>Clique em <strong>Testar conex&atilde;o</strong> para verificar se as configura&ccedil;&otilde;es est&atilde;o corretas.</li>
<li>Clique em <strong>OK</strong> para salvar e concluir.</li>
</ol>
<p>Ap&oacute;s concluir a configura&ccedil;&atilde;o, voc&ecirc; pode acessar o DiskStation pela Internet digitando o nome de host do DDNS em um navegador de Internet.</p>
<div class="section">
<h4>Requisitos e limita&ccedil;&otilde;es</h4>
<ul> 
<li>Os servidores do provedor de servi&ccedil;o de DDNS devem estar funcionando.</li>
<li>O DiskStation deve ser capaz de se conectar &agrave; Internet.</li>
<li>O DDSN funciona apenas em ambiente de rede onde nenhum servidor proxy seja necess&aacute;rio.</li>
<li>Voc&ecirc; pode digitar apenas um nome de host para cada provedor de DDNS.</li>
</ul>
</div>
<h3>Gerenciamento de nomes de host</h3>
<p>Use os bot&otilde;es a seguir para gerenciar as entradas de nomes de host existentes:</p>
<ul>
<li><strong>Excluir:</strong> Remove a entrada do nome de host selecionada da lista.</li>
<li><strong>Editar:</strong> Altere as configura&ccedil;&otilde;es da entrada de nome de host selecionada.</li>
<li><strong>Atualizar agora:</strong> Atualiza o status de todas as entradas do nome de host que t&ecirc;m o servi&ccedil;o DDNS habilitado.</li></ul>
<h3>Configura&ccedil;&atilde;o do Provedor DDNS personalizado</h3>
<p>Voc&ecirc; pode adicionar um provedor DDNS personalizado se o seu provedor j&aacute; n&atilde;o aparecer na lista de provedores de servi&ccedil;o.</p>
<h4>Para configurar um provedor DDNS personalizado:</h4>
<ol>
<li>Clique em <b>Personalizar</b>.</li>
<li>Uma caixa de di&aacute;logo aparece pedindo que voc&ecirc; digite as seguintes configura&ccedil;&otilde;es:
<ul>
<li><strong>Provedor de servi&ccedil;os:</strong> Digite o nome de seu provedor de servi&ccedil;o personalizado.</li>
<li><strong>URL da consulta:</strong> Digite o URL de seu provedor de servi&ccedil;o personalizado.</li>
  </ul>
</li>
<li>Clique em <strong>Salvar</strong> para adicionar um provedor de servi&ccedil;o personalizado &agrave; lista de provedores de servi&ccedil;o de DDNS.</li>
</ol>
<div class="section">
<h4>Requisitos e limita&ccedil;&otilde;es</h4>
<ul>
<li>O URL da consulta deve seguir o protocolo especificado pelo seu provedor de servi&ccedil;o.Esse URL &eacute; usado para atualizar informa&ccedil;&otilde;es de IP do servidor de DDNS do seu provedor.</li>
<li>Um URL de consulta geralmente cont&eacute;m os quatro par&acirc;metros a seguir.Ao digitar o URL da consulta, substitua os par&acirc;metros a seguir pelas vari&aacute;veis correspondentes.</li>
  <ul>
<li>Nome de usu&aacute;rio:__USERNAME__</li>
<li>Senha:__PASSWORD__</li>
<li>Nome de host:__HOSTNAME__</li>
<li>Endere&ccedil;o externo:__MYIP__</li>
  </ul>
<li>O URL da consulta n&atilde;o pode conter espa&ccedil;os ou pontos e v&iacute;rgulas.</li>
</ul>
</div>
</body>
</html>
