<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="link_aggr"></a>Link Aggregation*</h2>
<p>O DiskStation suporta multi-LAN, o que permite a combina&ccedil;&atilde;o das interfaces de LAN usando a tecnologia Link Aggregation. Link Aggregation aumenta a largura de banda de seu DiskStation agregando v&aacute;rias interfaces de rede e fornece failover de tr&aacute;fego para manter a conex&atilde;o de rede em caso de queda da conex&atilde;o.</p>
<p>Depois de combinar as interfaces de LAN, voc&ecirc; ver&aacute; uma nova interface chamada <b>Bond</b> em <b>Painel de controle</b> &gt; <b>Rede</b> &gt; <b>Interface de rede</b>, que pode ser configurada do mesmo modo que as outras interfaces (como LAN ou PPPoE).</p>


<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Com o Link Aggregation habilitado, o tr&aacute;fego de rede se ajustar&aacute; e se balancear&aacute; automaticamente para cada dispositivo conectado.</li>
<li>Se as interfaces de rede estiverem conectadas a v&aacute;rios switches, certifique-se de que as portas dos switches estejam na mesma LAN ou VLAN.</li>
</ul>
</div>


<h4>Para combinar v&aacute;rias LANs com o Link Aggregation:</h4>
<ol>
<li>V&aacute; at&eacute; <strong>Painel de Controle</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de Rede</strong>. Clique em <strong>Criar</strong> &gt; <strong>Criar Bond</strong>.</li>

<img src="about:blank" class="help_image"/>


<li>Selecione o modo que deseja.

<div class="section">
<h4>Descri&ccedil;&otilde;es de modo:</h4>
<ul>
<li><strong>Adaptive Load Balancing</strong>: Esse moto otimiza o tr&aacute;fego de rede recebido e enviado por seu DiskStation se o switch suportar o Link Aggregation. Para evitar erros inesperados, n&atilde;o habilite o Link Aggregation no switch mesmo quando ele for suportado.</li>
<li><strong>Link Aggregation Din&acirc;mico IEEE 802.3ad</strong>: Esse modo otimiza o tr&aacute;fego de rede recebido e enviado pelo seu DiskStation e requer que o IEEE 802.3ad (Dynamic) Link Aggregation (LACP, 802.1AX) seja habilitado no(s) switch(es). Se v&aacute;rios switches forem usados, eles precisam ser empilh&aacute;veis e configurados adequadamente.</li>
<li><strong>Balance XOR</strong>: Esse modo balanceia o tr&aacute;fego de rede recebido e enviado pelo seu DiskStation e requer que o Link Aggregation est&aacute;tico seja habilitado no(s) switch(es). Se v&aacute;rios switches forem usados, eles precisam ser empilh&aacute;veis e configurados adequadamente. Se o Link Aggregation n&atilde;o for suportado pelo switch, o tr&aacute;fego enviado pelo seu DiskStation ainda pode ser balanceado. Com esse modo, os links perdidos podem ser detectados mas n&atilde;o a causa (ex.: quando os cabos Ethernet forem desconectados ou o switch for desconfigurado).</li>
<li><strong>Ativo/Em espera</strong>: Esse modo fornece ao seu DiskStation toler&acirc;ncia de falha de rede. Isto &eacute;, quando a interface de rede ativa cair, uma das outras portas LAN assumir&aacute; o controle para manter a conex&atilde;o de rede. Voc&ecirc; pode escolher esse modo sem configurar o switch ou com um switch que suporte o IEEE 802.3ad Link Aggregation.</li>
</ul>
</div>
</li>

<img src="about:blank" class="help_image"/>

<li>Selecione as interfaces para criar o Link Aggregation.</li>

<img src="about:blank" class="help_image"/>

<li>Ajuste as configura&ccedil;&otilde;es de IP. Voc&ecirc; tamb&eacute;m pode habilitar o VLAN se necess&aacute;rio. Clique em <b>Aplicar</b> para completar a configura&ccedil;&atilde;o.</li>

<img src="about:blank" class="help_image"/>

<li>Depois de terminar voc&ecirc; pode ver a nova interface nomeada <b>Bond 1</b> na lista de <b>Interfaces de rede</b>.</li>

<img src="about:blank" class="help_image"/>

</ol>

<h4>Para editar as configura&ccedil;&otilde;es do Link Aggregation:</h4>
<ol>
<li>Para alterar o modo Link Aggregation ou visualizar as informa&ccedil;&otilde;es dos dispositivos f&iacute;sicos, v&aacute; para <b>Painel de controle</b> &gt; <b>Rede</b> &gt; <b>Interface de rede</b>.</li>
<li>Selecione a interface <b>Bond 1</b> e clique no bot&atilde;o <b>Editar</b>.</li>

<img src="about:blank" class="help_image"/>

<li>V&aacute; para as guias correspondentes para modificar as configura&ccedil;&otilde;es desejadas.</li>
</ol>

<h4>Para remover o Link Aggregation:</h4>
<ol>
<li>V&aacute; at&eacute; <b>Painel de Controle</b> &gt; <b>Rede</b> &gt; <b>Interface de Rede</b>.</li>
<li>Selecione a interface <b>Bond 1</b> e clique no bot&atilde;o <b>Excluir</b>.</li>

<img src="about:blank" class="help_image"/>

<li>Quando concluir voc&ecirc; ver&aacute; que <b>Bond 1</b> agora foi substitu&iacute;do por duas interfaces LAN.</li>

<img src="about:blank" class="help_image"/>

</ol>

<p>____<br> * Dispon&iacute;vel apenas em modelos espec&iacute;ficos.</p>

</body>
</html>

