
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="pppoe"></a>PPPoE</h2>
<p>Se voc&ecirc; usa um modem DSL ou a cabo para se conectar &agrave; Internet e seu Provedor de Servi&ccedil;os de Internet (ISP) usa PPPoE (Protocolo Ponto a Ponto pela Ethernet), voc&ecirc; pode ativar PPPoE no <strong>Painel de controle</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de Rede</strong> e digitar as informa&ccedil;&otilde;es da conta para se conectar diretamente &agrave; Internet sem o roteador.</p>
<p>Para obter mais informa&ccedil;&otilde;es sobre PPPoE, entre em contato com seu ISP ou administrador de rede.</p>

<h3><a name="ipv6"></a>Configura&ccedil;&atilde;o de IPv6</h3>
<p>Os dispositivos DiskStation suportam os esquemas de pilha dupla IPv4/IPv6. Isto significa que tanto IPv4 quanto IPv6 podem trabalhar em seu DiskStation ao mesmo tempo. A configura&ccedil;&atilde;o padr&atilde;o para IPv6 &eacute; <b>Auto</b>. Selecione uma interface de rede existente, clique no bot&atilde;o <b>Editar</b> e v&aacute; para a guia <b>IPv6</b> para alterar as configura&ccedil;&otilde;es.</p>
<p>At&eacute; o IPv6 suplantar completamente o IPv4, os mecanismos de transi&ccedil;&atilde;o de IPv6 s&atilde;o necess&aacute;rios para permitir que os hosts com endere&ccedil;os IPv4 se conectem a servi&ccedil;os IPv6. Escolha entre os diferentes mecanismos de transi&ccedil;&atilde;o de IPv6:</p>
<ul>
  <li><b>6in4</b>: Conecte-se &agrave; rede IPv6 por meio de um agente de t&uacute;nel. Voc&ecirc; precisar&aacute; preencher <b>Endere&ccedil;o IPv6</b>, <b>Comprimento do Prefixo</b>, <b>Prefixo</b> e <b>Endere&ccedil;o IPv4 do Agente de T&uacute;nel</b>. Isso requer um endere&ccedil;o IPv4 p&uacute;blico.</li><li><b>6to4</b>: Conecte-se &agrave; rede IPv6 por meio de um agente de t&uacute;nel utilizando Anycast. Isso requer um endere&ccedil;o IPv4 p&uacute;blico.</li>
  <li><b>DHCP-PD</b>: Obtenha um prefixo IPv6 do DHCP Server por meio da delega&ccedil;&atilde;o de prefixo com a LAN. Isso requer suporte a ISP e funciona somente em modo de roteador.</li>
</ul>
</body>
</html>
