
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Controle de tr&aacute;fego do roteador</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name=""></a>Controle de tr&aacute;fego do roteador</h2>
<p>
O controle de tr&aacute;fego do roteador &eacute; habilitado quando seu DiskStation estiver no modo roteador. O controle de tr&aacute;fego do roteador (em <strong>Painel de controle</strong> &gt; <strong>Rede</strong> &gt; <strong>Controle de tr&aacute;fego do roteador</strong>) gerencia o tr&aacute;fego de upload e download em execu&ccedil;&atilde;o na rede privada do DiskStation. Ao criar as regras, voc&ecirc; precisa especificar a <strong>Largura de banda garantida</strong> e a <b>Largura de banda m&aacute;xima</b> para limitar o tr&aacute;fego de upload e download.</p>


<div class="section">
<h4>Explica&ccedil;&atilde;o dos termos</h4>
<ul>
<li><b>Largura de banda garantida</b>: Define o tr&aacute;fego de sa&iacute;da que esse servi&ccedil;o garante fornecer quando a largura de banda do sistema inteiro &eacute; suficiente.</li>
<li><b>Largura de banda m&aacute;xima</b>: Define o tr&aacute;fego de sa&iacute;da que esse servi&ccedil;o pode utilizar quando toda a largura de banda do sistema for suficiente e houver <b>Largura de banda restante do sistema</b>. Sugerimos calcular a <b>Largura de banda de sa&iacute;da do sistema</b> primeiro. Depois, certifique-se de que a soma da <b>Largura de banda garantida</b> para cada servi&ccedil;o n&atilde;o seja maior que a <b>Largura de banda de sa&iacute;da de sistema</b>, ou a configura&ccedil;&atilde;o poder&aacute; n&atilde;o funcionar corretamente.</li>
</ul>
</div>
<div class="section">
<h4>Configura&ccedil;&atilde;o da f&oacute;rmula</h4>
<ul>
<li><b>Largura de banda de sa&iacute;da do sistema</b> = Total <b>Largura de banda garantida</b> de todos os servi&ccedil;os + a <b>Largura de banda restante do sistema</b></li>
<li><b>Largura de banda garantida</b> de cada servi&ccedil;o ≤ <b>Largura de banda m&aacute;xima</b> de cada servi&ccedil;o
</li>
</ul>
</div>

<div class="section">
<h4>Nota:</h4>
<p>Se os pacotes de sa&iacute;da n&atilde;o corresponderem a nenhuma regra de controle de tr&aacute;fego do roteador, o comportamento padr&atilde;o ser&aacute; sem limite. Voc&ecirc; pode adicionar sua pr&oacute;pria regra de controle de tr&aacute;fego padr&atilde;o do roteador no final de todas as regras selecionando <b>Todas</b> as portas e especificando a <b>Largura de banda garantida</b> e a <b>Largura de banda m&aacute;xima</b>.</p>
</div>


<h4>Para criar uma regra de controle de tr&aacute;fego do roteador:</h4>
<ol>

<li>Selecione uma interface de rede no menu suspenso no canto superior direito.</li>

<li>Clique em <b>Criar</b>.</li>
<li>Na se&ccedil;&atilde;o <b>Portas</b>, selecione uma das op&ccedil;&otilde;es a seguir:
	<ul>
		<li>Escolha <b>Todas</b> para aplicar a regra a todas as portas.</li>
		<li>Selecione <b>Personalizada</b> e clique em <b>Personalizada</b>. Insira at&eacute; 15 portas separadas por v&iacute;rgula ou especifique um intervalo de portas para aplicar essa regra.</li>
		<li class="no">Voc&ecirc; tamb&eacute;m pode especificar o protocolo.</li>
	</ul>
</li>
<li>Na se&ccedil;&atilde;o <b>IP de origem</b>, selecione uma das op&ccedil;&otilde;es a seguir:
	<ul>
		<li>Selecione <b>Todas</b> para aplicar essa regra a todos os endere&ccedil;os IP.</li>
		<li>Selecione <b>IP Espec&iacute;fico</b> e clique em <strong>Selecionar</strong>. Voc&ecirc; pode especificar um endere&ccedil;o IP ou faixa de IP para aplicar essa regra.</li>
	</ul>
</li>
</ol>
<p>
Agora voc&ecirc; poder&aacute; ver a regra de controle de tr&aacute;fego do roteador criada na lista de regras. </p>
<h4>Para excluir as regras de controle de tr&aacute;fego do roteador, execute uma das seguintes a&ccedil;&otilde;es:</h4>
<ul>
<li>Desmarque a caixa de sele&ccedil;&atilde;o da regra na coluna <b>Habilitado</b> da lista.</li>
<li>Exclua a regra de controle de tr&aacute;fego do roteador.</li>
</ul>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Voc&ecirc; pode criar at&eacute; 100 regras para cada interface de rede. </li>
<li>Arraste e solte para reorganizar as regras na lista.</li>
<li>As regras s&atilde;o priorizadas de acordo com as suas posi&ccedil;&otilde;es na lista.</li>
<li>As portas especificadas referem-se aos n&uacute;meros de porta de servi&ccedil;os de Internet fora da rede local.</li>
<li>Os IPs de origem referem-se aos endere&ccedil;os IP dos dispositivos que usam o Synology NAS como roteador.</li>
</ul>
</div>
</body>
</html>
