
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Rede</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Geral</h2>

<p>Op&ccedil;&otilde;es de rede gen&eacute;ricas como gateway padr&atilde;o, DNS Server, proxy e tunelamento de IPv6 est&atilde;o dispon&iacute;veis em <strong>Painel de Controle</strong> &gt; <strong>Rede</strong> &gt; <strong>Geral</strong>.</p>


<h3>Renomear Dispositivo DiskStation</h3>
<p>Para renomear o nome do dispositivo DiskStation, digite o novo nome do servidor e clique em <b>Aplicar</b>.</p>
<p>O nome de servidor n&atilde;o diferencia mai&uacute;sculas de min&uacute;sculas e pode estar na faixa de 1 a 15 caracteres, que podem consistir em letras, n&uacute;meros, sublinhados e o sinal de menos. O primeiro caractere do nome deve ser uma letra.</p>


<h3>Especifica&ccedil;&atilde;o do Gateway Padr&atilde;o</h3>
<p>Apenas digite o endere&ccedil;o IP do gateway padr&atilde;o e clique em <b>Aplicar</b> para salvar a configura&ccedil;&atilde;o.</p>


<h3>Especifica&ccedil;&atilde;o do Endere&ccedil;o IP do DNS Server</h3>
<p>Voc&ecirc; pode escolher configurar manualmente o endere&ccedil;o IP do seu servidor DNS. Nesse caso, o endere&ccedil;o IP de seu servidor DNS preferido deve ser digitado. Um endere&ccedil;o IP do servidor DNS alternativo tamb&eacute;m pode ser digitado, fornecendo backup se o servidor DNS preferido apresentar problemas. Quando os endere&ccedil;os IP do servidor DNS estiverem configurados como desejado, clique em <strong>Aplicar</strong> para salvar as configura&ccedil;&otilde;es.</p>


<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Os campos servidor DNS e gateway padr&atilde;o ser&atilde;o definidos automaticamente e n&atilde;o podem ser alterados quando todas as interfaces de rede forem configurados automaticamente ou quando voc&ecirc; estiver usando uma conex&atilde;o PPPoE.</p>
</div>



<h3><a name="proxy"></a>Conex&atilde;o via Servidor Proxy</h3>
<p>Para habilitar seu dispositivo DiskStation para se conectar via servidor proxy, marque <b>Conectar-se por um servidor proxy</b>, digite o <b>Endere&ccedil;o</b> e a <b>Porta</b> e clique em <b>Aplicar</b>.</p>


<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Clique em <strong>Configura&ccedil;&otilde;es Avan&ccedil;adas</strong> para configurar o proxy HTTP, proxy HTTPS e as informa&ccedil;&otilde;es de autentica&ccedil;&atilde;o.<li>Por padr&atilde;o, as configura&ccedil;&otilde;es de proxy HTTPS s&atilde;o as mesmas que as do proxy HTTP.</li>
<li>Se a op&ccedil;&atilde;o <b>Conectar-se por um servidor proxy</b> estiver marcada, o DSM Update e o Centro de Pacotes, juntamente com alguns outros pacotes, sempre ir&atilde;o se conectar &agrave; Internet por um proxy.</li>
<li>Se o <b>Servidor proxy para endere&ccedil;os locais</b> estiver marcado, verifique se o DNS server usado pelo DiskStation pode atender consultas para dispositivos na rede local.</li>
</ul>
</div>


<h3>Habilitar Tunelamento de IPv6</h3>
<p>At&eacute; o IPv6 suplantar completamente o IPv4, o tunelamento de IPv6 &eacute; necess&aacute;rio para permitir que os hosts com endere&ccedil;os IPv6 se conectem a servi&ccedil;os IPv4. Essa t&eacute;cnica fornece uma maneira de transportar tr&aacute;fego IPv6 em redes IPv4 existentes.<br> Se n&atilde;o tiver certeza sobre como configurar IPv6 ou se tiver problemas de conex&atilde;o, entre em contato com o Provedor de servi&ccedil;os de Internet.</p>
<h4>Para habilitar o IPv6 Tunnel:</h4>
<ol>
<li>Marque a caixa de sele&ccedil;&atilde;o <b>Ativar tunnel</b> para ativar o suporte ao tunnel.</li>

<li>Em <b>Endere&ccedil;o do servidor</b>, digite o nome de host ou o IP do provedor de servi&ccedil;os de tunnel, por exemplo: anonymous.freenet6.net.</li>

<li>Escolha se quer <b>Conectar anonimamente</b> ou <b>Conectar com uma conta existente</b>.</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>O endere&ccedil;o IPv6 externo pode ser atualizado automaticamente pelo provedor de servi&ccedil;os. Entretanto, o dispositivo DiskStation n&atilde;o remover&aacute; imediatamente o endere&ccedil;o IPv6 antigo.</p>
</div>



</body>
</html>
