<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="router"></a>Porta do roteador</h2>

<p>Se voc&ecirc; deseja que os servi&ccedil;os da Internet (como Google Docs ou Pixlr) acessem o seu DiskStation, pode especificar o nome de host externo p&uacute;blico e o n&uacute;mero da porta em <strong>Painel de Controle</strong> &gt; <strong>Acesso externo</strong> &gt; <strong>Avan&ccedil;ado</strong>.</p>

<p> Por padr&atilde;o, o nome de host &eacute; o seu endere&ccedil;o p&uacute;blico de IP (ou o nome de host configurado no <strong>Painel de Controle</strong> &gt;<strong>Acesso externo</strong> &gt; <strong>DDNS</strong>) e o n&uacute;mero da porta &eacute; 5000 (ou 5001 para as conex&otilde;es HTTPS). No entanto, se voc&ecirc; tiver outro nome de host que n&atilde;o est&aacute; configurado na p&aacute;gina do <strong>DDNS</strong>, ou se especificou um n&uacute;mero de porta diferente em seu roteador ao configurar as regras de encaminhamento de porta, ser&aacute; necess&aacute;rio inserir o nome de host ou os n&uacute;meros da porta do roteador para garantir que os arquivos que voc&ecirc; compartilhou com os servi&ccedil;os da Internet possam ser acessados com sucesso.</p>


<h4>Para habilitar a configura&ccedil;&atilde;o da porta do roteador:</h4>
<ol>
<li>Digite o nome de host ou o endere&ccedil;o IP p&uacute;blico de seu DiskStation no campo <b>Nome de host ou IP est&aacute;tico</b>.</li>
<li>Digite o n&uacute;mero de porta do roteador que especificou quando configurou a regra de encaminhamento de porta do DSM no roteador nos campos <b>DSM (HTTP)</b> ou <b>DSM (HTTPS)</b>.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>

</body>
</html>

