<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
content="text/html; charset=UTF-8">
<title>Bloqueio autom&aacute;tico</title> 

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Bloqueio autom&aacute;tico</h2>
<p>O bloqueio autom&aacute;tico permite evitar o logon n&atilde;o autorizado. Ap&oacute;s ativar o servi&ccedil;o, se um endere&ccedil;o IP tiver muitas falhas em tentativas de logon ele ser&aacute; bloqueado. Falhas de tentativa de login via SSH, Telnet, rsync, Backup de rede, Sincroniza&ccedil;&atilde;o de pasta compartilhada, FTP, WebDAV, aplicativos m&oacute;veis Synology, File Station ou DSM ir&atilde;o se somar. Voc&ecirc; tamb&eacute;m pode ter uma Lista permitida que inclua os endere&ccedil;os IP que nunca ser&atilde;o bloqueados.</p>
<h4>Para configurar o bloqueio autom&aacute;tico:</h4>
<ol>
<li>V&aacute; para a guia <strong>Geral</strong> e marque <b>Habilitar bloqueio autom&aacute;tico</b>.</li>
<li>Digite um n&uacute;mero para <b>Tentativas de logon</b> e <b>Dentro de (minutos)</b> para bloquear um endere&ccedil;o IP depois do n&uacute;mero definido de falhas em tentativas de logon dentro do n&uacute;mero de minutos especificado.</li>
<li>Marque <b>Ativar expira&ccedil;&atilde;o do bloqueio</b> e digite um n&uacute;mero para remover um endere&ccedil;o IP bloqueado depois do n&uacute;mero de dias especificado.  Endere&ccedil;os IP bloqueados permanecer&atilde;o indefinidamente na lista de bloqueio at&eacute; que seja removido manualmente da lista, caso esta op&ccedil;&atilde;o n&atilde;o seja selecionada ou se <b>Desbloquear depois de (dias)</b> for definido como 0.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>
<h4>Para adicionar endere&ccedil;os IP bloqueados:</h4>
<p>Clique na guia <strong>Lista de bloqueio</strong> e selecione um dos seguintes no menu suspenso <strong>Criar</strong>:</p>
<ul>
<li><strong>Adicionar endere&ccedil;o IP</strong></li>
<p>Digite um endere&ccedil;o IP e defina o tempo de expira&ccedil;&atilde;o.<p/>
<li><strong>Importar lista de endere&ccedil;o IP</strong></li>
<p>Importe um arquivo texto que liste os endere&ccedil;os IP para adicionar um n&uacute;mero de endere&ccedil;os IP e definir o tempo de expira&ccedil;&atilde;o ao mesmo tempo. Marque a caixa de sele&ccedil;&atilde;o adequada se desejar sobrescrever os endere&ccedil;os IP existentes. Se essa op&ccedil;&atilde;o n&atilde;o estiver selecionada, os endere&ccedil;os IP duplicados ser&atilde;o ignorados.</p>
<p>Para importar um arquivo, ele deve atender os seguintes crit&eacute;rios:</p>
<ul>
<li>O arquivo deve ser um arquivo de texto sem formata&ccedil;&atilde;o.</li>
<li>Cada linha do arquivo pode conter apenas um endere&ccedil;o IP.</li>
<li>As linhas de coment&aacute;rio come&ccedil;am com o s&iacute;mbolo #.</li>
<p>Se o arquivo selecionado tiver um formato correto, voc&ecirc; ver&aacute; todos os endere&ccedil;os IP na &aacute;rea de visualiza&ccedil;&atilde;o. Clique em <strong>OK</strong> para importar.</p>
</ul>
</ul>
<h4>Para remover endere&ccedil;os IP bloqueados:</h4>
<ol>
<li>
Clique na guia <b>Lista de bloqueio</b> para ver a lista de endere&ccedil;os IP bloqueados.
</li>
<li>
Selecione os endere&ccedil;os IP que deseja remover da lista e clique em <b>Remover</b>.
</li>
</ol>
<h4>Para adicionar os endere&ccedil;os IP permitidos:</h4>
<p>Clique na guia <strong>Lista permitida</strong> e selecione um dos seguintes no menu suspenso <strong>Criar</strong>:</p>
<ul>
<li><strong>Adicionar endere&ccedil;o IP</strong></li>
<p>Digitar um endere&ccedil;o de IP.<p/>
<li><strong>Importar lista de endere&ccedil;o IP</strong></li>
<p>Importe um arquivo texto que liste os endere&ccedil;os IP para adicionar um n&uacute;mero de endere&ccedil;os IP ao mesmo tempo. Marque a caixa de sele&ccedil;&atilde;o adequada se desejar sobrescrever os endere&ccedil;os IP existentes. Se essa op&ccedil;&atilde;o n&atilde;o estiver selecionada, os endere&ccedil;os IP duplicados ser&atilde;o ignorados.</p>
<p>Para importar um arquivo, ele deve atender os seguintes crit&eacute;rios:</p>
<ul>
<li>O arquivo deve ser um arquivo de texto sem formata&ccedil;&atilde;o.</li>
<li>Cada linha do arquivo pode conter apenas um endere&ccedil;o IP.</li>
<li>As linhas de coment&aacute;rio come&ccedil;am com o s&iacute;mbolo #.</li>
<p>Se o arquivo selecionado tiver um formato correto, voc&ecirc; ver&aacute; todos os endere&ccedil;os IP na &aacute;rea de visualiza&ccedil;&atilde;o. Clique em <strong>OK</strong> para importar.</p>
</ul>
</ul>
<h4>Para remover endere&ccedil;os IP permitidos:</h4>
<ol>
<li>
Clique na guia <b>Lista permitida</b> para ver a lista de endere&ccedil;os IP permitidos.
</li>
<li>
Selecione os endere&ccedil;os IP que deseja remover da lista e clique em <b>Remover</b>. </li>
</ol>
</body>
</html>
