<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Pasta compartilhada</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Gerenciar permiss&otilde;es avan&ccedil;adas de pasta compartilhada</h2>

<p>A p&aacute;gina em <strong>Painel de controle</strong> &gt; <strong>Pasta compartilhada</strong> &gt; <strong>Editar</strong> &gt; <strong>Avan&ccedil;ado</strong> inclui as op&ccedil;&otilde;es abaixo para ajuste fino das permiss&otilde;es de acesso de uma pasta compartilhada.</p>

<h3>Permiss&otilde;es de compartilhamento avan&ccedil;adas</h3>
<p>As permiss&otilde;es de compartilhamento avan&ccedil;adas oferecem uma camada adicional de controle para gerenciar as permiss&otilde;es de acesso de pastas compartilhadas. Quando ativada, os usu&aacute;rios e grupos podem visualizar ou modificar o conte&uacute;do de uma pasta compartilhada somente se o usu&aacute;rio ou grupo tiver permiss&otilde;es de compartilhamento avan&ccedil;adas <em>e</em> do Windows ACL (localizadas em <strong>Pasta compartilhada</strong> &gt; <strong>Editar</strong> &gt; <strong>Permiss&otilde;es</strong>).</p>

<h4>Para ativar as permiss&otilde;es de compartilhamento avan&ccedil;adas:</h4>

<ol>
<li>Marque a caixa <strong>Ativar permiss&otilde;es de compartilhamento avan&ccedil;adas</strong>.</li>
<li>Clique em <strong>Permiss&otilde;es de compartilhamento avan&ccedil;adas</strong> para modificar essas permiss&otilde;es para a pasta compartilhada. </li>
</ol>

<div class="section">
  <h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>As permiss&otilde;es de compartilhamento avan&ccedil;adas s&atilde;o aplicadas quando um usu&aacute;rio acessa uma pasta compartilhada atrav&eacute;s dos seguintes servi&ccedil;os de arquivo: Windows File Sharing, Apple File Sharing, File Station, FTP e WebDAV.</li>
</ul>
</div>

<h3>Configura&ccedil;&otilde;es avan&ccedil;adas</h3>

<p>Se necess&aacute;rio, voc&ecirc; pode colocar mais restri&ccedil;&otilde;es em usu&aacute;rios quando eles acessam uma pasta compartilhada atrav&eacute;s do File Station, FTP ou WebDAV.</p>
	<ul>
    <li><strong>Desabilitar pesquisa em diret&oacute;rios:</strong> ativar essa op&ccedil;&atilde;o restringe aos usu&aacute;rios a visualiza&ccedil;&atilde;o do conte&uacute;do da pasta compartilhada.</li>
    <li><strong>Desabilitar a modifica&ccedil;&atilde;o de arquivos existentes:</strong> ativar essa op&ccedil;&atilde;o restringe aos usu&aacute;rios a movimenta&ccedil;&atilde;o, exclus&atilde;o ou modifica&ccedil;&atilde;o de arquivos da pasta compartilhada. Observe que os usu&aacute;rios ainda poder&atilde;o ver, baixar/carregar, copiar ou descompactar o conte&uacute;do da pasta compartilhada.</li>
    <li><strong>Desabilitar download de arquivos:</strong> ativar essa op&ccedil;&atilde;o restringe aos usu&aacute;rios fazer download do conte&uacute;do da pasta compartilhada.</li>
    </ul>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Observe que essas restri&ccedil;&otilde;es n&atilde;o se aplicam aos usu&aacute;rios que pertencem ao grupo <strong>administrators</strong>.</p>
</div>
</body>
</html>
