<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;os Web</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="webdav"></a>WebDAV</h2>
<p>O WebDAV &eacute; uma extens&atilde;o do HTTP projetada para permitir que os usu&aacute;rios editem e gerenciem arquivos armazenados em servidores remotos. Quando o servi&ccedil;o WebDAV estiver habilitado, os programas do cliente que suportam WebDAV, tais como certos aplicativos Windows, Mac OS Finder, Navegador de arquivos Linux, poder&atilde;o acessar remotamente o DiskStation como se estivessem acessando uma unidade de rede local.</p>

<h4>Para ativar WebDAV:</h4>
<ol>
<li>Marque a caixa <strong>Habilitar WebDAV</strong> ou <strong>Habilitar conex&atilde;o WebDAV HTTPS</strong> se desejar habilitar as conex&otilde;es WebDAV atrav&eacute;s do HTTPS. A porta padr&atilde;o para WebDAV &eacute; 5005 e WebDAV HTTPS &eacute; 5006.</li>
<li>Clique em <strong>Aplicar</strong></li>
</ol>

<h3>Limite de velocidade</h3>
<p>A habilita&ccedil;&atilde;o do limite de velocidade permite que voc&ecirc; controle a largura de banda m&aacute;xima utiliz&aacute;vel para grupos ou usu&aacute;rios espec&iacute;ficos durante a transfer&ecirc;ncia de arquivos atrav&eacute;s do WebDAV.</p>

<h4>Para ativar o limite de velocidade:</h4>
<ol>
  <li>Marque a caixa <b>Ativar limite de velocidade</b> ou <strong>Ativar limite de velocidade de acordo com uma programa&ccedil;&atilde;o</strong> se deseja implementar um limite de velocidade apenas em momentos espec&iacute;ficos. Esta &eacute; uma configura&ccedil;&atilde;o para todo o servidor e anular&aacute; as configura&ccedil;&otilde;es de usu&aacute;rios e grupos individuais. Escolha <strong>Nenhum limite de velocidade</strong> para desativar as configura&ccedil;&otilde;es de limite de velocidade de todos os usu&aacute;rios e grupos.</li>
  <li>Clique em <strong>Configura&ccedil;&otilde;es do limite de velocidade</strong> para modificar as configura&ccedil;&otilde;es para usu&aacute;rios ou grupos individuais. Para cada usu&aacute;rio e grupo, voc&ecirc; pode selecionar uma das seguintes op&ccedil;&otilde;es:
    <ul>
      <li><strong>Aplicar configura&ccedil;&otilde;es de grupo:</strong> As configura&ccedil;&otilde;es do limite de velocidade ser&atilde;o iguais &agrave;s do grupo ao qual o usu&aacute;rio pertence. </li>
      <li><strong>Nenhum:</strong> Nenhum limite de velocidade ser&aacute; aplicado quando os membros do grupo transferirem arquivos com o servi&ccedil;o.</li>
      <li><strong>Constante:</strong> Um limite de velocidade fixo e constante ser&aacute; aplicado ao usu&aacute;rio ou membros do grupo. Os limites de velocidade de upload e download podem ser especificados nos campos &agrave; esquerda.</li>
      <li><strong>Vari&aacute;vel:</strong> Dois limites de velocidade diferentes podem ser especificados e aplicados ao usu&aacute;rio ou aos membros de grupo, de acordo com uma programa&ccedil;&atilde;o. Clique no bot&atilde;o <strong>Personalizar</strong> para modificar as configura&ccedil;&otilde;es de limite de velocidade e tamb&eacute;m uma programa&ccedil;&atilde;o.</li>
    </ul>
  </li>
  <li>Clique em <b>Aplicar</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para obter mais detalhes sobre a din&acirc;mica do limite de velocidade do grupo, clique <a href="file_group_edit.html">aqui</a>.</li>
<li>Ao configurar o limite de velocidade para um usu&aacute;rio, a se&ccedil;&atilde;o <strong>Resultado</strong> exibe o limite de velocidade real do usu&aacute;rio de acordo com as configura&ccedil;&otilde;es individuais dele e as do grupo. Por exemplo, se o usu&aacute;rio &quot;Achilles&quot; tiver um limite de download individual de 100 KB/s, mas pertence a um grupo com um limite de 500 KB/s, a se&ccedil;&atilde;o <strong>Resultados</strong> mostrar&aacute; &quot;0/500&quot;.</li>
</ul>
</div>

<h3>Configura&ccedil;&otilde;es avan&ccedil;adas</h3>
<p>Clicar no bot&atilde;o <strong>Configura&ccedil;&otilde;es avan&ccedil;adas</strong> permite a modifica&ccedil;&atilde;o das seguintes op&ccedil;&otilde;es:</p>
<ul>
<li><strong>Habilitar Anonymous WebDAV:</strong> Permite que os clientes acessem as pastas compartilhadas usando o nome de usu&aacute;rio &quot;anonymous&quot; ao se conectar atrav&eacute;s do WebDAV. Certifique-se de que o usu&aacute;rio &quot;Anonymous FTP/WebDAV&quot; tenha recebido os privil&eacute;gios de acesso adequados na p&aacute;gina <strong>Pasta compartilhada</strong>.</li>
<li><strong>Habilitar DavDepthInfinity:</strong> Ao usar a ferramenta do cliente, isso permite que os usu&aacute;rios acessem ou excluam arquivos sem restri&ccedil;&otilde;es de tamanho de caminho do arquivo. </li>
<li><strong>Habilitar registro de WebDAV:</strong> Essas op&ccedil;&otilde;es registram os eventos relacionados ao WebDAV. Clique em <strong>Exibir registros</strong> e voc&ecirc; ver&aacute; os registros na janela pop-up.</li>
</ul>

<h2><a name="use"></a>Uso do WebDAV com sistemas operacionais diferentes</h2>
<p>Quando o WebDAV tiver sido habilitado em seu DiskStation, siga as instru&ccedil;&otilde;es abaixo para come&ccedil;ar a acessar arquivos com dispositivos Windows, Mac, Linux ou alguns aplicativos para smarphones da Synology.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Ao se conectar com os servi&ccedil;os WebDAV, sugerimos o uso de um cliente WebDAV com suporte UTF-8 para evitar erros de codifica&ccedil;&atilde;o. </li>
</ul>
</div>

<h3>Para Windows</h3>

<p>Para usu&aacute;rios Windows que gostariam de usar o protocolo WebDAV para acessar arquivos em produtos Synology, sugerimos o uso do BitKinex, um aplicativo de mapeamento de unidades gr&aacute;tis para uso n&atilde;o comercial. Alternativamente, existem v&aacute;rios outros aplicativos de clientes WebDAV dispon&iacute;veis na Internet.</p>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se voc&ecirc; desejar usar <strong>Mapear unidade de rede</strong> do Windows para acessar arquivos em seu DiskStation atrav&eacute;s do WebDAV, obtenha um certificado SSL v&aacute;lido e acesse seu DiskStation atrav&eacute;s de uma conex&atilde;o HTTPS. Ao usar o servi&ccedil;o WebDAV em ambiente Windows, se quiser mudar para outra conta de usu&aacute;rio, precisar&aacute; antes fazer logout do sistema Windows.</li>
</ul>
</div>

<h3>Para Mac</h3>

<p>Para usu&aacute;rios Mac, voc&ecirc; pode conectar-se ao seu DiskStation atrav&eacute;s do WebDAV simplesmente usando o Finder.</p>

<h4>Para usar WebDAV no Mac:</h4>
<ol>
<li>Em seu computador Mac, v&aacute; para <b>Finder</b> &gt; <b>Conectar ao servidor</b>.</li>
<li>No campo<strong> Endere&ccedil;o do Servidor</strong>, digite o endere&ccedil;o IP do seu DiskStation ou o nome do dom&iacute;nio precedido por &quot;http://&quot; e seguido por &quot;:5005&quot; (ou qualquer n&uacute;mero de porta que voc&ecirc; especifique durante a habilita&ccedil;&atilde;o do servi&ccedil;o WebDAV). Por exemplo: <strong>http://pm.synology.com:5005/</strong>.</li>
<li>Digite o seu nome de usu&aacute;rio e a senha DSM.</li>
<li>Clique em <b>Conectar</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>WebDAV suporta Bonjour broadcast.</li>
</ul>
</div>

<h3>Para Linux</h3>

<p>Para usu&aacute;rios Ubuntu ou outros usu&aacute;rios Linux, siga as instru&ccedil;&otilde;es abaixo para acessar os arquivos em seu DiskStation atrav&eacute;s do WebDAV.</p>

<h4>Para usar WebDAV no Ubuntu:</h4>
<ol>
<li>Clique em <b>Locais</b> &gt; <b>Conectar ao servidor</b>.</li>
<li>Selecione <b>WebDAV (HTTP)</b> ou <b>WebDAV (HTTPS)</b> no menu suspenso.</li>
<li>Digite as informa&ccedil;&otilde;es necess&aacute;rias, incluindo localiza&ccedil;&atilde;o do servidor, porta, pasta e conta do usu&aacute;rio. Clique em <b>Conectar</b> para continuar.</li>
<li>Digite sua senha e clique em <b>Conectar</b>.</li>
</ol>
<h4>Para usar WebDAV pela linha de comando Linux:</h4>
<p>Se desejar usar a linha de comando, &eacute; poss&iacute;vel usar o <b>cadaver</b>, um software cliente do WebDAV com linha de comando para configurar o acesso.</p>






<h2>Assinatura de calend&aacute;rios com Clientes CalDAV</h2>
<p>
Voc&ecirc; pode usar clientes CalDAV no computador ou dispositivo m&oacute;vel para assinar calend&aacute;rios armazenados no DiskStation e gerenciar eventos, notas ou tarefas a fazer de calend&aacute;rios. Exemplos de clientes de calend&aacute;rio incluem <a href="http://www.mozilla.org/projects/calendar/sunbird/" target="_blank">Sunbird</a> (Windows, Mac, Linux), <a href="http://blog.chandlerproject.org/" target="_blank">Chandler</a> (Windows, Mac, Linux), Evolution (Linux), ou iCal (dispositivo Mac, iOS).</p>

<h4>Para ativar CalDAV:</h4>
<ol>
<li>Habilite a conex&atilde;o WebDAV ou WebDAV HTTPS primeiro.</li>
<li>
  Marque <b>Ativar CalDAV</b>.
</li>
<li>
Clique em <b>Aplicar</b>.
</li>
</ol>

<h4>Para gerenciar a lista de calend&aacute;rios:</h4>
<ol>
<li>
Clique em <b>Ver lista de calend&aacute;rio</b>.
</li>
<li>Na janela que aparece, fa&ccedil;a uma das seguintes op&ccedil;&otilde;es:
	<ul>
		<li>Se quiser criar um novo calend&aacute;rio, clique em <b>Adicionar</b>, nomeie o novo calend&aacute;rio (por exemplo, &quot;cal1&quot;) e especifique o destino onde o calend&aacute;rio ser&aacute; salvo (por exemplo, a pasta compartilhada &quot;calendar&quot;) e clique em <b>OK</b>.</li>
		<li>Se desejar alterar o nome e o destino do calend&aacute;rio, selecione-o na lista de calend&aacute;rios, clique em <b>Editar</b> para fazer as altera&ccedil;&otilde;es e clique em <b>OK</b>.</li>
		<li>Se desejar excluir o calend&aacute;rio do DiskStation, selecione-o na lista de calend&aacute;rios e clique em <b>Excluir</b>.</li>
	</ul>
</li>
<li>Clique em <b>Fechar</b>.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Os calend&aacute;rios armazenados no DiskStation ser&atilde;o exibidos como uma pasta no DiskStation.</li>
</ul>
</div>

<h4>Para assinar seu calend&aacute;rio com um aplicativo cliente (usando Sunbird como exemplo):</h4>
<ol>
<li>
<a href="http://www.mozilla.org/projects/calendar/sunbird/" target="_blank">Fa&ccedil;a Download</a> e instale o Sunbird no computador.
</li>
<li>
V&aacute; para <b>Arquivo</b> &gt; <b>Assinar calend&aacute;rio remoto</b>.
</li>
<li>
Na janela que aparece, escolha <b>Na Rede</b> e clique em <b>Avan&ccedil;ar</b>.
</li>
<li>
Escolha <b>CalDAV</b>, digite <b>http://DiskStation_DDNS_Hostname:WebDAV_Port_Number/Calendar_Location/Calendar_Name</b> no campo <b>Localiza&ccedil;&atilde;o</b> (por exemplo: &quot;http://demo.no-ip.info:5005/calendar/cal1&quot;) e clique em <b>Avan&ccedil;ar</b>.
</li>
<li>
D&ecirc; um nome ao calend&aacute;rio e clique em <b>Avan&ccedil;ar</b>.
</li>
<li>
Digite seu nome de usu&aacute;rio e senha do DSM para autentica&ccedil;&atilde;o, clique em <b>OK</b> e clique em <b>Conclu&iacute;do</b>.
</li>
</ol>
<h4>Para assinar seu calend&aacute;rio com um dispositivo m&oacute;vel (usando o dispositivo iOS como exemplo):</h4>
<ol>
<li>
No seu dispositivo iOS, v&aacute; para <b>Configura&ccedil;&otilde;es</b> &gt; <b>Mail, Contatos, Calend&aacute;rios</b>.
</li>
<li>
Em <b>Contas</b>, v&aacute; para <b>Adicionar Conta</b> &gt; <b>Outros</b> e toque em <b>Adicionar Conta CalDAV</b>.
</li>
<li>
Nos campos, digite o endere&ccedil;o IP (ou nome de dom&iacute;nio) de DiskStation e suas credenciais de usu&aacute;rio e toque em <b>Avan&ccedil;ar</b>. Se surgir uma mensagem, toque em <b>Continuar</b>.
</li>
<li>
Toque em <b>Configura&ccedil;&otilde;es Avan&ccedil;adas</b> e fa&ccedil;a o seguinte:
	<ol>
		<li>Digite <b>5005</b> (ou qualquer outro n&uacute;mero de porta que tenha especificado ao habilitar WebDAV) no campo <b>Porta</b>.</li>
		<li>Modifique a URL no campo <b>URL da Conta</b> para <b>http://DiskStation_DDNS_Hostname:WebDAV_Port_Number/Calendar_Location/Calendar_Name</b> (por exemplo: &quot;http://demo.no-ip.info:5005/calendar/cal1&quot;).</li>
		<li>Toque em <b>CalDAV</b>.</li>
	</ol>
</li>
<li>
Toque em <b>Avan&ccedil;ar</b> para verificar as informa&ccedil;&otilde;es da sua conta e toque em <b>Salvar</b> para concluir a configura&ccedil;&atilde;o da conta.
</li>
<li>
Volte &agrave; tela inicial do seu dispositivo iOS e abra <b>Calend&aacute;rio</b> para gerenciar seu calend&aacute;rio.
</li>
</ol>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para obter mais informa&ccedil;&otilde;es sobre como gerenciar eventos, notas ou tarefas a fazer de calend&aacute;rios, consulte os documentos da Ajuda de cada aplicativo cliente.</li>
</ul>
</div>

 

</body>
</html>
