<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>FTP/FTPS</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>FTP/FTPS</h2>

<p>Em <strong>Painel de controle</strong> &gt; <strong>Servi&ccedil;os de arquivos</strong> &gt; <strong>FTP</strong> voc&ecirc; pode ativar os servi&ccedil;os FTP para permitir que os clientes acessem pastas e dados no sistema. Antes de habilitar o FTP, certifique-se de que as seguintes portas TCP de seu roteador estejam sendo enviadas para o dispositivo DiskStation: 21 (conex&atilde;o de controle padr&atilde;o), 20 (conex&atilde;o de dados para o modo ativo) e 55536-55567 (conex&atilde;o de dados para o modo passivo).</p>

<h4>Para ativar o servi&ccedil;o FTP:</h4>
<ol>
<li>Habilite um dos seguintes itens:
	<ul>
		<li><b>Habilitar servi&ccedil;o FTP (Sem criptografia):</b> Esse &eacute; o protocolo de rede padr&atilde;o usado para transferir arquivos. O FTP n&atilde;o fornece nenhuma criptografia para proteger informa&ccedil;&otilde;es durante as sess&otilde;es de transfer&ecirc;ncia como senhas, nomes de usu&aacute;rio ou arquivos. Entretanto, as velocidades de transfer&ecirc;ncia s&atilde;o mais r&aacute;pidas e exige menos recursos do sistema.</li>
		<li><b>Habilitar servi&ccedil;o de criptografia FTP SSL/TLS (FTPS):</b> Uma continua&ccedil;&atilde;o do FTP padr&atilde;o com o suporte adicional dos protocolos de criptografia Transport Layer Security (TLS) e Secure Sockets Layer (SSL), que protegem as informa&ccedil;&otilde;es durante as sess&otilde;es de transfer&ecirc;ncia, como senhas, nomes de usu&aacute;rio ou arquivos. Entretanto, as velocidades de transfer&ecirc;ncia s&atilde;o menores e consome mais recursos do sistema devido &agrave; criptografia.</li>
	</ul>
</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>


<h3>Tempo limite</h3>
<p>O servidor de FTP desconectar&aacute; os usu&aacute;rios ociosos depois do tempo especificado.</p>


<h3>Configura&ccedil;&atilde;o de n&uacute;mero da porta do servi&ccedil;o FTP</h3>
<p>Esta se&ccedil;&atilde;o permite especificar a porta usada para o canal de controle do FTP.</p>
<div class="section">
<h4>Nota:</h4>
<p>O n&uacute;mero de porta padr&atilde;o para o canal de controle do FTP &eacute; 21. Voc&ecirc; pode defini-lo entre 1 e 65535, com exce&ccedil;&atilde;o dos seguintes n&uacute;meros: 20, 22, 23, 25, 80, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002 e portas padr&atilde;o do eMule: 4662 (TCP), 4672 (UDP).</p>
</div>


<h3>Extens&atilde;o de porta de FTP Passivo</h3>
<p>Esta se&ccedil;&atilde;o permite especificar o intervalo de portas usado para as conex&otilde;es do FTP Passivo. Voc&ecirc; pode usar o intervalo padr&atilde;o ou especificar um personalizado. O intervalo de portas pode ser definido entre 1025 e 65535, e pode conter at&eacute; 128 portas.</li>
</p>


<h3>Relatar IP externo no modo PASV</h3>
<p>Quando essa fun&ccedil;&atilde;o estiver ativada, o servidor relatar&aacute; seu endere&ccedil;o IP externo aos clientes FTP. O endere&ccedil;o IP relatado ser&aacute; exibido no registro de conex&atilde;o do cliente FTP. Uma vez ativado, voc&ecirc; pode optar por detectar automaticamente o endere&ccedil;o IP externo ou inserir manualmente o do DiskStation.</p>
<p>Essa op&ccedil;&atilde;o s&oacute; funciona quando o DiskStation estiver por tr&aacute;s de um NAT, e os clientes FTP pertencerem a uma subrede diferente do DiskStation. Na maioria dos casos essa op&ccedil;&atilde;o &eacute; desnecess&aacute;ria, mas se os clientes FTP n&atilde;o conseguirem se conectar ao DiskStation, voc&ecirc; pode ativar esta op&ccedil;&atilde;o e tentar novamente.</p>
<h3>Ativar FXP</h3>
<p>FXP significa Protocolo de troca de arquivos. Ao ativar essa op&ccedil;&atilde;o, o servi&ccedil;o FTP suportar&aacute; a fun&ccedil;&atilde;o de transfer&ecirc;ncia de arquivos de servidor para servidor.</p>

<h3>Habilitar m&oacute;dulo criptogr&aacute;fico FIPS</h3>
<p>FIPS &eacute; suportado no servi&ccedil;o FTPS usando-se o m&oacute;dulo de criptografia validado pelo OpenSSL FIPS 140-2 (Certificado No. 1747). Ao habilitar essa op&ccedil;&atilde;o, os algoritmos de criptografia de seguran&ccedil;a adicionais ser&atilde;o usados pelo servi&ccedil;o FTPS para proporcionar sess&otilde;es mais seguras.</p>


<h3>Modo de transfer&ecirc;ncia ASCII de suporte </h3>
<p>Ative essa op&ccedil;&atilde;o para suportar o modo de transfer&ecirc;ncia ASCII, permitindo que o DiskStation transfira corretamente os arquivos de texto simples no formato ASCII via FTP.</p>


<h3>Codifica&ccedil;&atilde;o UTF-8</h3>
<p>Essa op&ccedil;&atilde;o pode ser usada para ajudar clientes FTP a exibir e manusear arquivos corretamente com nomes de arquivo em v&aacute;rios idiomas. Para atender as necessidades de v&aacute;rios clientes FTP, s&atilde;o fornecidas as tr&ecirc;s op&ccedil;&otilde;es seguintes:
<ul>
<li><strong>Desabilitar</strong>: A codifica&ccedil;&atilde;o UTF-8 n&atilde;o ser&aacute; usada. Essa op&ccedil;&atilde;o destina-se a clientes que usam o Windows File Explorer como um cliente FTP para carregar/baixar arquivos com nomes em v&aacute;rios idiomas. N&atilde;o &eacute; recomendada para uso normal.</li>
<li><strong>Auto</strong>: Deixe que o DSM determine automaticamente como manusear a codifica&ccedil;&atilde;o UTF-8. Essa op&ccedil;&atilde;o &eacute; recomendado para uso normal.</li>
<li><strong>For&ccedil;ar</strong>: For&ccedil;ar usa a codifica&ccedil;&atilde;o UTF-8. Se voc&ecirc; tiver habilitado a codifica&ccedil;&atilde;o UTF-8 em seu cliente FTP e ele ainda n&atilde;o conseguir exibir e manusear corretamente os nomes dos arquivos em v&aacute;rios idiomas, selecione essa op&ccedil;&atilde;o.</li>
</ul>

<h3>Restri&ccedil;&atilde;o na conex&atilde;o</h3>
<p>Esta se&ccedil;&atilde;o inclui as seguintes op&ccedil;&otilde;es:</p>

<ul>
<li><strong>Limitar conex&otilde;es por IP:</strong> Quando esta fun&ccedil;&atilde;o estiver ativada, o servidor limitar&aacute; o n&uacute;mero m&aacute;ximo de conex&otilde;es por IP. Ativar essa fun&ccedil;&atilde;o e a <b>restri&ccedil;&atilde;o de largura de banda de FTP</b> para um gerenciamento eficiente da largura de banda.</li>
<li><strong>Ativar restri&ccedil;&atilde;o de largura de banda de FTP:</strong> Ative esta fun&ccedil;&atilde;o para restringir a largura de banda de uma &uacute;nica conex&atilde;o FTP.</li>
</ul>

<div class="section">

<h4>Nota:</h4>
<ul>
<li>A conta &quot;guest&quot; n&atilde;o pode efetuar login no servidor por FTP.</li>
<li>A configura&ccedil;&atilde;o da p&aacute;gina de c&oacute;digo do computador cliente de FTP deve ser a mesma de DiskStation para acessar os dados corretamente.</li>
<li>Em alguns modelos espec&iacute;ficos, o servi&ccedil;o FTP suporta a conex&atilde;o usando SSL ou TLS.</li>
<li>As configura&ccedil;&otilde;es do firewall do seu cliente FTP e dois servidores FTP devem ser configuradas corretamente ou a fun&ccedil;&atilde;o FXP pode n&atilde;o funcionar bem.</li>
<li>Alguns clientes de FTP, como aqueles que usam o Internet Explorer 8/9, precisam fazer login com seu nome de usu&aacute;rio e senha. Por exemplo: <i>ftp://username:password@your.ftp.com</i>.</li>
</ul>
</div>




</body>
</html>
