<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Servi&ccedil;o de diret&oacute;rio</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Usu&aacute;rios ou grupos de dom&iacute;nio/LDAP</h2>
<p>Se o seu DiskStation tiver ingressado em um servi&ccedil;o de diret&oacute;rio como um dom&iacute;nio Windows ou cliente LDAP, voc&ecirc; pode configurar e modificar a permiss&atilde;o de acesso de usu&aacute;rios ou grupos de dom&iacute;nio/LDAP nas pastas compartilhadas DiskStation e aplicativos DSM e habilitar o servi&ccedil;o de base para todos os usu&aacute;rios do dom&iacute;nio/LDAP.</p>
<h3>Usu&aacute;rios de dom&iacute;nio/LDAP</h3>
<p class="disable-dockerx64">Dependendo do tipo do servi&ccedil;o de diret&oacute;rio em que voc&ecirc; est&aacute; ingressando, clique na guia <strong>Usu&aacute;rios de dom&iacute;nio</strong> ou <strong>Usu&aacute;rios de LDAP</strong> para configurar as permiss&otilde;es da pasta compartilhada e do aplicativo e a cota da capacidade do disco de cada usu&aacute;rio.</p>
<p class="enable-dockerx64">Dependendo do tipo do servi&ccedil;o de diret&oacute;rio em que voc&ecirc; est&aacute; ingressando, clique na guia <strong>Usu&aacute;rios de dom&iacute;nio</strong> ou <strong>Usu&aacute;rios de LDAP</strong> para configurar as permiss&otilde;es da pasta compartilhada e do aplicativo de cada usu&aacute;rio.</p>
<h4>As regras de configura&ccedil;&otilde;es de privil&eacute;gio incluem o seguinte:</h4>
<ul>
<li>Em caso de conflitos de privil&eacute;gio, a prioridade de privil&eacute;gio ser&aacute;: NA &gt; RW &gt; RO.</li>
<li>Visualizar privil&eacute;gio: Os privil&eacute;gios do usu&aacute;rio s&atilde;o mostrados aqui, e isso &eacute; definido baseado nas configura&ccedil;&otilde;es de privil&eacute;gio do usu&aacute;rio e dos grupos dos quais faz parte.</li>
<li>Privil&eacute;gios de grupo: Atribua privil&eacute;gios aos grupos de acesso para acessar pastas compartilhadas.</li>
</ul>
<h3>Base do usu&aacute;rio</h3>
<p>Da mesma forma que os usu&aacute;rios locais, todos os usu&aacute;rios do dom&iacute;nio/LDAP podem acessar sua pr&oacute;pria pasta <b>home</b> atrav&eacute;s de CIFS, AFP, FTP ou File Station. </p>
<p>
Usu&aacute;rios com privil&eacute;gios de administrador podem acessar todas as pastas personalizadas localizadas na pasta compartilhada <b>homes</b>. Todas as pastas base dos usu&aacute;rios est&atilde;o localizadas em uma das sub pastas da pasta chamada &quot;<b>@DH-nome do dom&iacute;nio</b>&quot; (para usu&aacute;rios do dom&iacute;nio) ou &quot;<b>@LH-nome do FQDN</b>&quot; (para usu&aacute;rios do LDAP). O nome da pasta base do usu&aacute;rio &eacute; a conta de usu&aacute;rio mais um n&uacute;mero exclusivo.</p>
<ol>
<span class="note_head">Nota: </span>
<li>Para excluir a pasta compartilhada <span class="bold_general">homes</span>, o servi&ccedil;o de base do usu&aacute;rio deve ser desabilitado primeiro.</li>
<li>A habilita&ccedil;&atilde;o do servi&ccedil;o base para usu&aacute;rios do dom&iacute;nio/LDAP tamb&eacute;m habilitar&aacute; o servi&ccedil;o base para usu&aacute;rios locais se ainda n&atilde;o estiver habilitado.
</li>
</ol> 
<h3>Grupo de dom&iacute;nio/LDAP</h3> 
<p>Dependendo do tipo de servi&ccedil;o de diret&oacute;rio em que voc&ecirc; est&aacute; ingressando, clique na guia <b>Grupo de dom&iacute;nio</b> ou <b>Grupo de LDAP</b> para configurar os privil&eacute;gios de acesso dos grupos de dom&iacute;nio/LDAP &agrave;s pastas compartilhadas. A prioridade de privil&eacute;gios &eacute;: NA &gt; RW &gt; RO.</p> 
</body> </html> 
