<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Servi&ccedil;os de Backup - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Allow other users to back up data from their Synology NAS or rsync-compatible clients to your Synology NAS.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>rsync</h2>
<p>Voc&ecirc; pode permitir outros usu&aacute;rios fa&ccedil;am backup de dados atrav&eacute;s do rsync de um Synology NAS ou clientes compat&iacute;veis com rsync com seu DiskStation.</p>
<h3>Habilita&ccedil;&atilde;o do servi&ccedil;o Time Backup rsync</h3>
<h4>Para habilitar o servi&ccedil;o rsync:</h4>
<p>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Servi&ccedil;os de arquivos</strong> &gt; <strong>rsync</strong>e selecione <strong>Habilitar servi&ccedil;os rsync</strong>.</p>
<h4>Para atribuir privil&eacute;gios de backup rsync:</h4>
<p>Atribua os privil&eacute;gios de backup rsync adequados aos usu&aacute;rios para que esses usu&aacute;rios possam fazer backup dos dados de um Synology NAS ou um rsync compat&iacute;vel com o servidor com o Synology NAS de destino.</p>
<ol>
<li>V&aacute; para <b>Painel de controle</b> &gt; <b>Privil&eacute;gios</b>, clique em <strong>rsync (Sincronização da pasta compartilhada, Backup LUN em modelos suportados)</strong> &gt; <strong>Editar</strong>.</li>
<li>Atribuir privil&eacute;gios <strong>Permitir</strong> para os usu&aacute;rios desejados (usu&aacute;rios do DSM para rsync criptografado ou contas rsync para rsync n&atilde;o criptografado) ou especifique ainda os endere&ccedil;os IP permitidos para usu&aacute;rios espec&iacute;ficos.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<p>Para realizar o backup do rsync de um DiskStation executando uma vers&atilde;o do DSM anterior &agrave; 3.0 ou um cliente que n&atilde;o seja o DiskStation e desejar manter as informa&ccedil;&otilde;es de <b>propriet&aacute;rio</b> e <b>grupo</b> dos dados de origem, precisar&aacute; adicionar as contas rsync no grupo <b>administrators</b> e fazer backup dos dados na pasta compartilhada <b>NetBackup</b>.</p>
</div>
<h3>Habilita&ccedil;&atilde;o das contas rsync</h3>
<p>Se voc&ecirc; realizar o backup rsync de um cliente n&atilde;o Synology NAS, &eacute; necess&aacute;rio criar contas rsync no Synology NAS de destino para que os usu&aacute;rios rsync possam fazer o backup dos dados em seu Synology NAS.</p>
<h4>Para habilitar contas rsync:</h4>
<ol>
<li>V&aacute; para <b>Painel de controle</b> &gt; <b>Servi&ccedil;os de arquivos</b> &gt; <strong>rsync</strong>e selecione <b>Habilitar conta rsync</b>.</li>
<li>Clique em <b>Editar conta rsync</b> para definir os usu&aacute;rios e as senhas correspondentes para autentica&ccedil;&atilde;o.</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se o servi&ccedil;o rsync for criptografado (isto &eacute;, se tiver uma porta de criptografia SSH especificada), o sistema aplicar&aacute; diretamente os nomes de usu&aacute;rio e senhas do usu&aacute;rio do DSM como suas contas rsync.</li>
<li>Se o servi&ccedil;o rsync for criptografado, voc&ecirc; precisar&aacute; criar contas rsync correspondentes para eles.</li>
</ul>
</div>
<h3>Uso da configura&ccedil;&atilde;o rsync personalizada</h3>
<p>&Eacute; poss&iacute;vel personalizar a configura&ccedil;&atilde;o do rsync e configurar privil&eacute;gios do usu&aacute;rio e o destino do backup em seu DiskStation. Outras pessoas podem ent&atilde;o realizar o backup rsync a partir de seus dispositivos DiskStation ou clientes compat&iacute;veis com rsync para pastas compartilhadas de destino (ou &ldquo;m&oacute;dulos de backup&rdquo;) em seu DiskStation.</p>
<h4>Para usar configura&ccedil;&atilde;o rsync personalizada:</h4>
<ol>
<li>Fa&ccedil;a login no seu dispositivo DiskStation atrav&eacute;s de Telnet ou SSH.</li>
<li>Especifique o m&oacute;dulo de backup e os usu&aacute;rios autorizados no arquivo de configura&ccedil;&atilde;o do rsync &ldquo;<b><code>/etc/rsyncd.conf</code></b>&rdquo;. Para obter informa&ccedil;&otilde;es detalhadas, consulte a p&aacute;gina do manual de <b>rsyncd.conf</b> no seu cliente rsync ou <a href="http://rsync.samba.org/ftp/rsync/rsyncd.conf.html" target="_blank">aqui</a>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<p>Se o m&oacute;dulo de backup e a pasta compartilhada compartilharem o mesmo nome, a configura&ccedil;&atilde;o do m&oacute;dulo de backup ser&aacute; usada.</p>
</div>
<h3>Ativar o limite de velocidade</h3>
<p>Voc&ecirc; pode controlar a largura de banda m&aacute;xima utiliz&aacute;vel ou o backup rsync para usu&aacute;rios e grupos.</p>
<h4>Para ativar o limite de velocidade:</h4>
<ol>
  <li>V&aacute; at&eacute; <b>Painel de controle</b> &gt; <b>Servi&ccedil;os de arquivo</b> &gt; <strong>rsync</strong>. Selecione uma das op&ccedil;&otilde;es a seguir:
  <ul>
  <li><strong>N&atilde;o h&aacute; limite de velocidade</strong></li>
  <li><strong>Habilitar limite de velocidade</strong></li>
  <li><strong>Habilitar o limite de velocidade de acordo com uma programa&ccedil;&atilde;o</strong> (Clique em <strong>Definir programa&ccedil;&atilde;o</strong> para realizar outras modifica&ccedil;&otilde;es.)</li>
  </ul>
  
<div class="section">
<h4>Nota:</h4>
<p>Esta &eacute; uma configura&ccedil;&atilde;o para todo o servidor e anular&aacute; as configura&ccedil;&otilde;es de usu&aacute;rios e grupos individuais. Por exemplo, escolher <strong>Nenhum limite de velocidade</strong> desabilita as configura&ccedil;&otilde;es de limite de velocidade de todos os usu&aacute;rios e grupos.</p>
</div>
  </li>
  <li>Se voc&ecirc; habilitou o limite de velocidade, clique em <strong>Configura&ccedil;&otilde;es do limite de velocidade</strong> e clique no usu&aacute;rio/grupo desejado para modificar as configura&ccedil;&otilde;es:
    <ul>
       <li><strong>Nenhum:</strong> Nenhum limite de velocidade ser&aacute; aplicado quando os membros do grupo transferirem arquivos com o servi&ccedil;o.</li>
      <li><strong>Aplicar configura&ccedil;&otilde;es de grupo</strong>: O usu&aacute;rios compartilhar&aacute; as mesmas configura&ccedil;&otilde;es de limite de velocidade com o grupo afiliado.</li>
      <li><strong>Constante</strong>: Um limite de velocidade fixo e constante ser&aacute; aplicado ao usu&aacute;rio ou membros do grupo. Os limites de velocidade de upload e download podem ser especificados nos campos &agrave; esquerda.</li>
      <li><strong>Personalizado</strong>: Dois limites de velocidade diferentes podem ser especificados e aplicados ao usu&aacute;rio ou aos membros de grupo, de acordo com uma programa&ccedil;&atilde;o. Clique em <strong>Personalizar</strong> para modificar as configura&ccedil;&otilde;es de limite de velocidade e definir uma programa&ccedil;&atilde;o.</li>
    </ul>
  </li>
 <li>Clique em <b>Aplicar</b>.</li> 
</ol>
<div class="section">
  <h4>Nota:</h4>
    <p>A se&ccedil;&atilde;o <strong>Resultado (UL/DL)</strong> exibe os limites de carregamento e download atuais do usu&aacute;rio de acordo com suas configura&ccedil;&otilde;es individuais e de grupo. Por exemplo, se o usu&aacute;rio &quot;Achilles&quot; tiver um limite de download individual de 100 KB/s, mas pertence a um grupo com um limite de 500 KB/s, a se&ccedil;&atilde;o <strong>Resultado (UL/DL)</strong> mostrar&aacute; &quot;0/500&quot;.</p>
</div>
</body>
</html>
