<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Pasta compartilhada</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Edi&ccedil;&atilde;o de pasta criptografada</h2>
<p>Ap&oacute;s a pasta ter sido criptografada, voc&ecirc; pode usar o menu suspenso <b>Criptografia</b> para editar a pasta.</p>
<h4>Os itens mostrados no menu dependem do status da pasta compartilhada selecionada:</h4>
<ul>
<li>Se voc&ecirc; selecionar uma pasta compartilhada n&atilde;o criptografada, o menu suspenso <b>Criptografia</b> estar&aacute; desativado.</li>
<li>Se voc&ecirc; selecionar uma pasta compartilhada criptografada que estiver montada, pode escolher <b>Desmontar</b> no menu suspenso <b>Criptografia</b> para desmontar a pasta, ou <b>Exportar chave</b> para salvar a chave de criptografia.</li>
<li>Se voc&ecirc; selecionar uma pasta compartilhada criptografada que estiver desmontada, pode escolher <b>Montar</b> no menu suspenso <b>Criptografia</b> e em seguida digitar ou importar a chave de criptografia para montar a pasta para acesso.</li>
</ul>
<ol>
<span class="note_head">Nota:</span>
<li><span  class="note_content">&Eacute; muito importante lembrar a chave de criptografia.</span>Recomendamos enfaticamente que voc&ecirc; exporte e salve a chave de criptografia. Se voc&ecirc; esquecer ou perder a chave, n&atilde;o h&aacute; modo de recuperar os dados criptografados.</li>
<li>Quando a pasta compartilhada criptografada &eacute; montada, n&atilde;o &eacute; poss&iacute;vel renome&aacute;-la ou mudar o local do seu volume. Voc&ecirc; pode fazer altera&ccedil;&otilde;es apenas depois de desmont&aacute;-la.</li></ol>
</body>
</html>
