<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Pasta compartilhada</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Pasta compartilhada</h1>
<p>As pastas compartilhadas s&atilde;o os diret&oacute;rios b&aacute;sicos onde voc&ecirc; pode armazenar arquivos e pastas em seu DiskStation. Antes de armazenar quaisquer arquivos de seu DiskStation, ser&aacute; necess&aacute;rio criar pelo menos uma pasta compartilhada. Os dados armazenados em pastas compartilhadas podem ser mantidos privados ou compartilhados com usu&aacute;rios ou grupos espec&iacute;ficos, de acordo com as permiss&otilde;es de acesso personaliz&aacute;veis. Al&eacute;m disso, as pastas compartilhadas podem ser criptografadas durante a cria&ccedil;&atilde;o, incluindo uma camada adicional de prote&ccedil;&atilde;o.</p>

<h3>Pastas compartilhadas padr&atilde;o</h3>

<p>Abaixo est&aacute; uma lista de pastas compartilhadas que s&atilde;o criadas automaticamente quando certos aplicativos, servi&ccedil;os ou pacotes s&atilde;o instalados e ativados.</p> 

<table>
<tr>
<th>Nome</th>
<th>Descri&ccedil;&atilde;o</th>
</tr>
<tr>
<th>public</th>
<td>A pasta <strong>public</strong> &eacute; criada automaticamente depois que seu DiskStation &eacute; configurado pela primeira vez.*</td>
</tr>
<tr>
<th>web</th>
<td>A pasta <strong>web</strong> &eacute; o local de armazenamento padr&atilde;o para conte&uacute;do de um site hospedado no DiskStation. Ela &eacute; criada automaticamente quando <strong>Web Station</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>photo</th>
<td>A pasta <strong>photo</strong> &eacute; usada para armazenar fotos e v&iacute;deos que voc&ecirc; pode compartilhar no Photo&nbsp;Station. Ela &eacute; criada automaticamente quando <strong>Photo Station</strong> ou<strong> DLNA/UPnP Media Server</strong> s&atilde;o ativados.</td>
</tr>
<tr>
<th>music</th>
<td>A pasta <strong>music</strong> &eacute; usada para armazenar m&uacute;sicas que voc&ecirc; deseja ouvir com o Audio&nbsp;Station. Ela &eacute; criada automaticamente quando <strong>Audio Station</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>video</th>
<td>A pasta <strong>video</strong> &eacute; usada para armazenar arquivos de v&iacute;deo que voc&ecirc; quer pesquisar atrav&eacute;s de dispositivos DLNA/UPnP. Ela &eacute; criada automaticamente quando <strong>Media Server</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>surveillance</th>
<td>A pasta <strong>surveillance</strong> &eacute; usada para armazenar grava&ccedil;&otilde;es do Surveillance&nbsp;Station. Ela &eacute; criada automaticamente quando <strong>Surveillance Station</strong> &eacute; ativado. Ela &eacute; uma pasta somente leitura e s&oacute; pode ser acessada pelo administrador do sistema.</td>
</tr>
<tr>
<th>home</th>
<td>As pastas <strong>home</strong> fornecem espa&ccedil;os particulares para que cada usu&aacute;rio armazene dados onde os outros usu&aacute;rios n&atilde;o ter&atilde;o acesso. Ela &eacute; criada automaticamente quando <strong>Base do usu&aacute;rio</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>homes</th>
<td>A pasta <strong>homes</strong> cont&eacute;m as pastas de p&aacute;ginas iniciais de todos os usu&aacute;rios. Ela &eacute; criada automaticamente quando <strong>Base do usu&aacute;rio</strong> &eacute; ativado. Somente o administrador do sistema pode acessar e gerenciar as pastas base de todos os usu&aacute;rios.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>A pasta <strong>NetBackup</strong> &eacute; criada automaticamente quando o <strong>Backup de rede</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>usbshare</th>
<td>A pasta <strong>usbshare[number]</strong> &eacute; criada automaticamente quando voc&ecirc; conecta um dispositivo de unidade externa USB &agrave; porta USB do DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>A pasta <strong>satashare</strong> &eacute; criada automaticamente quando voc&ecirc; conecta um dispositivo de unidade externa eSATA &agrave; porta eSATA do DiskStation.*</td>
</tr>
</table>

<p>____<br> * Dispon&iacute;vel apenas em determinados modelos.</p>

</body>
</html>
