<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Grupo</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Editar um grupo</h2>
<p>
Voc&ecirc; pode editar as informa&ccedil;&otilde;es do grupo e seus privil&eacute;gios de acesso &agrave;s pastas compartilhadas.
</p>
<h4>Para editar as informa&ccedil;&otilde;es do grupo:</h4>
<ol>
<li>Selecione o grupo que voc&ecirc; deseja editar.</li>
<li>Clique em <b>Editar</b> e edite as informa&ccedil;&otilde;es do grupo.</li>
<li>Clique em <b>OK</b> para concluir.</li>
</ol>
<h4>Para editar os privil&eacute;gios de acesso do grupo &agrave;s pastas compartilhadas:</h4>
<ol>
<li>Selecione o grupo que voc&ecirc; deseja editar.</li>
<li>Clique em <b>Editar</b> e <b>Permiss&otilde;es</b>.</li>
<li>
Marque ou desmarque os privil&eacute;gios a seguir para atribuir privil&eacute;gios de acesso ao grupo:
</li>
<ol>
<li>
<b>Leitura/Grava&ccedil;&atilde;o</b>: O grupo pode acessar e fazer altera&ccedil;&otilde;es &agrave; pasta compartilhada.
</li>
<li>
<b>Somente leitura</b>: O grupo pode acessar a pasta compartilhada, mas n&atilde;o pode fazer altera&ccedil;&otilde;es a ela.
</li>
<li><b>Nenhum acesso</b>: O grupo n&atilde;o pode acessar a pasta compartilhada.
</li>
</ol>
<li>Clique em <b>OK</b> para concluir.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<p>Quando encontrar conflitos de privil&eacute;gios, a prioridade de privil&eacute;gios &eacute; a seguinte: Nenhum acesso &gt; Leitura/Grava&ccedil;&atilde;o &gt; Somente leitura.</p>
</div>
<h4 class="disable-dockerx64">Para editar a cota de uso do grupo:</h4>
<ol class="disable-dockerx64">
<li class="disable-dockerx64">Selecione o grupo que voc&ecirc; deseja editar.</li>
<li class="disable-dockerx64">Clique em <strong>Editar</strong> e v&aacute; para a guia <strong>Cota</strong>.</li>
<li class="disable-dockerx64">Para cada volume<span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64">/pasta compartilhada</span>, marque a caixa em <strong>Habilitar cota</strong>. Em seguida digite uma cota de uso no campo <strong>Cota</strong> (ex.: 10 GB).</li>
</ol>
<div class="section disable-eds14 disable-dockerx64">
<h4>Nota:</h4>
<ul>
<li>Cada membro do grupo herda a cota de uso de grupo espec&iacute;fica. A cota de uso do grupo n&atilde;o &eacute; compartilhada entre cada membro do grupo.</li>
<li>A cota de uso de armazenamento m&aacute;xima que pode ser inserida para cada grupo &eacute; de aproximadamente 4 TB (4095 GB).</li>
</ul>
</div>
<h4>Para editar os privil&eacute;gios de acesso de um grupo aos aplicativos:</h4>
<ol>
<li>Selecione o grupo que voc&ecirc; deseja editar.</li>
<li>Clique em <b>Editar</b> e v&aacute; para a guia <strong>Aplicativos</strong>.</li>
<li>Para cada servi&ccedil;o, voc&ecirc; pode selecionar uma das seguintes op&ccedil;&otilde;es:
  <ul>
<li><strong>Permitir:</strong> O grupo poder&aacute; acessar o aplicativo.</li>
<li><strong>Negar:</strong> O grupo n&atilde;o poder&aacute; acessar o aplicativo.</li>
<li><strong>Personalizado:</strong> Gerencie os privil&eacute;gios de acesso por endere&ccedil;o IP.</li>
</ul>
</li>
<li>Clique em <b>OK</b> para concluir.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Quando encontrar conflitos de privil&eacute;gios, a prioridade de privil&eacute;gios &eacute; a seguinte: Negar &gt; Permitir.</li>
<li>Nem todos os pacotes e servi&ccedil;os s&atilde;o compat&iacute;veis com configura&ccedil;&otilde;es de privil&eacute;gio de acesso <strong>Por IP</strong>.</li>
</ul>
</div>
<h4>Para editar o limite de velocidade do grupo:</h4>
<p>Voc&ecirc; pode ativar um limite de velocidade de grupo para diferentes servi&ccedil;os (por exemplo, File Station, FTP etc.) a fim de restringir a largura de banda consumida pelos membros do grupo que transferem arquivos atrav&eacute;s de cada servi&ccedil;o. Os limites de velocidade de um grupo s&atilde;o compartilhados por todos os seus membros.</p>
<ol>
<li>Selecione o grupo que voc&ecirc; deseja editar.</li>
<li>Clique em <b>Editar</b> e v&aacute; para a guia <strong>Limite de velocidade</strong>.</li>
<li>Para cada servi&ccedil;o, voc&ecirc; pode selecionar uma das seguintes op&ccedil;&otilde;es:
<ul>
<li><strong>Nenhum:</strong> Nenhum limite de velocidade ser&aacute; aplicado quando os membros do grupo usarem o servi&ccedil;o.</li>
<li><strong>Constante:</strong> Um limite de velocidade fixo e constante ser&aacute; aplicado aos membros de grupos. Especifique os limites de velocidade de upload e download nos campos &agrave; esquerda.</li>
<li><strong>Vari&aacute;vel:</strong> Dois limites de velocidade diferentes podem ser especificados e aplicados aos membros de grupo, de acordo com uma programa&ccedil;&atilde;o. Clique no bot&atilde;o <strong>Personalizar</strong> para modificar as configura&ccedil;&otilde;es de limite de velocidade e a programa&ccedil;&atilde;o.</li>
</ul>
</li>
<li>Clique em <b>OK</b> para concluir.</li>
</ol>
<div class="section">
<h4>Limite de velocidade para usu&aacute;rios que pertencem a v&aacute;rios grupos</h4>
<p>Quando um usu&aacute;rio pertence a v&aacute;rios grupos, seu limite de velocidade &eacute; decidido com base no grupo com a largura de banda dispon&iacute;vel mais alta no momento da transfer&ecirc;ncia dos arquivos. Como a largura de banda &eacute; dividida uniformemente entre os usu&aacute;rios que est&atilde;o transferindo arquivos atualmente, a largura de banda dispon&iacute;vel muda com base em quantos usu&aacute;rios est&atilde;o consumindo a largura de banda compartilhada atualmente.</p>
<p>Por exemplo, um usu&aacute;rio &quot;John&quot; pertence ao &quot;Grupo 1&quot; (limite de velocidade de 500KB/s; total de cinco usu&aacute;rios) e o &quot;Grupo 2&quot; (limite de velocidade de 400KB/s; total de dois usu&aacute;rios).</p>
<ul>
<li>Se os usu&aacute;rios do Grupo 1 e Grupo 2 estiverem todos transferindo arquivos ao mesmo tempo, ent&atilde;o o limite de velocidade de John ser&aacute; de 200KB/s e seu consumo contar&aacute; na cota de largura de banda compartilhada do Grupo 2.</li>
<li>Quando os outros usu&aacute;rios do Grupo 1 tiverem terminado de transferir os arquivos, o limite de velocidade de John mudar&aacute; imediatamente para 500KB/s e seu consumo contar&aacute; na cota de largura de banda compartilhada do Grupo 1.</li>
</ul>
</div>
</body>
</html>
