<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Usu&aacute;rio</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Base do usu&aacute;rio</h2>
<p>Ative a base do usu&aacute;rio para criar uma pasta personalizada <b>home</b> (base) para cada usu&aacute;rio, exceto <b>guest</b>. Todos os usu&aacute;rios podem acessar sua pr&oacute;pria pasta base atrav&eacute;s de CIFS, AFP, FTP ou File Station.</p>
<p>O administrador pode acessar todas as pastas personalizadas localizadas na pasta compartilhada padr&atilde;o do sistema <b>homes</b>. O nome da pasta base &eacute; o mesmo da conta de usu&aacute;rio.</p>
<h4>Para habilitar o servi&ccedil;o de base do usu&aacute;rio:</h4>
<ol>
<li>Clique em <b>Base do usu&aacute;rio</b>.</li>
<li>Marque <b>Ativar servi&ccedil;o de base do usu&aacute;rio</b>.</li>
<li>Se houver mais de um volume em Synology DiskStation, selecione o local onde a pasta  <b>homes</b> dever&aacute; ser armazenada.</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<p><span class="note_head">Nota:</span> Assim que o servi&ccedil;o de base de usu&aacute;rio local for desativado, o servi&ccedil;o de base de usu&aacute;rio do dom&iacute;nio tamb&eacute;m ser&aacute; desativado ao mesmo tempo.</p>
<h4>Para desabilitar o servi&ccedil;o de base do usu&aacute;rio:</h4>
<ol>
<li>Clique em <b>Base do usu&aacute;rio</b>.</li>
<li>Desmarque a caixa <b>Ativar servi&ccedil;o de base do usu&aacute;rio</b>.</li>
</ol>
<p>Ap&oacute;s desabilitar o servi&ccedil;o de base do usu&aacute;rio, a pasta compartilhada <b>homes</b> ser&aacute; preservada para acesso do administrador.  Os usu&aacute;rios poder&atilde;o acessar suas pastas base quando o servi&ccedil;o de base de usu&aacute;rio for habilitado novamente.</p>
<ol>
<span class="note_head">Nota:</span>
<li>Para excluir a pasta compartilhada <b>homes</b>, o servi&ccedil;o de base de usu&aacute;rio deve ser desabilitado primeiro.</li>
<li>O servi&ccedil;o de base de usu&aacute;rio do dom&iacute;nio ser&aacute; desativado se o servi&ccedil;o de base de usu&aacute;rio local for desativado.</li> 
</ol> 
</body>	
</html> 
