<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Vis&atilde;o geral</h2>
<p><b>Painel de controle (modo simples)</b> &gt; <b>Vis&atilde;o geral</b> &eacute; um portal r&aacute;pido e centralizado que permite gerenciar v&aacute;rias configura&ccedil;&otilde;es b&aacute;sicas e monitorar recursos de sistema de seu DiskStation.</p>


<h3>Integridade do sistema</h3>
<p>Esta se&ccedil;&atilde;o exibe o status geral de seu sistema. Se um erro tiver ocorrido ou se seus espa&ccedil;os de armazenamento tiverem sido paralisados ou degradados, voc&ecirc; pode passar o mouse sobre essa se&ccedil;&atilde;o e clicar no &iacute;cone <b>Mais</b> no canto superior direito para abrir as p&aacute;ginas correspondentes de reparo e gerenciamento.</p>

<h3>Vers&atilde;o do DSM</h3>
<p>Sua vers&atilde;o e o status atuais do DSM ser&atilde;o exibidos nessa se&ccedil;&atilde;o. Quando um novo DSM estiver dispon&iacute;vel para download, voc&ecirc; poder&aacute; atualizar para a vers&atilde;o mais recente diretamente desse local.</p>

<h3>QuickConnect ID</h3>
<p>Voc&ecirc; pode visualizar seu QuickConnect ID aqui. Para configura&ccedil;&otilde;es e gerenciamento mais avan&ccedil;ados, passe o mouse sobre essa se&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b> no canto superior direito para abrir a p&aacute;gina <b>QuickConnect</b>.</p>
<h3>Armazenamento</h3>
<p>Esta se&ccedil;&atilde;o exibe informa&ccedil;&otilde;es e o status do hardware de seus espa&ccedil;os de armazenamento, como utiliza&ccedil;&atilde;o do disco r&iacute;gido e uso/capacidade do volume. Voc&ecirc; pode verificar quantos discos r&iacute;gidos est&atilde;o sendo usados por quais espa&ccedil;os de armazenamento. Para configura&ccedil;&otilde;es e gerenciamento mais avan&ccedil;ados, passe o mouse sobre essa se&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b> no canto superior direito para abrir a p&aacute;gina <b>Gerenciador de armazenamento</b>.</p>

<h3>Monitor de recursos</h3>
<p>Voc&ecirc; pode monitorar a porcentagem do uso geral da CPU e da mem&oacute;ria, bem como a taxa de dados enviados e recebidos em KB por segundo. Se mais de uma LAN estiver em uso, clique no &iacute;cone de seta no gr&aacute;fico de fluxo de rede para alternar. Para configura&ccedil;&otilde;es e gerenciamento mais avan&ccedil;ados, passe o mouse sobre essa se&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b> no canto superior direito para abrir a p&aacute;gina <b>Gerenciador de armazenamento</b>.</p>

<h3>Usu&aacute;rios Conectados</h3>
<p>Aqui &eacute; poss&iacute;vel ver e gerenciar os clientes que est&atilde;o conectados ao sistema e acessando os recursos no momento. Essa se&ccedil;&atilde;o exibe os clientes conectados via HTTP, TELNET, SSH, SMB/CIFS, AFP, FTP e NFS. Para configura&ccedil;&otilde;es e gerenciamento mais avan&ccedil;ados, passe o mouse sobre essa se&ccedil;&atilde;o e clique no &iacute;cone <b>Mais</b> no canto superior direito para abrir a p&aacute;gina <b>Gerenciador de armazenamento</b>.</p>

<h4>Para interromper as conex&otilde;es atuais:</h4>
<p>Clique no &iacute;cone <b>Interromper conex&atilde;o</b> ao lado do usu&aacute;rio desejado para impedir que ele acesse o recurso. O usu&aacute;rio desconectado precisar&aacute; ser autorizado novamente para obter acesso ao recurso.</p>

</body>
</html>