<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Pasta compartilhada</h2>
<p>As pastas compartilhadas s&atilde;o os diret&oacute;rios b&aacute;sicos onde voc&ecirc; pode armazenar arquivos e pastas em seu DiskStation. Antes de armazenar arquivos em seu DiskStation, &eacute; preciso criar pelo menos uma pasta compartilhada no DSM. &Eacute; poss&iacute;vel manter os dados armazenados nas pastas compartilhadas privados ou compartilhados com usu&aacute;rios espec&iacute;ficos ou grupos de usu&aacute;rios de acordo com permiss&otilde;es de acesso personaliz&aacute;veis.</p>



<p>Veja a seguir uma lista das pastas compartilhadas padr&atilde;o que s&atilde;o criadas automaticamente quando determinados aplicativos, servi&ccedil;os ou pacotes s&atilde;o instalados ou ativados.</p> 
<table>
<tr>
<th>Nome</th>
<th>Descri&ccedil;&atilde;o</th>
</tr>
<tr>
<th>public</th>
<td>A pasta <strong>public</strong> &eacute; criada automaticamente depois que o DiskStation &eacute; configurado pela primeira vez.*</td>
</tr>
<tr>
<th>web</th>
<td>A pasta <strong>web</strong> &eacute; o local de armazenamento padr&atilde;o para o conte&uacute;do de um site hospedado no DiskStation. Ela &eacute; criada automaticamente quando o <strong>Web Station</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>photo</th>
<td>A pasta <strong>photo</strong> &eacute; usada para armazenar fotos e v&iacute;deos que voc&ecirc; deseja compartilhar no Photo&nbsp;Station. Ela &eacute; criada automaticamente quando o <strong>Photo&nbsp;Station</strong> ou o <strong>Servidor de M&iacute;dia DLNA/UPnP</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>music</th>
<td>A pasta <strong>music</strong> &eacute; usada para armazenar m&uacute;sicas que voc&ecirc; deseja ouvir no Audio Station. Ela &eacute; criada automaticamente quando o <strong>Audio&nbsp;Station</strong> ou o <b>Servidor de M&iacute;dia DLNA/UPnP</b> &eacute; ativado.</td>
</tr>
<tr>
<th>video</th>
<td>A pasta <strong>video</strong> &eacute; usada para armazenar arquivos de v&iacute;deo pelos quais voc&ecirc; deseja navegar em dispositivos DLNA/UPnP. Ela &eacute; criada automaticamente quando o <b>Video&nbsp;Station</b> ou o <strong>Servidor de M&iacute;dia DLNA/UPnP</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>surveillance</th>
<td>A pasta <strong>surveillance</strong> &eacute; usada para armazenar grava&ccedil;&otilde;es do Surveillance Station. Ela &eacute; criada automaticamente quando o <strong>Surveillance Station</strong> &eacute; ativado. Ela &eacute; uma pasta somente leitura e s&oacute; pode ser acessada pelo administrador do sistema.</td>
</tr>
<tr>
<th>home</th>
<td>A pasta <strong>home</strong> oferece espa&ccedil;os particulares para cada usu&aacute;rio armazenar dados que somente ele pode acessar. Ela &eacute; criada automaticamente quando a <strong>Base do usu&aacute;rio</strong> &eacute; ativada.</td>
</tr>
<tr>
<th>homes</th>
<td>A pasta <strong>homes</strong> cont&eacute;m as pastas de p&aacute;ginas iniciais de todos os usu&aacute;rios. Ela &eacute; criada automaticamente quando a <strong>Base do usu&aacute;rio</strong> &eacute; ativada. Somente o administrador do sistema pode acessar e gerenciar as pastas base de todos os usu&aacute;rios.</td>
</tr>
<tr>
<th>NetBackup</th>
<td>A pasta <strong>NetBackup</strong> &eacute; criada automaticamente quando o <strong>Backup de Rede</strong> &eacute; ativado.</td>
</tr>
<tr>
<th>usbshare</th>
<td>A pasta <strong>usbshare[n&uacute;mero]</strong> &eacute; criada automaticamente quando voc&ecirc; conecta um dispositivo de unidade externa USB &agrave; porta USB do DiskStation.*</td>
</tr>
<tr>
<th>satashare</th>
<td>A pasta <strong>satashare</strong> &eacute; criada automaticamente quando voc&ecirc; conecta um dispositivo de unidade externa eSATA &agrave; porta eSATA do DiskStation.*</td>
</tr>
</table>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Voc&ecirc; s&oacute; pode editar as permiss&otilde;es de pasta compartilhada dos usu&aacute;rios no modo simples. Se voc&ecirc; desejar criar grupos de usu&aacute;rios ou gerenciar os privil&eacute;gios de acesso de grupos &agrave;s pastas compartilhadas, v&aacute; para <b>Painel de controle (modo avan&ccedil;ado)</b> &gt; <b>Grupo</b>.</li>
</ul>
</div>

<h4>Para criar uma pasta compartilhada:</h4>
<ol>
<li>V&aacute; para <b>Painel de controle (modo simples)</b> &gt; <b>Pasta compartilhada</b> e clique no &iacute;cone <b>+</b> no painel esquerdo.</li>
<li>Especifique um nome e selecione o volume no qual a pasta compartilhada ser&aacute; criada.</li>
<li>Marque <b>Habilitar lixeira</b> se necess&aacute;rio. Se essa op&ccedil;&atilde;o for ativada, quando os arquivos na pasta compartilhada forem exclu&iacute;dos, eles ser&atilde;o movidos para uma pasta chamada <b>#recycle</b>. O acesso &agrave; lixeira pode ser limitado a usu&aacute;rios que pertencem ao grupo <b>administrators</b>.</li>
<li>Marque ou desmarque as caixas correspondentes a cada usu&aacute;rio para personalizar suas permiss&otilde;es de acesso &agrave; pasta compartilhada:</li>
<ul>
<li><b>Leitura/Grava&ccedil;&atilde;o:</b> O usu&aacute;rio pode acessar e fazer altera&ccedil;&otilde;es aos arquivos e sub pastas na pasta compartilhada.</li>
<li><b>Somente leitura:</b> O usu&aacute;rio pode acessar os arquivos e as subpastas na pasta compartilhada.</li>
<li><b>Nenhum acesso:</b> O usu&aacute;rio n&atilde;o pode acessar os arquivos ou subpastas na pasta compartilhada.</li>
</ul>
<li>Clique em <b>Aplicar</b> para salvar as configura&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Os nomes das pastas compartilhadas n&atilde;o diferenciam mai&uacute;sculas de min&uacute;sculas e podem ter de 1 a 32 caracteres. Os nomes n&atilde;o podem ter os seguintes caracteres:<br> <strong>! &quot; # $ % &amp; &apos; ( ) * + , / : ; <= > ? @ [ ] \ ^ ` { } | ~</strong></li>
<li>Os seguintes nomes s&atilde;o reservados para uso do sistema:<br> <strong>.</strong>, <strong>..</strong>, <strong>global</strong>, <strong>home</strong>, <strong>homes</strong>, <strong>printers</strong>, <strong>public</strong>, <strong>satashare</strong>, <strong>surveillance</strong>, <strong>usbbackup</strong>, <strong>usbshare</strong></li>
<li>O primeiro caractere do nome de uma pasta compartilhada n&atilde;o pode ser um sinal de menos ou um espa&ccedil;o, e o &uacute;ltimo caractere n&atilde;o pode ser um espa&ccedil;o.</li>
<li>Quando houver conflitos de permiss&atilde;o, a prioridade de permiss&otilde;es ser&aacute; a seguinte: <b>Nenhum acesso</b> &gt; <b>Leitura/Grava&ccedil;&atilde;o</b> &gt; <b>Somente leitura</b>.</li>
<li>Ao criar uma nova pasta compartilhada, se as permiss&otilde;es dos usu&aacute;rios pertencentes ao grupo <b>administrators</b> estiverem definidas como <b>Nenhum acesso</b>, esses usu&aacute;rios s&oacute; poder&atilde;o ver as pastas compartilhadas em <b>Painel de controle</b> &gt; <b>Pasta compartilhada</b>.</li>
<li>&Eacute; poss&iacute;vel ajustar as configura&ccedil;&otilde;es de privil&eacute;gio da pasta Lixeira no File Station clicando com o bot&atilde;o direito do mouse na pasta <b>#recycle</b>. Selecione <b>Propriedades</b> e clique na guia <b>Permiss&otilde;es</b>.</li>
</ul>
</div>

<h4>Para editar uma pasta compartilhada:</h4>
<ol>
<li>V&aacute; para <b>Painel de controle</b> &gt; <b>Pasta compartilhada</b>.</li>
<li>Selecione a pasta compartilhada desejada no painel esquerdo.</li>
<li>Edite as informa&ccedil;&otilde;es gerais da pasta compartilhada, como nome, local e permiss&otilde;es de usu&aacute;rio.</li>
<li>Se a op&ccedil;&atilde;o <b>Habilitar lixeira</b> j&aacute; estiver marcada, voc&ecirc; pode clicar em <b>Esvaziar lixeira</b> para remover todos os arquivos exclu&iacute;dos da lixeira permanentemente.</li>
<li>Clique em <b>Aplicar</b> para salvar as configura&ccedil;&otilde;es.</li>
</ol>

<h4>Para excluir uma pasta compartilhada:</h4>
<ol>
<li>V&aacute; para <b>Painel de controle</b> &gt; <b>Pasta compartilhada</b>.</li>
<li>Selecione a pasta compartilhada desejada no painel esquerdo.</li>
<li>Clique no &iacute;cone <b>Lixo</b> no painel esquerdo para excluir a pasta compartilhada selecionada.</li>

</ol>


<p>____<br> * Dispon&iacute;vel apenas em certos modelos.</p>
</body>
</html>