<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>SNMP</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SNMP</h2>

<p>O servi&ccedil;o SNMP (em <strong>Painel de Controle</strong> &gt; <strong>Terminal e SNMP</strong> &gt; <strong>SNMP</strong>) permite que os usu&aacute;rios monitorem o DiskStation com o software de gerenciamento de rede. Atualmente, s&atilde;o suportados os protocolos SNMPv1, SNMPv2c e SNMPv3. </p>


<h3>Ativar servi&ccedil;o SNMP</h3>

<p>Marque <b>Habilitar servi&ccedil;o SNMP</b> e siga as etapas abaixo.</p>
<h4>Para habilitar o servi&ccedil;o SNMPv1, SNMPv2c:</h4>
<ol>
<li>Marque <b>Servi&ccedil;o SNMPv1, SNMPv2c</b>.<li>Digite um nome de <b>Comunidade</b>.<li>Clique em <b>Aplicar.</b></ol>
<h4>Para habilitar o servi&ccedil;o SNMPv3:</h4>
<ol>
<li>Marque <b>Servi&ccedil;o SNMPv3</b>.<li>Digite um <b>Nome de usu&aacute;rio</b> e <b>Senha</b>. Digite sua senha novamente para <b>Confirmar a senha</b>.<li>Clique em <b>Aplicar</b>.</ol>
<p>Al&eacute;m disso, digitar <b>Nome</b>, <b>Localiza&ccedil;&atilde;o</b> e <b>Contato</b> ajudar&aacute; a identificar o DiskStation. Esses campos s&atilde;o opcionais.</p>


<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ol>
<li>IPv4 e IPv6 s&atilde;o suportados pelo servi&ccedil;o SNMP. </li>
<li>O servi&ccedil;o SNMP suporta SNMPv1, SNMPv2c e SNMPv3 simultaneamente. </li>
</ol>
</div>


<div class="section">
<h4>Limita&ccedil;&atilde;o da comunidade SNMPv1, SNMPv2c:</h4>
<p>O nome da comunidade deve estar na faixa de 1 a 64 caracteres exib&iacute;veis. Os caracteres a seguir n&atilde;o s&atilde;o permitidos: <br>&quot; &apos; \ e espa&ccedil;o.</p>
<h4>Limita&ccedil;&atilde;o do nome do usu&aacute;rio SNMPv3:</h4>
<p>O nome do usu&aacute;rio deve estar na faixa de 1 a 64 caracteres exib&iacute;veis. Os caracteres a seguir n&atilde;o s&atilde;o permitidos: <br>&quot; &apos; \ e espa&ccedil;o.</p>
<h4>Limita&ccedil;&atilde;o de senha SNMPv3:</h4>
<p>A senha diferencia mai&uacute;sculas e min&uacute;sculas e deve estar na faixa de 8 a 127 caracteres exib&iacute;veis, incluindo letras, n&uacute;meros e s&iacute;mbolos. Os caracteres a seguir n&atilde;o s&atilde;o permitidos: <br>&quot; &apos; \ e espa&ccedil;o.</p>
<p>&nbsp;</p>
</div>
<h3>Download de Arquivos MIB Synology</h3>
<p class="disable-eds14">A Synology fornece a capacidade de monitorar o DiskStation atrav&eacute;s de sistemas de gerenciamento de rede, incluindo o status do sistema, do disco e o status de volumes RAID.</p>

<p class="enable-eds14">A Synology fornece a capacidade de monitorar o DiskStation atrav&eacute;s de sistemas de gerenciamento de rede, incluindo o status do sistema, do disco e o status de volumes.</p>

<p>Acesse o <a href="http://www.synology.com/support/snmp_mib" target="_blank">Site da Synology</a> para obter mais informa&ccedil;&otilde;es e baixar os arquivos relacionados.</p>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Os sistemas de gerenciamento de rede contam com arquivos MIB para obter defini&ccedil;&otilde;es dos dispositivos monitorados. Para obter mais informa&ccedil;&otilde;es, acesse: <a href="http://en.wikipedia.org/wiki/Management_information_base" target="_blank">aqui</a>.</p>
</div>

</body>
</html>
