<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Backup da Configura&ccedil;&atilde;o</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Backup da Configura&ccedil;&atilde;o</h2>
<p>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Atualizar e restaurar</strong> para fazer imediatamente o backup das configura&ccedil;&otilde;es do sistema para um computador local. Isso permite que voc&ecirc; salve v&aacute;rias configura&ccedil;&otilde;es (por exemplo, usu&aacute;rios, grupos, configura&ccedil;&otilde;es de servi&ccedil;o de arquivos, etc.) e restaure as configura&ccedil;&otilde;es posteriormente. As configura&ccedil;&otilde;es do sistema s&atilde;o salvas como um arquivo do formato .dss.</p>
<h4>Para fazer backup das configura&ccedil;&otilde;es do sistema:</h4>
<ol>
<li>Clique em <b>Configura&ccedil;&atilde;o do backup</b>. </li>
<img src="about:blank" class="help_image"/>
<li>Um arquivo de configura&ccedil;&atilde;o ser&aacute; baixado (com o nome <b>[Nome do produto Synology]_[Data da cria&ccedil;&atilde;o].dss</b>) em seu computador.</li>
</ol>
<h4>Para restaurar as configura&ccedil;&otilde;es do sistema:</h4>
<ol>
<li>Clique em <b>Restaurar configura&ccedil;&atilde;o</b>.</li>
<img src="about:blank" class="help_image"/>
<li>Clique em <b>Navegar</b> e selecione o arquivo de configura&ccedil;&otilde;es armazenado em seu computador.</li>
<li>Marque as caixas de sele&ccedil;&atilde;o correspondentes das configura&ccedil;&otilde;es que deseja restaurar e depois clique em <strong>OK</strong>. Voc&ecirc; tamb&eacute;m pode marcar a op&ccedil;&atilde;o <strong>Sobrescrever configura&ccedil;&otilde;es conflitantes</strong> para sobrescrever as configura&ccedil;&otilde;es atuais de qualquer sele&ccedil;&atilde;o de usu&aacute;rios, grupos, pastas compartilhadas e servi&ccedil;os existentes.</li>
<img src="about:blank" class="help_image"/>
<li>Uma mensagem de advert&ecirc;ncia &eacute; exibida. Clique em <strong>Sim</strong> para continuar.</li>
<img src="about:blank" class="help_image"/>
<li>Ap&oacute;s a conclus&atilde;o da fun&ccedil;&atilde;o restaurar, aparece uma mensagem. Clique em <strong>OK</strong> para concluir.</li>
<img src="about:blank" class="help_image"/>
</ol>
<div class="section">
<h4>Ser&aacute; feito backup das seguintes configura&ccedil;&otilde;es:</h4>
<ul class="disable-eds14">
<li>Usu&aacute;rios, grupos e pastas compartilhadas</li>
<li>Grupo de trabalho, dom&iacute;nio e LDAP</li>
<li>Compartilhamento de arquivos (por exemplo: Servi&ccedil;o de Arquivos do Windows, Servi&ccedil;o de Arquivos do Mac, Servi&ccedil;o NFS, FTP, WebDAV e rsync) e servi&ccedil;o de backup.</li>
<li>Outros (ex.: P&aacute;gina inicial do usu&aacute;rio, Configura&ccedil;&otilde;es de senha e Agendador de tarefas)</li>
</ul>
<ul class="enable-eds14">
<li>Usu&aacute;rios, grupos e pastas compartilhadas</li>
<li>Compartilhamento de arquivos (por exemplo: Servi&ccedil;o de Arquivos do Windows, Servi&ccedil;o de Arquivos do Mac, Servi&ccedil;o NFS, FTP, WebDAV)</li>
<li>Outros (ex.: P&aacute;gina inicial do usu&aacute;rio, Configura&ccedil;&otilde;es de senha e Agendador de tarefas)</li>
</ul>
<h4>Nota:</h4>
<ul class="disable-eds14">
<li>O <strong>Servi&ccedil;o de backup</strong> inclui as configura&ccedil;&otilde;es b&aacute;sicas de servi&ccedil;o, mas n&atilde;o informa&ccedil;&otilde;es sobre as tarefas de backup.</li>
<li>A <strong>Base do usu&aacute;rio</strong> inclui configura&ccedil;&otilde;es de servi&ccedil;os b&aacute;sicos enquanto exclui a pasta compartilhada <b>homes</b>. V&aacute; para <b>Hyper Backup</b> para fazer backup e restaurar a pasta compartilhada <b>homes</b> e seus dados.</li>
<li>O <b>Agendador de tarefas</b> inclui tarefas que podem ser criadas no <b>Agendador de tarefas</b> enquanto exclui tarefas geradas por outros aplicativos (por exemplo <b>Hyper Backup</b> e <b>Relat&oacute;rio de uso de disco</b>, etc.)</li>
<li>Se os nomes dos usu&aacute;rios ou grupos restaurados agora estiverem reservados somente para o uso do sistema, eles ser&atilde;o restaurados com outros nomes.</li>
</ul>
<ul class="enable-eds14">
<li>A <strong>Base do usu&aacute;rio</strong> inclui configura&ccedil;&otilde;es de servi&ccedil;os b&aacute;sicos enquanto exclui a pasta compartilhada <b>homes</b>. V&aacute; para <b>Hyper Backup</b> para fazer backup e restaurar a pasta compartilhada <b>homes</b> e seus dados.</li>
<li>O <b>Agendador de tarefas</b> inclui tarefas que podem ser criadas no <b>Agendador de tarefas</b> enquanto exclui tarefas geradas por outros aplicativos (por exemplo <b>Hyper Backup</b> e <b>Relat&oacute;rio de uso de disco</b>, etc.)</li>
<li>Se os nomes dos usu&aacute;rios ou grupos restaurados agora estiverem reservados somente para o uso do sistema, eles ser&atilde;o restaurados com outros nomes.</li>
</ul>
</div>
</body>
</html>
