<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Notifica&ccedil;&atilde;o</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>SMS</h2>
<p class="disable-eds14">Voc&ecirc; pode habilitar as notifica&ccedil;&otilde;es por SMS para que o DiskStation envie mensagens de notifica&ccedil;&atilde;o a voc&ecirc; por SMS quando o status mudar ou ocorrerem erros no sistema, como perda de conex&atilde;o, altera&ccedil;&atilde;o do comportamento da ventoinha, falha de energia, volume de armazenamento ficando sem espa&ccedil;o ou falha de backup e restaura&ccedil;&atilde;o, etc.</p>

<p class="enable-eds14">Voc&ecirc; pode habilitar as notifica&ccedil;&otilde;es por SMS para que o DiskStation envie mensagens de notifica&ccedil;&atilde;o a voc&ecirc; por SMS quando o status mudar ou ocorrerem erros no sistema, como perda de conex&atilde;o, falha de energia, volume de armazenamento ficando sem espa&ccedil;o ou falha de backup e restaura&ccedil;&atilde;o, etc.</p>


<h4>Para habilitar as notifica&ccedil;&otilde;es por SMS:</h4>
<p>Marque <b>Habilitar notifica&ccedil;&otilde;es por SMS</b> e complete as seguintes configura&ccedil;&otilde;es:</p>
<ol>
<li>Selecione um provedor de SMS na lista suspensa <b>Fornecedor de servi&ccedil;o de SMS</b>. O fornecedor de servi&ccedil;o padr&atilde;o &eacute; &quot;clickatell&quot;.</li>
<li>Clique em <b>Adicionar provedor de servi&ccedil;o SMS</b> para criar uma nova configura&ccedil;&atilde;o de provedor de SMS ou clique em <b>Excluir</b> para excluir a configura&ccedil;&atilde;o selecionada de provedor de SMS.</li>
<li>No campo <b>Nome de usu&aacute;rio</b>, digite o nome de usu&aacute;rio de sua conta do servi&ccedil;o de SMS.</li>
<li>Nos campos <b>Senha</b> e <b>Confirmar senha</b>, digite e confirme a senha de sua conta de servi&ccedil;o de SMS.</li>
<li>Digite seu <b>N&uacute;mero de telefone principal</b> ou <b>N&uacute;mero de telefone secund&aacute;rio</b>. Se os dois n&uacute;meros forem informados, as mensagens de notifica&ccedil;&atilde;o por SMS ser&atilde;o enviadas para ambos os n&uacute;meros.</li>
<li>Se n&atilde;o desejar receber muitas mensagens, marque <b>Ativar limite de intervalo de SMS</b> e limite o n&uacute;mero de mensagens de notifica&ccedil;&atilde;o a uma mensagem por intervalo de tempo especificado.</li>
<li>Clique em <b>Enviar uma mensagem SMS como teste</b> para enviar uma mensagem de SMS como teste para o n&uacute;mero de telefone especificado. Se nenhuma mensagem for recebida, a configura&ccedil;&atilde;o est&aacute; incorreta.</li>
<li>Clique em <b>Aplicar</b> para salvar a configura&ccedil;&atilde;o, ou clique em <b>Restaurar</b> para cancelar a configura&ccedil;&atilde;o.</li>
</ol>
<p><span class="note_head">Observa&ccedil;&atilde;o: </span>O idioma da notifica&ccedil;&atilde;o de SMS &eacute; configurado em <strong>Idioma de Notifica&ccedil;&atilde;o</strong>. Para alterar o idioma da notifica&ccedil;&atilde;o de SMS, v&aacute; para <strong>Menu principal</strong> &gt; <strong>Painel de controle</strong> &gt; <strong>Op&ccedil;&otilde;es regionais</strong>, clique na guia <strong>Idioma</strong> e selecione seu idioma preferido do menu suspenso da se&ccedil;&atilde;o <strong>Idioma de notifica&ccedil;&atilde;o</strong>.</p>
<ol><span class="note_head">Limita&ccedil;&otilde;es:</span><li>Nome de usu&aacute;rio: distingue mai&uacute;sculas de min&uacute;sculas e deve ter entre 1 e 32 caracteres Unicode.</li>
<li>Senha: distingue mai&uacute;sculas de min&uacute;sculas e deve ter de 0 a 128 caracteres vis&iacute;veis incluindo letras, n&uacute;meros, sinais e espa&ccedil;os.</li>
<li>O limite de intervalo de SMS deve estar entre 1 e 10.000 minutos.</li>
</ol>
<h4>Para criar uma configura&ccedil;&atilde;o de fornecedor de SMS:</h4>
<ol>
<li>Clique em <b>Adicionar fornecedor de servi&ccedil;o SMS</b>.</li>
<li>No campo <b>Nome do provedor</b>, digite o nome do seu provedor de servi&ccedil;o de SMS.</li>
<li>No campo <b>URL de SMS</b>, digite uma URL de SMS com o conte&uacute;do da mensagem definido como &quot;Hello world&quot;. Voc&ecirc; pode obter a URL de SMS com seu provedor de servi&ccedil;o de SMS.</li>
<li>Clique em <b>Avan&ccedil;ar</b>.</li>
<li>O sistema quebrar&aacute; a URL de SMS em v&aacute;rios par&acirc;metros. Defina cada par&acirc;metro selecionando a categoria correspondente. Cada categoria de par&acirc;metro pode ser usada somente uma vez, exceto <b>Outros</b>.</li>
</ol>
<ol><a name='smshowto'></a><span class="note_head">Limita&ccedil;&otilde;es:</span><li>Nome do fornecedor: distingue mai&uacute;sculas de min&uacute;sculas e deve ter entre 1 e 32 caracteres Unicode.</li>
<li>URL de SMS: distingue mai&uacute;sculas de min&uacute;sculas e deve ter entre 1 e 500 caracteres Unicode. O n&uacute;mero de par&acirc;metros deve estar entre 4 e 10. Esta URL de SMS est&aacute; dispon&iacute;vel apenas para fins de configura&ccedil;&atilde;o. Nenhuma mensagem de SMS ser&aacute; enviada ap&oacute;s a conclus&atilde;o da configura&ccedil;&atilde;o. O formato dessa URL &eacute; fornecido pelo provedor de servi&ccedil;o de SMS e a URL deve incluir os seguintes par&acirc;metros: nome de usu&aacute;rio, senha, telefone de destino e conte&uacute;do da mensagem. Usando a Clickatell como exemplo, uma URL poss&iacute;vel seria: https://api.clickatell.com/http/sendmsg?user=TestUser&amp;password=TestPassword&amp;api_id=3148203&amp;to=886123456789&amp;text=Hello+world. Note que no par&acirc;metro &quot;conte&uacute;do da mensagem&quot;, o espa&ccedil;o entre &quot;Hello&quot; e &quot;world&quot; ser&aacute; substitu&iacute;do pelo caractere particular definido pelo fornecedor de servi&ccedil;o.</li>	

</ol>
</body>
</html>
