<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="login"></a>Estilo de logon</h2>

<p>&Eacute; poss&iacute;vel personalizar a apar&ecirc;ncia da tela de login do DSM escolhendo a partir de uma variedade de modelos, alterando a imagem de fundo ou adicionando um logotipo. Para fazer isso, v&aacute; para <strong>Painel de controle</strong> &gt; <strong>Estilo de logon</strong>.</p>

<h4>Para personalizar a tela de logon do DSM:</h4>
<p>As op&ccedil;&otilde;es a seguir aparecem na p&aacute;gina <strong>Estilo de logon</strong>:</p>
<ul>
<li><strong>T&iacute;tulo da p&aacute;gina de logon:</strong> O texto inserido aqui aparece na tela de logon.</li>
<li><strong>Informa&ccedil;&otilde;es de tempo:</strong> Selecione para mostrar ou ocultar informa&ccedil;&otilde;es meteorol&oacute;gicas locais na tela de logon.</li>
<li><strong>Modelo:</strong> Selecione uma imagem de fundo e esquema de cores padr&atilde;o. O modelo escolhido ter&aacute; efeito na pr&oacute;xima vez que voc&ecirc; entrar no DiskStation.</li>
<li><strong>Fundo:</strong> Para alterar a imagem de fundo que aparece na tela de logon, clique na imagem existente ou no sinal de mais (<strong>+</strong>) se nenhuma imagem estiver selecionada. Voc&ecirc; pode escolher entre pap&eacute;is de parede padr&atilde;o, imagens armazenadas no DiskStation ou imagens utilizadas anteriormente. Apenas os formatos de arquivo de imagem JPE, JPEG, JPG, BMP, GIF ou PNG s&atilde;o suportados.</li>
<li><strong>Logotipo:</strong> Para adicionar um logotipo na tela de logon, clique no logotipo existe ou no sinal de mais (<strong>+</strong>) se nenhuma imagem estiver selecionada. Voc&ecirc; pode carregar uma imagem menor do que 1 MB, escolher entre as imagens armazenadas no DiskStation ou escolher uma imagem usada anteriormente.</li>
</ul>

</body>
</html>

