
<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>E-mail - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Enabling email notifications allows your DiskStation to send messages to your email when specified events occur.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>E-mail</h2>
<p class="disable-eds14">A ativa&ccedil;&atilde;o de notifica&ccedil;&otilde;es de e-mail permite que o DiskStation envie mensagens para o seu e-mail quando ocorrerem eventos espec&iacute;ficos, como erros de sistema, perda de conex&atilde;o de rede, comportamento da ventoinha, falha de energia ou falha da tarefa de backup.</p>

<p class="enable-eds14">A ativa&ccedil;&atilde;o de notifica&ccedil;&otilde;es de e-mail permite que o DiskStation envie mensagens para o seu e-mail quando ocorrerem eventos espec&iacute;ficos, como erros de sistema, perda de conex&atilde;o de rede, falha de energia ou falha da tarefa de backup.</p>


<h4>Para ativar a notifica&ccedil;&atilde;o por e-mail:</h4>
<ol>
<li>V&aacute; at&eacute; <strong>Painel de Controle</strong> &gt; <strong>Notifica&ccedil;&otilde;es</strong> &gt; <strong>E-mail</strong>.</li>
<li>Marque <strong>Ativar notifica&ccedil;&otilde;es por e-mail</strong>.</li>
<li>Digite um ou mais endere&ccedil;os de e-mail no campo <strong>Destinat&aacute;rios</strong>. As notifica&ccedil;&otilde;es do sistema ser&atilde;o enviadas para os endere&ccedil;os inseridos aqui. S&atilde;o permitidos dois endere&ccedil;os. &Eacute; poss&iacute;vel separar v&aacute;rios endere&ccedil;os por um ponto e v&iacute;rgula (;).</li>
<li>Se necess&aacute;rio, adicione um prefixo de assunto no campo <strong>Prefixo do assunto</strong>. Esse prefixo ser&aacute; adicionado ao assunto de cada mensagem enviada pelo DiskStation, ajudando a identificar e filtrar mensagens.</li>
<li>Se desejar usar um servidor de e-mail de terceiros (como Gmail, Outlook, Yahoo!) para encaminhar mensagens, consulte a se&ccedil;&atilde;o &quot;servi&ccedil;o de e-mail de terceiros&quot; abaixo. Se desejar usar um servidor personalizado, consulte a se&ccedil;&atilde;o &quot;servidor SMTP personalizado&quot;. </li>
</ol>




<h4>Para usar um servi&ccedil;o de e-mail de terceiros:</h4>
<ol>


<li>No menu <strong>Provedor de servi&ccedil;o</strong> escolha um servi&ccedil;o de e-mail de terceiros, como o Gmail, Yahoo ou Outlook.</li>
<li>Digite seu nome de usu&aacute;rio e sua senha para o servi&ccedil;o de e-mail selecionado.</li>
<li>Clique em <strong>Aplicar</strong> para salvar as configura&ccedil;&otilde;es.</li>
<li>Voc&ecirc; pode clicar em <strong>Enviar um e-mail de teste</strong> para ver se as configura&ccedil;&otilde;es est&atilde;o corretas.</li>
</ol>

<h4>Para usar um servidor SMTP personalizado:</h4>
<ol>


<li>No menu <strong>Provedor de servi&ccedil;o</strong>, selecione <strong>Servidor SMTP personalizado</strong>.</li>
<li>Digite o nome do servidor SMTP ou o endere&ccedil;o IP no campo <strong>Servidor SMTP</strong>. </li>
<li>Digite o n&uacute;mero da porta SMTP no campo <strong>Porta SMTP</strong>. (Se voc&ecirc; tiver especificado uma porta SMTP diferente ao configurar as regras de envio de porta, digite esse n&uacute;mero.)</li>
<li>Se seu servidor SMTP exigir autentica&ccedil;&atilde;o, marque <strong>Autentica&ccedil;&atilde;o obrigat&oacute;ria</strong>, digite o <strong>Nome de usu&aacute;rio</strong> e <strong>Senha</strong> do servidor de e-mail. </li>
<li>Se seu servidor SMTP exigir conex&atilde;o SSL/TLS, marque <strong>A conex&atilde;o segura (SSL/TLS) &eacute; necess&aacute;ria</strong>.
<li>Se quiser personalizar o nome do remetente que aparece nos e-mails enviados pelo DiskStation, digite o nome no campo <strong>Nome do remetente</strong>. Se quiser personalizar o endere&ccedil;o de e-mail do remetente, digite o endere&ccedil;o de e-mail no campo <strong>E-mail do remetente</strong>. Se o campo estiver em branco, o primeiro endere&ccedil;o de e-mail no campo <strong>Destinat&aacute;rio</strong> ser&aacute; usado.</li>
<li>Clique em <strong>Aplicar</strong> para salvar as configura&ccedil;&otilde;es.</li>
<li>Voc&ecirc; pode clicar em <strong>Enviar um e-mail de teste</strong> para ver se as configura&ccedil;&otilde;es est&atilde;o corretas.</li>
</ol>






<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se desejar enviar uma mensagem de boas-vindas para cada conta de usu&aacute;rio rec&eacute;m-criada, marque <strong>Enviar uma mensagem de boas-vindas para novos usu&aacute;rios</strong> e todos os usu&aacute;rios receber&atilde;o uma mensagem de boas-vindas ao criar uma conta.</li>
<li>O idioma da notifica&ccedil;&atilde;o de e-mail pode ser definida em <strong>Idioma de notifica&ccedil;&atilde;o</strong>. Para alterar o idioma das notifica&ccedil;&otilde;es de e-mail, v&aacute; para <strong>Menu Principal</strong> &gt; <strong>Painel de Controle</strong> &gt; <strong>Op&ccedil;&otilde;es Regionais</strong>,  clique na guia <strong>Idioma</strong> e selecione o idioma no menu suspenso na se&ccedil;&atilde;o <strong>Idioma de Notifica&ccedil;&otilde;es</strong>.</li>
<li>Se voc&ecirc; estiver usando o servidor SMTP do Gmail e tiver ativado a verifica&ccedil;&atilde;o em duas etapas, lembre-se de usar a &quot;senha espec&iacute;fica para aplicativo&quot; fornecida pelo Google para autentica&ccedil;&atilde;o SMTP.</li>
</ul>
</div>

<div class="section">
<h4>Nome do dom&iacute;nio do servidor SMTP:</h4>
<p>O servidor SMTP pode ser um endere&ccedil;o IP ou um nome de dom&iacute;nio. Caso seja um nome de dom&iacute;nio, verifique se o IP v&aacute;lido do DNS server foi digitado no <b>Menu principal</b> &gt; <b>Painel de controle</b> &gt; <b>Rede</b> e verifique se o servidor est&aacute; na Internet. </p>


</div>
</body>
</html>
