<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Alimenta&ccedil;&atilde;o</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Hiberna&ccedil;&atilde;o</h2>
<p>Voc&ecirc; pode especificar o tempo em que os discos r&iacute;gidos permanecem ociosos antes de entrar no modo de hiberna&ccedil;&atilde;o do HDD. Durante a hiberna&ccedil;&atilde;o do HDD, os discos r&iacute;gidos param de girar, reduzindo o consumo de energia e estendendo a vida &uacute;til dos discos r&iacute;gidos. &Eacute; poss&iacute;vel especificar per&iacute;odos diferentes para discos r&iacute;gidos internos e discos r&iacute;gidos externos eSATA/USB.</p>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>A hiberna&ccedil;&atilde;o do HDD &eacute; interrompida no acesso.</li>
<li>Apenas alguns dispositivos de armazenamento USB externo suportam a hiberna&ccedil;&atilde;o do HDD.</li>
</ul>
</div>


<div class="section">
<h4>Por que meu DiskStation n&atilde;o hiberna?</h4>

<p>Observe que os servi&ccedil;os a seguir impedir&atilde;o que o DiskStation entre no modo de hiberna&ccedil;&atilde;o. Al&eacute;m disso, o sistema sair&aacute; do modo de hiberna&ccedil;&atilde;o dois minutos antes de qualquer tarefa agendada.</p>

<p><strong>Pacotes:</strong></p>
<ul>
  <li>Download Station: o DiskStation n&atilde;o pode hibernar se o Download Station estiver executando downloads agendados de RSS, eMule ou tarefas ativas.</li>
  <li>Mail Station: O DiskStation n&atilde;o poder&aacute; hibernar se o Mail Station estiver buscando do POP3.</li>
  <li>Surveillance Station: O DiskStation n&atilde;o pode hibernar se o Surveillance Station estiver gravando.</li>
  <li>Servidor de m&iacute;dia: O DiskStation n&atilde;o pode hibernar se o registro DMA estiver habilitado em configura&ccedil;&otilde;es do Servidor de m&iacute;dia (V&aacute; para <strong>Menu principal</strong> &gt; <strong>Servidor de m&iacute;dia</strong> &gt; <strong>Servidor de m&iacute;dia</strong> &gt; <strong>Diagn&oacute;stico</strong>).</li>
  <li>Directory Server</li>
  <li>Webalizer</li>
  <li>Logitech<sup>&reg;</sup> Media Server</li>
  <li>Plex Media Server</li>
  <li>Outro software de terceiro ou optware como o SABnzbd</li>
</ul>
<p><strong>Processos:</strong></p>
<ul>
  <li>Miniaturas e indexa&ccedil;&atilde;o: O DiskStation n&atilde;o pode hibernar ao gerar miniaturas ou reindexar arquivos multim&iacute;dia ap&oacute;s a atualiza&ccedil;&atilde;o. Durante esse tempo, o processo &ldquo;synoindexd&rdquo; ser&aacute; indicado como &ldquo;Em execu&ccedil;&atilde;o&rdquo; (V&aacute; para <strong>Menu principal</strong> &gt; <strong>Monitor de recursos</strong> &gt; <strong>Processo</strong>).</li>
  <li>Local Master Browser: O DiskStation n&atilde;o pode hibernar se o Local Master Browser estiver habilitado (V&aacute; para <strong>Painel de Controle</strong> &gt; <strong>Win/Mac/NFS</strong> &gt; <strong>Servi&ccedil;o de Arquivos do Windows</strong> &gt; <strong>Habilitar Local Master Browser</strong>).</li>
  <li>Windows Media Player: O DiskStation n&atilde;o pode hibernar se o servi&ccedil;o de compartilhamento de rede do Windows Media Player estiver habilitado na LAN.</li>
  <li>O DiskStation n&atilde;o pode hibernar se o n&uacute;mero de processos concomitantes exigir troca, em que a capacidade de mem&oacute;ria RAM tenha sido ultrapassada e os HDDs sejam usados temporariamente para opera&ccedil;&otilde;es de leitura/grava&ccedil;&atilde;o.</li>
</ul>
<p><strong>Outros</strong></p>
<ul>
  <li>Dispositivos USB: O DiskStation n&atilde;o pode entrar na Hiberna&ccedil;&atilde;o do sistema se algum dispositivo USB estiver conectado &agrave; unidade. </li>
</ul>

</div>


<h3>Hiberna&ccedil;&atilde;o do sistema</h3>
<p>Voc&ecirc; pode definir o DiskStation para entrar em hiberna&ccedil;&atilde;o do sistema um minuto ap&oacute;s os discos r&iacute;gidos iniciarem a hiberna&ccedil;&atilde;o. A hiberna&ccedil;&atilde;o do sistema reduz o consumo de energia do DiskStation.  </p>
<p>Durante o modo de hiberna&ccedil;&atilde;o do sistema:</p>

<ol>
  <li>O bot&atilde;o Liga/Desliga entra no modo intermitente (ciclo liga/desliga lento). Os outros LEDs apagam.</li>
  <li>A energia dos discos r&iacute;gidos &eacute; desligada.</li>
  <li>A CPU para.</li>
  <li>A ventoinha externa para.</li>
  <li>Os LEDs das portas LAN desligam.</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Qualquer pacote de transmiss&atilde;o SMB/CIFS pode impedir que o servidor entre na hiberna&ccedil;&atilde;o do sistema, incluindo qualquer navegador de arquivos do Windows funcionando na rede. Caso voc&ecirc; deseje ignorar os pacotes de transmiss&atilde;o do CIFS ao entrar na hiberna&ccedil;&atilde;o do sistema, selecione <strong>Ignorar os pacotes de transmiss&atilde;o do Windows Explorer</strong>. Esteja ciente de que quando essa op&ccedil;&atilde;o for selecionada, os pacotes SMB/CIFS n&atilde;o poder&atilde;o ser usados para sair da hiberna&ccedil;&atilde;o do sistema. A conex&atilde;o de qualquer dispositivo USB tamb&eacute;m impedir&aacute; que o servidor entre na hiberna&ccedil;&atilde;o do sistema.</li>
</ul>
</div>

<h2>Sono profundo</h2>
<p>O sono profundo para unidades de expans&atilde;o pode ser habilitado atrav&eacute;s da interface emparelhada do DiskStation. Voc&ecirc; pode configurar a unidade de expans&atilde;o e o DiskStation emparelhado para ficar ocioso por per&iacute;odos diferentes. Portanto, as unidades de expans&atilde;o podem ser configuradas para entrar em sono profundo enquanto o DiskStation emparelhado permanece on-line.</p>
<p>Durante o modo sono profundo:</p>
<ul>
  <li>Todos os LEDs da unidade de expans&atilde;o ser&atilde;o apagados.</li>
<li>A energia dos discos r&iacute;gidos da unidade expans&atilde;o ser&aacute; cortada.</li>
<li>A ventoinha da unidade de expans&atilde;o parar&aacute;.</li>
</ul>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>O sono profundo &eacute; interrompido no acesso.</li>
<li>Para garantir a opera&ccedil;&atilde;o normal ao usar a fun&ccedil;&atilde;o sono profundo na unidade de expans&atilde;o, deslize o interruptor <b>Auto/Manual</b> do painel traseiro para <b>Auto</b>.</li>
</ul>
</div>

<h2>Desligamento autom&aacute;tico</h2>
<p>Voc&ecirc; pode especificar o per&iacute;odo de tempo durante o qual o disco interno ir&aacute; permanece em estado de hiberna&ccedil;&atilde;o antes de seu DiskStation desligar automaticamente.</p>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Voc&ecirc; deve habilitar a hiberna&ccedil;&atilde;o do HDD interno primeiro.</li>
<li>Voc&ecirc; deve habilitar o servi&ccedil;o WOL primeiro para que voc&ecirc; possa acionar remotamente o seu DiskStation.</li>
</ul>
</div>

</body>
</html>

