<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Notifica&ccedil;&atilde;o</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="advanced"></a>Avan&ccedil;ado</h2>
<p>Voc&ecirc; pode selecionar os tipos de eventos que ir&atilde;o disparar o sistema para enviar mensagens de notifica&ccedil;&atilde;o bem como o meio (e-mail, SMS, celular e programas de mensagens instant&acirc;neas) que receber&aacute; as mensagens. </p>
<p>Cada um dos eventos tem sua pr&oacute;pria mensagem de notifica&ccedil;&atilde;o, mas voc&ecirc; tamb&eacute;m ter&aacute; a op&ccedil;&atilde;o de personalizar o seu pr&oacute;prio conte&uacute;do da notifica&ccedil;&atilde;o editando a mensagem de notifica&ccedil;&atilde;o. A mensagem padr&atilde;o pode ser restaurada se voc&ecirc; decidir descartar suas configura&ccedil;&otilde;es personalizadas posteriormente.</p>

<ul class="disable-eds14">
<li><strong>Todas as notifica&ccedil;&otilde;es</strong>: Como o nome sugere, ele inclui todos os tipos de eventos de notifica&ccedil;&atilde;o.</li>
<li><b>Por prioridade:</b> Dependendo da import&acirc;ncia dos eventos de notifica&ccedil;&atilde;o, eles s&atilde;o filtrados em dois grupos: <strong>Cr&iacute;tico</strong> e <strong>Informativo</strong>.</li>
<ul>
<li><b>Cr&iacute;tico</b>: eventos que exigem que voc&ecirc; tome as medidas corretivas imediatamente pertencem a esse grupo.</li>
<li><strong>Informativo</strong>: eventos que n&atilde;o exigem nenhuma a&ccedil;&atilde;o corretiva e visam a inform&aacute;-lo sobre altera&ccedil;&otilde;es do status do sistema pertencem a esse grupo.</li>
</ul>
<li><b>Por Categoria</b>: dependendo da natureza dos eventos de notifica&ccedil;&atilde;o, eles s&atilde;o filtrados em seis grupos: <strong>Sistema</strong>, <strong>Armazenamento interno</strong>, <strong>Backup e restaura&ccedil;&atilde;o</strong>, <strong>Fonte de alimenta&ccedil;&atilde;o</strong>, <strong>USBCopy</strong>, <strong>CMS</strong> e <strong>Armazenamento externo</strong>.</li>
<ul>
<li><b>Sistema</b>: eventos relativos &agrave;s altera&ccedil;&otilde;es ou erros do sistema pertencem a esse grupo.</li>
<li><strong>Armazenamento interno</strong>: eventos relativos ao armazenamento interno pertencem a esse grupo.</li>
<li><strong>Backup e restaura&ccedil;&atilde;o</strong>: eventos relativos &agrave;s tarefas de backup e restaura&ccedil;&atilde;o pertencem a esse grupo.</li>
<li><strong>Alimenta&ccedil;&atilde;o</strong>: eventos relativos &agrave; fonte de alimenta&ccedil;&atilde;o pertencem a esse grupo. </li>
<li><strong>USBCopy</strong>: eventos relativos ao USBCopy pertencem a esse grupo.</li>
<li><strong>CMS</strong>: Eventos relevantes para conex&atilde;o/desconex&atilde;o com o host CMS pertencem a esse grupo.</li>
<li><strong>Armazenamento externo</strong>: Eventos relativos ao armazenamento externo pertencem a esse grupo.</li>
</ul>
</ul>

<ul class="enable-eds14">
<li><strong>Todas as notifica&ccedil;&otilde;es</strong>: Como o nome sugere, ele inclui todos os tipos de eventos de notifica&ccedil;&atilde;o.</li>
<li><b>Por prioridade:</b> Dependendo da import&acirc;ncia dos eventos de notifica&ccedil;&atilde;o, eles s&atilde;o filtrados em dois grupos: <strong>Cr&iacute;tico</strong> e <strong>Informativo</strong>.</li>
<ul>
<li><b>Cr&iacute;tico</b>: eventos que exigem que voc&ecirc; tome as medidas corretivas imediatamente pertencem a esse grupo.</li>
<li><strong>Informativo</strong>: eventos que n&atilde;o exigem nenhuma a&ccedil;&atilde;o corretiva e visam a inform&aacute;-lo sobre altera&ccedil;&otilde;es do status do sistema pertencem a esse grupo.</li>
</ul>
<li><b>Por Categoria</b>: dependendo da natureza dos eventos de notifica&ccedil;&atilde;o, eles s&atilde;o filtrados em seis grupos: <strong>Sistema</strong>, <strong>Armazenamento interno</strong>, <strong>Backup e restaura&ccedil;&atilde;o</strong>, <strong>Fonte de alimenta&ccedil;&atilde;o</strong>, e <strong>Armazenamento externo</strong>.</li>
<ul>
<li><b>Sistema</b>: eventos relativos &agrave;s altera&ccedil;&otilde;es ou erros do sistema pertencem a esse grupo.</li>
<li><strong>Backup e restaura&ccedil;&atilde;o</strong>: eventos relativos &agrave;s tarefas de backup e restaura&ccedil;&atilde;o pertencem a esse grupo.</li>
<li><strong>Alimenta&ccedil;&atilde;o</strong>: eventos relativos &agrave; fonte de alimenta&ccedil;&atilde;o pertencem a esse grupo. </li>
<li><strong>CMS</strong>: Eventos relevantes para conex&atilde;o/desconex&atilde;o com o host CMS pertencem a esse grupo.</li>
<li><strong>Armazenamento externo</strong>: Eventos relativos ao armazenamento externo pertencem a esse grupo.</li>
</ul>
</ul>



<h4>Para selecionar os tipos e o meio dos eventos de notifica&ccedil;&atilde;o:</h4>
<ol>
<li>Selecione um grupo de eventos do menu suspenso nas guias. Os eventos do grupo selecionado ser&atilde;o exibidos.</li>
<li>Marque as caixas de sele&ccedil;&atilde;o para cada evento individual para selecionar o meio de notifica&ccedil;&atilde;o de sua prefer&ecirc;ncia.</li>
<li>Clique em <b>Salvar</b> para aplicar as configura&ccedil;&otilde;es.</li>
</ol>
<h4>Para editar a mensagem de notifica&ccedil;&atilde;o:</h4>
<ol>
<li>Selecione um evento cuja mensagem de notifica&ccedil;&atilde;o voc&ecirc; deseja editar da lista de eventos e depois clique em <b>Editar Mensagem</b>.</li>
<li>Na janela que aparece, digite na linha de assunto e conte&uacute;do do corpo para personalizar a mensagem de notifica&ccedil;&atilde;o e depois clique em <strong>Salvar</strong> para aplicar as altera&ccedil;&otilde;es.</li>
<li>Se voc&ecirc; quiser restaurar a mensagem padr&atilde;o de uma notifica&ccedil;&atilde;o ap&oacute;s as altera&ccedil;&otilde;es serem salvas, fa&ccedil;a o seguinte:</li>
<ol>
<li>Selecione um evento cuja mensagem de notifica&ccedil;&atilde;o voc&ecirc; deseja restaurara para os valores padr&atilde;o da lista de eventos e depois clique em <b>Editar Mensagem</b>.</li>
<li>Na janela que aparece, clique em <b>Restaurar padr&otilde;es</b> e depois clique em <strong>Sim</strong> na caixa de di&aacute;logo solicitando a confirma&ccedil;&atilde;o.</li>
</ol>
</ol>

<p><span class="note_head">Observa&ccedil;&atilde;o:</span> Sugerimos que voc&ecirc; reserve os segmentos de sequ&ecirc;ncia contendo &apos;%&apos; na linha de assunto e no conte&uacute;do do corpo. Eles ser&atilde;o substitu&iacute;dos pelas informa&ccedil;&otilde;es atuais do sistema quando a notifica&ccedil;&atilde;o for enviada.</p>
</body>
</html>
