<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Atualiza&ccedil;&atilde;o do DSM</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1><a name="leaf_update"></a>Atualiza&ccedil;&atilde;o do DSM</h1>
<p>Periodicamente a Synology libera atualiza&ccedil;&otilde;es gratuitas do DSM. As atualiza&ccedil;&otilde;es podem incluir novas caracter&iacute;sticas, melhoria de funcionalidades e de desempenho.</p>
<p><span class="note_head">Importante:</span>  Normalmente, a atualiza&ccedil;&atilde;o do DSM n&atilde;o afeta os dados no DiskStation. Entretanto, para garantir a seguran&ccedil;a dos dados, &eacute; fortemente recomendado efetuar um backup de seus dados antes de iniciar.</p>

<h2>Executar a atualiza&ccedil;&atilde;o manual do DSM</h2>
<p>Voc&ecirc; pode fazer download do arquivo de atualiza&ccedil;&atilde;o .pat no <a href="http://www.synology.com/support/download.php" target="_blank">Centro de Downloads</a> da Synology e executar a atualiza&ccedil;&atilde;o manual do DSM.</p>
<h4>Para executar a atualiza&ccedil;&atilde;o manual do DSM:</h4>

<ol>
<li>Visite <a href="http://www.synology.com" target="_blank">www.synology.com</a> para baixar a atualiza&ccedil;&atilde;o mais recente do DSM para seu computador local. Descompacte o arquivo para obter um arquivo de atualiza&ccedil;&atilde;o .pat.</li>
<li>Clique em <b>Atualiza&ccedil;&atilde;o manual do DSM</b> para entrar na p&aacute;gina de Atualiza&ccedil;&atilde;o manual do DSM</li>
<li>Clique em <b>Procurar</b> para selecionar o arquivo de atualiza&ccedil;&atilde;o.</li>
<li>Clique em <b>Aplicar</b> para come&ccedil;ar a atualizar seu DSM. O sistema ser&aacute; reiniciado automaticamente quando a atualiza&ccedil;&atilde;o for completada.</li>
</ol>
<div class="section">
<h4>Solu&ccedil;&atilde;o de problemas:</h4>
<p>Se n&atilde;o puder atualizar o DSM, as sugest&otilde;es a seguir podem ajudar a resolver seu problema:</p>
<ul>
<li>Verifique se o processo de atualiza&ccedil;&atilde;o for interrompido pelo usu&aacute;rio ou outros eventos inesperados, como uma pane na rede el&eacute;trica.</li>
<li>Verifique a vers&atilde;o do DSM. Voc&ecirc; pode atualizar o sistema apenas com uma vers&atilde;o mais nova do DSM.</li>
<li>Baixe a atualiza&ccedil;&atilde;o do DSM novamente porque o arquivo de atualiza&ccedil;&atilde;o pode estar corrompido.</li>
</ul>
<p>Se o problema persistir, contate o <a href="https://account.synology.com/support/support_form.php" target="_blank">Suporte T&eacute;cnico</a> da Synology.</p>
</div>

<h2>Executar a atualiza&ccedil;&atilde;o autom&aacute;tica do DSM</h2>
<p>Diferente da atualiza&ccedil;&atilde;o manual, todas as vezes que voc&ecirc; for &agrave; <b>Atualiza&ccedil;&atilde;o do DSM</b>, o sistema verificar&aacute; com a Synology se h&aacute; um novo DSM dispon&iacute;vel para download e exibir&aacute; o resultado em texto verde ou vermelho. Se o resultado disser que o DSM mais recente est&aacute; pronto para download, o sistema far&aacute; o download do DSM para voc&ecirc; e executar&aacute; a atualiza&ccedil;&atilde;o.</p>
<h4>Para que o sistema fa&ccedil;a a atualiza&ccedil;&atilde;o do DSM mais recente e execute a atualiza&ccedil;&atilde;o:</h4>
<ol>
<li>Se o DSM mais recente estiver pronto para download, clique no link <b>Baixar</b> para que o sistema baixe o DSM mais recente para voc&ecirc;.</li>
<li>O sistema mostrar&aacute; uma das notifica&ccedil;&otilde;es de &aacute;rea de trabalho a seguir para lhe avisar se o download foi ou n&atilde;o bem sucedido: <b>Download do DSM conclu&iacute;do</b> ou <b>Erro no Download do DSM</b>.</li>
<li>Clique na janela da notifica&ccedil;&atilde;o de &aacute;rea de trabalho para ir &agrave; <b>Atualiza&ccedil;&atilde;o do DSM</b>.</li>
<li>Execute um dos seguintes procedimentos:<ul>
<li>Se o download do DSM foi conclu&iacute;do, clique em <b>Atualizar agora</b> para iniciar imediatamente a atualiza&ccedil;&atilde;o do DSM.</li>
<li>Se houve erro no download do DSM, clique em <b>Tentar novamente</b> para que o sistema baixe novamente o DSM mais recente da Synology.</li>
</ul>
</li>
</ol>
<h4>Para verificar regularmente as atualiza&ccedil;&otilde;es:</h4>
<ol>
<li>Marque <b>Verificar atualiza&ccedil;&otilde;es do DSM automaticamente.</b></li>
<li>Escolha um plano de atualiza&ccedil;&atilde;o e configure a <b>Programa&ccedil;&atilde;o de instala&ccedil;&atilde;o</b>.</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<p>Uma notifica&ccedil;&atilde;o ser&aacute; exibida na &aacute;rea de trabalho quando uma atualiza&ccedil;&atilde;o do DSM for baixada e estiver pronta para ser instalada. Para interromper a atualiza&ccedil;&atilde;o autom&aacute;tica do DSM, voc&ecirc; pode cancel&aacute;-la na notifica&ccedil;&atilde;o da &aacute;rea de trabalho ou alterando as <strong>Configura&ccedil;&otilde;es de atualiza&ccedil;&atilde;o</strong>. As atualiza&ccedil;&otilde;es do DSM ser&atilde;o instaladas antes do desligamento programado, se voc&ecirc; tiver habilitado o <strong>Desligamento</strong> no <strong>Agendamento de energia</strong>.</p>

<div class="section">
<h4>Solu&ccedil;&atilde;o de problemas:</h4>
<p>Se voc&ecirc; vir mensagens de erro (em texto vermelho) durante a verifica&ccedil;&atilde;o ou download do DSM mais recente, as sugest&otilde;es a seguir podem ajudar a resolver seu problema:</p>
<ul>
<li>Certifique-se de que o DiskStation est&aacute; conectado &agrave; Internet.</li>
<li>O servidor de download da Synology pode estar ocupado no momento. Tente fazer o download de novo mais tarde; isso pode resolver o problema.</li>
</ul>
<p>Se o problema persistir, contate o <a href="https://account.synology.com/support/support_form.php" target="_blank">Suporte T&eacute;cnico</a> da Synology.</p>
</div>

</body>
</html>
