<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Dispositivos Externos</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="usbprinter"></a>Impressoras</h2>
<p>O DiskStation pode se transformar em uma servidor de impress&atilde;o, permitindo aos computadores clientes e aos dispositivos m&oacute;veis acessarem impressoras conectadas ao DiskStation. Al&eacute;m disso, os suportes Impress&atilde;o sem fio Apple e Google Cloud Print permitem imprimir remotamente usando dispositivos iOS ou produtos e servi&ccedil;os Google.</p>
<p>Visite <a href="http://www.synology.com" target="_blank">www.synology.com</a> para encontrar impressoras compat&iacute;veis.</p>

<h3>Configura&ccedil;&atilde;o de impressoras</h3>
<p>Veja as instru&ccedil;&otilde;es abaixo para configurar e conectar uma impressora <span style="display: inline;" class="disable-rc18015xsp">USB ou </span> de rede ao seu DiskStation.</p>


<h4 class="disable-rc18015xsp">Para configurar uma impressora USB:</h4>
<ol class="disable-rc18015xsp">
<li>Ligue e conecte a impressora em uma porta USB no DiskStation.</li>
<li>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Dispositivos externos</strong> &gt; <strong>Impressora</strong>.</li>
<li>Selecione a impressora que deseja configurar. Observe que o DiskStation n&atilde;o consegue reconhecer impressoras conectadas via hubs USB.</li>
<li>Clique em <b>Gerenciador de impressoras</b> e selecione <b>Configurar impressora</b>.</li>
<li>Na caixa de di&aacute;logo, selecione um dos modos a seguir:
<ul>
<li><b>Multifuncional de rede:</b> permite aos clientes dentro da rede local usar as fun&ccedil;&otilde;es imprimir, digitalizar e enviar fax da sua impressora multifuncional. A digitaliza&ccedil;&atilde;o e o envio de fax est&atilde;o dispon&iacute;veis apenas para computadores com Windows.</li>
<li><b>Impressora de rede:</b> selecione este modo para impressoras que suportam apenas impress&atilde;o ou se quiser permitir que os clientes usem apenas a fun&ccedil;&atilde;o de impress&atilde;o.</li>
</ul>
</li>
<li>Defina as configura&ccedil;&otilde;es de impress&atilde;o sem fio Apple ou Google Cloud Print (opcional).</li>
<li>Clique em <b>Salvar</b>.</li>
</ol>

<div class="section disable-rc18015xsp">
<h4>Nota:</h4>
<p>um MFP de rede s&oacute; pode ser acessado por um cliente ao mesmo tempo.</p>
</div>


<h4>Para configurar uma impressora de rede:</h4>
<ol>
<li>Ligue e conecte a impressora de rede na mesma rede local que o seu DiskStation.</li>
<li>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Dispositivos externos</strong> &gt; <strong>Impressora</strong>.</li>
<li>Clique em <b>Adicionar impressora de rede</b> e siga as instru&ccedil;&otilde;es no assistente de configura&ccedil;&atilde;o.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li><strong>Nome da impressora:</strong> o nome da impressora deve ser inserido durante a configura&ccedil;&atilde;o e pode incluir at&eacute; 32 caracteres, incluindo letras, n&uacute;meros e sublinhados.</li>
	<li><strong>Protocolo:</strong> em geral, as impressoras de rede HP usam Socket; as impressoras de rede Canon usam BJNP; e a maioria das outras usa LPR.</li>
<li><strong>Nome da fila:</strong> &eacute; necess&aacute;rio digitar um nome de fila para as impressoras de rede LPR e IPP, mas isso n&atilde;o &eacute; aplic&aacute;vel para impressoras Socket ou BJNP.</li>
<li><strong>Nenhuma multifuncional de rede:</strong> As impressoras de rede conectadas ao DiskStation n&atilde;o podem usar o modo multifuncional de rede no momento.</li>
<li><strong>Nenhuma impressora USB:</strong> as impressoras USB compartilhadas por um produto Synology n&atilde;o podem ser definidas como impressoras de rede.</li>
</ul>
</div>


<h3>Gerenciar impressoras</h3>
<p>A guia Impressora inclui as seguintes op&ccedil;&otilde;es para gerenciar impressoras <span style="display: inline;" class="disable-rc18015xsp">USB ou </span> de rede conectadas ao DiskStation.</p>

<ul>
<li><b>Obter Informa&ccedil;&otilde;es:</b> exibe informa&ccedil;&otilde;es relacionadas &agrave; impressora selecionada, tais como o nome do dispositivo, fabricante, status, etc.</li>
<li><strong>Remo&ccedil;&atilde;o:</strong> remove e desconecta uma impressora do DiskStation.</li>
<li><strong>Gerenciador de impressoras:</strong> inclui as seguintes op&ccedil;&otilde;es:
<ul>
<li><strong>Configurar impressora</strong>: edite as configura&ccedil;&otilde;es da impressora, tais como Impress&atilde;o sem fio Apple ou Google Cloud Print (veja as instru&ccedil;&otilde;es abaixo).</li>
<li><strong>Limpar o espa&ccedil;o do spool:</strong> cancela todas as tarefas de impress&atilde;o em todas as impressoras.</li>
<li><strong>P&aacute;gina de teste de impress&atilde;o:</strong> imprime uma p&aacute;gina de teste para ter certeza de que as configura&ccedil;&otilde;es est&atilde;o corretas..</li>
<li><b>Liberar Impressora:</b> Desconecta a impressora e o cliente (apenas para o modo multifuncional de rede). Quando um cliente se conectada a uma impressora multifuncional para receber fax ou digitalizar arquivos, a tarefa pode demorar para ser executada. Se necess&aacute;rio, a conex&atilde;o pode ser interrompida para permitir ao pr&oacute;ximo cliente na linha acessar a impressora.</li>
</ul></li>
</ul>


<h4>Para habilitar impress&atilde;o sem fio Apple:</h4>
<ol>
<li>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Dispositivos externos</strong> &gt; <strong>Impressora</strong>.</li>
<li>Selecione uma impressora na lista de dispositivos.</li>
<li>Clique em <b>Gerenciador de impressoras</b> &gt; <b>Configurar impressora</b>.</li>
<li>Marque a caixa <b>Habilitar impress&atilde;o sem fio Apple</b>.</li>
<li>Selecione a marca e o driver da impressora.</li>
<li>Clique em <b>Salvar</b>.</li>
</ol>

<p>Ap&oacute;s concluir a configura&ccedil;&atilde;o, voc&ecirc; pode imprimir uma p&aacute;gina de teste clicando em <b>Gerenciador de impressoras</b> &gt; <b>P&aacute;gina de teste de impress&atilde;o</b>.</li>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Habilitar a impress&atilde;o sem fio Apple tamb&eacute;m habilita o Bonjour Printer Broadcast para DSM.</li>
<li>A impress&atilde;o sem fio Apple est&aacute; dispon&iacute;vel para iOS 4.2 ou posterior.</li>
</ul>
</div>


<h4>Para ativar o Google Cloud Print:</h4>
<ol>
<li>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Dispositivos externos</strong> &gt; <strong>Impressora</strong>.</li>
<li>Selecione uma impressora na lista de dispositivos.</li>
<li>Clique em <b>Gerenciador de impressoras</b> &gt; <b>Configurar impressora</b>.</li>
<li>Marque a caixa <b>Ativar Google Cloud Print</b>.</li>
<li>Informe os seguintes detalhes:
<ul>

<li>Informa&ccedil;&otilde;es da sua conta Google.</li>
<li>A marca e o driver da impressora.</li>
</ul>
<li>Clique em <b>Salvar</b>.</li>
</ol>
<p>Ap&oacute;s concluir a configura&ccedil;&atilde;o, voc&ecirc; pode imprimir uma p&aacute;gina de teste clicando em <b>Gerenciador de impressoras</b> &gt; <b>P&aacute;gina de teste de impress&atilde;o</b>.</li>
</p>
<p>Para gerenciar as tarefas do Google Cloud Print, clique no link <a href="http://www.google.com/cloudprint/manage.html" target="_blank">Google Cloud Print</a>.</p>


<h3>Acessar as impressoras</h3>
<p>Veja a se&ccedil;&atilde;o abaixo para acessar as impressoras usando um PC ou Mac.</p>
<h4><a name="others"></a>Para acessar impressoras usando um PC com Windows:</h4>
<p>
A melhor maneira de acessar o servi&ccedil;o de impress&atilde;o do dispositivo DiskStation &eacute; configurar a conex&atilde;o com a impressora com o Synology Assistant. Consulte a Ajuda para obter instru&ccedil;&otilde;es detalhadas.
</p>

<p>Se o Synology Assistant n&atilde;o estiver instalado em seu computador, consulte abaixo para saber outras maneiras de acessar o servi&ccedil;o de impress&atilde;o do dispositivo DiskStation.</p>
<p><strong>Tipo 1. Impressora de rede compartilhada</strong></p>
<ol>
<li>No seu PC, abra <b>Rede</b> no Explorador de arquivos e clique duas vezes em DiskStation.</li>

<li>Clique duas vezes em <span style="display: inline;" class="disable-rc18015xsp"><b>usbprinter</b> ou </span><b>nome da impressora de rede</b>; o sistema solicita que voc&ecirc; instale o driver correto e, em seguida, clique em <b>Sim</b>.</li>

<li>Instale o driver da impressora a partir do CD ou site do fabricante. Selecione o fabricante e o modelo da impressora ou clique em <strong>Com disco</strong> para selecionar o local do driver. Em seguida, clique em <b>OK</b>.</li>
<li>O sistema come&ccedil;ar&aacute; a configurar a impressora de rede. Ap&oacute;s a conclus&atilde;o da configura&ccedil;&atilde;o, voc&ecirc; pode come&ccedil;ar a usar a impressora. </li>
</ol>


<p><strong>Tipo 2. Porta LPR (Recomendado)</strong></p>
<ol>
<li>No seu PC, clique em <b>Iniciar</b> e v&aacute; para <b>Dispositivos e impressoras</b>.</li>
<li>Clique em <b>Adicionar impressora</b>. </li>
	<li>Selecione <strong>Adicionar uma impressora de rede, sem fio ou Bluetooth</strong>. </li>
	<li>Selecione <strong>A impressora que eu quero n&atilde;o est&aacute; listada</strong>.</li>
<li>Selecione <b>Adicionar uma impressora usando o endere&ccedil;o TCP/IP ou nome de host</b>. Clique em <b>Pr&oacute;ximo</b> para continuar.</li>
<li>Escolha do tipo de dispositivo para ser o <b>Dispositivo da porta TCP/IP</b>.</li>
<li>Digite o endere&ccedil;o IP do DiskStation. Clique em <b>Pr&oacute;ximo</b> para continuar.</li>
<li>Selecione <b>Tipo de Dispositivo</b>: <strong>Personalizar</strong> &gt; <strong>Configura&ccedil;&otilde;es</strong> &gt; ... Clique em <b>Pr&oacute;ximo</b> para continuar.</li>

<li>Selecione <b>LPR</b> para protocolo; Digite <span style="display: inline;" class="disable-rc18015xsp"><b>usbprinter</b> ou o </span><b>nome da impressora de rede</b> para Nome da fila e marque a caixa de sele&ccedil;&atilde;o <b>Contagem de bytes LPR habilitada</b>. Clique em <b>OK</b> para continuar.</li>

<li>Instale o driver da impressora a partir do CD ou site do fabricante. Selecione o fabricante e o modelo da impressora ou clique em <strong>Com disco</strong> para selecionar o local do driver. Em seguida, clique em <b>OK</b>.</li>
	<li>O sistema come&ccedil;ar&aacute; a configurar a impressora de rede. Ap&oacute;s a conclus&atilde;o da configura&ccedil;&atilde;o, voc&ecirc; pode come&ccedil;ar a usar a impressora.</li>
</ol>

<h4>Para acessar impressoras usando um Mac:</h4>
<p>
Os usu&aacute;rios de Mac podem acessar o servi&ccedil;o de impress&atilde;o do dispositivo DiskStation ativando a transmiss&atilde;o de impressora Bonjour do DSM e adicionando a impressora em Prefer&ecirc;ncias do sistema.</p>
<P>Verifique se o DiskStation est&aacute; usando uma impressora Postscript antes de continuar.
</p>
<p><strong>Passo 1. Ativar o Bonjour Printer Broadcast do DSM</strong></p>
<ol>
<li>
Entre no DSM como <b>admin</b> ou como um usu&aacute;rio pertencente ao grupo <b>administrators</b>.
</li>
<li>
V&aacute; para <b>Painel de controle</b> &gt; <strong>Servi&ccedil;os de arquivos</strong> &gt; <b>Win/Mac/NFS</b>.
</li>
<li>
Marque <b>Ativar o Bonjour Printer Broadcast</b>.
</li>
</ol>

<p><strong>Passo 2. Acessar a impressora atrav&eacute;s do Mac</strong></p>
<ol>
<li>
No seu Mac, v&aacute; para <b>Prefer&ecirc;ncias do sistema</b> &gt; <b>Imprimir e digitalizar</b> e clique em <b>+</b>.
</li>

<li>
Escolha <span style="display: inline;" class="disable-rc18015xsp"><b>usbprinter[n&uacute;mero]</b> ou </span><b>nome da impressora de rede</b> no menu suspenso. Seu Mac configurar&aacute; a impressora automaticamente.
</li>

</ol>
</div>
</body>
</html>
