<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Dispositivos Externos</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Dispositivos Externos</h2>

<p>V&aacute; para <strong>Painel de Controle</strong> &gt; <b>Dispositivos Externos</b> &gt; <b>Dispositivos Externos</b> voc&ecirc; pode ver a lista de dispositivos de armazenamento externo conectados ao seu DiskStation.</p>


<h3><a name="usbdisk"></a><a name="esatadisk"></a>Discos Externos</h3>
<p class="enable-eds14">Ao conectar o disco externo ao sistema, voc&ecirc; poder&aacute; compartilhar a capacidade do disco atrav&eacute;s de uma pasta compartilhada criada pelo sistema, chamada <b>usbshare[n&uacute;mero]</b> (para discos USB). A pasta compartilhada ser&aacute; removida automaticamente quando o disco externo for desconectado do sistema.</p>
<p class="disable-eds14">Ao conectar um disco externo ao sistema, voc&ecirc; poder&aacute; compartilhar a capacidade do disco atrav&eacute;s de uma pasta compartilhada criada pelo sistema com o nome <b>usbshare[n&uacute;mero]</b> (para discos USB) ou <b>satashare[n&uacute;mero]</b> (para discos eSATA). A pasta compartilhada ser&aacute; removida automaticamente quando o disco externo for desconectado do sistema.</p>
<p>DiskStation reconhece os formatos a seguir: <span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64"><b>Btrfs</b>, </span><b>ext3</b>, <b>ext4</b>, <b>FAT</b>, <b>FAT32</b>, <b>HFS</b>, <b>HFS Plus</b> e <b>NTFS</b>. Qualquer disco externo n&atilde;o reconhecido deve ser formatado antes de ser usado pelo sistema.</p>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ol>
<li>Alguns modelos oferecem suporte a HFS/HFS Plus com somente leitura.</li>
<li>O di&aacute;rio n&atilde;o &eacute; suportado em HFS/HFS Plus.</li>
<li>Verifique se o disco externo foi ejetado antes de desconect&aacute;-lo.</li>
</ol>
</div>

<h4>Para formatar o disco:</h4>

<p>Clique em <b>Formatar</b> e siga o assistente. Voc&ecirc; pode formatar discos externos nos formatos <b>ext4</b> e <b>FAT32</b> com o DiskStation.</p>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ol>
<li>Lembre-se de fazer backup dos dados antes de formatar o disco externo. Todos os dados ser&atilde;o apagados durante o procedimento e n&atilde;o poder&atilde;o ser restaurados.</li>

<li>Para formatar o disco externo em formato ext3 ou ext4, o tamanho do disco deve ser maior que 1 GB.</li>

<li>Quando o disco estiver formatado no formato ext3 ou ext4, somente ser&aacute; reconhecido pelo DiskStation. Para ler os dados diretamente de seu disco externo com seu PC ou Mac, escolha o formato FAT32.</li>
</ol>
</div>


<h4>Para realizar o teste S.M.A.R.T.:</h4>
<P>O teste S.M.A.R.T. do disco examina e relata o status de seus discos r&iacute;gidos, fornecendo um alerta antecipado sobre falhas iminentes no disco. Recomendamos a troca imediata do disco em caso de detec&ccedil;&atilde;o de algum erro. <br> Para realizar o teste S.M.A.R.T., basta clicar no bot&atilde;o <strong>Teste S.M.A.R.T.</strong> e seguir o assistente.<br> Para verificar os resultados do teste, basta clicar em <strong>Informa&ccedil;&otilde;es S.M.A.R.T.</strong></P>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>O tempo de teste varia de acordo com o ambiente do sistema.</p>
</div>


<div class="section disable-eds14">
<h4>Limita&ccedil;&otilde;es</h4>

<p>A formata&ccedil;&atilde;o de disco n&atilde;o est&aacute; dispon&iacute;vel nas seguintes situa&ccedil;&otilde;es:</p>

<ul>
<li>O disco externo est&aacute; sendo iniciado, ou seja, quando o dispositivo externo foi conectado recentemente.</li>
<li>A capacidade do disco externo &eacute; menor que 1 GB (formatos ext3 ou ext4).</li>
<li>O disco externo est&aacute; sendo formatado.</li>
<li>Quando o sistema estiver executando backup de arquivos para o disco externo.</li>
<li>O disco externo est&aacute; danificado.</li>
</ul>
<h4>Solu&ccedil;&atilde;o de problemas</h4>
<ol>
<li>Falha ao formatar o disco externo. Por qu&ecirc;?</li>
<ul>
<li>Verifique se o disco externo est&aacute; devidamente inserido.</li>
<li>Verifique se o disco externo est&aacute; protegido contra grava&ccedil;&atilde;o. Caso positivo, remova-o antes de formatar. </li>
</ul>
<li>O sistema de arquivos do disco externo &eacute; exibido como <b>N&atilde;o suportado</b> ou o sistema n&atilde;o cria a pasta compartilhada <b>usbshare[n&uacute;mero]</b> ou <b>satashare[n&uacute;mero]</b> do disco externo. O que devo fazer? </li>
<ul>
<li>O sistema atualmente reconhece os formatos <span style="display: inline;" class="enable-bromolow enable-grantley enable-avoton enable-braswell enable-broadwell enable-kvmx64">Btrfs, </span>ext3, ext4, FAT, FAT32, HFS, HFS Plus e NTFS. Qualquer disco externo n&atilde;o formatado como os tipos acima n&atilde;o ser&aacute; reconhecido e seu status ser&aacute; mostrado como <b>N&atilde;o Suportado</b>.</li>
</ul>
<li>N&atilde;o consigo acessar a pasta compartilhada <b>usbshare[n&uacute;mero]</b> ou <b>satashare[n&uacute;mero]</b>. O que devo fazer? </li>

<ul>
<li>Isso pode ser resultado de um problema no sistema de arquivos do disco externo. Para solucionar esse problema, conecte o disco externo ao PC e realize uma verifica&ccedil;&atilde;o do sistema de arquivos</li>
</ul>
<li>O meu disco externo com o formato ext3 e ext4 pode ser conectado ao meu PC ou Mac e acessado ​​diretamente?</li>
<ul>
<li>N&atilde;o, o ext3 ou ext4 &eacute; reconhecido apenas pelo DiskStation. Para ler os dados diretamente de seu disco externo com seu PC ou Mac, escolha o formato FAT32. </li>
</ul>
<li>Por que vejo uma pasta chamada &quot;lost+found&quot; em meu disco externo?</li>
<ul>
<li>Esta &eacute; uma pasta padr&atilde;o do sistema que &eacute; criada automaticamente quando o sistema de arquivos ext3/ext4 &eacute; usado. &Eacute; normal ver essa pasta no disco externo. Apesar de os administradores terem o direito de acessar e gerenciar o conte&uacute;do interno, recomendamos que voc&ecirc; deixe a pasta intacta.</li>

</ul>

</ol>
</div>
<div class="section enable-eds14">
<h4>Limita&ccedil;&otilde;es</h4>

<p>A formata&ccedil;&atilde;o de disco n&atilde;o est&aacute; dispon&iacute;vel nas seguintes situa&ccedil;&otilde;es:</p>

<ul>
<li>O disco externo est&aacute; sendo iniciado, ou seja, quando o dispositivo externo foi conectado recentemente.</li>
<li>A capacidade do disco externo &eacute; menor que 1 GB (formatos ext3 ou ext4).</li>
<li>O disco externo est&aacute; sendo formatado.</li>
<li>Quando o sistema estiver executando backup de arquivos para o disco externo.</li>
<li>O disco externo est&aacute; danificado.</li>
</ul>
<h4>Solu&ccedil;&atilde;o de problemas</h4>
<ol>
<li>Falha ao formatar o disco externo. Por qu&ecirc;?</li>
<ul>
<li>Verifique se o disco externo est&aacute; devidamente inserido.</li>
<li>Verifique se o disco externo est&aacute; protegido contra grava&ccedil;&atilde;o. Caso positivo, remova-o antes de formatar. </li>
</ul>
<li>O tipo de sistema de arquivos do disco externo &eacute; exibido como <b>N&atilde;o Suportado</b> ou o sistema n&atilde;o ir&aacute; criar a pasta compartilhada <b>usbshare[n&uacute;mero]</b> no disco externo. O que devo fazer? </li>
<ul>
<li>O sistema atualmente reconhece os formatos ext3, ext4, FAT, FAT32, HFS, HFS Plus e NTFS. Qualquer disco externo n&atilde;o formatado como os tipos acima n&atilde;o ser&aacute; reconhecido e seu status ser&aacute; mostrado como <b>N&atilde;o Suportado</b>.</li>
</ul>
<li>N&atilde;o consigo acessar a pasta compartilhada <b>usbshare[n&uacute;mero]</b>. O que devo fazer? </li>

<ul>
<li>Isso pode ser resultado de um problema no sistema de arquivos do disco externo. Para solucionar esse problema, conecte o disco externo ao PC e realize uma verifica&ccedil;&atilde;o do sistema de arquivos</li>
</ul>
<li>O meu disco externo com o formato ext3 e ext4 pode ser conectado ao meu PC ou Mac e acessado ​​diretamente?</li>
<ul>
<li>N&atilde;o, o ext3 ou ext4 &eacute; reconhecido apenas pelo DiskStation. Para ler os dados diretamente de seu disco externo com seu PC ou Mac, escolha o formato FAT32. </li>
</ul>
<li>Por que vejo uma pasta chamada &quot;lost+found&quot; em meu disco externo?</li>
<ul>
<li>Esta &eacute; uma pasta padr&atilde;o do sistema que &eacute; criada automaticamente quando o sistema de arquivos ext3/ext4 &eacute; usado. &Eacute; normal ver essa pasta no disco externo. Apesar de os administradores terem o direito de acessar e gerenciar o conte&uacute;do interno, recomendamos que voc&ecirc; deixe a pasta intacta.</li>

</ul>

</ol>
</div>


<h4>Para definir as permiss&otilde;es padr&atilde;o de todos os dispositivos externos:</h4>
<p>Voc&ecirc; pode definir as permiss&otilde;es padr&atilde;o clicando em <strong>Permiss&otilde;es Padr&atilde;o</strong> e especificando quais usu&aacute;rios ou grupos podem acessar, visualizar ou modificar os dispositivos externos e seus conte&uacute;dos. Quando um dispositivo externo &eacute; inserido no DiskStation, as permiss&otilde;es que voc&ecirc; especificou ser&atilde;o atribu&iacute;das automaticamente ao dispositivo externo.</p>
<p>Na janela de permiss&otilde;es, fa&ccedil;a o seguinte para definir as permiss&otilde;es padr&atilde;o:</p>
<ol>
<li>Selecione uma op&ccedil;&atilde;o no menu suspenso:</li>
<ul>
<li><b>Usu&aacute;rio interno do sistema:</b> Atribui permiss&otilde;es para os usu&aacute;rios padr&atilde;o do sistema, como o usu&aacute;rio An&ocirc;nimo de FTP/WebDAV.</li>
<li><b>Usu&aacute;rios locais:</b> Atribuir permiss&otilde;es para usu&aacute;rios locais (incluindo <b>guest</b>).</li>
<li><b>Grupos locais:</b> Atribui permiss&otilde;es para grupos locais.</li>
</ul>

<li>Marque ou desmarque as caixas apropriadas para cada usu&aacute;rio ou grupo, para personalizar suas permiss&otilde;es de acesso a dispositivos externos:</li>
  <ul>
<li><b>Leitura/Grava&ccedil;&atilde;o</b>: O usu&aacute;rio ou grupo pode acessar e fazer altera&ccedil;&otilde;es aos arquivos e pastas nos dispositivos externos.</li>
<li><b>Somente leitura</b>: O usu&aacute;rio ou grupo pode acessar os arquivos e pastas nos dispositivos externos.</li>
<li><b>Nenhum acesso</b>: O usu&aacute;rio ou grupo n&atilde;o pode acessar os arquivos e pastas nos dispositivos externos.</li>
</ul>
</ol>


</body>
</html>
