<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Servi&ccedil;o de Push - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Push service allows your DiskStation to send notifications to your mobile device or instant messaging program.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Servi&ccedil;o Push</h2>
<p>O servi&ccedil;o de Push permite que o DiskStation envie notifica&ccedil;&otilde;es para seu dispositivo m&oacute;vel ou navegadores da Web quando ocorrem eventos ou erros espec&iacute;ficos.</p>

<div class="section">
<h4>Portas:</h4>
<p>Antes de ativar o servi&ccedil;o de push, certifique-se de que o DiskStation possa acessar a Internet usando a porta 8089.</p>
</div>


<h4>Para habilitar as notifica&ccedil;&otilde;es por e-mail fornecidas pela Synology:</h4>
<ol>
<li>Selecione <strong>Enviar notifica&ccedil;&otilde;es sobre o status do sistema por meio do servidor de e-mail da Synology</strong>.</li>
<li>Digite um ou mais endere&ccedil;os de e-mail no campo <b>Destinat&aacute;rios</b>. As notifica&ccedil;&otilde;es do sistema ser&atilde;o enviadas para os endere&ccedil;os inseridos aqui. S&atilde;o permitidos dois endere&ccedil;os. Separe v&aacute;rios endere&ccedil;os por um ponto e v&iacute;rgula (;).</li>
<li>Clique em <strong>Aplicar</strong> e um e-mail de verifica&ccedil;&atilde;o dever&aacute; ser enviado para os endere&ccedil;os especificados no campo <strong>Destinat&aacute;rios</strong>. Siga os passos no e-mail de verifica&ccedil;&atilde;o.</li>
<li>Ap&oacute;s a verifica&ccedil;&atilde;o, clique em <b>Enviar mensagem de teste</b> e clique em <b>OK</b> para enviar uma notifica&ccedil;&atilde;o de teste.</li>
</ol>


<h4>Para habilitar notifica&ccedil;&otilde;es no dispositivo m&oacute;vel:</h4>
<ol>
<li>V&aacute; para <strong>Painel de controle</strong> &gt; <strong>Notifica&ccedil;&atilde;o</strong> &gt; <strong>Servi&ccedil;o Push</strong>.</li>
<li>Marque a caixa <b>Habilitar notifica&ccedil;&otilde;es no dispositivo m&oacute;vel</b> e, em seguida, clique em <b>Aplicar</b>.</li>
<li>Instale e inicie o <b>DS finder</b> em seu dispositivo m&oacute;vel e depois adicione seu DiskStation &agrave; lista de <b>Favoritos</b> para emparelhar o dispositivo m&oacute;vel com o DiskStation.</li>
<li>Clique em <b>Enviar uma mensagem de teste</b> e clique em <b>OK</b> para enviar uma notifica&ccedil;&atilde;o de teste. Em seguida, inicie o DS finder em seu dispositivo m&oacute;vel para verificar se a mensagem de teste foi recebida.</li>
</ol>


<h4>Para gerenciar dispositivos m&oacute;veis emparelhados:</h4>

<ol>
<li>Clique em <b>Gerenciar dispositivos emparelhados</b> para ver a lista de todos os dispositivos m&oacute;veis emparelhados.</li>
<li>Se desejar desemparelhar qualquer um dos dispositivos, selecione-os e clique em <b>Desemparelhar</b>. (Pressione e segure a tecla Shift ou Ctrl para sele&ccedil;&atilde;o m&uacute;ltipla.) Nenhuma notifica&ccedil;&atilde;o ser&aacute; enviada a eles a menos que voc&ecirc; os emparelhe novamente.</li>
</ol>


<h4>Para habilitar as notifica&ccedil;&otilde;es no navegador:</h4>
<ol>
<li>Marque <b>Habilitar notifica&ccedil;&otilde;es no dispositivo m&oacute;vel</b> e, em seguida, clique em <b>Aplicar</b> para ativar essa fun&ccedil;&atilde;o.</li>
<li>Clique em <b>Habilitar notifica&ccedil;&otilde;es no navegador</b> para emparelhar o seu DiskStation com o navegador.</li>
<li>Realize uma das a&ccedil;&otilde;es a seguir na janela que aparece:
	<ul>
		<li>Para o Chrome: clique em <b>Instalar agora</b> para instalar a extens&atilde;o do Chrome e, em seguida, fa&ccedil;a login em sua conta Google se voc&ecirc; n&atilde;o ainda n&atilde;o o fez.</li>
		<li>Para o Safari: clique em <b>Permitir</b> para autorizar o servi&ccedil;o de notifica&ccedil;&atilde;o.</li>
	</ul>
</li>
<li>Quando voc&ecirc; for redirecionado para a p&aacute;gina de notifica&ccedil;&atilde;o do navegador, clique na guia <b>Dispositivos emparelhados</b> para visualizar as informa&ccedil;&otilde;es de dispositivos emparelhados ou desemparelhar o seu DiskStation no navegador, ou clique na guia <b>Eventos</b> para exibir seu hist&oacute;rico de notifica&ccedil;&otilde;es do navegador nos &uacute;ltimos sete dias.</li>

</ol>
<div class="section">
<h4>Nota:</h4>
<p>O servi&ccedil;o de notifica&ccedil;&otilde;es do navegador &eacute; suportado no Chrome (35 ou posterior) e Safari (OS X v10.9 ou posterior).</p>
</div>








</body>
</html>
