<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Alimenta&ccedil;&atilde;o</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Geral</h2>
<p>
<strong>Painel de controle</strong> &gt; <strong>Hardware e alimenta&ccedil;&atilde;o</strong> &gt; <strong>Geral</strong> oferece op&ccedil;&otilde;es para permitir a recupera&ccedil;&atilde;o de energia, Wake on LAN (WOL) e compress&atilde;o de mem&oacute;ria. Voc&ecirc; tamb&eacute;m pode modificar o controle sonoro e o modo de velocidade do ventilador aqui.
</p>
<h3>
Restaura&ccedil;&atilde;o de energia
</h3>
<p>Se o sistema desligar devido a uma falha inesperada de energia, a fun&ccedil;&atilde;o de recupera&ccedil;&atilde;o de energia permite que o sistema seja iniciado automaticamente depois que a energia for restaurada.</p>
<h3>Wake on LAN*</h3>
<p>A ativa&ccedil;&atilde;o do Wake on LAN (WOL) permite ativar o DiskStation sobre rede de &aacute;rea local ou pela Internet, digitando o endere&ccedil;o IP (ou hostname DDNS) e o endere&ccedil;o MAC do DiskStation usando um aplicativo WOL, como Synology Assistant, DS finder ou outros aplicativos WOL.</p>
<p>O Wake on LAN funciona somente ap&oacute;s o desligamento correto do DiskStation pressionando o bot&atilde;o f&iacute;sico <b>Power</b> ou clicando em <b>Desligamento</b> na interface DSM. Mantenha o cabo de alimenta&ccedil;&atilde;o conectado a uma tomada de alimenta&ccedil;&atilde;o em funcionamento ap&oacute;s o desligamento.</p>
<div class="section">
	<h4>Observa&ccedil;&atilde;o:</h4>
	<p class="disable-rc18015xsp">O recurso WOL n&atilde;o &eacute; suportado nas portas LAN 10GbE (se dispon&iacute;vel em seu DiskStation).</p>
	<ul class="enable-rc18015xsp">
		<li>O recurso WOL n&atilde;o &eacute; suportado nas portas LAN 10GbE (se dispon&iacute;vel em seu DiskStation).</li>
		<li>O recurso WOL &eacute; habilitado por padr&atilde;o nas portas LAN 1GbE para o DiskStation e n&atilde;o pode ser desabilitado.</li>
	</ul>
</div>
<h3>Modo de velocidade da ventoinha*</h3>
<p>As op&ccedil;&otilde;es de velocidade da ventoinha a seguir est&atilde;o dispon&iacute;veis:</p>
<ul>
<li><strong>Modo frio:</strong> A ventoinha funciona em velocidade mais alta, mantendo o DiskStation resfriado, mas produzindo mais ru&iacute;do.</li>
<li><strong>Modo silencioso:</strong> A ventoinha funciona em velocidade mais baixa, produzindo menos ru&iacute;do, mas o DiskStation pode ficar mais quente.</li>
<li><strong>Baixa energia:</strong> A ventoinha funciona em velocidade mais baixa, produzindo menos ru&iacute;do, mas o DiskStation pode ficar mais quente. Al&eacute;m disso, quando o DiskStation est&aacute; frio, a ventoinha para economizar energia. O modo de baixa energia est&aacute; dispon&iacute;vel apenas em alguns modelos.</li>
</ul>
<h3>Controle do bipe</h3>
<p>O DiskStation pode emitir um bipe quando determinados eventos ou erros ocorrerem. Clique nas caixas de verifica&ccedil;&atilde;o de eventos listados para permitir que o DiskStation alerte quando ocorrerem erros.</p>
<h4>Para parar o som do bipe:</h4>
<ul>
<li>Se o DiskStation estiver emitindo o bipe, clique no bot&atilde;o <strong>Desligar bipe</strong> para desativ&aacute;-lo. </li>
</ul>
<h3>Compacta&ccedil;&atilde;o de mem&oacute;ria*</h3>
<p>Voc&ecirc; pode ativar a compacta&ccedil;&atilde;o de mem&oacute;ria para melhorar a capacidade de resposta geral do sistema em carga, compactando os dados usados menos recentemente na mem&oacute;ria.</p>
<p>Quando se tem v&aacute;rios aplicativos em execu&ccedil;&atilde;o e a mem&oacute;ria come&ccedil;a a encher, a compacta&ccedil;&atilde;o de mem&oacute;ria din&acirc;mica diminui o tamanho dos itens raramente usados ​​na mem&oacute;ria, minimizando o uso de mem&oacute;ria. Quando os itens forem necess&aacute;rios novamente, eles poder&atilde;o ser descompactados instantaneamente. Isso reduz a necessidade de ler e escrever arquivos de swap de mem&oacute;ria no disco, melhorando a efici&ecirc;ncia e a capacidade de resposta.</p>
<p>Para ativar a compacta&ccedil;&atilde;o de mem&oacute;ria, basta marcar a caixa de sele&ccedil;&atilde;o.</p>



<h3>LED*</h3>
<p>Em <strong>Painel de controle</strong> > <strong>Hardware e energia</strong> > <strong>Geral</strong> > <strong>Controle de brilho do LED</strong>, você pode ajustar o brilho dos LEDs indicadores do seu DiskStation.</p>
<div class="section">
<h4>Nota:</h4>
<p>As configurações de brilho são aplicadas em todos os LEDs indicadores de seu DiskStation (i.e. Energia, STATUS, LAN, status da unidade, etc).</p>
</div>
<h4>Para ajustar o brilho do LED:</h4>
<p>Agora existem quatro níveis de brilho disponíveis para os LEDs indicadores de seu DiskStation.</p>
<ol>
<li>Clique e arraste o ponteiro na escala de brilho em qualquer sentido:
  <ul>
<li>Para a direita: Aumenta o brilho do LED.</li>
<li>Para a esquerda: Diminui o brilho do LED.</li>
</ul>
</li>
<li>Clique em <strong>Aplicar</strong> para salvar as configurações.</li>
</ol>
<h4>Para ajustar o brilho do LED por programação:</h4>
<p>Os LEDs indicadores podem alterar seu nível de brilho na hora programada.</p>
<ol>
<li>Clique em <strong>Definir programação</strong>.</li>
<li>Clique em um dos tipos de brilho a seguir:
<ul>
<li><strong>Brilho padrão</strong>: O brilho máximo</li>
<li><strong>Brilho ajustado</strong>: O nível de brilho especificado na escala de brilho</li>
</ul>
</li>
<li>Clique nos períodos desejados para personalizar a programação de brilho.</li>
<li>Clique em <strong>OK</strong> e em <strong>Aplicar</strong> para salvar suas configurações.</li>
</ol>


<p>____<br> * Dispon&iacute;vel apenas em modelos espec&iacute;ficos. </p>
</body>
</html>
