<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Dispositivos Externos</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>USBCopy</h2>

<p>Voc&ecirc; pode selecionar uma pasta de destino para a fun&ccedil;&atilde;o USBCopy indo para <strong>Painel de Controle &gt;</strong> <strong>Dispositivos Externos</strong> &gt; <strong>USBCopy/SDCopy.</strong></p>

<h4>Para ativar o USBCopy:</h4>
<ol>
<li>
Marque <b>Habilitar USBCopy</b>.
</li>
<li>
Selecione a pasta compartilhada de destino no menu suspenso.
</li>
</ol>

<p>Ao conectar um dispositivo USB (tal como uma c&acirc;mera digital) &agrave; porta USB no painel frontal do produto Synology, voc&ecirc; pode pressionar o bot&atilde;o Copiar no painel frontal para copiar os dados no dispositivo USB para a pasta compartilhada de destino atribu&iacute;da aqui. Se a pasta de destino do USBCopy for exclu&iacute;da, o sistema ir&aacute; substitu&iacute;-la pela pasta compartilhada p&uacute;blica automaticamente.</p>

<div class="section">
<h4>Limita&ccedil;&otilde;es</h4>
<ol>

<li>S&atilde;o suportados apenas dispositivos USB nos formatos FAT, NTFS, ext3 e ext4.</li>

<li>Os dispositivos USB devem estar conectados &agrave; porta USB no painel frontal do dispositivo DiskStation.</li>
<li>Somente o <strong>administrador</strong> ou usu&aacute;rios no grupo <strong>administrators</strong> t&ecirc;m privil&eacute;gios de acesso apropriados para a realiza&ccedil;&atilde;o de tarefas de backup para dispositivos USB.</li>
<li>O espa&ccedil;o dispon&iacute;vel da pasta compartilhada de destino deve ser maior que o espa&ccedil;o usado no dispositivo USB.</li></ol>
</div>

<h2>SDCopy*</h2>

<p>Voc&ecirc; pode selecionar uma pasta de destino para a fun&ccedil;&atilde;o SDCopy indo para <strong>Painel de Controle</strong> &gt; <strong>Dispositivos Externos</strong> &gt; <strong>USBCopy/SDCopy</strong>.</p>


<h4>Para ativar SDCopy:</h4>
<ol>
	<li>
	Marque <b>Habilitar SDCopy</b>.
	</li>
	<li>
	Selecione a pasta compartilhada de destino no menu suspenso.
	</li>
</ol>

<p>Ao conectar um dispositivo SD na ranhura SD no painel frontal do produto Synology, voc&ecirc; pode pressionar o bot&atilde;o Copiar no painel frontal para copiar os dados no dispositivo SD para a pasta compartilhada de destino atribu&iacute;da aqui. Se a pasta de destino do SDCopy for deletada, o sistema ir&aacute; substitu&iacute;-la pela pasta compartilhada p&uacute;blica automaticamente.</p>

<div class="section">
<h4>Limita&ccedil;&otilde;es</h4>
<ol>

	<li>S&atilde;o suportados apenas dispositivos SD no formato FAT, NTFS, ext3 e ext4.</li>

	<li>Os dispositivos SD devem estar conectados &agrave; ranhura SD no painel frontal do produto Synology.</li>
    <li> Somente o <strong>administrador</strong> ou usu&aacute;rios no grupo <strong>administrators</strong> t&ecirc;m privil&eacute;gios de acesso apropriados para a realiza&ccedil;&atilde;o de tarefas de backup para dispositivos SD.</li>
	<li>O espa&ccedil;o dispon&iacute;vel da pasta compartilhada de destino deve ser maior que o espa&ccedil;o usado no dispositivo SD.</li></ol>
</div>

<p>____<br> * Dispon&iacute;vel apenas em modelos espec&iacute;ficos. </p>
</body>
</html>
