<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>For&ccedil;a</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>



<h2>UPS</h2>

<p class="disable-eds14">Um no-break (Fonte de alimenta&ccedil;&atilde;o ininterrupta) &eacute; um dispositivo de energia de seguran&ccedil;a que permite que o DiskStation continue a funcionar por um curto per&iacute;odo se ocorrer uma falha de energia. Essa fun&ccedil;&atilde;o em <strong>Painel de Controle</strong> &gt; <strong>Hardware e Alimenta&ccedil;&atilde;o</strong> &gt; <strong>UPS</strong> ajuda a evitar perda de dados dando ao DiskStation tempo suficiente para salvar os dados e desmontar volumes antes de perder a energia e desligar.</p>

<p class="enable-eds14">Um no-break (Fonte de alimenta&ccedil;&atilde;o ininterrupta) &eacute; um dispositivo de energia de seguran&ccedil;a que permite que o DiskStation continue a funcionar por um curto per&iacute;odo se ocorrer uma falha de energia. Essa fun&ccedil;&atilde;o em <strong>Painel de Controle</strong> &gt; <strong>Hardware e Alimenta&ccedil;&atilde;o</strong> &gt; <strong>UPS</strong> ajuda a evitar perda de dados dando ao DiskStation tempo suficiente para salvar os dados e desmontar volumes antes de perder a energia e parar.</p>

<div class="section">
<h4>Modo Seguro</h4>
<p class="disable-eds14">Quando o DiskStation entra no modo seguro, ele para todos os servi&ccedil;os e desmonta volumes para evitar perda de dados e desliga com seguran&ccedil;a quando o dispositivo no-break fica sem energia. Por padr&atilde;o o sistema entra no Modo seguro quando o no-break come&ccedil;a a funcionar com pouca energia. Voc&ecirc; tamb&eacute;m pode especificar quanto tempo antes o DiskStation entrar&aacute; no Modo seguro quando ocorrer falha de energia. Entretanto, se o dispositivo no-break ficar com a bateria fraca antes do tempo especificado, o sistema entrar&aacute; no Modo seguro imediatamente.</p>

<p class="enable-eds14">Quando o DiskStation entra no modo seguro, ele para todos os servi&ccedil;os e desmonta volumes para evitar perda de dados e parar com seguran&ccedil;a quando o dispositivo no-break fica sem energia. Por padr&atilde;o o sistema entra no Modo seguro quando o no-break come&ccedil;a a funcionar com pouca energia. Voc&ecirc; tamb&eacute;m pode especificar quanto tempo antes o DiskStation entrar&aacute; no Modo seguro quando ocorrer falha de energia. Entretanto, se o dispositivo no-break ficar com a bateria fraca antes do tempo especificado, o sistema entrar&aacute; no Modo seguro imediatamente.</p>


<p></p>
<p class="disable-eds14">Nas situa&ccedil;&otilde;es em que o DiskStation desliga durante o modo de seguran&ccedil;a, ele liga automaticamente quando a energia for restaurada, se voc&ecirc; ativar a op&ccedil;&atilde;o <strong>Reiniciar automaticamente ap&oacute;s uma falha de energia</strong> (localizada no <strong>Painel de controle</strong> &gt; <strong>Hardware e Alimenta&ccedil;&atilde;o</strong> &gt; <strong>Geral</strong>).</p>

<p></p>
</div>




<h3>Suporte ao no-break local</h3>

<p>Para obter detalhes sobre a instala&ccedil;&atilde;o de hardware, consulte o manual do usu&aacute;rio do dispositivo no-break. Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da e o DiskStation tiver sido conectado ao dispositivo no-break, voc&ecirc; pode seguir as etapas abaixo para habilitar o suporte ao no-break.</p>
<h4>Para habilitar o suporte ao no-break local:</h4>
<OL>
<li>Conecte o dispositivo no-break a uma porta USB do DiskStation.</li>
<LI>Na guia <strong>UPS</strong>, marque a caixa de sele&ccedil;&atilde;o <b>Habilitar suporte a UPS</b>.</LI>
<LI>Selecione quando o DiskStation deve entrar no Modo seguro ap&oacute;s ocorrer falha de energia.</LI>
<LI>Selecione se ser&aacute; ou n&atilde;o enviado um sinal de desligamento ao no-break quando o sistema entrar no Modo Seguro. A maioria dos dispositivos no-break podem ligar automaticamente quando a energia &eacute; restaurada.</LI>
<LI>Clique em <b>Aplicar</b>.</LI>
</OL>

<h3>Suporte ao no-break SNMP</h3>

<p>Seu DiskStation tamb&eacute;m suporta conex&atilde;o a dispositivos no-break SNMP (Protocolo de gerenciamento de rede simples). Para obter detalhes sobre a instala&ccedil;&atilde;o de hardware, consulte o manual do usu&aacute;rio do dispositivo no-break SNMP. Quando o DiskStation tiver sido conectado a um dispositivo e conectado &agrave; mesma rede, voc&ecirc; pode seguir as etapas abaixo para habilitar o suporte ao no-break.</p>
<h4>Para habilitar o suporte ao no-break SNMP:</h4>
<ol>
<LI>Na guia <strong>UPS</strong>, marque a caixa de sele&ccedil;&atilde;o <b>Habilitar suporte a UPS</b>.</LI>
<li>Selecione <strong>UPS SNMP</strong> no menu suspenso <strong>Tipo de UPS de Rede</strong>.</li>
<li>No campo<strong>Endere&ccedil;o IP do UPS SNMP</strong>, digite o endere&ccedil;o IP do dispositivo UPS SNMP.</li>
<LI>Selecione quando o DiskStation deve entrar no Modo seguro ap&oacute;s ocorrer falha de energia.</LI>
<li>Digite o segmento de comunidade do dispositivo UPS SNMP no campo <strong>Comunidade SNMP</strong>.</li>
<LI>Clique em <b>Aplicar</b>.</LI>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>&Eacute; altamente recomendado usar <b>SNMP UPS</b> para implementa&ccedil;&otilde;es do Synology High Availability (SHA).</li>
<li>O DiskStation suporta dispositivos UPS SNMPv1 e SNMPv2c.</li>
</ul>
</div>


<h3>Suporte ao no-break de rede</h3>

<p>Se houver dois produtos Synology usando um dispositivo no-break com porta USB &uacute;nica. ent&atilde;o apenas um DiskStation pode obter informa&ccedil;&otilde;es sobre o status do dispositivo no-break. Nesse caso, um DiskStation pode funcionar como um &quot;servidor de no-break de rede&quot; e conectar o dispositivo no-break atrav&eacute;s de USB ou rede (dependendo do dispositivo). O servidor de no-break de rede obt&eacute;m informa&ccedil;&otilde;es do no-break e as retransmite para outro &quot;cliente&quot; DiskStation.</p>
<h4>Para habilitar o suporte a UPS de rede:</h4>
<OL>
<li>Fa&ccedil;a login no DiskStation que est&aacute; conectado ao dispositivo no-break (via USB ou rede). Se o suporte ao no-break local ainda n&atilde;o tiver sido habilitado nesse DiskStation, consulte a se&ccedil;&atilde;o abaixo.</li>
<LI>Na guia <strong>UPS</strong> marque a caixa <strong>Habilitar servidor UPS de rede</strong> para permitir que o DiskStation retransmita as informa&ccedil;&otilde;es do UPS para o cliente DiskStation.</li>
<li>Clique no bot&atilde;o <strong>Dispositivos DiskStation permitidos</strong>.</li>
<li>Na janela que aparece, digite os endere&ccedil;os IP do outro DiskStation que est&aacute; usando o dispositivo no-break, mas n&atilde;o est&aacute; conectado via USB ou rede. Clique em <strong>OK</strong>.</li>
<li>Clique em <strong>Aplicar</strong> para salvar as configura&ccedil;&otilde;es.</li>
</OL>
<p>Agora o servidor de no-break de rede pode obter informa&ccedil;&otilde;es do no-break e retransmiti-las para o outro DiskStation que est&aacute; usando o dispositivo no-break. Consulte as instru&ccedil;&otilde;es abaixo para habilitar o suporte do no-break no outro DiskStation.</p>
<h4>Para habilitar o suporte ao no-break no cliente DiskStation:</h4>
<ol>
<li>Fa&ccedil;a login no outro DiskStation que est&aacute; usando o dispositivo no-break, mas n&atilde;o est&aacute; conectado via USB ou rede.</li>
<li>Na guia <strong>UPS</strong>, marque a caixa <strong>Habilitar suporte a UPS</strong>.</li>
<li>Selecione <strong>Servidor UPS Synology</strong> no menu suspenso <strong>Tipo de UPS de Rede</strong>.</li>
<li>Digite o endere&ccedil;o IP do servidor UPS da rede (i.e. o DiskStation conectado ao dispositivo UPS) no campo <strong>IP do servidor UPS de rede</strong>.</li>
<LI>Selecione quando o DiskStation deve entrar no Modo seguro ap&oacute;s ocorrer falha de energia. Para simplificar as configura&ccedil;&otilde;es de Modo Seguro, voc&ecirc; pode selecionar <strong>Mesma do servidor</strong>.</LI>
<LI>Clique em <b>Aplicar</b> para salvar as configura&ccedil;&otilde;es.</LI>
</OL>
<div class="section">
<h4>Requisitos do no-break de rede:</h4>
<UL>
<LI>Para retransmitir as informa&ccedil;&otilde;es do dispositivo no-break, cada DiskStation deve estar conectado &agrave; mesma rede.</LI>
<LI>O dispositivo de rede (ex.: switch ou hub) ao qual cada DiskStation est&aacute; conectado deve ser acoplado ao mesmo dispositivo no-break. Caso contr&aacute;rio os DiskStations n&atilde;o poder&atilde;o retransmitir as informa&ccedil;&otilde;es do dispositivo no-break quando ocorrer falha de energia.</LI>
</UL>
</div>
</body>
</html>
