<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<title>Gestor de High Availability - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Synology High Availability uses two servers to form a high-availability cluster in which one server assumes the role of active server and another server acts as a standby passive server.">


 </head>
 <body>
  <h1>Gestor de High Availability</h1>

  <p>High Availability refere-se a uma solu&ccedil;&atilde;o de esquema de servidor concebida para reduzir as interrup&ccedil;&otilde;es de servi&ccedil;os provocadas por avarias no servidor. O Synology High Availability utiliza dois servidores para formar um &ldquo;cluster de high-availability&rdquo; em que um servidor funciona como &ldquo;servidor activo&rdquo; e outro servidor funciona como &ldquo;servidor passivo&rdquo; em espera. Para implementar e criar um cluster de high-availability, s&atilde;o necess&aacute;rios dois servidores Synology compat&iacute;veis.</p>
  <p>Um cluster de alta disponibilidade tira partido dos seguintes componentes e conceitos:</p>

  <ul>
   <li><b>Conceito: </b>A implementa&ccedil;&atilde;o de Synology High Availability requer dois servidores Synology para criar um cluster de high-availability. Um servidor serve como &quot;servidor activo&quot; e outro serve como &quot;servidor passivo&quot;. Quando o cluster de high-availability for criado, os dados s&atilde;o continuamente duplicados do servidor activo para o servidor passivo. Todos os ficheiros no servidor activo existir&atilde;o em duplicado no servidor passivo. Em caso de avaria do servidor activo, o servidor passivo estar&aacute; pronto para tomar conta de todos os servi&ccedil;os com uma c&oacute;pia espelhada completa dos dados do servidor activo. Assim, o cluster de high-availability continuar&aacute; a providenciar os servi&ccedil;os normalmente, minimizando o tempo de inactividade do servidor. Para mais detalhes sobre a mudan&ccedil;a, consulte <a href="switchover_fail.html">Mudan&ccedil;a</a></li>
   <li><b>Servidor activo:</b> O servidor activo gere a provis&atilde;o de todos os servi&ccedil;os. No caso de ocorrer um evento no servidor activo, voc&ecirc; ou o sistema podem iniciar uma mudan&ccedil;a para o servidor passivo. Neste caso, a provis&atilde;o dos servi&ccedil;os ser&aacute; transferida para o servidor passivo, e a partir desse momento o servidor activo passa a ser servidor passivo.</li>
   <li><b>Servidor passivo:</b> Em condi&ccedil;&otilde;es normais, o servidor passivo continua em modo de espera. Os dados do servidor activo ser&atilde;o continuamente duplicados para o servidor passivo. No caso do servidor activo n&atilde;o conseguir providenciar os servi&ccedil;os, voc&ecirc; ou o sistema podem iniciar uma mudan&ccedil;a para o servidor passivo.</li>
   <li><b>Liga&ccedil;&atilde;o heartbeat:</b> Os servidores activo e passivo de um cluster de high-availability est&atilde;o ligados por uma liga&ccedil;&atilde;o de rede privada dedicada mencionada como &quot;liga&ccedil;&atilde;o Heartbeat&quot;. Quando o cluster de high-availability for criado, a liga&ccedil;&atilde;o Heartbeat facilita a sincroniza&ccedil;&atilde;o de dados e a duplica&ccedil;&atilde;o entre os servidores activo e passivo. Se o contacto entre os servidores for interrompido durante um per&iacute;odo de tempo espec&iacute;fico, o sistema determinar&aacute; se uma mudan&ccedil;a &eacute; necess&aacute;ria.</li>
   <li><b>Volume de armazenamento principal do cluster de high-availability:</b> O volume de armazenamento do servidor activo passar&aacute; a ser o volume de armazenamento principal do cluster de high-availability. Os dados s&atilde;o duplicados para o volume de armazenamento do servidor passivo atrav&eacute;s da liga&ccedil;&atilde;o Heartbeat.</li>
   <li><b>Volume suplementar de armazenamento do cluster de alta disponibilidade: </b>O volume de armazenamento no servidor passivo torna-se no volume suplementar de armazenamento do cluster de alta disponibilidade. Os dados s&atilde;o continuamente duplicados do volume de armazenamento do servidor activo para o volume de armazenamento passivo atrav&eacute;s da liga&ccedil;&atilde;o Heartbeat. Isto garante a consist&ecirc;ncia do conte&uacute;do dos ficheiros quando ocorrer uma mudan&ccedil;a.</li>
   <li><b>Nome do servidor do cluster de alta disponibilidade:</b> Os servidores no cluster de high-availability partilham um nome de servidor. Na rede, pode ligar utilizando este nome de servidor e os servi&ccedil;os ser&atilde;o providenciados pelo servidor activo. </li>
   <li><b>IP do cluster de alta disponibilidade: </b>Uma vez que o servidor activo e passivo no cluster de alta disponibilidade t&ecirc;m o seu pr&oacute;prio endere&ccedil;o IP, para evitar a mudan&ccedil;a para outro endere&ccedil;o IP quando ocorrer uma mudan&ccedil;a, o cluster de alta disponibilidade gerar&aacute; endere&ccedil;os IP comuns para acesso. Para aceder a qualquer servi&ccedil;o DSM, independentemente do servidor Synology que &eacute; o servidor activo, pode ligar atrav&eacute;s destes endere&ccedil;os IP. </li>
  </ul>




 </body>
</html>
