<!DOCTYPE html>
<html class="img-no-display">
 <head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>High Availability</title>


 </head>
 <body>
 <h2>Defini&ccedil;&otilde;es de rede</h2>
	<p>Esta p&aacute;gina cont&eacute;m tr&ecirc;s separadores que apresentam as defini&ccedil;&otilde;es de rede do cluster de high-availability, o servidor membro activo e o servidor membro passivo.</p>
  
	<h3>Separador Cluster HA</h3>
  	<p>Quando criar um cluster de high-availability, o sistema gera um endere&ccedil;o IP comum para o IP do cluster de high-availability para receber liga&ccedil;&otilde;es de entrada. Se necess&aacute;rio, podem ser criados endere&ccedil;os IP adicionais para cluster de alta disponibilidade. OS endere&ccedil;os IP das interfaces de rede activadas no servidor activo ser&atilde;o apresentadas neste separador (a interface de rede utilizada pela liga&ccedil;&atilde;o Heartbeat n&atilde;o ser&aacute; apresentada nesta p&aacute;gina, porque a dita interface ser&aacute; utilizada para duplica&ccedil;&atilde;o de dados entre dois servidores). Este separador mostra a seguinte informa&ccedil;&atilde;o.</p>
    	<ul>
        	<li><b>Interface de Rede:</b> A(s) interface(s) de rede activada(s) no servidor activo.</li>
            <li><b>Liga&ccedil;&atilde;o:</b> Mostra se esta interface est&aacute; ou n&atilde;o ligada.</li>
            <li><b>Endere&ccedil;o IP:</b> Quando criar um cluster de high-availability, o sistema gera um endere&ccedil;o IP comum para o IP do cluster de high-availability receber liga&ccedil;&otilde;es de entrada. Pode ligar-se ao cluster de high-availability utilizando este endere&ccedil;o IP quando pretender iniciar sess&atilde;o no DiskStation Manager (DSM), independentemente de qual seja o servidor Synology activo. Isto evita que seja necess&aacute;rio ligar a endere&ccedil;os IP diferentes quando ocorrer uma mudan&ccedil;a.</li>
            <li><b>M&aacute;scara Subrede: </b>A m&aacute;scara de subrede associada para um determinado endere&ccedil;o IP do cluster de alta disponibilidade.</li>
		</ul>
<h4>Para editar Endere&ccedil;o IP e M&aacute;scara Subnet:</h4>
	<ol>
		<li>Seleccione o endere&ccedil;o IP ou m&aacute;scara subnet que pretende editar e clique em <b>Editar</b> ou clique duas vezes no campo para come&ccedil;ar a editar.</li>
   <li>Marque as caixas de verifica&ccedil;&atilde;oo <b>Activar</b> para activar ou desactivar cada interface. Pode activar mais do que uma interface de rede de cluster mas a interface de rede original configurada durante a cria&ccedil;&atilde;o do cluster n&atilde;o pode ser desactivada.</li>
    </ol>
<h4>Para alterar o nome do servidor do cluster de alta disponibilidade:</h4>
 	<ol>
    	<li>Clique em <b>Alterar defini&ccedil;&otilde;es de rede</b> para ver o nome do cluster de high-availability e alterar as suas defini&ccedil;&otilde;es.</li>
   		<li>Clique em <b>Aplicar</b> para guardar o actual nome e as actuais defini&ccedil;&otilde;es do endere&ccedil;o IP do cluster de alta disponibilidade.</li>
   		<li>Para ignorar as actuais altera&ccedil;&otilde;es, clique em <b>Cancelar</b>. </li>
  </ol>

<h3>Separadores Servidor Activo e Passivo (apresentado como nome de servidor)</h3>
<p>Estes separadores apresentam o estado das interfaces de rede no servidor activo ou passivo. Destas, a liga&ccedil;&atilde;o Heartbeat ocupar&aacute; uma interface de rede em cada um dos servidores activo e passivo. Estes separadores apresentam a seguinte informa&ccedil;&atilde;o:</p>
	<ul>
    	<li><b>Interface de rede:</b> A interface de rede f&iacute;sica no servidor.</li>
    	<li><b>Endere&ccedil;o IP:</b>O endere&ccedil;o IP atribu&iacute;do a uma determinada interface de rede.</li>
    	<li><b>M&aacute;scara Subnet:</b>A m&aacute;scara de subrede associada a um determinado endere&ccedil;o IP.</li>
    	<li><b>Descri&ccedil;&atilde;o:</b> Apresenta informa&ccedil;&atilde;o detalhada de uma determinada interface de rede e a acessibilidade do seu endere&ccedil;o IP atribu&iacute;do. Este campo apresenta as seguintes condi&ccedil;&otilde;es poss&iacute;veis:</li>
		<ol>
			<li><b>Endere&ccedil;o IP original acess&iacute;vel</b>: O endere&ccedil;o IP original atribu&iacute;do &agrave; interface do servidor activo &eacute; acess&iacute;vel para dados e servi&ccedil;os.</li>
			<li><b>Endere&ccedil;o IP original n&atilde;o acess&iacute;vel</b>: O endere&ccedil;o IP original atribu&iacute;do &agrave; interface no servidor passivo n&atilde;o &eacute; acess&iacute;vel.</li>
			<li><b>IP de liga&ccedil;&atilde;o Heartbeat, n&atilde;o acess&iacute;vel da Intranet</b>: O endere&ccedil;o IP original atribu&iacute;do automaticamente &agrave; liga&ccedil;&atilde;o Heartbeat n&atilde;o &eacute; acess&iacute;vel para dados e servi&ccedil;os.</li>
		</ol>
	</ul>
</body>
</html>