<!DOCTYPE html>
<html class="img-no-display">
<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>High Availability</title>


</head>
<body>

<h2> Monitor do servi&ccedil;o</h2>

<p>Esta p&aacute;gina permite-lhe monitorizar determinados servi&ccedil;os. Se um servi&ccedil;o monitorizado falhar no servidor activo, o sistema ir&aacute; entrar em p&oacute;s-falha no modo de servidor passivo em espera (desde que o servidor passivo esteja a funcionar normalmente). S&atilde;o apresentadas nesta p&aacute;gina as seguintes sec&ccedil;&otilde;es:</p>

<ul>
  <li><b>Servi&ccedil;o:</b> Exibe os servi&ccedil;os que podem ser monitorizados.</li>
  <li><b>Estado: </b> Mostra se os servi&ccedil;os est&atilde;o ou n&atilde;o em execu&ccedil;&atilde;o.</li>
  <li><b>Activa&ccedil;&atilde;o p&oacute;s-falha se o servi&ccedil;o falhar: </b>Assinale a caixa de verifica&ccedil;&atilde;o junto a um servi&ccedil;o para come&ccedil;ar a monitoriz&aacute;-lo. O sistema ir&aacute; entrar em p&oacute;s-falha, caso o servi&ccedil;o seleccionado falhe.</li>
</ul>

<h4>Para monitorizar um servi&ccedil;o:</h4>

<ol>
<li>Encontre o servi&ccedil;o que pretende monitorizar. Assinale a caixa de verifica&ccedil;&atilde;o junto ao mesmo.</li>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Servi&ccedil;os suportados</h4>
<p>Os servi&ccedil;os que podem ser monitorizados s&atilde;o os seguintes: Servi&ccedil;o de Ficheiros Windows, iSCSI Target, FTP, Servi&ccedil;o de Ficheiros Mac, Servi&ccedil;o NFS.</p>
</div>

<div class="section">
<h4>Activa&ccedil;&atilde;o p&oacute;s-falha quando a liga&ccedil;&atilde;o de rede falhar</h4>
<p>Se esta op&ccedil;&atilde;o estiver activa, o sistema ir&aacute; entrar em modo de p&oacute;s-falha no servidor passivo quando a liga&ccedil;&atilde;o de rede do servidor activo falhar ou funcionar incorrectamente e a liga&ccedil;&atilde;o de rede do servidor passivo estiver a funcionar normalmente.</p>

<ul>
<li>A p&oacute;s-falha ser&aacute; activada apenas se o servidor passivo tiver mais liga&ccedil;&otilde;es saud&aacute;veis. Por exemplo, se o servidor activo tiver mais do que tr&ecirc;s liga&ccedil;&otilde;es e uma falhar, o sistema ir&aacute; activar uma p&oacute;s-falha apenas se o servidor passivo possuir tr&ecirc;s ou mais liga&ccedil;&otilde;es saud&aacute;veis.</li>
<li>As liga&ccedil;&otilde;es combinadas com Link Aggregation contam como uma liga&ccedil;&atilde;o. Por exemplo, se estiverem combinadas duas liga&ccedil;&otilde;es e uma delas falhar, mas a outra ainda funcionar, a liga&ccedil;&atilde;o ir&aacute; ainda assim contar como saud&aacute;vel.</li>
</ul>

</div>

</body>
</html>
