<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Services d'assistance</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>


</head>
<body>

<h2>Services d'assistance</h2>
<p>
Les services d'assistance comprennent les outils d'acc&egrave;s et de g&eacute;n&eacute;ration de journaux, permettant &agrave; nos ing&eacute;nieurs de l'assistance de voir, de diagnostiquer et r&eacute;soudre rapidement les probl&egrave;mes techniques sur votre DiskStation depuis un bureau Synology. Pour ce faire, allez sur <b>Centre d'assistance</b> &gt; <b>Services d'assistance</b>.
</p>

<h4>Pour activer l'acc&egrave;s &agrave; distance :  </h4>
<p>
Activer l'acc&egrave;s &agrave; distance sur votre DiskStation uniquement quand c'est demand&eacute; par les ing&eacute;nieurs de l'assistance technique.
</p>
<ol>
<li>Cochez la case <b>Activer l'acc&egrave;s &agrave; distance</b> et ensuite cliquez sur <b>Appliquer</b> pour que les modifications prennent effet.
</li>
<li>Fournit aux ing&eacute;nieurs de l'assistance technique Synology avec votre mot de passe et la cl&eacute; d'identification d'assistance via l'email. 
</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>L'acc&egrave;s &agrave; distance sera automatiquement d&eacute;sactiv&eacute; au bout de 14 jours.  Il ne doit pas &ecirc;tre d&eacute;sactiv&eacute; manuellement &agrave; moins que l'ing&eacute;nieur de l'assistance technique Synology ne vous le demande. 
</li>
<li>Veuillez retirer tout contenu de votre DiskStation que vous consid&eacute;rez priv&eacute;.  
</li>
<li>Bien que Synology ne puisse garantir que la provision de l'acc&egrave;s &agrave; distance r&eacute;solvera votre probl&egrave;me, Synology fera des efforts raisonnables pour effectuer les services d'assistance d'une fa&ccedil;on professionnelle.
</li>	
</ul>
</div>

<h4>Pour g&eacute;n&eacute;rer des journaux :  </h4>
<p>
G&eacute;n&eacute;rer et fournir des journaux uniquement aux ing&eacute;nieurs de l'assistance technique Synology.
</p>
<ol>
<li>Cliquez sur <b>G&eacute;n&eacute;rer des journaux</b> puis attendre quelques minutes que le t&eacute;l&eacute;chargement se r&eacute;alise. 
</li>
<li>Fournit aux ing&eacute;nieurs de l'assistance technique Synology avec les journaux via l'email.
</li>
</ol>

<div class="section">
<h4>Choses que vous devez savoir &agrave; propos des services de l'assistance</h4>
<ul>
<li>Nous respectons votre DiskStation comme si c'&eacute;tait le notre. </li>
<li>Notre DiskStation sera uniquement utilis&eacute; &agrave; des fins de diagnostic du syst&egrave;me.  Synology n'acc&egrave;dera pas ou ne divulguera pas touts autre information personnelle sur votre DiskStation. </li> 

</ul>
</div>

</body>
</html>
